[["Barmini", 
[["Best of DC", 
5.0, 
"October 8, 2015", 
"steve10011", 
"New York, NY", 
35, 
28, 
"This very civilized, upscale cocktail room should be at the top of your list if you're craving drinks in DC. Crack bartenders fashion one splendid drink after another from the wide-ranging-but-not-overwhelming menu. Another winner from José Andrés."], 
["Super Delicious and Fun", 
5.0, "October 8, 2015", 
"EATravels2015", 
"Washington DC, District of Columbia", 29, 7, "This place is soo cool. The \"A\" of EATravels took me here for our final date before we got married a few weeks ago. We were given a quiet couch and they even had a rose there for me upon her request. I know, many people think that is cheesy, but I hapen to like that stuff. Anyway - Our...\n\n\nMore"], ["Could have been great", 4.0, "September 28, 2015", "Adora O", null, 2, 1, "Went there for my birthday, I was very excited to go seeing all the wonderful reviews. Even my non drinking friends came along. Yes, your credit card is required for reservations and yes there is no real food- fair enough, you are told in advance. The decor is beautiful, I think \"sophisticated speakeasy\"\nWe decided on the flight but I...\n\n\nMore"], ["Highbrow and reservations required", 2.0, "September 24, 2015", "KathieT35", "Georgetown, Texas", 82, 21, "So we knew we needed reservations but thought we would stop in anyway and look around. You cannot see the bar - it's all tucked away. They let us look in and it looked nice but what really got us riled up was that they referred us to a sister location - that they could not spell the name of...\n\n\nMore"], ["Really neat cocktail bar", 5.0, "September 20, 2015", "ckubic", null, 50, 17, "I wish I could have tried them all! Really imaginative cocktails make this a fun spot for drinks. Wish I could have gotten into minibar but this was second best since I got to try some of the food on the menu."], ["Nothing special!", 2.0, "September 17, 2015", "jojo60713", "San Francisco, California", 57, 14, "Venue small and you have to have reservations to get in - we arrived for our 11pm - the place was pretty empty so the need for reservations is ridiculous - they would get a lot more business if they allowed walk ins. Drinks were just ok - nothing special - glad we didn't get the flight experience as it...\n\n\nMore"], ["Amazing cocktails - surpassed expectations", 5.0, "September 14, 2015", "Samantha M", "Southlake, Texas, United States", 41, 21, "From the moment we rang the doorbell to get in (after walking past the entrance 3 times!) until the moment we left, we had a perfect evening. We sat in the corner booth which was a very comfortable spot - so comfortable in fact that we spent 3 and a half hours there. We were greeted with a sample of...\n\n\nMore"], ["Special place to have a drink (or a flight)!", 5.0, "September 8, 2015", "nwlilac", "Alexandria, Virginia", 50, 24, "If you are visiting DC and like a unique bar experience, make a reservation. You have two hours for this experience and it won't disappoint! The service is impeccable. The space is nice and won't ever be crowded. Yes, it's expensive, but you won't have cocktails like these anywhere else! And, it's not as expensive as the minibar side. The...\n\n\nMore"], ["Awesome place", 5.0, "September 6, 2015", "Matt W", null, 3, 3, "This place is awesome! I highly recommend going here and treating yourself to some very high quality cocktails, they are like a piece of art the way they are made"], ["Oh, what a night!", 5.0, "September 1, 2015", "Shannon S", "Washington DC, District of Columbia", 1, 0, "Barmini is by far my favorite place to go for fancy, delicious and surprisingly affordable cocktails (made by legit mixologists) and yummy interesting bar snacks. The decor will not disappont either. Get yourself all dolled up on a random night and head to Barmini...and be sure to order the cotton candy old fashioned or the smoke and cedar!"], ["Wonderful experience", 5.0, "September 1, 2015", "jljordan", "Washington DC, District of Columbia", 3, 3, "I spent my birthday here with my brother. It was wonderful. We purchased the Jose experience which was an hour and a half of handcrafted drinks. The lobster rolls were perfect. Great food and service."], ["Delicious and cool", 4.0, "September 1, 2015", "dcnative16", "Washington, DC", 8, 0, "This was a big birthday occasion ... we had a great time and they paired desserts with drinks for us."], ["Probably the coolest bar I've ever been to", 5.0, "August 29, 2015", "Pinz123", "Litchfield, Minnesota", 3, 1, "Incredible atmosphere, service and drinks. By far the most unique drink experience I've had. I wouldn't go back to DC without another reservation there."], ["Worth the wait", 5.0, "August 28, 2015", "jncdc", "Washington, DC", 3, 4, "We made reservations weeks in advance to get a spot at Barmini. It did not disappoint. The atmosphere, drinks, service, and food were all awesome. We had a great experience!"], ["Go there NOW!!", 5.0, "August 18, 2015", "SazzleB82", null, 6, 1, "I live in the UK but I'm debating whether it's worth the flight just to go back here for a night.\nWe had the most amazing experience. We decided to have the \"flight\" and a few bar snacks. Words cannot do this place justice. Just go, enjoy and come out happy.\nOooo and the toilets are worth the visit on...\n\n\nMore"], ["Now one of my favorites places on earth", 5.0, "August 9, 2015", "AliciaWalker", "Venice", 21, 7, "I was in DC for work, and it was the first time I'd ever been. A friend of mine told me I HAD 