[["West Wing Cafe", [["Great spot for quick breakfast or lunch", 4.0, "September 20, 2015", "KatyD507", "Birmingham", 25, 14, "Ideal if you are staying at the nearby Hyatt or Liaison hotel for breakfast or lunch. Mind-boggling array of types of turkey to a mere Brit. Good omelettes and bagels for breakfast. Good value, casual, quick bite."], ["Great for a quick eat.", 5.0, "July 27, 2015", "tex1330", "Graham, Texas", 55, 20, "This place was close to our hotel and had a good menu. Service was nice and food was good. Easy to get out and in. The only thing that freaked some people out was no men's and women's restrooms just restrooms."], ["Fantastic food, great range", 5.0, "April 29, 2015", "CaiBri", "Sydney, Australia", 12, 8, "I went to this delightful cafe today between visiting museums. It was definitely worth the few blocks walk. A large range of sandwiches and smoothies. Tasted very fresh and at a good price. Friendly service, i would definitely recommend this place for a good lunch."], ["lots of food for a reasonable price", 4.0, "July 5, 2014", "Ms_Yokohama2014", "Yokohama, Japan", 59, 36, "We went to the West Wing Cafe because we were hungry when we walked by it. We decided that we'd been lucky. The sandwiches are huge, and the prices are very reasonable. It's a great bargain. They call themselves a \"gourmet delicatessen\". Maybe gourmet, maybe not, but everything we ordered was fine. We ate it all."], ["Okay if you just want to refuel", 3.0, "May 23, 2014", "smartesthorse", "suffolk uk", 122, 126, "This place is clean and quick. It tends to be wraps and sandwiches on an egg theme. It is nothing special but its inexpensive and the food will fill you for busy day. There is a choice of ready brewed coffee which is good enough but don't try the Corsican...do they really grow coffee in Corsica..its very very strong I...\n\n\nMore"], ["Good breakfast", 5.0, "November 1, 2013", "49MAK", "Seattle", 3, 0, "Their breakfast sandwiches are really good. Even though their coffee is in airpots, it is good and hot.\nWe only went there because of other good reviews."]]], ["Colony Club", [["Great coffee, comfortable atmosphere", 5.0, "June 30, 2015", "Laura A", "Toronto, Canada", 12, 7, "I stumbled upon this place while walking from my AirBnB in Petworth, desperately searching for decent coffee. I was very happy I did. Delicious coffee, beautiful aesthetic, soft jazz music playing, friendly staff, and yummy-looking baked goods. It turns into a bar at night, and I didn't try it out after-hours, but it looks like it would be a great...\n\n\nMore"], ["Bar, Coffee Shop & Ping Pong all under one roof", 4.0, "June 7, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "This review is solely for the premises and tea and coffee, as I have not eaten here yet. This place is in my hood and noticed it opened for a couple of weeks now, but never make it to try it out. After pig out a big breakfast in another restaurant, I walked in to get a green tea to...\n\n\nMore"], ["Wonderful neighborhood coffee shop with a ping pong table", 5.0, "May 18, 2015", "Robbieg", "North Carolina", 26, 21, "Colony Club is located in a gentrifying section of Georgia Ave. Great coffee, excellent internet, comfortable furniture for both working and reading, attractive decor, a very friendly staff, and in the upstairs room they have a ping pong table.\nWe visited for the coffee and ping pong. They also offer beer and wine and delicious looking pastries (which we didn't...\n\n\nMore"]]], ["Sudhouse", [["Awesome place for private events", 5.0, "July 7, 2015", "Allison J", null, 6, 0, "I completely agree with Sams review. It was so clean and relaxing. I saw they updated their menu to include a few more healthy options - but I loved sitting on the patio and people watching! My girlfriend threw her birthday event at \"The Hooch\" the upstairs bar and that was so much fun! No pretentiousness to complain about."], ["Great Place to Drink with Friends", 5.0, "June 27, 2015", "Sam W", "Nairobi, Kenya", 64, 35, "It's the right location with the right kind of clients and the multicultural staffs that makes this place sophisticated. The food here is mainly deep fried, but you don't go to a bar for food. The music and the clienteles here makes you feel comfortable hanging out with access to good drinks. I simply love it here."]]], ["Au Bon Pain", [["Great place to eat!!!!", 5.0, "September 30, 2015", "Susan C", "Hampton, United States", 53, 7, "Stopped to eat lunch here earlier this week!!! Sandwiches fresh and made for you to your specifications. Large selection on the menu. Sandwiches, soups, fresh pastries, cookies!! It was all absolutely delicious!! Staff helpful and friendly. Really enjoyed eating here. Will be back. In the basement of this building where you catch the Metro. Shops are there as well. Very...\n\n\nMore"], ["Very delicious", 4.0, "September 14, 2015", "Karsvegud", "Reykjavik, Iceland", 9, 2, "Went there for a bite in the middle of the day. Had a hard time choosing since everything was super good looking. Ended up getting a turkey sandwich. The whole place looked clean and I would go there again for sure!"], ["Nice place and good prices", 5.0, "August 27, 2015", "BRDave225", "Baton Rouge, Louisiana", 38, 13, "I stopped at this location as I was running through the Metro station, stopping only to get a Cookie and soft drink. The place looked like a good place to eat."], ["average", 3.0, "August 12, 2015", "Julia P", null, 18, 3, "There was one of these bakeries every 2 blocks. They had decent bagels and coffee. Only ate there once. There were better places to eat."], ["excellent", 5.0, "July 8, 2015", "Beverly D", "Tyler, Texas", 11, 8, "It is always a treat to visit an Au Bon Pain, only wish they would move to the south. Thoroughly enjoy having lunch there. The food is always fresh, and oh yeah, the deserts are always delish !!!"], ["Bad selection, bad service, leaking coffee cup", 2.0, "June 3, 2015", "LakersFanSB", "Santa Barbara, California", 45, 16, "All I wanted was a muffin and a cup of coffee, and both were pretty bad. I didn't want anything super sweet, which left me with very limited selection. They don't list their ingredients, and the woman working the counter couldn't tell me if the zucchini bread had raisins or not. I took a chance, and sure enough it was...\n\n\nMore"], ["Fresh and Affordable!", 4.0, "March 23, 2015", "SPGal", "Peoria, Illinois", 176, 60, "Had just arrived from early morning flight and was looking for a fresh salad at an affordable price instead of my pricey hotel. A native on the street referred this place to us. I had a great chicken salad with a drink and bread choice. The total was about $10 and was more than I could eat. The service was...\n\n\nMore"], ["Fresh lunch", 4.0, "March 17, 2015", "mimi68Canfield", "canfield", 66, 24, "Sandwiches, wraps, salads made fresh to order, I thought it was a reasonable price. Baked goods, coffee and teas."], ["Catering to a Captive Audience . . . .", 3.0, "February 27, 2015", "melvinius", "Chevy Chase, Maryland", 47, 23, "This Bon Pain is a cafe in the doctors' building adjacent to Sibley Hospital and no other branch of this enterprise. The place is staffed by two low-paid immigrant workers who speak and understand limited English, plus a cashier (manager?). Having fasted overnight and not been able to finish my doctor's appointment until 11:30, I was disappointed to note that...\n\n\nMore"], ["Good Choice for Suburban Crowd", 4.0, "January 12, 2015", "Mavsam", "Lynchburg, Virginia", 67, 10, "Stopped in here for lunch on Sunday. The place has the birch plywood-bright color sterility of current trend in fast food...a la Moe's, Chipotle, Zoie's.\nChicken avocado wrap was fresh and tasty. Peach tea was good. Lentil soup was savory. Their soup choices were minimal, it being the DC Mall district on a Sunday.\nPrice was reasonable.\nSo good, but...\n\n\nMore"], ["Ice Coffee --- Horrible", 1.0, "July 23, 2014", "BGouker", "Hanover, Pennsylvania", 31, 15, "Terrible ice coffee and rock hard cookies ..forget this place. I thought that this would be a nice break in the morning ... should have gone to Dunkin Dounuts"], ["Delicious sandwiches and out of this world cinnamon buns!", 5.0, "June 19, 2014", "GloriousLakeSuperior", "Northwestern Ontario", 165, 228, "We were on our way to the American History museum and decided to stop at Au Bon Pain for lunch first. We had the most amazing turkey club sandwiches! All fresh ingredients, no scrimping, good prices....and we shared a cinnamon bun and it was the best, hands down."], ["Nice Place for a quick bite", 4.0, "April 19, 2014", "Jamie G", "Barrie, Canada", 11, 7, "We were looking for a quick bite of lunch yesterday, while doing the Washington DC sites. Tho it did not look like much from the outside, this proved a great place for a quick lunch.\nI hate cold soup - not a problem here. I hate cold coffee - also not a problem here!\nEverything was nice and fresh. It...\n\n\nMore"], ["Nothing special", 3.0, "September 8, 2013", "desifoto", "minnesota", 89, 31, "I needed food for the road and this was in Union Station. It's no different than any other place. The salad was basic."], ["Overpriced mediocre food", 3.0, "July 15, 2013", "Arman H", "Syracuse, New York, United States", 14, 7, "Walked into this place for some lunch and noticed how nice the place was. After waiting a couple minutes to figure out my order, the person behind the counter left, and we had to wait for another person to show up to make sandwiches. The Lobster sandwich I had cost near $12, and was the size of my hand. Understandable,...\n\n\nMore"], ["Go elsewhere", 2.0, "July 6, 2013", "al_spa", null, 3, 0, "Tables were filthy. Garbage was overflowing. Food tasted great, but you had to eat it with your eyes closed."], ["Quick, healthy, customizable breakfast options in a convenient location.", 4.0, "May 27, 2013", "Diamond_Debutante", "Des Moines, Iowa", 147, 60, "My friends and I were staying at L'Enfant Plaza Hotel and stopped at Au Bon Pain for breakfast a couple times. The first time I had the egg whites & cheddar on a skinny wheat bagel. The second time I added ham. Both were delicious options that were much healthier than the pastries, bagels, and paninis at the other restaurants...\n\n\nMore"], ["Awful", 1.0, "May 24, 2013", "AtlTravelalot", "Atlanta, Georgia", 45, 28, "We only chose this restaurant for lunch because it was the first open restaurant we found on a very cold Sunday. We placed our orders at the counter and gave the cashier our names. The restaurant was not busy, but we waited for an eternity for our orders. One guy just gave up and grabbed my brother's sandwich after the...\n\n\nMore"], ["Au Bon Deliciosos", 4.0, "May 5, 2013", "Jake G", "Wilsonville, Oregon, United States", 5, 4, "Ok food with a lot pd extra bread.I liked the soup. Very nice staff, polite. Atmosphere was very nice. Music and an occupied feeling. This is fun for people that like to talk. I would come here again of I was near by."], ["it was late afternoon, I was hungry, I took a chance", 3.0, "May 1, 2013", "roboird", "Memphis, TN", 143, 49, "So, I got a roast beef and cheese, and it was not terrible but had I not missed lunch, been feeling a bit famished at 4:00 PM, I would not have stopped - but it was convenient. And I would probably do it again, but only because I needed to put some food in my body, and not because I...\n\n\nMore"], ["Delicious, Quick, & nicely priced", 4.0, "March 30, 2013", "Sharon8here", null, 141, 22, "This cafe is in Union Station. Friendly people work here. You just place your order and watch them make your food (I got a vegetarian baguette). The food was delicious! I sat at a table in the cafe (much better than sitting in the food court area). This cafe is on the second floor (less noise and nicer atmosphere). My...\n\n\nMore"], ["It's not worth it.", 1.0, "March 7, 2013", "forthetweeple", "Amarillo, Texas", 87, 48, "This place looke nice, but the food is just terrible. The day I went in, right as they opened, they had three bagels to choose from. I was forced to get something made, which requires disturbing their staff, which obviously is there to only look as if they are working. After my sandwich was made, I had to wait for...\n\n\nMore"], ["Yummy!", 5.0, "February 14, 2013", "Vicki M", "Los Angeles, California", 6, 5, "Affordable quick stop. We had the mac & cheese and clam chowder soup - both were very good! Lots of other options for sandwiches and other soups. Close to Natural History Museum."], ["The Best Almond Croissants on Earth!", 5.0, "January 23, 2013", "LifeHappens310", "Washington DC, District of Columbia", 13, 7, "I have enjoyed Au Bon Pain's pastries for years and their food appears to keep getting better and better as time progresses. In my work I travel often but somehow I always end up in a city where they're located. Maybe the kicking and screaming does work but shhh! I digress.\nThe pastries and the coffee go good with 15...\n\n\nMore"], ["Au Average Pain", 3.0, "January 17, 2013", "GoodFood88", "Washington DC, District of Columbia", 594, 253, "This Au Bon Pain has four distinct areas at L'Enfant Plaza. There is the quick walk in and out most people know, and sit down areas broken down across three seperate areas. The food is ok, not great and the wait staff is mostly ambivalent to want serving you. This is a mix of office folks with the many federal...\n\n\nMore"], ["Hot Soup", 3.0, "January 2, 2013", "thf077", "Charleston, South Carolina", 83, 32, "Head into this chain and get a large hot bowl of soup from the daily offerings and add a loaf of fresh bread and dessert from the bakery. Head over to the mall or ice skating area of sculpture garden for the perfect inexpensive winter picnic. This works out well for a family or a date. Not easy to get...\n\n\nMore"], ["Not too bad", 4.0, "December 17, 2012", "Nathaen M", "Brisbane, Australia", 319, 176, "Au Bon Pain\nNice brekky. Had a ciabatta with bacon, egg and sausage. Very small servings. Probably could have easily eaten two of them! None the less it was very tasty and the staff were friendly and efficient."], ["Great sandwitches!", 4.0, "November 25, 2012", "CWestcott", "Media, Pennsylvania", 70, 36, "And a very nice crew. Not cheap but good healthy non-fast-food eats! There wasn't lot of room to sit but there was outside seating."], ["Great!", 5.0, "November 19, 2012", "John H", "Florence, Mississippi, United States", 1, 0, "I am not in the habit of writing reviews for \"chain\" cafe's but for this little travelers oasis I will make an exception. Every time I pass through Union Station I make my way to this corner bistro. I have soup and a mini baguette or two. All of their soups are delicious and, if they have it when you...\n\n\nMore"], ["Pretty good", 3.0, "November 10, 2012", "Madeleine W", "Great Falls, Montana", 11, 3, "There are A LOT of these bakeries in DC. One of the people in our group would often wonder off in the middle of the day (for no reason) and he would always return with pastries from here (and he didn't set out to find them). Of course, they weren't the best pastries on the planet, but they're worth the...\n\n\nMore"], ["Nice but pricey", 3.0, "September 28, 2012", "olegnaumov", null, 1, 0, "Good selection of tasty food, but breakfast for 2 (2 coffees, tiny breakfast sandwich, tiny salad wrap and a tiny cupcake) turned out to be almost $20."], ["Good for a Quickie", 3.0, "September 21, 2012", "zr9000x", "Sudbury Ontario, Canada", 223, 72, "This place is in a great location at Union Station and has greaat quick ezat and run sandwiches. Very clean but a little pricy for what you get"], ["Did not handle the crowd well!", 3.0, "September 4, 2012", "nigel'smom", "Richmond, Virginia", 89, 26, "Union Station Location, Saturday morning of Labor Day weekend 2012. An absolute disaster in terms of service, crowd control and wait time.\nGenerally like these little sandwich shops with the pretentious name and pricing, but this was a mess"], ["A step up from Subway", 4.0, "September 2, 2012", "TorontoSunvacationer", "toronto", 72, 40, "We ate at 2 different Au Bon Pain in Washington, DC. The first one was near the Post Office Pavillion and the second one was not too far from there either.\nAnyway, the soups were very nice, a large variety to choose from. The bagels were interesting too. One of my daughters had a turkey club sandwich on both occassions...\n\n\nMore"], ["Good Value", 4.0, "September 2, 2012", "PearceFamily", "Canterbury Kent United Kingdom", 36, 28, "Very clean and good selection of snacks. Very tasty soups and snacks. Free WIFI and very friendly service"], ["The Danish tasted like it was a week old!", 2.0, "August 1, 2012", "Arthur G", "Scarsdale, New York", 222, 70, "I was surprised that after ordering a chocolate croissant, it tasted stale and not worth eating. Given the volume that these restaurants have, you'd think that they would replace the food that has been sitting on the shelves after a day or two. This one tasted like it had been there for at least a week. We did have some...\n\n\nMore"], ["Good food in Union Station", 4.0, "July 21, 2012", "JBarohn", "Columbus, Ohio", 33, 17, "Our made to order sandwiches were good, but we really liked the French bakery items, especially the chocolate croissants. They also had little packets of carrots for a healthy alternative to chips."], ["Another good sandwich shop", 4.0, "July 14, 2012", "middle_aged_mom_12", "KC", 52, 20, "The bread is exceptionally good, as you would expect. Not open after 5 or 6 pm usually though. Breakfast sandwiches are fresh and tasty!"], ["Disappointed", 2.0, "June 12, 2012", "GlendaleAZ-traveler", "Glendale, Arizona", 5, 4, "I thoroughly expected a bigger selection of pastries. I settled for a scone and my husband had a almond croissant. Both were dry and not very good. They have breakfast and lunch items. Free Wi-Fi."], ["What a pleasant surprise", 5.0, "June 5, 2012", "garliclover101", "Newborn, Georgia", 177, 52, "I knew that Au Bon Pain had the pastry catagoy represented, but they have soups too!! Who knew. The varieties are plenty.\nOh yea, and the pastry. I just had the best, most fantastic, life altering experience with a coconut macaroon. did I mention that it was dipped in chocolate? AND it had little tiny bits of pineapple mixed in....\n\n\nMore"], ["Great, healthy selections....", 4.0, "June 2, 2012", "KLF2005", "East Tennessee", 16, 38, "Great, healthy salad and sandwich selections. Food was fresh, and staff was helpful; some staff had difficulty with English but it worked out."], ["yum", 4.0, "May 31, 2012", "Spaulding79", "Denver, Colorado, United States", 24, 10, "yummy food and good coffee - you can find lots to eat here."], ["Great for a quick breakfast or lunch", 4.0, "May 25, 2012", "cmhd1", "Lancaster, Pennsylvania", 25, 7, "We needed a quick breakfast and did not feel like eating at the hotel. I also stopped in a few days later for lunch. The breakfast selection was great as was numerous choices for lunch. Good, quick, tasty food."], ["Quick, healthy choices", 4.0, "May 14, 2012", "cphilpot", "Fort Smith, Arkansas", 226, 76, "This is a wonderful place to get quick, on the go lunches. The best part is the healthy food choices. In a very busy place, at the height of lunch hour, it is easy to get in and out in five minutes. The convenience is a great added plus"], ["Great in any state", 4.0, "April 29, 2012", "BrockHolidaze", "Grand Rapids, MI", 37, 10, "They have these in Chicago too. They are great for fast, self serve food. This location is right in the center of the museums and has great outdoor seating. Service is fast, friendly and yummy!"], ["Nice, quality fast food", 4.0, "April 1, 2012", "jpc36", "Austin, TX", 36, 4, "Convenient central location, good choice of freshly-prepared soups, sandwiches, salads, and desserts."], ["Who uses iceburg lettuce anymore? This place!", 3.0, "March 19, 2012", "Jill T", "Richmond, Virginia", 14, 19, "The place was all right...I mean, there wasn't hair in our food or anything- but it was just an overall not special experience. My Greek and Caprese salads came with iceburg lettuce...so gross and worthless-but with a Washington DC price tag! Not good.\nThe waitress was not even busy but somehow managed to never fill up our drinks or give...\n\n\nMore"], ["smelled like a good bakery !", 3.0, "November 11, 2011", "redstapler", "O'Fallon, Missouri", 40, 14, "traveling in DC, doing lots of walking & the smell of the bakery was tempting! had lunch w/ family..it was ok-not fabulous, not bad..the bakery while smelling wonderful was also just ok..maybe I picked the wrong thing because it sure did smell wonderful."], ["Very expensive for ordinary food; bad layout", 2.0, "September 12, 2011", "RMG4369", "Virginia", 26, 18, "The Aub Bon Pain at L'Enfant Plaza, Washington, DC, was recently re-opened after a year of moving and renovations. The new store is much smaller than the previous eatery but the prices for most items have skyrocketed. I purchased a large soup and a bottled drink and the bill (including tax) came to over $8. They charge $5 for a...\n\n\nMore"], ["Decent food", 3.0, "July 19, 2011", "Potomac_11", "Potomac, Maryland", 160, 20, "Pleasant place with good food for a quick and casual lunch."]]], ["Ulah Bistro", [["Poor service cold food", 1.0, "June 12, 2015", "Andrea Ruth T", "Houston, United States", 4, 4, "We were the first table in the restaurant for brunch. There were several waiters standing around and drinking coffee. Took 20 minutes to get a cold cup of coffee and to place our order. Took several attempts to get drink refills. Our eggs were over cooked but we were never asked how the food came out so we couldn't complain....\n\n\nMore"], ["A pre-theater culinary and experience disappointment", 2.0, "April 19, 2015", "GoneDivingVA", "Virginia", 93, 46, "Unfortunately not what we expected. Despite the advertising, no valet service available. That's a BIG problem in Adams Morgan where there is plenty of street parking but available spots are at a premium. Restaurant was EXTREMELY loud. The hostess was downright rude from the moment we walked in the door. $28 steak frites was overpriced, over cooked and under delivered....\n\n\nMore"], ["Food was nice but service was not good", 3.0, "April 14, 2015", "DD S", "Alexandria, Virginia", 62, 15, "This restaurant is directly across the street from the popular Ben's Chili Bowl, so if you are not a chili dog kind of person it is quite appealing. We visited on a Sunday afternoon and arrived too late for brunch (ends at 4 p.m.), so we ordered from the dinner menu and sat outside. It's quite noisy with all the...\n\n\nMore"], ["Good food, fun atmosphere in a good location.", 3.0, "March 27, 2015", "Jennifer A", "Terre Haute, Indiana, United States", 63, 28, "This casual dining experience on U St right near the Metro Station offers a great menu and a fun atmosphere. Our waiter was a young guy with an adrenaline tattoo, and he was energetic and attentive. That being said, the service was extraordinarily slow, for which the waiter kept apologizing. We were a table of 3, and one of our...\n\n\nMore"], ["Great Brunch!", 4.0, "February 16, 2015", "grt81584", "Philadelphia, Pennsylvania", 18, 13, "Visited on a Sunday morning for brunch and was happy with the choice. This place was recommended by the concierge at the Liaison Capitol Hill. My girlfriend and a friend had the bottomless mimosas and breakfast for $29, which actually turned out to be a great deal. The Lox platter was very good, as were the other standard breakfast dishes...\n\n\nMore"], ["Horrible Service!", 2.0, "January 9, 2015", "Melissa P", "Washington, District of Columbia, District of Columbia, United States", 8, 9, "I was so excited to meet my friends here after searching high and low for a great brunch spot. Needless to say, we are all very disappointed. The service ruined our experience. We waited 30 minutes for water to arrive at our table and they were not packed. There were about 5 tables full of people. She messed up our...\n\n\nMore"], ["Nice neiborhood restaurant", 4.0, "December 22, 2014", "Miles S", "Waldorf, Maryland", 22, 6, "U street has plenty to offer, Ulah is one of the better ones. it's cozy, good selection of food and great service. Leffe on tap and a nice dish on week night is a good way to treat yourself. Service here is very personable and the place is clean."], ["Ulah--A Place for lunch daytime U Street", 4.0, "November 26, 2014", "Prawet J", "Washington DC, District of Columbia", 238, 73, "U Street area is considered a nightlife area of the District. After a visit to the African American Civil War Museum, I was looking for place to have lunch, Ulah is one of a few places open for lunch and is suitable for a solo traveler or a small group of people. From the day time point of view, the...\n\n\nMore"], ["Pretty Darn Average", 3.0, "November 22, 2014", "Patty H", "Bethesda, Maryland", 56, 29, "Had dinner with friends last night at the Ulah Bistro, pretty underwhelming. The menu was all over the place. The table has some starters...Crab Dip (Very Heavy), Cheese Plate (Quite Nice) and the Tuna Tatare (Again quite good). The entrees were pretty average: Chicken with Couscous (Chicken was very dry & the couscous plain), Crab Cakes (very Bready) Salmon (average),...\n\n\nMore"], ["Neighborhood Gem On U Street", 5.0, "November 11, 2014", "BobFV1", "Virginia, USA", 161, 47, "Our small group was going to a concert at the Lincoln Theater on historic U Street in Washington DC. The Ulah Bistro is directly across the street. It is cozy with a wonderful bar that featured 8 or 10 fine craft beers on draft as well as a full wine and liquor selection. The manu was mixed American, not quite...\n\n\nMore"], ["Great for any occasion", 4.0, "October 30, 2014", "Bjorn I", null, 59, 27, "A great no-nonsense place to go for any occasion. A great varaiety on the menu from meat to fish and pizza, all prepared fresh and good and also a good matching wine selection. Great value for the money."], ["Great service", 5.0, "October 6, 2014", "Haulster", "Galway, Ireland", 8, 3, "Visited here on a trip to DC and found great service, a good atmosphere and good food. As it was a Monday the wine was half price so when this was combined with their 3-course menu for $19.95 this was excellent value as well. Loved U St generally and Ulah topped it off with a Creme Brulee."], ["Such a Great Place for Brunch!", 4.0, "October 5, 2014", "Christopher M", "Elkridge", 183, 61, "A friend and I decided to meet at Ulah Bistro for brunch recently and were both pleasantly surprised at our experience. From the food to the service to the very quaint atmosphere (we sat upstairs to avoid the bustling noise on the first level), we were pleased and impressed. There's also plenty of outside seating for fair-weather days, and it's...\n\n\nMore"], ["Nice", 5.0, "September 29, 2014", "Beverly L", "Houston, Texas", 98, 18, "We decided to eat there as it is across the street from the Lincoln Theatre where we were going to see Bryan Ferry (who cancelled, but that's another story). Anyway. Food is very good, we both had the Jumbo Crab cakes which were served over collard greens I believe. The cakes were excellent. Good beer and wine selection. Atmosphere cozy....\n\n\nMore"], ["Nicely Done", 5.0, "September 20, 2014", "GringoDave47", "New Bern, North Carolina", 107, 72, "Joining with visiting friends from Europe, we explored the U Street area in search of dinner and came upon the Ulah.\nWe had a baby with us, and the staff went to great lengths to accomodate her and all other aspects of service were also excellent.\nTwo of us had the Neighborhood Appreciation Menu - a real steal of regular...\n\n\nMore"], ["Light fare on the patio", 4.0, "September 16, 2014", "acdcusa", "Washington, DC", 71, 26, "Shared a ceviche, and had the Fish tacos and the Seafood salad, with a glass of wine. Fun, affordable and convenient, a standard go-to, low impact restaurant right off the metro on 13+U street."], ["Really enjoyed it", 5.0, "July 22, 2014", "dgezelle", "Adamstown, Maryland", 28, 11, "We ate here before a show at the Lincoln theatre which was right across the street. We sat upstairs and really enjoyed the atmosphere and the music they were playing. Their martinis were very tasty. There were several things on the menu that I would have liked to have tried but my husband and I both got the crab cakes...\n\n\nMore"], ["Last minute save", 4.0, "May 17, 2014", "Idglm", "Boise, Idaho", 76, 26, "With a last minute change of plans, a group of 13 women found ourselves ravishingly hungry and no place to eat. Ulah took us in. Fed us, entertained us and left us smiling. Thanks for the experience. Good wine special recommendations."], ["Enjoyed the patio, food ok", 3.0, "May 8, 2014", "KK80439", null, 70, 29, "Convenient to the Lincoln Theater....right across the street. Enjoyed sitting out on the patio watching the people go by. The food was fine. Veggie sandwich was ok; fries were really good. The service could have been quicker, especially since we were going to a concert. When we aske for a bit more speed, the servers were accommodating."], ["Nice but nothing special", 3.0, "April 5, 2014", "Giralang", "Canberra, Australia", 60, 17, "Went looking to go for a dinner down on U St and Ulah Bistro was recommended. Nice place and efficient staff although when we went it was not busy at all\nFood was nice and seemed to be well priced\nOverall it was nice but nothing overly special. Certainly nothing to write home about"], ["Great happy hour drinks, food, and outdoor people-watching", 5.0, "April 3, 2014", "LUVSML", "Virginia", 69, 37, "My husband and I live in the No.VA suburbs and went to a show at the Lincoln Theater which is right across from this restaurant. I read a lot of good reviews on google and yelp and decided we should try this place. Great happy hour special - $5 mojitos til closing (among other drink specials.) Happy hour bar menu...\n\n\nMore"], ["YUMMY", 5.0, "March 3, 2014", "Alexis C", "Annapolis, Maryland", 2, 3, "food was great! we went after a concert and the service was wonderful! I had the seafood pasta and my sister ate the pizza, both were delicoius"], ["Ulah Was My \"Go To\" Spot.....Until Last Night", 1.0, "February 21, 2014", "Kai M", "Washington DC, District of Columbia", 2, 1, "I have often traveled from Maryland to Ulah, and I have watched it evolve from a so-so venue into a really phenomenal and vibrant bistro. In fact, I have recommended the restaurant to many visitors, and I often go there for the Sunday brunch. Regrettably, after last night's lackluster service encounter, I am on the hunt for a new \"go...\n\n\nMore"], ["Unexpected Pleasure", 4.0, "February 15, 2014", "TAC-Trek5200", "Silver Spring, Maryland", 14, 5, "At the last minute, we were looking for a place for Valentine's Day dinner. Went to U Street headed for another place and came upon Ulah which I had seen positively reviewed. Walked in, no tables. Went upstairs to the bar and two seats quickly opened. Limited but decent wine selection at reasonable prices. We shared the steamed mussels appetizer...\n\n\nMore"], ["A Gem", 5.0, "February 3, 2014", "Lisa L", "Smithsburg, Maryland", 45, 15, "Ulah Bistro is a gem. Brunch on a Saturday is a great idea and we thoroughly enjoyed it. The atmosphere is vibrant, very hip.\nA very nice menu and the bloody Mary's were perfect."], ["Great Food", 5.0, "January 7, 2014", "ReneeandRob", "Washington DC, District of Columbia", 6, 0, "The food and its presentation are great. The best ruben sandwich I have ever had. Also great dinner specials."], ["Food quality varied among three: one great, one terrible, one odd", 3.0, "November 3, 2013", "kareno425", "Washington DC, District of Columbia", 56, 38, "If I were reviewing this restaurant based on my own entree last night, I would give it four circles, but my companions' dishes were not so great. We dined on a Saturday night, upstairs and the atmosphere was nice. I ordered the special, halibut with fingerling potatoes and artichokes and the fish was as delicious as halibut gets. My friend...\n\n\nMore"], ["Delightful evening", 4.0, "October 23, 2013", "Cmcolonel", "Burlington, North Carolina", 3, 0, "We had good wine, great Duck fat fries and very good service. We were watching a football game and they never tried to rush us."], ["Surprisingly good", 4.0, "October 14, 2013", "D C", "Washington DC, District of Columbia, USA", 2, 0, "Food is pretty good and at a good price point. Try the ahi tuna salad or the burgers. The duck fat fries are to die for."], ["Service never good, but food is", 3.0, "September 13, 2013", "food_chick1", "MD, DC metro", 69, 24, "This visit to Ulah (my 4th or 5th time) provided me with the worst waiter yet. He didn't get to our table for a good 15 minutes after we were seated. We asked a busboy after a 10 minute wait if he could bring us some water, and he did. Once the waiter arrived he wasn't even apologetic and was...\n\n\nMore"], ["So good, we went back again and again !", 5.0, "September 4, 2013", "173el", "New York City, New York", 7, 8, "Our family came here for brunch which was great! We all enjoyed eggs Benedict on crab meat with a delicious hollandaise. They offer unlimited mimosas or bloody marys and attentive servers ever ready to keep your glass full. We enjoyed ourselves so much we came back the next day for lunch. Two nights later we returned for dinner and had...\n\n\nMore"], ["Excellent Crab & Brie Omelette!!!", 5.0, "August 18, 2013", "Chris W", "Washington DC, District of Columbia", 76, 15, "The crab & brie omelette was excellent! I didn't order anything else so I can't speak for the other menu items. However, I will definitely be back for the crab & brie omelette. I wish they served that at more place. I get sick and tired of the generic omelets such as veggie, ham & onion, etc.... The price was...\n\n\nMore"], ["Great Brunch", 4.0, "August 15, 2013", "Minutemen10", "Arlington, Virginia", 180, 55, "I was here for brunch with my sister and it was great. She used a living social voucher so it saved us 10 bucks. The food was very good. The breakfast burger was great, it had a fried egg on it. The bottomless mimosas and bloody marys were a bonus. I will go back"], ["Awesome brunch!", 5.0, "July 15, 2013", "BuffyMaryland", "Maryland", 63, 14, "I've dined here several times for lunch and dinner, but this was my first time for brunch. My only regret is not \"brunching\" here sooner.\nWe were greeted warmly when we arrived and our server was very friendly. The food, service, and unlimited mimosas were all great. (My glass was never empty). I had the eggs benedict with crab meat...\n\n\nMore"], ["Brunch is always great", 4.0, "July 6, 2013", "b1dmhl4", "Washington", 12, 5, "The brunch special is always good, especially with the unlimited mimosas. Great service - never an empty glass. Food was cooked right and tasted great. We come here with out of town guest and we are NEVER disappointed."], ["Nice", 5.0, "May 26, 2013", "OldHeadbngr", "Troy, Ohio", 21, 10, "We recently spent a couple of days in DC. Our B & B was about a block away from Ulah Bistro. We had two dinners here and both were excellent. I had the pizza and my husband had the short ribs. Service was great. If ever in the area again we would definitely go back."], ["The mac n' cheese is totally awesome!!", 5.0, "April 26, 2013", "BuffyMaryland", "Maryland", 63, 14, "Every time I come here, I tell myself that I'm going to skip the mac n'cheese and try a different appetizer. However, I never do and I never regret it. The dish comes with a large piece of corn bread, so it can be filling. You also have the option of adding bacon. I recommend sharing, but I never share....\n\n\nMore"], ["Different Every Time", 4.0, "April 8, 2013", "jopen", "Cleveland, Ohio", 32, 26, "One of the things I like about Ulah is that the menu does not seem static. I had the salmon cake sandwich which was huge. Did I mention delicious as well? I have been there before but this was new on the menu to me. My only dislike was sitting near the door and having a strong cold breeze every...\n\n\nMore"], ["This is what DC is about", 5.0, "April 3, 2013", "S K", "Harpers Ferry, West Virginia", 16, 7, "I lived near her for years, but now when I have a chance to go back, this is still a fave. The food is as delicious as the descriptions. I'm partial to the wood smoked pizzas, but a friend had an app with goat cheese that was out if this world. Sadly, I can't remember what it was called. Bartender...\n\n\nMore"], ["Please Hire a New Chef", 1.0, "March 24, 2013", "MarTee2", "Washington DC, District of Columbia", 7, 3, "I went to Ulah on a Sunday night for an early dinner. The regular chef must have had the night off because the meal I had does not match the other reviews I read here. I ordered the steak which came served with lettuce on top and a few crispy onions. It lacked flavor and it was chewy. It tasted...\n\n\nMore"], ["Very nice & trendy place!", 4.0, "March 19, 2013", "pianoflynn", "Delaware", 19, 4, "Very nice & welcoming. Crowded on Mar. 17th. Patty Day!\nbit loud when crowded, but to be expected. Very fun, young urban crowd.\nFood very good. We left with a full belly!\nWould definitely return."], ["Decent food in a pretty good location", 3.0, "March 17, 2013", "ghmont123", "Washington DC, District of Columbia", 14, 3, "This place is very standard fare. The food is pretty good but nothing too exciting or special. I had the seared tuna. Dining partner had a burger. Both were fine and pricing was pretty standard for DC. It's close to the U street metro station so that may be a plus for some."], ["Gourmet at a great price", 4.0, "March 16, 2013", "Robin3257", "Philadelphia, Pennsylvania", 90, 39, "Ulah's Bistro is just steps away from the U Street Metro stop ... very convenient. We had a reservation at 5.45 pm before a 7.30 pm event at the Verizon Center. We had time for a lovely meal and made it to the event in plenty of time. The crabcakes served on a fried green tomato with watercress salad were...\n\n\nMore"], ["Delicious and Accomodating!", 4.0, "March 4, 2013", "Rockshire", "Virginia", 64, 27, "My family had lunch at Ulah's on a Sunday just as their Jazz Brunch ended. They accommodated us without reservations and gave us prompt and quick service as one of our party had to get to the airport. Two of us had the seared ahi tuna salad. It was beautifully presented with beets, tomatoes, and greens wrapped with a thinly...\n\n\nMore"], ["Did a good job on Valentines Day", 4.0, "February 15, 2013", "Kim T", "Washington DC, District of Columbia", 126, 33, "My wife and I visited on Valentines Day, using a coupon from the Washington Post. Things got off to a bumpy start when the wait staff, overwhelmed by the onrush, hadn't visited our table for five or so minutes after we were seated.\nBut they turned it around with great food at a fair price. Portions of moderately high-style cuisine...\n\n\nMore"], ["Cozy and delicious", 5.0, "January 8, 2013", "mmcreel", "New Orleans, Louisiana", 18, 5, "I ate at Ulah last week while visiting my brother. We had reservations so we did not have to wait for a table. We sat upstairs in the bar area which turned out to be nice and cozy on a very cold night. I had the soup of the day (tomato ginger) and the grilled cheese and braised short rib...\n\n\nMore"], ["Just a good place to eat", 5.0, "January 7, 2013", "harold66", "Wallkill", 138, 69, "We have eaten here several times on stays in Dc. The service is tops and the food always surpasses our expectations. The only down side is that they do stey quite busy so you might have to wait for a table, worth the wait."], ["Nice nook in a NW DC neighborhood", 4.0, "December 26, 2012", "ssmosley", "DC", 77, 123, "A really nice restaurant on U street. Very good food and reasonable prices; we had dinner there on Christmas Eve and enjoyed our dinner of Double-cut Pork Chops and Steak and Frites. Try the grilled octopus as appetizer, it is exquisite and very tasty.\nThe service was friendly, attentive and efficient. Ulah is a trendy place yet has a very...\n\n\nMore"], ["Tasty Food", 4.0, "November 4, 2012", "wrestlerUMCP", "College Park MD", 52, 30, "Anyone looking for good food at reasonable prices will leave Ulah quite satisfied. I have eaten there 6 or 7 times and enjoyed each visit. The crabcakes and wild mushroom pizza are standouts."], ["Decent value for DC", 3.0, "October 25, 2012", "5STARz", "Macungie, Pennsylvania", 123, 40, "Business dinner on a weeknight. Place was dead around 6pm so we got good service. It started filling up a bit later. Food was quite good and prices were very reasonable for a meal in DC. Nice wine special too - half price on any bottle that was sold by the glass. Enjoyed Grilled Pear Crustini, Wood Fire Baked Oysters,...\n\n\nMore"], ["great food!!", 5.0, "October 23, 2012", "BuffyMaryland", "Maryland", 63, 14, "My only regret about this place is that I never seem to be able to eat dinner there. I have only eaten there for lunch. While lunch is perfectly fine, the dinner menu is more expansive and has some interesting items. Regardless of when you go, I recommend the mac and cheese appetizer. It's really good, but filling."], ["Truly Delicious Food!", 5.0, "October 18, 2012", "BRIDGE1965", "Washington DC, District of Columbia", 1, 0, "We stopped there because we saw the sign that said Mojitos for $5. The Mojitos weren't that good but the food was amazing. We had the Wild Mushroom Pizaa and Calamari. OMG!! The pizza was the best I have every tasted!! This restaurant is on the top of the list for favorite restaurants in the DC area for sure!!"], ["Ulah. Shmoolah.", 3.0, "October 5, 2012", "Amaronee", "Washington DC, District of Columbia", 2, 0, "Not really worth a special trip to U Street for the food here, although the service was very attentive and good-natured. But, really, Eggs Benedict on UNTOASTED English muffins...? OJ out of the carton...? Eggs were well-prepared but really sank into those mushy muffins. Not good."], ["Plenty of choice, friendly service, delicious meal.", 5.0, "September 13, 2012", "Adirah", null, 44, 19, "It was my birthday & they turned it into a delight all around. 3 course dinner $20! Fascinating variety of flavors in seared tuna with viscous."], ["Good food", 4.0, "September 12, 2012", "Shere M", "New York City, New York", 79, 19, "We really liked this place. We didn't order anything too special; we both ordered pizzas, but it was really good pizza. Also, the food that was going by around us looked amazing. We ended up wishing we had tried all of it, especially the oysters and the calamari!\nMy pizza had pork belly, balsamic vinegar reduction, gargonzola and arugula. Pretty...\n\n\nMore"], ["Worth checking out", 4.0, "August 25, 2012", "Nads82", "Falls Church, Va", 423, 110, "The ambiance was pretty laid back. Service was excellent. Food was good - I went with Salmon and veggies. It was fresh and healthy. Most of the dishes looked like comfort food and,while not as healthy, I heard were delicious. Pretty sure I would come back. Price point for some of the options were a bit high, but on the...\n\n\nMore"], ["Good location with tables outside", 3.0, "August 17, 2012", "dilanste", null, 89, 31, "I had a dinner in the outside table watching people in the street and tasting my cocktail. About this there are other places I had better cocktails (Hawaii), so I do not suggest the restaurant for these but for burger, salad and I think also pizza. I had not taste of pizza but my nose appreciated scent from near tables....\n\n\nMore"], ["Fun place for Brunch!", 5.0, "August 6, 2012", "Teacher202", "Crestview Hills, Kentucky", 27, 8, "Not pricey. My husband's burger could have adorned the cover of Food Magazine, and he said it was perfect! My Mediterranean omelet was loaded with spinach and feta cheese - DEE-licious!"], ["Families welcomed.", 4.0, "July 18, 2012", "CHUBABY", "Silver Spring, Maryland", 23, 35, "I didn't get a chance to eat there. Just had a drink. The atmosphere definitely was kid friendly but intimate. If you were on a date you could go upstairs and enjoy a kid-free zone. Very pretty decor."], ["good menu, trendy area", 4.0, "July 15, 2012", "matt c", "Bristol, CT", 37, 19, "like...right off of Metro stop...dislike...obnoxious ATM light nearby kills outside dining atmosphere...lol"], ["A Bistro or a Bar", 3.0, "June 7, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "It is the first time for me. To call it a bistro it is slightly misleading. It is more of a bar. Coming from Europe, no reputable would have big TV in it's establishment. There is more bar space in the place than tables. It is very noisy too. One thing that save this place for me to give it...\n\n\nMore"], ["good menu, trendy area", 4.0, "May 18, 2012", "acsanta11", "bristol, ct", 4, 0, "like...right off of Metro stop...dislike...obnoxious ATM light nearby kills outside dining atmosphere...lol"], ["Delicious and cosy.", 4.0, "March 25, 2012", "SFresh118", "Marseille, France", 59, 34, "The Mediteranean salad was amazing. Not too much dressing and really fresh. Except the waiters who allow themselves to make bad faces when they think that the tips you left are not enough, there's a good atmosphere in this bistro!"], ["Nice Find", 5.0, "March 8, 2012", "Lois6848", "Richmond, Virginia", 311, 71, "Had an early dinner with a business colleague. We were both pleased with our entrees -- I had the seared Ahi Tuna salad, and she had the steak salad with crisp bread and olive tapenade Scrumptious!. Oh, we also tried the fries with aioli (just wanted to indulge). I highly recommend this neighborhood gem, and I will return when I...\n\n\nMore"], ["Yummy", 5.0, "February 29, 2012", "roninzero", "Washington DC", 15, 5, "Fit for foodies. Great neighborhood gem and awesome location."], ["Bustling weekend vibe and decent food means good time", 4.0, "February 19, 2012", "rmwhitt", null, 130, 187, "Went to Ulah's with a Groupon and had a great time! Parking in the busy neighborhood takes time and patience. but we found a spot within a short walk. Started with appetizers: Their mac n cheese is thick, rich and full of shells and gouda. Could be a great meal for someone with a small appetite. Ordered a gorgonzola pizza...\n\n\nMore"], ["Fun Little Spot", 4.0, "February 9, 2012", "ITOMBA", "Baltimore, Maryland", 31, 14, "My wife and I were wondering the U St corridor recently and stumbled upon the Ulah Bistro. Remembered reading some good reviews on TripAdvisor and stopped in. Had a great time and good food in this happening little spot. Don\"t go if you are looking for quiet and romantic, but if what you want is energetic and fun, do stop...\n\n\nMore"], ["Tasty little bistro", 4.0, "February 8, 2012", "cwall5", "North Carolina", 12, 4, "Great restaurant with innovative dishes. The volume was a bit loud inside, but people seemed to be enjoying outdoor bistros as well. A good alternative to the ethnic foods in the U Street Corrider. We had a wonderful watermelon and feta appetizer that we have since started making at home!"], ["good buzz, nice surprise", 4.0, "November 25, 2011", "Karlitos", "Seattle, Washington", 46, 74, "Wanted to get into Coppi's but it was full...so tried Ulah's. Very pleasantly surprised. Good buzz. Packed (Friday night.) They first gave us a table upstairs which was full of young excited singles at the bar...too noisy! I asked if we could move downstairs & they obliged directly & we got a GREAT table. Started with a house salad (good),...\n\n\nMore"], ["Great Food", 5.0, "November 7, 2011", "mc2wv0307", "Washington DC, District of Columbia", 20, 6, "Great small place in the heart of the \"U Street Corridor\" section of D.C. I've eaten here many many times and it's always a great choice! When you go ask them for the bread, they don't typically serve it anymore, however, upon request they will bring you out a pizza type flat bread with an olive spread on the side....\n\n\nMore"], ["Excellent food, hearty portions and rich tastes, very busy bar", 4.0, "October 31, 2011", "CraftsmanTraveler", "Washington DC, District of Columbia", 59, 18, "The menu has a lot of variety, and the fare is very mixed. There are substantial portions of short ribs and other meats, as well as salads and fish courses. The bar is very busy and gives a lively atmosphere. Outdoor seating is very good."], ["Consistently good!", 4.0, "October 31, 2011", "acdcusa", "Washington, DC", 71, 26, "I had always gone there with friends in the past, but lately have started meeting clients there for lunch. The menu is quite elaborate, and allows for enough choices even for the most finicky. The muscles are outstanding, and \" as big as small chicken breasts\" as one friend remarked recently. I always had the Mediterranean salad with grilled tuna,...\n\n\nMore"], ["Serendipity!", 4.0, "August 3, 2011", "BethSko", "Pittsburgh, Pennsylvania", 11, 13, "My boyfriend and I were on our way home from DC on a Saturday afternoon and wanted to try Ben's Chili Bowl. When we arrived, the line was around the building. Since we were starving and had already parked our car, we decided to try Ulah Bistro which is directly across the street from Ben's... excellent decision! We sat at...\n\n\nMore"], ["Great Food, Thanks Chef!", 4.0, "July 16, 2011", "triptakero25", "Orange, California", 33, 7, "What a great surprise. Coming from Los Angeles with great orestaurants this was a big surprise. Try the braised short ribs with the polenta and the appetizers. I wish we had one hear."], ["Ulah Bistro on a Sunday Nite", 4.0, "February 20, 2011", "Jack M", "Charlotte, North Carolina", 21, 15, "A very cool and funky place for dinner! We had pizza, wings, salads and appetizers. The staff was very friendly. It also appeared to have a hip bar for hanging out and watching a basketball game. I'll definitely come back to this joint."], ["Love this place for brunch. Generous portions, and there's plenty of parking mid-morning. Reservations recommended.", 4.0, "May 30, 2009", "eventsdc", "washington, dc", 170, 88, "Love this place for brunch. Generous portions, and there's plenty of parking mid-morning. Reservations recommended."], ["My girlfriends and I met...", 4.0, "March 12, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "My girlfriends and I met here the other night for drinks and dinner. It was my first time there. The atmosphere was modern but somewhat casual. The staff was helpful and attentive and didn't rush to seat us as we chatted over wine. The menu was pretty standard, and I took a chance on the chicken. The chicken entree is...\n\n\nMore"], ["super huge portions. good beers on tap, but hate the tv's at the bar.", 3.0, "December 14, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "super huge portions. good beers on tap, but hate the tv's at the bar."], ["Best all-around (location, food, service, atmosphere) on U Street", 4.0, "June 22, 2008", "wdcguy", "Washington DC, District of Columbia", 10, 11, "Best all-around (location, food, service, atmosphere) on U Street"], ["Ulah is one of my new favorites. Very good food, very good service and pretty reasonable. Their weekend brunch is...", 4.0, "June 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Ulah is one of my new favorites. Very good food, very good service and pretty reasonable. Their weekend brunch is great! It is really worth trying."], ["Pizza was to die for.", 4.0, "May 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pizza was to die for."], ["They make delicious pizza here. The rest of the entrees are also very good, especially the tuna. I would characterize...", 3.0, "April 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They make delicious pizza here. The rest of the entrees are also very good, especially the tuna. I would characterize this place as the Matchbox of U Street Corridor. Go here for good, American style food."]]], ["Subway", [["Sometimes stuck eating here", 2.0, "September 30, 2015", "Heidi A", "Alexandria, Virginia", 22, 7, "The sandwich is standard Subway, but the service and speed are sub par. It is usually staffed with only one person at lunch time, in a building cafeteria area that gets heavy lunch time use. One person wouldn't be so bad, but the person works in slow motion and does not even pleasantly greet the customers. I only eat here...\n\n\nMore"], ["Subway for Dept of Education building", 1.0, "July 31, 2015", "chrisizme", "Collierville, Tennessee", 4, 1, "You can't eat here unless you work in the Department of Education building. We were turned away by security at the door. This location should be taken off of Tripadvisor since it isn't open to the publoc. You must have a federal ID to enter."], ["Lifesaver!", 5.0, "July 1, 2015", "Izelle V", "South Africa", 23, 5, "When in the USA we look for this place,first thing,when ariving in a new city/town. Fresh and delicious !"], ["healthy fast food", 5.0, "March 27, 2015", "sja23323", "Billings, Montana", 15, 9, "Subway is now the largest fast food chain in the world, I just happen to have been to them in many countries. Americans like going to a local fast food option when in Europe."], ["Good way to get around", 4.0, "January 12, 2015", "Rachel S", "Carmel, New York, United States", 45, 22, "We took the train to National Stadium to see the 2015 Winter Classic game. With a little help from the attendant, who was kind enough to come over to the pay station and show us where we need to go, what we needed to do and how we paid was the most difficult part. Trains came quickly and were clean...\n\n\nMore"], ["Clean Safe and Orderly Subway", 5.0, "January 2, 2015", "karen_ralph", "Pompano Beach, Florida", 88, 58, "Wow... No grafitti!!! What a pleasant change from both American and European cities. Felt very safe, subways run smoothly and timely."], ["SALUDABLE OPTION", 3.0, "November 6, 2014", "ElSrBucci", "Madrid, Spain", 189, 37, "In the fast food way this is a good option, many sandwiches ... you know subway... here in this amazing city you can find a Better Subway than others places"], ["What a bargain!", 5.0, "July 30, 2014", "Karen B", "Maxwell, Iowa", 26, 6, "Stopped here for supper after a day of sightseeing. Priced right and delicious. We recommend this place."], ["Tried and true", 3.0, "July 11, 2014", "Marcia K", "Palo Alto, California", 225, 55, "While touring in DC, we just wanted a quick healthy bite and lo and behold, we were in front of a subway shop. Subway sandwiches are always fresh, consistent and cheap! My husband had his favorite meatball sandwich and I had my favorite 6\" extra loaded veggie sandwich. What can I say? Subway is a Subway, but sometimes, you just...\n\n\nMore"], ["Only available for govt employees", 5.0, "June 25, 2014", "John H", "Louisville, Kentucky", 4, 3, "This is in the dept of education. We were told that it was only available to govt employees so we were turned away. I was forced to give it a rating to submit this review."]]], ["Piola", [["Best brunch...", 5.0, "September 29, 2015", "dawanthem04", "Brewer, Maine", 8, 3, "This place still is the best place I have been to for brunch in dc... great environment.. we sat upstairs and had to go down for the drinks but they will bring you drinks if you ask... food is fantastic"], ["Went for brunch", 3.0, "April 13, 2015", "Maria L", "Stamford, Connecticut", 39, 22, "we went with friends for brunch. Atmosphere was cool. Food was ok. Table ordered a lot of food. I tried the Bloody Mary flight. It was ok. Drinks were a bit watery for me. I like my BM a little thicker. I didn't prefer the tequila one personally. I had the veggie pizza and really liked it. I felt the...\n\n\nMore"], ["Too noisy", 2.0, "March 19, 2015", "nicothed", "Washington DC, District of Columbia", 71, 43, "Brunch food was really good but the noise level was just too loud (and we had 3 flights of 4 margaritas, which was a good try but none of us really liked them)."], ["Family dinner", 5.0, "August 7, 2014", "Yulia S", null, 5, 2, "Walked in not knowing anything about the place. Very friendly staff. Very tasty food. Pizza crust amazing. Recommend for family visit!"], ["average pizza place with a hip atmosphere", 3.0, "February 25, 2014", "jg325", "WashingtonDC", 489, 320, "My partner night to Piola for Valentine's Day dinner, and overall, I felt it was a quality pizza place in the busy 14th Street restaurant landscape. We went originally because we got a Gilt City deal so we were able to try a lot of their offerings.\nThe atmosphere upstairs was pretty hip, with tall ceilings. They redid the place...\n\n\nMore"], ["Pizza, fusion Italian/Brazilian", 4.0, "January 21, 2014", "John B", "Washington DC, District of Columbia", 29, 13, "Dropped in on an impulse. Affordable pizza, amiable wait staff. Acceptable ambience, but be wary of folks always bringing kids to pizza joints. Upstairs may be more removed from the children. The pizza was good, thin-crust, and arrived quickly. Will return!"], ["cut the nonsense", 4.0, "December 18, 2013", "rufkdlk_10", "Washington DC, District of Columbia", 50, 13, "like you cut your pizza in this place, hands down, best pizza in town with so many side items i haven't tried but the bruschetta is first rate and the soup is what you expect, staff range from pleasantly charming to downright surly but management is top notch, as is this place. Bravo."], ["Great pizza", 5.0, "September 14, 2013", "live2eat67", "Arlington, VA", 2, 0, "Really good pizza with a wonderful thin crust. They have another location in Arlington which is very popular. Their happy hour is busy because of their special drinks and free finger food they pass around."]]], ["Peaches Kitchen Catering", [["Service Needs To Be UPGRADED!!!", 1.0, "October 11, 2015", "Orishaslove", "WASHINGTON DC", 5, 8, "Today i ordered two side items and didn't get my food until after an entire 45 minutes. I'm ashamed that i even waited ad long as i did. I was in need of a snack and thought it would take less then 10 minutes but i was wrong. I'm really confused, out of all the people who work at this...\n\n\nMore"], ["Caribbean Food at it's best", 4.0, "October 8, 2015", "LivvyT", "Washington DC, District of Columbia", 2, 2, "Went for dinner about 30-45 minutes before closing and given excellent service, as if I had come much earlier. Pretty good wait for the food but it was well worth the wait.\nUsed groupon and it was readily accepted. Owner(s), Wait staff, Cook and all to be\ncommended. Will definitely return."], ["Pilate Tantalizing", 5.0, "September 19, 2015", "Joseph B", null, 1, 0, "Enjoyed Peaches catering service at a family event and the menu was impressive. Had to stop by Peaches Kitchen for an even better experience."], ["Delicious food and a nice environment", 5.0, "December 11, 2014", "YWood", "Fredericksburg, Virginia", 9, 3, "This is a nice family owned restaurant. They offer a variety of foods that are made fresh at a reasonable cost. I ordered the Jerk Chicken that comes with 2 sides of your choice. The food was delicious."]]], ["IHOP", [["New Years Eve Ritual", 5.0, "April 3, 2015", "lovingfla", "Washington DC, District of Columbia", 46, 13, "We always go here after church on New Years Eve. The wait is never that long, and the food is always hot and tasty. Restaurant is always clean and the wait staff is extra nice."], ["Always a home town feel, love this place...", 5.0, "February 20, 2015", "Terrence W", "Lawrenceville, Virginia", 4, 1, "Love the food as always, and our server was excellent! The restaurant is always clean, warm and inviting!"], ["Perfect all around", 5.0, "November 21, 2013", "HiDEF_Niq", "Washington DC, District of Columbia", 3, 2, "I have eaten at this restaurant several times and i consistently have a good dining experience. Ambiance is quiet, calm, and relaxed, nice earth tones and comfortable seating. We sat at a booth with a view of the street. Food was made to order and came out quickly (there were few people in the restaurant at the time, but still...\n\n\nMore"], ["Great Service", 4.0, "April 4, 2013", "Mike1963", "Washington, DC", 19, 4, "The IHOP near the colony south was very good. It is IHOP but, the food was hot and done right. The IHOP was clean and the service was great"]]], ["Chop't Creative Salad", [["Vegan options 'creatively' available!", 5.0, "September 27, 2015", "randall1025", "Las Vegas, Nevada", 124, 22, "This location is in Union Station allowing for a delicious meal as well as excellent people watching! I had the Mexicali Vegan which was absolutely fantastic! There was just enough salad dressing and avocado to keep the salad moist without being overly seasoned. This is a place I would definitely return to when in D.C.!"], ["Very Good", 4.0, "July 5, 2015", "safe_foodforyou", null, 68, 10, "I had the New England Cobb with chicken and my wife had a chopped cob.\nBoth were very good. I really enjoyed the beets in my salad.\nVery reasonably price at $10 per salad."], ["Salads v2.0", 4.0, "January 21, 2015", "Bill W", "Daphne, Alabama", 121, 65, "Best idea for 'fast food'. Wish I had these near my home. How many times do you want a salad and end up disappointed? The lettuce is limp or is the kind you don't like? Or the other ingredients are just blah? Here you choose your lettuce mix and other ingredients and they chop it up fresh for you. Great...\n\n\nMore"], ["Love Chop't!", 4.0, "September 1, 2014", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "I love this place, and so does everyone else! If you're at any chop't location at lunch, the line could be out the door! But it's well worth the wait. Pick one of their salads or create your own. I love all the options!"], ["The Place to Go at Union Station", 4.0, "August 13, 2014", "Ohtobeinsandiego", "California", 149, 52, "So many choices, but quick, relatively healthy food choices and a sturdy to-go container, makes this the place to grab a meal to take on Amtrak."], ["Healthy and good", 4.0, "August 6, 2014", "ques", "SoBoVa.", 125, 43, "Love this place its so good and fresh. I got the Kebab sandwich and hubby Cobb salad both were huge. I didn't leave hungry."], ["Awesome salad place", 4.0, "July 26, 2014", "Christopher C", "Frankfurt", 44, 20, "They should have these every 2 blocks. You pick something on the menu or create your own. Fresh ingredients and voila! You have an amazing salad. I was going to write more but it's very simple. You want amazing salad, they have it and they prepare it fast, friendly and good..."], ["Excellent spot for a light but filling healthy lunch", 4.0, "July 19, 2014", "Ron F", "San Francisco, California", 29, 15, "Chopt offers a nice variety of healthy salad options that are filling, tasty and healthy. The grilled chicken was tasty and fresh--didn't taste like processed chicken breast typical of chain restaurants. The vegetables were plentiful, fresh and crisp. The service was quick, portions were large enough to satisfy a hungry guy and prices were reasonable."], ["Great fresh salad, generous portions, many options", 4.0, "March 17, 2014", "chayared", "Maryland", 62, 26, "Ate lunch at chop't for the first time. Lots of options for toppings (chicken, beets, cheeses, etc.) and for salads (romaine, mesculun, arugula, kale, etc.). Quick efficient service, ingredients mixed well in front of you. Very tasty and not very expensive."], ["Love these salads", 4.0, "December 20, 2013", "4BearsinVA", "Leesburg, Virginia", 40, 7, "They have a great variety but I always get my favorite - Mexican Ceasar. Normally very quick and pleasant but you have to go before the lunch crowd hits when the line is out the door."], ["Very good salad", 4.0, "August 28, 2013", "RoadKing8084", "Henderson, North Carolina", 119, 44, "We got there during lunch traffic time. It was extremely busy with long lines, somewhat confusing and hurried due to the amount of people being served. Very noisy and I had difficulty hearing what they were asking. Some language accent problems also but we got through it. There are lots of choices for specific salads and for choose your own...\n\n\nMore"]]], ["Au Bon Pain", [["love it", 4.0, "August 30, 2015", "Nuit_Hernandez", "Puerto Vallarta, Mexico", 10, 9, "Delicious! love their soup,Au Bon is always a treat, fresh taste and quick service, I also enjoy their sandwiches :)"], ["So so", 3.0, "July 25, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "Au bon pain is generally a solid chain for pastries in my opinion. This is not the best store, and it feels a bit messy and cluttered. Coffee on the other hand is deadfall in any au bon pain, in particular the espresso which is my favorite coffee drink."], ["Great Wrap!", 5.0, "July 10, 2015", "MossFolks", "Marshfield, Missouri", 28, 9, "I ordered a wrap to go (napa chicken). The wrap is huge and delicious. This place offers so many choices from custom salads to soups and sandwiches to baked goods. I would return if ever in DC again."], ["Friendly", 4.0, "June 12, 2015", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "Stopped in for a coffee this afternoon, and service was fast and friendly! The vanilla latte was just sweet enough. My only beef was that you pay for everything all the way across the store from where you ordered, which could get confusing if they were really busy."], ["Quick and tasty", 4.0, "February 1, 2015", "Gary H", "Hunter Valley, Australia", 35, 20, "We had only just flew into DC and went for a walk after checking into our hotel, wanted something quick and easy to eat before having a long walk around the Capitol. We liked the look of Au Bon Pain and had a look inside, very new to this establishment we were helped immediately by one of the staff who...\n\n\nMore"]]], ["Chipotle Mexican Grill", [["As ordered", 4.0, "September 7, 2015", "Julie C", null, 2, 0, "Quality food, great service. Didn't have carnitas. Find in lower level of Union Station.\nSuggestion: Weary travelers need softer chairs."], ["longest lines at a Chipotle but quickly served", 4.0, "July 26, 2015", "jg325", "WashingtonDC", 489, 320, "The Union Station Chipotle is one of my go-to lunch spots. More than any Chipotle I know of, this one has the longest lunch lines. But even given the long lines, people are served pretty quickly and efficiently. (...But I don't think they'll make you one of the special quesadilla burritos since they're so busy.)\nHowever, I'm not a huge...\n\n\nMore"], ["Yummy !!", 5.0, "July 14, 2015", "ArtAddict99", "Jaipur, India", 7, 0, "nicely cooked hot quesadillas with spicy salsa made my lunch perfect. This was one of the satisfying meals I had at Washington."], ["Typical restaurant in a BUSY station", 3.0, "July 4, 2015", "David G", "Goose Creek, South Carolina", 123, 21, "Hot food fast. Nothing special. Guacamole was fresher tasting then normal. Due to the high volume of this restaurant maybe? No sweet tea in the Nations Capital??"], ["Not much of an option!!!!", 3.0, "February 11, 2015", "MuranoG", "Miami, Florida", 171, 213, "I think this place is not quiet there for Chipotle franchise. I did not find more choices on the bar where we can choose different items for our food. This place is not that clean than other stores. I had a bad experience here."], ["Don't eat the guacamole!", 1.0, "September 10, 2014", "SweetieCutie04", "McPherson, Kansas", 3, 7, "Grabbed a bag of chips and two cups of guacamole for a late lunch. Had horrible diarrhea approximately 45 minutes later. We were visiting from out of town and this seriously put a damper on the rest of our trip!"], ["Lunch Time food", 4.0, "January 28, 2014", "Ray W", "Washington DC, District of Columbia, USA", 15, 1, "Chipotle is always a good place to go when your'e hungry. This is where I go for lunchtime. Very filling"], ["Lovin' that Chipotle", 4.0, "December 17, 2013", "Andrew B", "Washington DC, District of Columbia", 1, 2, "I've been going to this place since way back, most likely longer than you. I really like the food there. I usually get the burrito bowl. It's like a burrito but served in a bowl, i.e. without a burrito. Unfortunately, they do not discount the price of the burrito shell from the regular price of the entree. Worry not, however,...\n\n\nMore"], ["Mexican Taste", 4.0, "December 8, 2013", "Libert R S", "Virginia", 12, 6, "When we decided to go there we were starvings!! we saw the restaurant and decided to enter.\nI ate the burrito with stake, back beans and etc. In general it was yummy but I kind of spice for me me."], ["Good Food, Long Line", 4.0, "November 20, 2013", "Seth J", "Seven Corners, Virginia", 480, 162, "This is one of the busiest and smallest Chipotles I've seen. At lunch there's usually a line of people and there's just a long table inside the place. If it's warm you can enjoy the outside seating, but if it's not you're out of luck and have to find a seat somewhere else."], ["Consistent and convenient", 4.0, "October 23, 2013", "Alex D", "Baltimore, Maryland", 13, 4, "The chipotle in union station has been consistent in quality and very convenient for a quick lunch. The lines may appear long but they move very quickly at this location. The only issue with this location is the lack of available seating nearby but there are additional tables and chairs on the first floor in the food court area"], ["The familiar taste of home", 4.0, "August 8, 2013", "ovolacto", "Colorado", 252, 167, "I'm hoping this is the Chipotle at Union Station. That's the one I went to, and this address is the most similar to Union Station.\nI was really impressed that Chipotle has extended its reach this far, and there are actually few of them in D.C. We enjoy Chipotle at home all the time, and were excited to be able...\n\n\nMore"]]], ["Impala Cantina y Taqueria", [["A taste of New Mexico in DC? Yes!", 5.0, "September 13, 2015", "yummygogi", "Denver, Colorado", 16, 2, "We were out visiting our son In DC and he took us to this wonderful gem! He told us that it had great tacos and I'm sure that it does, but we had the enchiladas with the red sauce and it was like stepping into Santa Fe. The enchiladas were delicious, tasty, spicy, home made red sauce with bubbling hot...\n\n\nMore"], ["Impressive food, great staff", 5.0, "July 6, 2015", "MikeMfromWashDC", "Washington, DC", 148, 89, "This delicious Mexican-style restaurant serves a variety of tasty tacos and enchiladas. Staff was super friendly and helpful. Margaritas were also a high point, and very reasonably priced."], ["Love this place!", 5.0, "July 6, 2015", "Julie T", null, 8, 3, "This is a great place! Delicious food - real Mexican! And the margaritas are hand freshly squeezed with real line juice - no crappy sour mix! It's a find in H and a great patio. Try it!"], ["Decent Mexican Food", 3.0, "July 1, 2015", "Ant1007", "Hyattsville, Maryland", 116, 38, "Stop in the night of the Mayweather Fight and had a few tacos, they were grilling them outside and the aroma was irresistible. The flavors were kind of muted but I enjoyed my meal overall. Its worth checking out if you are on ever on H St NE."], ["What a FIND!!!", 5.0, "June 18, 2015", "Karen V", "Anchorage, Alaska", 28, 17, "This is great authentic food! We traveled from Alaska and I wanted to try places that tourists don't know and we wanted a genuine experience and we got one here. We arrived and were seated outside, within minutes a thunderstorm rolled through; we were quickly moved upstairs to a great window seat. Our server was wonderful and attentive. The food...\n\n\nMore"], ["Surly but Sound", 4.0, "June 10, 2015", "Patty H", "Bethesda, Maryland", 56, 29, "Went on a Friday night with some friends....looking for a nice evening with good food. When we arrived the hostess asked if I had a reservation and the walked away (I looked at my friends and muttered is it something I said?). She returned with another surly friend and he said follow me. Up we went. Pretty traditional setting. Corn...\n\n\nMore"], ["Not good", 1.0, "April 3, 2015", "owamibuy", "Cincinnati, Ohio", 23, 9, "Poor service, not good food. Would NOT go back. A number of other places around it looked much better than this place. Kitchen looked not well kept."], ["Food poisoning", 1.0, "April 2, 2015", "Annie L", null, 1, 0, "Four hours after eating dinner at Impala, we're paying the real price. From the outside, the restaurant seemed like a decent place. We were seated and placed orders. While waiting, I stepped inside to look around. I saw a cramped, dimly lit, dirty kitchen with one guy in it. I immediately had the thought, \"that looks like a health disaster...\n\n\nMore"], ["Mexico in DC", 5.0, "February 27, 2015", "talley01", "Washington DC, District of Columbia", 54, 24, "You can't beat this place. The food is amazing and very authentic. I have been coming here from the beginning and love. Everything is feshly made and homedade tortillas are fantastic. Highly recommend the tacos and beef tongue is my favorite. Order a margrarita and enjoy."], ["As close as it gets to Mexico in DC", 5.0, "December 30, 2014", "Sinheart", "Washington, DC", 22, 19, "My regular go-to for Monday margaritas and tacos was packed one Monday. None too happy about that, but craving a margarita, I recalled that Impala had a Monday margarita special too. I walked in and the bar downstairs was quiet, which was great because I needed to decompress (hence the margarita). Their margaritas were good, but so were the margaritas...\n\n\nMore"], ["Real Mexican Food", 5.0, "September 8, 2014", "ch50ava", "Tulsa, OK", 5, 0, "Great food, great atmosphere, great service. If I close my eyes, I could be in Mexico. Love the patio and the margaritas. Don't go if you're looking for Tex-Mex!"]]], ["Meze", [["Good Turkish Small Plates", 3.0, "August 31, 2015", "Dan B", "Cape Coral, Florida", 214, 108, "Some hits and some misses. Excellent selection of mezes, plus a full Turkish menu. Service was excellent and the place was clean. We had a couple of very good dishes and some....not so. We had the spiced lamb sausage. Unique and excellent. The hummus.....Not so much. Have had so much better. One things that took away from the whole experIence...\n\n\nMore"], ["Turkish food in a pleasant, friendly setting", 4.0, "August 13, 2015", "Soane", "Virginia", 3, 2, "Meze has a great happy hour with discounted drinks and a variety of Turkish appetizers. A great place to sit outside in nice weather and enjoy the street life. The food is good, with some unusual Turkish dishes on the menu."], ["Meze restaurant DuPont circle", 1.0, "July 4, 2015", "christin41353", "Rockville, Maryland", 12, 4, "We were very disappointed by the food that was greasy and untasty.\nI love Mediterranean dishes but it is the first time I don't like what I chose in the menu.\nIt was an awful experience and I won't eat there again."], ["Turist from newyork .", 5.0, "June 1, 2015", "Maymuncuk", null, 1, 1, "Best turkish food and mojitos dc . We have great time there . Kunefe dessert wow . Must try . Basil ginger mojito ."], ["Very good", 4.0, "April 25, 2015", "Stefan M", "Amsterdam, The Netherlands", 26, 7, "We had dinner on the terrace. They have a good selection of Turkish/Persian dishes. The food was very good. Minor point is they ran out of their Turkish beer. Service was very good."], ["Choose Happy Hour over Groupon", 3.0, "April 20, 2015", "DishesToDieFor", "Washington DC, District of Columbia", 46, 16, "What is stranger than a watermelon mojito? Answer: A watermelon mojito in a Turkish restaurant. Go figure, but mojitos -- many riffs on the standard -- figure prominently on Meze's happy hour menu, and the watermelon variety is a fine choice. The happy hour food menu is a great deal as well -- you will find the groupon to be...\n\n\nMore"], ["perfect meal in AdMo", 5.0, "March 23, 2015", "rebecca m", "Washington DC, District of Columbia", 40, 24, "Just ate here on a lovely Saturday afternoon and had a wonderful experience. My friend and I were seated right away outside. It was a gorgeous day and there were many people out and about in Adam's Morgan so this restaurant is great location for people watching. The menu is extensive and somewhat confusing for those not familiar with Mediterranean/tapas...\n\n\nMore"], ["Pricey but worth it!", 5.0, "November 13, 2014", "Benjamin W", "Alexandria, Virginia", 15, 11, "Nice experience and good food. It is a bit pricey, but you get a lot for your money too. There is a semi-private back room that is good for small gatherings."], ["Good but...", 3.0, "November 11, 2014", "Evie9242", "Washington DC, District of Columbia", 28, 8, "Not so good as meze in Turkey by a long shot. OK for neighborhood standards. Friendly and good service. Go for nibbles, outside limin' and some good Turkish wine."], ["Turkish Tasting Menu", 5.0, "October 28, 2014", "liko11", null, 25, 19, "Got another Groupon for $75 that included a 11 Item Tasting Menu With 2 Glasses Of Wine For Two. Caught the bus to the restaurant which is just above Dupont Circle. Service was excellent and the food was great!"], ["a favorite place", 5.0, "October 17, 2014", "James B", "Lovingston", 43, 12, "My daughter wanted to come back to Meze despite being tired from a lot of biking that day, and a pretty good walk from the Woodley Park metro spot required. The food is that good. It is a family favorite. Our waiter was only two months out of Istanbul and was friendly and accomodating."], ["Good food – But don’t dine alone if you want to be outdoors!", 3.0, "August 31, 2014", "4GTravels", "Ohio", 179, 103, "It was a Friday evening on a nice summer day around 6:30pm (early for dinner) and I wanted to dine here because of the vegetarian options. The place was busy, but there seemed to be enough space for me to be seated outdoors. However, since I was dining alone the service provided to me was slower and I was not...\n\n\nMore"], ["Great Brunch!", 4.0, "August 5, 2014", "Nikki S", "Reston, Virginia", 8, 1, "We went here on a Sunday afternoon for the bottomless brunch. It was excellent - the outdoor seating is cute and pleasant, the food was delicious, and the service was mostly great.\nThis experience was much better than most buffet-style brunches. There is a large menu with items (small plates; think tapas) you can select for the brunch, and it...\n\n\nMore"], ["Excellent turkish/Mediterranean", 5.0, "June 19, 2014", "Hoya2014", "Washington DC, District of Columbia", 9, 2, "/Mediterranean with Turkish fare! Try their 11 item tasting menu..yo die for. Excellent, attentive service...they certainly make you fee T home. Try some raki while you're there'"], ["Excellent place for diverse diners", 4.0, "June 18, 2014", "jloreine", "San Antonio", 148, 59, "We were in DC for a conference and as such had four people who really didn't know each other attempting to find someplace to eat.\nWe walked over from the Hilton and after wandering a bit, all agreed to stop at Meze.\nWe each ordered two items from the menu- the cheese plate, the watermelon/feta salad and the lamb/pistachio sausage...\n\n\nMore"], ["An average Turkish restaurant serving tapas style average Turkish food", 3.0, "June 16, 2014", "ac c", "Saint Louis, Missouri", 80, 73, "This is a pretty small, but cute restaurant located in Adams Morgan on 18th street, serving tapas style Turkish food. There are two floors indoor seating and small outdoor seating available. Our servers were polite and fairly attentive, but forgetful. I had to order 4 times to receive a mix drink. Food tasted decent, average, but not great.\nA GroupOn...\n\n\nMore"], ["Turkish Coffee", 3.0, "June 2, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "It's hard to find a spot where you can seat to have drinks. Specially before 8pm.\nWe got a nice outdoor table on Meze. The staff was nice and helpful.\nGood Turkish coffee."], ["Decent", 3.0, "May 28, 2014", "AngieVacations", "New Jersey", 31, 24, "Good food. Great cocktails. Nicely located in Adams Morgan. Polite and attentive service. Indoor and outdoor seating. Tapas style Turkish food. Decent food. Not bad at all but have had better. Overall enjoyed it."], ["3 stars overall but 5 stars for the baklava!", 3.0, "May 21, 2014", "travelfoodiedc", "DC", 43, 27, "Pros: Best baklava I have ever tasted (and I just returned from Istanbul)! The mojito selection is impressive- pricey but impressive. The olives were yummy and the service was good. Outdoor seating on a sunny day is great for people watching.\nCons: The rest of the meal (vegetables in oil, lamb meatballs, and chicken kabob) was average and not memorable....\n\n\nMore"], ["Fun. Great Food.", 4.0, "April 12, 2014", "Wineaux FromAlexandria", "Alexandria, Virginia", 253, 115, "Meze is a great restaurant. Middle Eastern cuisine is becoming increasing popular and more and more restaurants opening. A great diversion from traditional \"continental\" and American food. The flavours are wonderful. And, without the heavy sauces and fats, likely at lot more healthy too. Enough of the PSA, and back to Meze ... located in an old townhouse in the...\n\n\nMore"], ["Charming dinner stop in Adams Morgan", 4.0, "March 26, 2014", "Heather M", "Calgary, Alberta, Canada", 64, 24, "We settled on Meze after reading some reviews on TripAdvisor and because it is just blocks from our Dupont Place Apartment (also found on Trip Advisor). And it is a great little find! We arrived at 8:30 pm and had no trouble getting seats. The atmosphere is cozy and we enjoyed a window seat to take in the evening snow...\n\n\nMore"], ["Fantastic Service and Great Brunch!", 5.0, "March 11, 2014", "Glenn72D", "Washington DC, District of Columbia", 5, 5, "Loved the food, service, and location. Great menu choices for both meat and grass eaters! If you are in thus area. It is worth trying out."], ["tight and cramped", 3.0, "March 9, 2014", "HikingTom", "Philly", 193, 74, "Probably not unusual for restaurants in this area, or anywhere in DC for that matter, real estate being what it is. I'd expect a little more elbow room in this dinning/residential area just outdie the bustle and bustle of downtown. Pricey, and the waiter kept saying 'portions are small', as if to warn that we'd leave hungry. But deft scrutiny...\n\n\nMore"], ["Turkish Restaurant", 4.0, "January 22, 2014", "Art G", "Sarasota, Florida", 55, 26, "Turkish restaurant in Adams Morgan area. An excellent piece of variety in the neighborhood. Can't say I'd ever had Turkish before, but this place showcases the best part of Mediterranean eating: the sharing. The titular meze, like tapas or dim sum, are small plates meant to be split with friends, and there's quite a nice variety. Wide variety of food...\n\n\nMore"], ["Best French Toast Brunch", 3.0, "December 13, 2013", "Aaron T", "Boston, Massachusetts", 43, 14, "It's seriously epeic... Think cinnamon-swirl bread that's crispy on the edges and soft inside. Topped with fresh fruit and drizzled with warm maple syrup - it's addictive."], ["Nice Late Night Menu", 5.0, "December 9, 2013", "echappell86", "Newport News, Virginia", 50, 22, "We stumbled across this restaurant on a search for food. We came to the Adams Morgan area because we couldn't find food in Old Town Alexandria. After attempting two other bars in Adams Morgan at about 12:30 am, we walked up to the bouncer at Meze and asked if they were still serving food. He said yes! We showed our...\n\n\nMore"], ["LOVE! LOVE! LOVE!", 5.0, "November 18, 2013", "Msmaria_nicole", null, 29, 4, "This was our first time experiencing this restaurant & the food, the service, the ambience made us feel as though we were royalty. LOL! We sat on the second level at a secluded little corner for two. We ordered the tasting menu & EVERYTHING was SUPERB!! Our glasses never got empty, the servers checked on us periodically & everything was...\n\n\nMore"], ["Great place - go at 4:30", 4.0, "September 30, 2013", "simnznc06", "NC", 162, 59, "We had a light late lunch/early dinner here. Excellent service. shared several small plates and a glass of wine. go at 430 to get the cheap/happy hour menu. Good place"], ["Fabulous mojitos", 4.0, "August 11, 2013", "NVDesertRat", null, 32, 16, "Great food & great service. The place is a bit small so make a reservation if you want to guarantee a seat. It's fun to order several small plates & share for a social meal experience. The mojito menu is extensive & they're all very good. Try the ginger mojito - fresh & tasty. It is a bit pricey, but...\n\n\nMore"], ["Good atmosphere, slow service, overpriced", 3.0, "July 31, 2013", "LadyDeathStryke", "Baltimore, Maryland", 40, 31, "First thing you should know, this is a tapas place = small portions for $7-10/ per dish. The cocktails are $10-12. The service was very slow. There were 6 full tables on the front patio with 4 waiters and I overheard a few tables complaining about the wait time for their food or check. So I wasn't surprised when it...\n\n\nMore"], ["Well worth it", 5.0, "June 28, 2013", "jtois", "Boston", 62, 68, "My family ate dinner at Meze -- as a parent, I had to make an executive decision to eat Turkish as my teenage sons are not very adventurous (chicken wings, chicken fingers, burgers ... eating anything else can be a struggle). So, off we walked to Meze from the Omni Shoreham (a nice 10 minute walk.)\nWe were seated outside...\n\n\nMore"], ["In the mood for Turkish food ... stop here", 4.0, "June 23, 2013", "whollows", "Naples, Florida", 129, 29, "I walked by an decided to check this place out. I did the chef's tasting menu with the wine selection. All the food was very good. The wine menu is a little limited.\nI had excellent service from Emre and Beatrice. They offered lots of suggestions, their service was very attentive and professional."], ["Not Good", 1.0, "March 31, 2013", "Steve S", "New York City, New York", 10, 5, "We were party of 6 with 2 kids. It was an average crowd, however our food came 20 minutes before the kids food. We were basically done with our food while kids were still waiting. One of the my friend wanted to substitute a Shepard salad instead of French fries for an extra charge (2.50) that comes with his food...\n\n\nMore"], ["Great small plate dining!", 4.0, "March 4, 2013", "zoegirltravels", "Great Neck, New York", 27, 15, "My daughter, a GWU student and I wandered in to Meze as we were in the mood for Mediterranean food for dinner. The restaurant itself intimate, with a room upstairs in the back. We decided to order a bunch of appetizers, or small plates. Eggplant dip, hummos, zuchini pancakes and stuffed grape leaves (vegeterian) and turkish bread. The bread could...\n\n\nMore"], ["Meze never disappoints!", 5.0, "March 1, 2013", "BuffyMaryland", "Maryland", 63, 14, "I wish I could dine here more often. I'm working my way through the \"small plates\" menu and have yet to find one that I didn't like. While everything I've had thus far is great, I especially recommend the rack of lamb with mashed potatoes and the scallops. The asparagus with lemon is also very good. My husband couldn’t get...\n\n\nMore"], ["Turkish! Say so.", 4.0, "October 16, 2012", "lorabaum", "Charlottesville, Virginia", 93, 45, "The restaurant promotes itself as sort of Mediterranean, but it is a a small plates/Turkish place with lots of choices for vegetarians and also those who want meat. The food was good, not overwhelming. Large bar, if that's what you want. Very accommodating service. They care that you are there, and pay attention to your meal."], ["Friendly staff , Nice food", 4.0, "September 12, 2012", "Bandook", "Germantown, Maryland", 12, 4, "I've been here a couple times and there's always something left to keep me coming back for more !. The tapa style dishes are a nice way to share the food. Try the apptz sampler with the walnut & chicken dips , the lentil and zuchini pancakes are nice options for the vegetarians ! Meat lovers have a whole load...\n\n\nMore"], ["Food was good, service wasn't as good as it could be", 3.0, "August 28, 2012", "Patricia L", "New York, New York, United States", 28, 13, "I went to Meze with 3 other friends, we were seated immediately at elevated tables right next to the outdoor area. 1) It was awkward as I'm literally less than a foot away from the next table of guests 2) The amount of space between the back of my chair and the table made it very uncomforatble for me to...\n\n\nMore"], ["good tappas", 5.0, "August 21, 2012", "eigram66", "NJ", 39, 12, "we went the first night in DC and it was not a let down ,it was great! some of the best lamb I have had in a long time food was delicious and price was for the two of us 54 dollars that included 3 tappas for me (hummus.lamb cubes and feta cigars) hubby had a main dish with all...\n\n\nMore"], ["delicious Turkish food", 4.0, "July 31, 2012", "Isabel089", "Boston, Massachusetts", 54, 15, "conveniently located near Dupont Circle. An attractively decorated dining room and a menu filled with well-prepared and delicious Turkish appetizers (\"meze\") and main dishes as well. The wine list was extensive, though we had a hard time finding something we liked. The waitperson, however, was patient in letting us try various possibilities."], ["Go if you enjoy getting ripped off", 1.0, "February 26, 2012", "AcousticImmersion", "Washington DC, District of Columbia", 64, 55, "The online menu at this restaurant's website does not matching pricing once you are in your store (Average price difference is +50%). Gloomy empty atmosphere and an average of 3-4 waiters wait on you every second that you eat. Do not honor happy hour promotions that are advertised at the restaurant's entrance. Avoid this placee unless you enjoy getting ripped...\n\n\nMore"], ["Excellent Meze (small plates)", 5.0, "December 11, 2011", "orangerook", "Bethesda, MD", 66, 41, "My family of 3 shared 9 plates (including two desserts). Everything was delicious, and we left full and satisfied."], ["Original food and atmosphere", 4.0, "November 28, 2011", "vbailey2", "Leland, North Carolina", 119, 55, "Dinner at Meze was a surprise to me as we went into the District one evening and had a gift certificate. The food (mostof it serves \"tapas\" style, but of course not Spanish) was quite good. Service was great, and it turned out my husband, during his various travels, had actually been to the hometown of our waiter (who was...\n\n\nMore"], ["Great atmosphere, good service, and mediocre food", 3.0, "October 26, 2011", "des16", "ithaca", 34, 14, "We had sunday brunch. The food was of mixed quality. Some things were quite tasty and well prepared, such as the bruschetta and the potatoes. However, the french toast was at best fair, some of the turkish dishes were quite tasteless, such as the lentil and zucchini dish. The atmosphere was great, and certainly an extremely pleasant place to have...\n\n\nMore"], ["Great out of the ordinary food", 5.0, "May 24, 2011", "AllenDC", "Washington DC, District of Columbia", 92, 59, "I had purchased a $30 voucher for $15 and this is why we tried MezeDC. Really glad we did. The food was excellent. If you aren’t sure what you want, just order the tasting menu. The menu is much more extensive that that listed at its website. The only thing that was second rate was the tomatoes in the Tomato...\n\n\nMore"], ["Absolutely Delicious", 5.0, "April 7, 2011", "Sherry L", "Chicago, Illinois", 7, 2, "While walking down the street looking for a good restaurant, a local directed us to Meze. We couldn't have been more thrilled. Our group of six had never had Turkish Tapas before, and this couldn't have been a better choice. We each picked two items off the menu, ordered the trio of humus w/ bread, a bottle of wine and...\n\n\nMore"], ["Great food, location, and mojitos!", 5.0, "December 29, 2010", "meggy0019", "Washington DC, District of Columbia", 15, 10, "Meze is a wonderful restaurant in the lively Adams Morgan area of DC. It is easily one of my favorite restaurants in DC - the food has always been excellent and the outdoor seating is a huge perk. Go around 8 or 9 on a Friday night and enjoy the liveliness of Adams Morgan. Meze also has an extensive Mojito...\n\n\nMore"], ["Nice restaurant in Adams Morgan", 4.0, "July 26, 2010", "NoVAFamilyof4", "NoVA", 111, 67, "Was meeting family for dinner in Adams Morgan area on a Sunday evening. I was looking for a place that offered variety and would have something my kids would like.\nBased on various restaurant reviews I ran across Meze.\nThe restaurant is a Turkish style tapas restaurant. We tried a variety of dishes and our favorite items include: Sigara Böreği...\n\n\nMore"], ["Good food but do not go hungry!", 4.0, "January 8, 2010", "pinaresk", "Melbourne, FL", 1, 0, "We went to Meze for the first time at the New Year's eve. It was a pricey four course fixed menu that I found out the details before making the reservation. We went there at 9:00 p.m. and weren't very hungry because of our satisfying lunch. Arugula salad, cold appetizers, main courses, and baklava were all very delicious but the...\n\n\nMore"], ["Good meze dishes. Go bold. Try new dishes. They're usually the better choices. Server was so doing the \"I can act stuck...", 3.0, "November 9, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good meze dishes. Go bold. Try new dishes. They're usually the better choices. Server was so doing the \"I can act stuck up cuz I work at a hip place\" thing. Get over it. The place is gonna be less hip in couple of years, and you'll end up back at Applebee's. Lamb kebap was overcooked. Homemade bread is yummy....\n\n\nMore"], ["Great atmosphere and excellent food!!", 5.0, "May 31, 2009", "ArisDC", "Washington, DC", 1, 0, "This little sassy restaurant in Adams Morgan is a perfect place to start a fun evening in DC. The atmosphere is really nice and relaxing, the food is delicious, and the price's are afortable. I would recommend this place to anyone. Just check it out."], ["warm romantic spot in adams morgan for tapas and wine", 4.0, "April 15, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "warm romantic spot in adams morgan for tapas and wine"], ["Mark reminded me of all...", 3.0, "July 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Mark reminded me of all the times we ate at this place even though it's not a regular haunt. Good food and people watching!"], ["Good food with outdoor seating", 4.0, "March 11, 2008", "avrussell", null, 28, 3, "Good food with outdoor seating"], ["Went for brunch one day...", 2.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Went for brunch one day, and the plates are small. It's not hate but it's not really love either. Depends on the person"], ["Their plates are small but very good, plan on 3 each. I have not loved anything on the menu, but the potato shells...", 4.0, "February 7, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Their plates are small but very good, plan on 3 each. I have not loved anything on the menu, but the potato shells, zucchini pancakes and feta cigars are my favorite. The weekends are packed with Mojito-lovers (regular and blackberry are my favorites), but I love Meze on weeknights for intimate dinners or quick bites and for brunch too, as...\n\n\nMore"], ["Better than Taberna", 3.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Better than Taberna"], ["Worth the money...", 5.0, "January 31, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Worth the money..."], ["Turkish Delight!", 5.0, "January 16, 2008", "Traveling3333", "Falls Church, VA", 4, 2, "What a find hidden among the bars and fast food joints along 18th Street along the main strip in Adams Morgan.\nThis Turkish cuisine is scrumptious. Fare ranges from seasoned pork chops to stuffed grape leaves.\nFor those vegetarians or vegans, there are ample selections.\nThe miniature portions and elegant presentations are typical of a high end restaurant downtown or...\n\n\nMore"], ["Very flavorful Turkish food and great atmosphere in crowded Adams Morgan.", 5.0, "January 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Very flavorful Turkish food and great atmosphere in crowded Adams Morgan."], ["haven't actually eaten here but they hosted a fair trade chocolate cocktail happy hour", 4.0, "January 7, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "haven't actually eaten here but they hosted a fair trade chocolate cocktail happy hour"], ["Most notable for incorporating real-deal Turkish food with the sort of fare Americans have come to expect from a Middle...", 3.0, "December 20, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Most notable for incorporating real-deal Turkish food with the sort of fare Americans have come to expect from a Middle Eastern restaurant."], ["not a bad brunch", 3.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "not a bad brunch"], ["fun bar", 4.0, "December 10, 2007", "Alvcpa", "Fairfax, Virginia", 48, 5, "fun bar"], ["bring friends!", 1.0, "November 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "bring friends!"], ["Decent meze, not crowded...", 3.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Decent meze, not crowded on weekends."], ["Hurrah for Turkish Tapas!", 5.0, "July 18, 2007", "DCMenina", "Washington DC, District of Columbia", 8, 9, "I love Meze - it is one of my favorite restaurants in the whole city. Have never tried the big plates, but the tapas are truly DIVINE. Get the Turkish cigars (creamy cheese inside fried cigar style pastry), the chicken meatballs, the red lentil patties with yogurt sauce. Yum. They also have Turkish coffee and the baklava there must be...\n\n\nMore"], ["Excellent Brunch", 5.0, "May 20, 2007", "dcfoodnut", "Washington, DC", 1, 0, "Brunch here is the best I've found in Adams Morgan, so far (that 7 restaurants and counting!)\nThe French toast is divine - served with lots of fresh fruit, even in the dead of winter. Turkish appetizer items on the menu are wonderful, ranging from sweet to savory. For coffee, go with espresso drinks, because their American coffee can be...\n\n\nMore"]]], ["Bourbon", [["Just okay", 3.0, "September 1, 2015", "myishap", null, 35, 8, "There is nothing special about this place. Food is average. Service mediocre. Some bright spots are the beer, wine, and being able to sit outside."], ["Exceptional Bourbon, Salmon, and Quesadilla While Watching NFL Draft", 5.0, "April 30, 2015", "FJV2", "Lenox, Massachusetts", 11, 4, "Caught a seat at the bar with my son to watch the NFL draft. Greeted by Mike, the bartender, and he helped me select a wonderful bourbon for a Manhattan that fit my budget. We had wings with their homemade buffalo sauce followed by their salmon entree and their chicken quesadilla with fresh jalapeños. Everything was to perfection at a...\n\n\nMore"], ["Best spot in Glover Park (and DC), without question!", 5.0, "October 3, 2014", "Ryan S", null, 1, 0, "This is the best bar in the neighborhood if not the city. The bartenders are absolutely the best in DC. Nam, Rachel, Mike and the entire crew have never let me down. They are all beyond knowledgeable with their whiskeys, cocktails, beers, etc. Not to mention they are absolutely fantastic people. Do not hesitate to kick it here for a...\n\n\nMore"], ["Fun Night...", 5.0, "April 7, 2014", "Beverley T", "Toronto, Canada", 139, 45, "This is a young person's bar, but when one lands at 10pm and is hungry, Bourbon will do. Turns out it did better than just 'do'. Tried some local beer and of course a 'bourbon burger'. This is also very local and we ended up sharing our table with two others and stayed up for at least another beer before...\n\n\nMore"], ["If you love Bourbon, this is THE place!", 5.0, "July 7, 2013", "Destindreamn", "Virginia", 35, 23, "Recently visited Bourbon for the first time with friends. Found the GM Jared to be very knowledgeable and personable. He took the time to find out our interests and did an excellent job with recommendations. Selections available are to be envied, many items you'll never see again. Was an added plus to be able to enjoy our cigars on the...\n\n\nMore"], ["Bourbon Lover's Must Go", 5.0, "July 3, 2013", "DrivingHazard", "Monroe, Virginia", 26, 20, "Being Bourbon lovers, we made a little detour to this place after a wonderful O's win over the Yanks. What a cool place. Jared, the General Manager, was so good to us. He knew his bourbon's and made recommendations based on what we typically drank. We had some bourbons that we will never see again. The food, although delicious, was...\n\n\nMore"], ["Always a good time", 4.0, "January 24, 2013", "Zotmeister", "Fairfax, Virginia", 35, 21, "This place is at one end of Adams Morgan (furthest from the Woodley Park Metro stop). Great atmosphere to hang out with friends and have a drink. There fries are excellent, especially on a cold night when you are hungry. Also been here, but upstairs, at an event. It had a great vibe and the service was very good. Worth...\n\n\nMore"], ["Not Your Typical Steak House", 4.0, "November 30, 2012", "Chris T", "Washington DC, District of Columbia", 386, 119, "- The Setting. More like a Bobby Vans than a Ruth's Chris, except even noisier. Set in the back of the lobby of the Four Seasons Hotel in Georgetown, Bourbon Steak has a lively bar and an overall excellent vibe. As one would expect, there were lots of men in their 50s ogling women in their 20s, a couple guys...\n\n\nMore"], ["Great atmosphere!", 5.0, "July 31, 2012", "Laurie L", null, 18, 3, "A great venue to enjoy a delicious steak and good company. The food was excellent, service was excellent. My only complaint was that it was a bit noisy, which made it hard to hear the conversation with my dinner companions."], ["Great Place", 5.0, "January 25, 2012", "LittleMiss99", "Creal Springs, Illinois", 89, 25, "This is a great place to drink & eat. Happy hour also on Wednesday. Food is very good.\nWould eat there again"], ["The GREAT bartenders pushed this to a '5' rating!", 5.0, "January 19, 2012", "WX-Lobo", "Reston, Virginia", 52, 27, "Hey - I love whiskey and bourbon is GOOD, but Bourbon was a GREAT experience. The food was fun, the alcohol selection really nice, but what pushed the experience over the top were the suggestions of the bartenders. We had the chili (GREAT w/ the bread they served) and bourbon chicken burger (with Old Bay waffle fries). . . a...\n\n\nMore"], ["great place to hang out", 5.0, "August 1, 2011", "ceesiren09", "Virginia Beach", 10, 2, "I chose Bourbon to celebrate a birthday. loved the bartenders loved the decor loved the mac and cheese we had a great time music was good too and the staff was cool it did get crowded (its in adams morgan and it was a friday night) but had a great time. We will hang out there next time we are...\n\n\nMore"], ["Sublime Waffle Fries", 4.0, "November 1, 2010", "B G", "Washington, DC", 74, 32, "And very good burgers - best in this part of DC."], ["I didn't notice food, but fun for drinks. Yes, they have lots of bourbon. Fun scene.", 4.0, "November 9, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I didn't notice food, but fun for drinks. Yes, they have lots of bourbon. Fun scene."], ["Fantastic Evening", 5.0, "July 27, 2008", "travelingmomOhio", "Ohio", 19, 18, "There were four serious bourbon drinkers in our group so how could we resist trying this place. It was wonderful--at first appearance it didn't appear to be much to write home about--we got there about 6:45 on a week night and there was a very small crowd. Our waitress suggested that we sit at the bar and \"engage\" with the...\n\n\nMore"], ["Great place to eat and hang with friends", 4.0, "July 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great place to eat and hang with friends"], ["Mmm. Grilled cheese.", 4.0, "June 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Mmm. Grilled cheese."], ["Best veggie burger I've...", 5.0, "June 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best veggie burger I've ever had!"], ["BLT & tater tots... mac...", 5.0, "May 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "BLT & tater tots... mac n cheese... mmm..."], ["my ultimate favorite neighborhood bar", 5.0, "April 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "my ultimate favorite neighborhood bar"], ["Nice for afterwork drink, and the bread pudding is amazing!", 3.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice for afterwork drink, and the bread pudding is amazing!"], ["Good bar in Adams Morgan. Food is okay, too.", 4.0, "January 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good bar in Adams Morgan. Food is okay, too."], ["Tons of bourbons and whiskey's to try. I like the Jefferson (otherwise very hard to find) Go HOOs! I havent yet had...", 4.0, "January 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Tons of bourbons and whiskey's to try. I like the Jefferson (otherwise very hard to find) Go HOOs! I havent yet had the food"], ["Great serving sizes, mildly expensive drinks.", 4.0, "January 7, 2008", "JoahS", null, 11, 0, "Great serving sizes, mildly expensive drinks."], ["If you're a bourbon lover this is a fun place.", 4.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "If you're a bourbon lover this is a fun place."], ["for beverages...not as crazy as the one in adams morgan. tasty tots and grilled cheese.", 5.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "for beverages...not as crazy as the one in adams morgan. tasty tots and grilled cheese."], ["I like the baked beans", 3.0, "December 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I like the baked beans"], ["lovely grilled cheese and tomato soup", 2.0, "December 21, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "lovely grilled cheese and tomato soup"], ["good drink selection", 4.0, "December 12, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good drink selection"], ["Nice neighborhood joint.", 2.0, "December 1, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice neighborhood joint."], ["Trendy; great burgers", 3.0, "November 30, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Trendy; great burgers"]]], ["Stone's Throw Restaurant & Bar", [["Great option for in hotel dining", 4.0, "October 14, 2015", "wisgirl01", "Wisconsin", 310, 92, "I had lunch and breakfast here with clients and both were excellent. The crab eggs benedict dish was amazing, as was the crab soup. Service was excellent and very friendly."], ["Just another restaurant", 4.0, "September 7, 2015", "Bharat P", "Newark, Delaware", 41, 12, "We ate breakfast during our stay of 2 days.\nThe buffet was well laid but not extensive enough for a 1200 room DC Marriot.\nBreads were ok and vegetarian options quite limited. Omletts were very good.\nService normal. I am not impressed."], ["Just OK", 3.0, "August 31, 2015", "nanski3", "granbury, tx", 53, 43, "We only ate here for breakfast. Service was good, and for the most part, the food was good. One morning my husband had Eggs Benedict & was not impressed."], ["Great place to meet old friends", 4.0, "August 30, 2015", "RSpicer", "Gastonia", 187, 59, "Great bartenders. Very attentive.\nHad a reunion with a bunch of old friends there and had a great time at the bar."], ["Expensive but Nice", 4.0, "August 3, 2015", "Newlovenewlife2012", null, 346, 70, "I sat down here because the lobby seating was pretty full. The little sections where you can sit are comfortable and a little private. After a while I decided to order something. It took about half an hour to get someone's attention, which was fine because I wasn't in a hurry. If you're there to get a beverage or snack...\n\n\nMore"], ["Not bad", 3.0, "August 1, 2015", "Jack O", "Helena, Montana", 46, 16, "Had breakfast there during some meetings I was attending. The food was good, and it was served quickly. The breakfast buffet was pretty expansive even though I didn't have it. It was a little too costly. The service was pretty good."], ["Sufficient for a hotel restaurant", 4.0, "July 31, 2015", "BodogArizona", "Arizona", 54, 34, "Grabbed a quick lunch here during a conference at the hotel. The service was a little slow to start but once our order was placed, we were golden. The salad, pizza, and sandwiches our table ordered were fresh, tasty, and satisfying.\nI wouldn't go out of my way to go to this restaurant but it is an acceptable option if...\n\n\nMore"], ["Pretty good breakfast buffet", 4.0, "July 18, 2015", "JoeyTheVeal", "Sewell, New Jersey", 5, 2, "Nothing was overly special or delicious but, if you are staying at the Marriott, this is good option for a breakfast buffet. Lots of choices - pancakes, waffles and omelets made to order."], ["Pricey for what you get, but great staff.", 3.0, "July 16, 2015", "870kipl", "Chicago, Illinois", 9, 0, "I understand they have a captive crowd, but the food was a bit overpriced for what you get. The staff, however, was very attentive and friendly."], ["OK for a hotel restaurant", 3.0, "July 9, 2015", "Fred S", "West Bloomfield", 105, 27, "Just wasn't overwhelmed with the food. The vegetable foccacia sandwich was good enough, but no real wow factor. And the prices are typical of a hotel restaurant - more expensive than at a regular restaurant. Convenient for someone staying at the hotel or at a conference there."], ["Great for business", 4.0, "July 6, 2015", "BostonKate83", null, 7, 17, "Fast service, charge to room to avoid change/awkward bill moment, good variety on menu for \"business\" hotel. Salads are great."], ["Rainy day dinner", 4.0, "July 1, 2015", "Hyden1", "Cockeysville, Maryland", 11, 2, "Service was quick and personal. The staff was wonderful to work with. Very accommodating. The menu is limited but still nice"], ["Don't bother", 2.0, "May 27, 2015", "John T", "Denver, Colorado", 141, 52, "Had lunch here during a business meeting. Service was slow and inattentive, food was uninspired. Lots of much better options down the street in the neighborhood."], ["Great food!", 4.0, "May 19, 2015", "Jamie D", null, 71, 7, "Really good food for a hotel restaurant. It's a little pricey, breakfast for 2 was around $42. They have a breakfast buffet that runs around $22."], ["nice but not inspiring", 3.0, "April 28, 2015", "1111first", "Chicago, Illinois", 109, 30, "good setting to meet with friends and business associates at the end of the day or while gathering to head out. the menu could have been broader and the service quicker"], ["It's okay", 3.0, "April 20, 2015", "Renee R", "Dallas, Texas", 109, 23, "I was tired and didn't want to leave in the snow. They had malt vinegar and hot fries, so it was fine."], ["A little better than average breakfast buffet", 4.0, "April 2, 2015", "Jolanda D", "Jacksonville, North Carolina", 127, 48, "There was a omelette station was just about any thing you could want in your omelette, other than that the breakfast buffet was on par with every other large hotel breakfast buffet I have ever had."], ["Just don't...", 1.0, "March 26, 2015", "Gina P", "Yakima, Washington", 9, 1, "The service is slow and surly. The prices are high for people on a tight per diem. Find somewhere else to have breakfast."], ["Delicious Food but Slow Service", 4.0, "March 20, 2015", "Dedi S", "Portland, Oregon", 95, 44, "Attending a conference in DC allows little time to enjoy a slow meal. Stone's Throw is located in the Marriott and is bright, spacious and welcoming. Food is beautifully presented and deliciously prepared. The staff, while kind and friendly, may be a bit stretched for time. On both occasions our service was quite slow. Might be good to mention to...\n\n\nMore"], ["On a breakfast note", 5.0, "February 28, 2015", "Sunshine4RL", "Houma, LA", 30, 7, "I thoroughly enjoyed this location for breakfast, but did not find much of interest on the lunch and dinner menu.\nIf you are a breakfast eater, best breakfast you can have in the hotel."], ["Azeb Hagos....best waitstaff we've had", 5.0, "February 27, 2015", "k k", "Burlington, Vermont", 3, 2, "I've eaten several times during my conference at this hotel restaurant. The food (e.g. steak salad, burger, veggie salad) were all very good. But Azeb made the meals great. I found her quite pleasant and fast. The restaurant at lunch today was busy and she handled it with great speed and charm. Look for her, she'll take care of you!!!"], ["Just what I needed to fuel up for my conference.", 5.0, "February 26, 2015", "Tayloredfit", null, 17, 3, "When you are 'stuck' at the conference hotel (although it is difficult to feel stuck when housed at a wonderful property like the Wardman Marriot) it is fantastic fo be able to count on the hotel restaurant.\nPacking lunch to go, preparing breakfast after I called from the room so it was read when I arrived and smiling all the...\n\n\nMore"], ["Stay away", 1.0, "February 17, 2015", "LeeAnn1641", "New York", 74, 29, "This might possibly be the worst place I have ever been to- I can't believe it's in a marriott hotel. Went to this restaurant at 9:30 on a Monday night with a party of ten. It was empty- we waited ten minutes for them to put a table together. We placed a drink order and even my ten year old...\n\n\nMore"], ["Amazing Breakfast/Brunch Buffet!", 4.0, "January 27, 2015", "SilverStar512", "New York City, New York", 15, 1, "I dined here during a business conference with my team at the Wardman Park Marriott. We had an amazing brunch buffet which cost about $30. I loved the selection they had for their buffet. I loved the assortment of fresh fruit, the oatmeal, bread pudding (it was to die for!), bacon, make your own omelette station (select your toppings &...\n\n\nMore"], ["Just not quality.", 2.0, "October 18, 2014", "Greg799", "Toronto", 173, 103, "If you are staying at the Marriott, try someplace else. The food quality is poor. Service is slow. The decor is okay but the fact is that they could do much better. Not worth a visit."], ["Salad and Pizza were good.", 3.0, "October 18, 2014", "Dennis T", "Greenfield, Indiana, United States", 16, 8, "Had a wedge salad for lunch and thought it was really good. Went back for dinner and had a pizza and it was pretty good as well. There are cheaper options down the street, but if you are looking for something in the hotel, there are some good options here."], ["Breakfast on the go", 4.0, "October 16, 2014", "Jennifer G", "Charlotte, North Carolina", 112, 28, "They were very quick and the buffet breakfast was perfect. The fresh omelets were right up my alley and you could get a fresh waffle or a 1/4 of a waffle - your choice. service was quick and very polite."], ["Great Cocktails and wonderful staff!", 5.0, "October 7, 2014", "Gabrielle71", "Havelock, North Carolina", 77, 35, "We had cocktails here both nights of our stay. Sayeed was a wonderful bartender and had us up way past our 'bedtime' talking and enjoying drinks. I'd go back to this bar just to say hello. My husband and I both really enjoyed his company and the ambiance of the bar."], ["Nice Place, Big Hotel", 4.0, "September 15, 2014", "Laura B", "North Fort Myers, Florida, United States", 10, 3, "The Stone's Throw has a typical menu and the food is very good. The hotel itself is large and the guests come in big packs, very noisy."], ["Lots of staff with direction issues", 4.0, "September 6, 2014", "lollipop3694", null, 47, 11, "The large beautiful layout challenges staff competence. ..waiting and distracted! Tuan our server was quite distracted took our order and couldn't remember who got what at delivery. Our sandwich e's had too much roll, sides of sweet fries and fruit were delicious."], ["Fine hotel restaurant", 3.0, "August 30, 2014", "too_few_trips_1", "Irvine, CA", 479, 254, "Our food was fine, though not particularly memorable. The menu was limited for breakfast; I suspect that they want you to order the buffet. Service was sort of slow, perhaps because the restaurant was quite crowded."], ["Great food for a hotel restaurant", 5.0, "August 25, 2014", "michaeljones46", "Oklahoma City", 95, 116, "Very good food, i usually do not find hotel restaurants to be good, but was pleasantly surprised. Also surprised it was somewhat quiet even though it was open to the lobby areas. Food prices were comparable to the local restaurants down the street, and service was quite good as well. Ended up eating there twice."], ["Best breakfast buffet anywhere!", 5.0, "August 3, 2014", "swcrowder", "Raleigh, North Carolina", 118, 66, "I visited Stones Throw for breakfast while staying at the Marriott Wardman. Food was amazing on the breakfast buffet, and the service was equally great. Buffet price was $25 (a bit high), but food was exceptional."], ["Typical hotel restaurant", 3.0, "May 29, 2014", "Brendan G", "Missouri City, Texas", 86, 49, "The food was good, although a bit expensive. Service was very good. The restaurant appeared to be rarely busy."], ["Fine breakfast", 4.0, "May 28, 2014", "LauraAHA", null, 99, 30, "We chose to order from the menu instead of cruising the buffet. Although we were encouraged to try the buffet and told it would cost the same, we ended up saving a little by ordering exactly what we wanted - egg white frittatas with tomato salsa, onions, spinach, and mushrooms. With orange juice and coffee, we were able to relax...\n\n\nMore"], ["Great Breakfast", 5.0, "May 14, 2014", "NYGirl13", "New York City", 13, 3, "They have a seafood omelet that is delicious!! There is also a choice of doing the buffet. You can't go wrong with either ordering or serving yourself."], ["Convenient location in the hotel.", 4.0, "April 21, 2014", "Barb J", "Maple Ridge, Canada", 166, 38, "The menu was a bit pricey, the buffet looked good but I stuck with the bagel and cream cheese with jam which was a good deal at only $3.50 if you prefer a smaller start to your day. Service was quick and friendly."], ["Good Service", 3.0, "April 20, 2014", "Margc_11", "Ontario", 34, 11, "Good breakfast, great toast! A bit pricey $36.00 for two. Great decor and wait service. Would go here again."], ["Worked for us since the weather was bad", 3.0, "April 17, 2014", "Lana P", "KANSAS", 34, 36, "We ate breakfast here twice. Service was so so and the food was fine. We ordered off the menu. It was pricy but in line with other convention hotels. If you do not have a car, and the weather is bad, you will be fine at this restaurant."], ["Cockroaches", 1.0, "April 2, 2014", "kellyo1126", "Denver, Colorado", 32, 20, "Cockroaches. Yes, three of them under my table. Crawling around under my feet. Cockroaches. Being not from the east coast I wasn't 100% sure, so I Googled them on my phone right then and there. Sure enough. Food was neither good nor bad. Hamburger was a bit burnt. Vegetable pizza was mediocre. Iced tea is $4. Overall, I'd say if...\n\n\nMore"], ["Overpriced", 2.0, "March 29, 2014", "Chacha562013", "Boston, Massachusetts", 50, 17, "Overall poor service, average food and and overpriced. Got 2 six ounce bottles of water for $. 2.75 at the bar, and a 20 ounce bottle of water for $2.99."], ["good variety", 4.0, "February 26, 2014", "joymey", "Manalapan, New Jersey", 3, 0, "had Sunday brunch. good variety. omelets made to order. they even had bagels and lox (smoked salmon), fresh fruit, etc. something for everyone"], ["Breakfast Buffet is good", 5.0, "January 16, 2014", "BScopatz", "Minneapolis, Minnesota", 20, 6, "Pricey, but not out of line for the area. Overall, I'd say it's a good value. The omelet station keeps improving. The selections of fresh fruit are also very welcome. The coffee is good here!"], ["Great for Breakfast and Lunch", 5.0, "January 13, 2014", "Munrovius", "Westfield, Massachusetts", 56, 33, "We usually avoid restaurants in our hotels (this one is in the Marriott Wardman Park) because of the price, but with bad weather outside, we had lunch here once and breakfast twice. All were excellent. It is indeed a bit pricey as expected, but the crabcake sandwich was excellent and the breakfast omelettes were outstanding. Also offers a breakfast buffet....\n\n\nMore"], ["Standard restaurant inside large hotel", 3.0, "December 27, 2013", "Traveler44Chicago", "Chicago", 38, 17, "This is inside the Marriott at Wardman Park. I normally prefer not to eat at the hotel where I am staying, but given the bad weather, we had breakfast here one day (OK, but overpriced) and brunch once--quite decent."], ["Yum", 4.0, "December 2, 2013", "DrColby", "USA", 12, 8, "I had a business-meeting breakfast at the Stone's Throw during a conference at the Marriott Wardman Park. The service was good given the size of our group, and I appreciated their patience with us. My dish was tasty."], ["Good Lunch", 4.0, "October 27, 2013", "CTManny", "Ridgefield, Connecticut", 498, 134, "Lunched here. Food was quite good. A little expensive, but not surprising for a restaurant in a very large Marriott. Menu included local dishes and the usual pub type dishes."], ["A quality breakfast at a Marriot", 4.0, "October 27, 2013", "Phillysub", "Hatfield, Pennsylvania", 52, 13, "Enjoyed the breakfast selections. Choose between a freshly-made or buffet breakfast. Speaking of \"freshly squeezed\"...the OJ was."], ["excellant food", 5.0, "October 12, 2013", "micstebou", "Fargo, North Dakota", 207, 43, "Lunch soups and salads are large, creative, and as good as we have had anywhere. The breakfast buffet is extensive."], ["Not worth the money", 2.0, "October 10, 2013", "Travelchicntx", "Tx", 26, 10, "Took forever to get the food and then it was cold and tasted horrible. Then the cost for a meal was crazy. I would not eat here again."], ["Good service, good food", 5.0, "September 15, 2013", "ExplorerTW", "Baltimore", 8, 6, "My family was tired after a long car ride and just wanted a quick meal without leaving our hotel. I was unsure at first because the prices seemed a bit high but I'm glad we stayed. Service was fast and our server was very nice. Portions were quite large and food was very good. It was nice to find an...\n\n\nMore"], ["Best Breakfast Buffet Around!", 5.0, "August 26, 2013", "cgemme", "Millbury, Massachusetts", 38, 14, "It's a little pricey, at $23 a person, but the food choices are great, loads of fruits and yogurts, omlets made to order, all kinds of cereals and breads. You will not leave hungry!"], ["Food, service, value? Ugh, terrible on all counts!", 1.0, "July 30, 2013", "KathleenNuccio", "Grand Rapids, Minnesota", 41, 14, "We are accustomed and happy to pay for good food, particularly seafood when we are near either coast. So we were thrilled to see crab cakes and scallops on the appetizer menu, choices that matched our desire for \"something and a house salad,\" before going off to a meeting.\nWhen the waitress was soooo unfriendly and didn't start off by...\n\n\nMore"], ["Good Hotel Restaurant", 4.0, "July 28, 2013", "Sail2Maine", "Falmouth, Maine", 90, 20, "A bit expensive for breakfast but not bad for dinner. It is hard to get by with an inexpensive breakfast. I skipped the buffet and ordered French toast which was very good. But if you are in a rush the buffet will be quicker due to slow service. The service at dinner was much better. I ordered a seafood risotto...\n\n\nMore"], ["Great Breakfast Buffet", 4.0, "July 11, 2013", "Deborah I", "Bridgeton, New Jersey", 48, 14, "Stone's Throw Restaurant has a very good, but pricey, breakfast buffet. Very extensive in it's choices, it ranges from fruits, to fresh made omelets and waffles."], ["Great food and staff", 4.0, "July 7, 2013", "LPAMIKE", "Jonesboro", 195, 38, "Great food and staff but kind of pricey. $16 for a burger and fries and another $4 for a soda. Handicap accessible but different entrances for different meals."], ["Good atmosphere", 5.0, "June 18, 2013", "charellen", "Virginia", 29, 34, "At night when the sun does not shine through the sky light, the blue lights of the bar are lovely. The couches are arranged to give privacy, and warmth. Drinks were good, the staff was efficient."], ["Typical hotel restaurant", 3.0, "May 5, 2013", "Jandy49", "Toronto", 30, 9, "The review title says it all. Breakfast egg white omelette was excellent. Caesar salad with grilled shrimp at lunch was mediocre - a pile of romaine with a commercial dressing and some unremarkable grilled shrimp. Fruit bowl was under-ripe melon slices and strawberries, some grapes."], ["Looks like a diner...", 3.0, "April 12, 2013", "LIGrammy", "Long Island, New York", 76, 61, "priced like an upscale restaurant. I don't mind expensive restaurants (I'm from NY and used to it) but not here. Service was OK."], ["Nice breakfast buffet.", 4.0, "April 3, 2013", "coosbaygal", "Upland, ca", 131, 43, "It does have some good choices but high priced, they will accomodate you very well for a price. The chocies for lunch or dinner are limited."], ["Good breakfast", 4.0, "March 27, 2013", "beachbreeze66", "Colorado", 378, 150, "I ate here for breakfast. I ordered an omlete which came out wrong. In the future, I would do the breakfast buffet. The service was good and the food was good (my omlete was corrected quickly)."], ["Great Food", 5.0, "February 21, 2013", "lag1009", "Long Island, New York", 36, 34, "Breakfast in Stone's Throw was a buffet or the menu - all the food looked fresh and yummy! The staff was accommodating!"], ["Great breakfast buffet but pricey", 5.0, "February 17, 2013", "Rod_CFP", "Kansas City, Missouri", 100, 35, "Always use the breakfast buffet because there are great choices either on the cold side or the full buffet. Around $21 plus tip for the full breakfast buffet with eggs cooked to order. The staff are willing to take special requests, just ask. Is a good quick way to get in and out."], ["The best food I have in a Marriott", 5.0, "February 16, 2013", "dMoniqueRenee", "Orlando, Florida", 383, 110, "Nestled in the Wardman Marriott as a guest I ate here at the Stone Throw. The service was excellent and the food was delicious. I had the lamb shank which was so good. The meat fell off the bone and I ate every carnivorousness bit and savored the tendernous. So much so I only took one forkful of mash potatoes...\n\n\nMore"], ["Quiet and well located", 4.0, "January 27, 2013", "halg16", "Newtown Square, PA", 121, 43, "I ate there because I was staying at the hotel alone and it was too cold to go out. I was surprised that there were few tables occupied. Nevertheless, I enjoyed ihis restaurant. The food was well prepared. I ordered the chef's special and he came out to get my opinion of it. I felt that it was well prepared...\n\n\nMore"], ["Expensive for what you get-", 3.0, "January 16, 2013", "Kaden_ID", "Troy", 9, 4, "good food, but way overpriced. Service was very professional however. Great crab sandwich. Location in the Marriott lobby convenient if you are staying there or at the Shoreham"], ["Good hotel restaurant; a bit pricey", 3.0, "January 4, 2013", "golfnut_ping", "Bellflower, Illinois", 6, 2, "The food was good - especially the breakfast buffet - but you pay a premium for it. Limited options but the staff are very nice and willing to accommodate requests."], ["Nice place for breakfast", 5.0, "November 16, 2012", "angelynx", "North Bethesda, Maryland", 12, 4, "We had the breakfast buffet here on a Saturday and Sunday morning and liked it very much. Great selection including granola and muffins made in-house and made-to-order omelets. Toast, cereal, yogurt with lots of available toppings (including blackberries and raspberries!), two kinds of sausage (the maple chicken was really good), scrambled eggs which were nice and creamy, and a lot...\n\n\nMore"], ["Good food, okay service", 4.0, "November 9, 2012", "solo_Anglophile", "Massachusetts", 28, 22, "I had lunch here one day and drinks another. Service at lunch was great, and the food was tasty. The service at the bar the next day, however, was slow and not very focused."], ["Great Breakfast!", 5.0, "November 7, 2012", "mas0509", "North Stonington, Connecticut", 125, 53, "Excellent choices at the breakfast buffet including omelettes, fresh fruits, yogurt, pancakes, waffles, fresh breads, pastries, fresh juices, cereals. Fantastic service and a great way to start your day."], ["Large breakfast buffet", 5.0, "November 7, 2012", "JEFFYG10", "Scranton, Pennsylvania", 213, 80, "Stayed for a Conference. Had a small business dinner in one of the private rooms. It was seperated from other areas by partial glass dividers, so noise level from outside the room was a big distraction (we had to speak loudly to each other to be heard). The entrees were all delicious with beautiful presentation. The chef came to the...\n\n\nMore"], ["Breakfast buffet", 5.0, "November 4, 2012", "Todd S", "North Stonington, Connecticut", 90, 23, "The buffet had everything. Fresh juice, omletts,waffles,pancakes. There was even fresh fruits that could be combined with yogurt. You will walk out stuffed. They serve till 11:00 am"], ["Awesome breakfast!", 5.0, "October 26, 2012", "Susan G", "Minneapolis, Minnesota", 32, 12, "LOVED that I could get gluten free pancakes made-to-order and the omelette bar was awesome. EXCELLENT food and the service was wonderful! They had so many options there and everything was just great."], ["Decent hotel fare - well priced and huge portions.", 3.0, "October 11, 2012", "DGB047", "Toronto, Canada", 35, 13, "An average type restaurant/bar with good standard food, very large portions and well priced. I spent much of my week at the hotel in eating here."], ["Great Food, Reasonably Priced", 5.0, "September 23, 2012", "Mainers", "Mainer", 105, 134, "We ate twice in the bar for lunch. Veggie sandwich, cobb salad, and veggie ravioli were all excellent and surprisingly reasonably priced. Bartender was great too!"], ["decent but expensive", 3.0, "August 20, 2012", "perogiman", "Delaware", 40, 24, "burger was $15 and salad was expensive. we ended up sharing and taking the food back to the room. the menu is limited"], ["Great lunch, service was slow", 4.0, "August 17, 2012", "ronnie20", "Denver", 103, 45, "Was here during a convention, stopped in for the seared tuna salad. It was wonderful. The service was friendly, but slow."], ["had breakfast for 3 days there", 3.0, "August 16, 2012", "Mgchoksi", "Ahmedabad", 42, 24, "same menu no change! not many options for vegies and not very good service. But whatever the food was, it was good."], ["Coffee, anyone?", 4.0, "August 13, 2012", "jksimmons_12", "Fort Lauderdale, Florida", 3, 0, "Enjoyed the small yet quaint coffee house, which served great whole wheat pancakes! Had to get the carb rush to take in all the sites-and singing:)"], ["Okay food, slow service", 3.0, "August 4, 2012", "TerriM", "San Diego, California", 23, 25, "Had lunch here on our way out. Wait staff nice but slow. Had a hard time getting the bill and then paying the bill."], ["Good experience", 5.0, "July 23, 2012", "roselover440", "Glastonbury, Ct", 10, 9, "Wonderful staff and the breakfasts were delicious."], ["A great quick lunch!", 4.0, "July 9, 2012", "mtswilson", "Frederick, Maryland", 57, 20, "I had just checked into the Marriott Wardman Park and need to get to a meeting in 40 minutes. Decided to try the hotel restaurant. The hostess sat me right away and called the waiter. I made a quick choice of the burger with a fruit salad. The iced tea was fresh and tasty. My lunch came with delicious coleslaw...\n\n\nMore"], ["Great food. Not as expensive as listed on Trip Advisor. Can get great food for $12.", 5.0, "June 28, 2012", "SLily11", "Silver City, New Mexico", 160, 68, "Great food, open late, wonderful place to eat right in hotel."], ["Average food, better options", 2.0, "June 28, 2012", "fuzzykiwi48", "Arlington Heights, Illinois", 71, 26, "The food here is just average. They dropped a soup I liked and some pizzas from the menu, going a little upscale. But it's pretty expensive, even with opentable.com helping with points. Go across the street to one of the many ethnic restaurants for a much tastier and cheaper meal."], ["surprisingly good for a hotel restaurant", 4.0, "June 26, 2012", "steff0566", "international", 175, 159, "The appetizers are small but very tasty and the daily specials are excellent....you can even order from the restaurant into the bar in the lobby lounge."], ["Not bad....for a hotel restaurant", 3.0, "June 24, 2012", "JoyceInDC", "Washington DC, District of Columbia", 196, 54, "Food quality was good (to be expected). For me, the difference was in the wait staff. \"Amina\" was GREAT!! In a hurry during a conference, stopped in to have a portabella mushroom sandwich. Days later, had a chicken caesar salad....although, I had to ask TWICE for the chicken (to be added to the salad that had already been served). Small...\n\n\nMore"], ["Just average place to eat.", 3.0, "May 29, 2012", "mrsbootc", "Springfield, Oregon", 59, 22, "Came in for a conference. We had breakfast and dinner here more than we should have. But because we were trying to get adjusted to the time change our schedule was off. This restaurant has all their meals way over priced. The food was just average. We would have been better off standing in line for \"illy's\" which is their...\n\n\nMore"], ["Great breakfast buffet, lunch was good but not special, service is good", 4.0, "April 20, 2012", "David C", "Sacramento, California", 18, 9, "Relatively limited menu for lunch but it's acceptable for a basic lunch"], ["just okay", 3.0, "March 29, 2012", "lcshea", "Ogdensburg, New York", 107, 31, "Ate here for both breakfast and dinner. The food was okay but the menu selection wasn't that varied."], ["Great food ruined by terrible service", 2.0, "February 24, 2012", "SactoC70Driver", "West Sacramento", 27, 9, "The chef does excellent work. Unfortunately, we had entrees delivered before starters and when we insisted on the right order, they brought out the original plates-cold sweet potato fries and crabcake, raviolis with sauce congealing around the edges. Out of 3 times (sometimes you are trapped in a conference hotel) they managed to get our food to us as intended...\n\n\nMore"], ["In the Marriott Wardman Hotel", 1.0, "February 22, 2012", "TripTakerSandra", "Austin, TX", 40, 17, "We had one meal in which we had horrible service, the waiter grazed my breast, twice with the back of his hand while placing and removing plates."], ["Good but not Great for the Price.", 4.0, "February 18, 2012", "DrVicProf", "Leander", 17, 9, "I ate at this Restaurant four times over four days - once for breakfast buffet, twice for lunch and once for dinner. The menu is fine with plenty of selection. Service was o.k., we had one night where the service was awful, but for the most part it was fine. Prices are HIGH - especially the $21 breakfast buffet, but...\n\n\nMore"], ["Nice for a hotel restaurant", 3.0, "February 12, 2012", "travelwife82", "Ohio", 40, 29, "I had dinner and lunch here during a conference. Because of the competing conference dinner, it was a delightful experience to dine there at night. However, my lunch experience was terrible due to the quantity of conference attendees deciding to eat at the same time, though it was late (2 p.m.) for lunch.\nThe food for both dinner and lunch...\n\n\nMore"], ["very good food and service", 5.0, "January 27, 2012", "52Overtherainbow", "Boston, Massachusetts", 93, 46, "The food was consistently good. The serve was excellent. I ate three time there."], ["Great pizza", 4.0, "January 14, 2012", "pronoah1", "Tuscaloosa, AL", 42, 14, "I had the meat lovers pizza. The day before I saw someone get the pizza and a salad, and I knew I could not eat both. I hardly could eat the entire pizza. Very tasty, and plenty of food. Could feed two if they each had an appetizer, or a filling lunch for one."], ["So-so food and service", 3.0, "January 8, 2012", "withkidstravel", "New York City, New York", 356, 186, "The restaurant is in a busy hotel (the huge Marriott off of Connecticut Avenue) and it has service issues, with food coming out in dribs and drabs, forgetful and seemingly new servers at peak times, and a basic menu. It is attractive and modern, with a view of the main lobby. The lunch servers did not appear to know the...\n\n\nMore"], ["Panini", 4.0, "January 7, 2012", "itraveld0y0u", "Albany", 6, 1, "Surprisingly good for a hotel restaurant. Portabello panini was great. Side of slaw and fruit cup accompaniment were fresh and bright. Good service."], ["Excellent chefs during working days but bit dawn on week ends cause I think their chefs change but OK, still", 4.0, "December 31, 2011", "zalfa A", "Washington DC, District of Columbia", 79, 18, "People at the bar are wonderful, professional & cheerful but of course, drinks are expensive since this is a big hotel. Bar menue along the main restaurant menu is fine but they need to make some changes for Harry's Pub."], ["Not worth the effort of eating here", 3.0, "November 14, 2011", "travelergo", "new york", 37, 24, "Food was BLAND. Ate egg breakfast here and lunch. Burger was burnt and had no taste to it. Only liked the french fries. My co-worker ate a chicken ceasar salad that had very little dressing on it and also tasted bland. Not impressed. Drinks were good though."], ["Dinner in the hotel", 4.0, "November 9, 2011", "George P", "San Francisco, California", 31, 5, "Three of us met for dinner at the resturant which is designed so that you don't sit close to other tables which was great for conversations. The waiter was attentive and my rack of lamb was done to perfection."], ["For a hotel restaurant, it wasn't bad", 4.0, "September 24, 2011", "Opusone1", "New York City, New York", 119, 42, "I had several meals in this restaurant. It wasn't bad. I highly recommend the buffet as the main kitchen appears to get backed up very easily.\nFood was fresh and tasted good."], ["Impeccable Service & Excellent Food", 5.0, "September 15, 2011", "Disneyfan6640", "Manasquan, New Jersey", 13, 4, "This restaurant is located in the beautiful Marriott Wardman Park where we were staying. As soon as we were seated we were given water and warm bread. Our waiter came over immediately & introduced himself. He told us the specials and took our drink order . A few minutes later he came back and brought our drinks which were beautifully...\n\n\nMore"], ["Lovely place", 5.0, "September 15, 2011", "Tatiana76131", "Fort Worth, Texas", 39, 24, "I ate here ones. It was pleasant experience. I loved the atmosphere of the place - candles, soft light and friendly staff. When I was there, it feels like I was somewhere on resort, because I could here all kind of exciting noises from downstairs - people attanding conferences socializing. However, most of the tables were empty. Prices little bit...\n\n\nMore"], ["Much better than typical hotel restaurants", 3.0, "September 12, 2011", "Amosboston", "boston", 29, 17, "Generous and fresh breakfasts, very decent dinners, good size drinks, and exceptional service."], ["Just breakfast", 1.0, "August 26, 2011", "davysims", "belfast northern ireland", 42, 22, "Simply too expensive. Nice staff - not their fault - but hotel breakfasts are usually not worth the money - go seek out adventure and a better price."]]], ["Cafe 8", [["Phenomenal Food", 4.0, "July 25, 2015", "MinniTraveler", "Minnesota", 44, 11, "We were out for dinner kind of late and stopped at Cafe 8. We both had salads and loved them! I had the Shepard's salad which was excellent! Then we split a spinach Pide, which was to die for. The Place is very cute with an outdoor seating area. The only downside is the hooka smoke when someone is partaking."], ["Fresh Food", 4.0, "May 1, 2015", "HealthyFamilyTravels", "Glen Burnie, Maryland", 10, 6, "Dined here for lunch. I had Spanikopitas, Dolmas and a spinach salad. The food was excellent, fresh and served in generous portions. The atmosphere is cozy and charming. The servers were friendly and professional. I'd definitely come again."], ["Positively 8th St.", 5.0, "September 5, 2014", "ProfessorCharles", "Virginia", 166, 79, "With so many good choices on 8th Street, it's difficult to decide where to stop. I finally stopped into Cafe 8 and quickly discovered a restaurant that I should never have walked by. There's a fine selection of Mediterranean/Mid-East dishes, both vegetarian and vegan (along with the typical carnivore choices.) Oh, and the bread, the freshly baked bread. Service is...\n\n\nMore"], ["Enjoyable lunch", 5.0, "July 15, 2014", "vanessamll4", "Wadsworth", 9, 2, "The appetizer with the different spread with the bread is fantastic. All the food is good - great durum sandwich (beef and lamb). Good service, friendly staff."], ["Definitely a redo", 4.0, "June 5, 2014", "bluenorth11", "San Antonio, Texas", 43, 13, "This was our first time wandering the streets DC, and we happened on Cafe 8. The menu posted at the entrance looked fresh and inviting...not to mention all the patrons food we couldn't help but covertly stare at while perusing the menu. I ordered an assorted kebab plate while my husband ordered a lamb plate. Both were served with perfect...\n\n\nMore"], ["Good Mediterranean food, very pleasant atmoshpere", 4.0, "September 26, 2013", "CarberyMan", "Washington, DC", 170, 75, "We have eaten at Café 8 several times. They serve good Mediterranean food. That includes nice Greek and Turkish dishes and drinks. Love the spicy olive oil and bread served at every table. Can't stop eating it! Interesting Turkish versions of food wrapped in dough. Service usually good. The drinks are very well prepared. Prices are reasonable for Barracks Row...\n\n\nMore"], ["Our favorite place on Barracks Row", 4.0, "September 21, 2013", "julia7178", "Washington DC, District of Columbia", 44, 21, "We live near Barracks Row and always find ourselves coming back here. We love Turkish food in general and have found Cafe 8 to offer consistently good food and good service. Cafe 8 also never seems quite as overwhelmingly crowded as some other nearby spots get on the weekends (unless they are having a private party,) and the outdoor seating...\n\n\nMore"], ["Great food, great service. Family owned restaurant.", 5.0, "September 9, 2013", "Alia P", "Washington DC, District of Columbia", 15, 11, "My husband and I have been going to Cafe 8 for several years now. We absolutely LOVE this place not only because it has great food and a good happy hour but also because we are always welcome with our dogs. We believe in supporting local businesses in our neighborhood and Cafe 8 is not only owned by the family...\n\n\nMore"], ["Was a little disappointed", 3.0, "July 2, 2013", "petie614", "Baltimore,Maryland", 106, 30, "Went here with several co-workers and was anticipating some flavorful, unique foods but my lunch lacked any real taste distinction. The saving grace were the spreads: cucumber, red pepper, sun-dried tomato - these, along with the fresh hot bread, were actually sufficient enough for a lunch meal. Very, very tasty. As for the lunch entrees, my sandwich was kind of...\n\n\nMore"], ["Great, healthy find", 4.0, "June 10, 2013", "revkate", "Decatur, Georgia", 50, 14, "We were luck to rent a house on Capitol Hill within walking distance of this neighborhood eatery. The service was kind and generous, if novice. The food was very good, and would be a place I would return to often when in the neighborhood. It was also very affordable for an intown DC restaurant."], ["Very good Turkish food", 4.0, "May 24, 2013", "rockandrollD", "High Wycombe, United Kingdom", 26, 18, "The complimentary bread and olive oil were a nice touch. We both had the lamb shank which fell off the bone and was delicious. We shared a baclava which was totally orthentic and dripping in honey. The service was good and we were able to sit outside all evening which was nice."], ["Turkish food in DC", 4.0, "April 19, 2013", "lrswtsn8", "Seattle, Washington", 40, 54, "This cuisine is one that not every city can boast having represented in its restaurants and this is what attracted my wife and I to try it on our recent visit to DC from Seattle. The place is attractively furnished and the menu full of items that looked interesting. We weren't terribly hungry and so we settled on splitting the...\n\n\nMore"], ["Not the same old thing", 4.0, "March 8, 2013", "jxx9595", "Washington, DC", 488, 163, "I'm not expert in Turkish food, but I've been coming here for several years. I don't know how authentic the food is, but it tastes both good and different. I particularly like the bread and the spreads. The pide is tasty as well. There are lots of food choices on Eighth Street, and visitors especially light up at the chance...\n\n\nMore"], ["Fine Turkish Fare", 4.0, "February 6, 2013", "BrandywineDC", "Oakton, Virginia", 48, 38, "Cafe 8 is a gem, a delightful and reasonable sampler of the eastern Mediterranean near Eastern Market (just steps from the Eastern Market Metro station). The coffee is excellent, the wine list is wide-ranging and intelligent, the menu charmingly selective. By no means cheap, the offerings are certainly reasonable."], ["Not the greatest", 2.0, "January 30, 2013", "Kevin H", "Tampa, Florida", 17, 13, "We ate here and we should have left when there was no one in the place. Ordered the chicken kabob and my friend ordered the donner plate. We have never seen ketchup on a donner (gyro) plate. My friend could not eat the meal. The chicken kabob, rice and veggies were just okay. Prices didn't compare to amount of food...\n\n\nMore"], ["Turkish Favorite", 5.0, "July 12, 2012", "anniemh2o", "Washington DC, District of Columbia", 59, 28, "Family run and owned. The slow-cooked pork shank is not always on the menu, but ask for it if you're in for dinner. You won't be sorry. Wonderful staff and outdoor seating."], ["stick to the mezze", 4.0, "January 26, 2012", "E20003", "dc", 76, 79, "i love the appetizers here, but the entrees have always been lacking. also - stick to beer and wine, the mixed drinks are expensive and weak. good thing you can keep piling on the apps until you're full :)"], ["Capitol Hill Gem!!!", 5.0, "January 21, 2012", "Jjb811", null, 1, 5, "Excellent food, service and atmosphere. A welcome addition to the neighborhood!!"], ["Wonderful new place on cap hill!", 5.0, "January 21, 2012", "jaguerrero", "miami beach", 7, 10, "Im moving back to dc and ate here this week. I'm glad to see that cap hill is opening up so many new restaurants. This place is a quaint comfortable restaurant. Excellent food, authentic Turkish staff, and clean dining and bath rooms. I'm going to be coming back often!"], ["Great food & atmosphere, plus near metro", 5.0, "December 30, 2011", "smidden", "Roseville, Minnesota", 18, 10, "The moussaka here was one of the best meals I had on our trip to DC. My family all enjoyed our dishes. The Turkish pizza was beautiful. Lovely atmosphere, good service. And conveniently located just 2 blocks from the Eastern Market metro stop. This restaurant is a great find."], ["Nice neighborhood place", 4.0, "November 28, 2011", "Scottinaboat", "Washington DC, District of Columbia", 110, 47, "this is a great little local Mediterranean place. Friendly staff, decent wine list and reasonably priced food."], ["Very nice outdoor seating!", 4.0, "October 11, 2011", "LadieLavender", "Odenton, Maryland", 63, 39, "My husband and I stopped in for lunch and we were pleasantly surprised! We started with the Spanakopita which were delicious and dangerous if your on a diet. I ordered the Vegetable Lahmacun pide which was covered in delicious spinach (my favorite) and my husband had the Durum sandwich which was also very good! The atmosphere was very pleasant and...\n\n\nMore"], ["Great Food, Great Service....Great Surprise", 4.0, "July 30, 2011", "LauraWashingtonDC", "Washington DC, District of Columbia", 19, 17, "We had never been on Barracks Row in DC, so we weren't sure which restaurant/bar would be a good place to pop in and have a quick drink and appetizer. We stopped in Cafe 8 because, though full, it did not appear to be too crowded to maintain a level of comfort. The hostess greeted us immediately and seated us...\n\n\nMore"], ["Pleasant Space, Okay Food", 3.0, "September 5, 2010", "DCtravler244", "Washington DC, District of Columbia", 142, 78, "This is a pretty space, but the food is nothing special. While Cafe 8 is Turkish and nearby Cava Mezze is Greek, there' are a lot of similarities in the food. Unfortunately for Cafe 8, has far better food.\nAttractive outdoor seating in the rear."], ["Cute and unexpected spot...", 4.0, "November 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Cute and unexpected spot on Cap Hill...much different than the pub grub that you typically find in that neighborhood. Try the muhamara (sp?) - the most flavorful eggplant dip that I've ever had. Good wine list, too."], ["go on Tuesdays! half price sushi", 4.0, "August 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "go on Tuesdays! half price sushi"], ["Cafe 8 is Gr-8 Eating", 5.0, "July 13, 2008", "CitizenB", "The Midwest", 25, 64, "We recently dined at Cafe 8 twice in the same week, the first time as a couple and the second time with a group of almost 20 people. Our first experience was so incredible we brought a group of friends back for our second visit. Cafe 8 is a fantastic restaurant with a great menu. The staff at Cafe 8...\n\n\nMore"]]], ["Irish Whiskey Public House", [["Steak and Fries and a Couple Pints", 4.0, "October 6, 2015", "Conchobar", "Florida", 92, 141, "A free night and a quick Google search and off I went to try this pub at 5:30pm.\nThe pub is three levels and has an outdoor seating area that was crowded. The indoor decor is \"rustic.\" I went down the stairs to the lower level as the middle level was packed. I found a stool at the bar and...\n\n\nMore"], ["Awesome food, staff, and ambiance!", 5.0, "September 14, 2015", "Lookingforgoodstuff", "Niantic, Connecticut", 13, 3, "I went here for dinner after my flight home had been cancelled. All the staff was really nice especially Liz! She took time to have a conversation with me while being an excellent bartender/waitress. I ordered the corn-beef sandwich and it was amazing. The bar scene also seemed pretty good. It seems to be a great place to go alone,...\n\n\nMore"], ["Awesome experience", 5.0, "August 23, 2015", "reroh21", "New Egypt, New Jersey", 27, 6, "We tried this place just to get some bar food and drinks, they say us downstairs which was basically empty but the bartender/server there was awesome, I think his name was Andrii. There was a drunk couple at the bar basically putting on a show, and he gave everyone downstairs a free shot basically to say sorry about the couple....\n\n\nMore"], ["Good food, good drinks, SLOW kitchen", 3.0, "August 22, 2015", "kevinoneill50", "Virginia Beach, Virginia", 1, 0, "Went for dinner and enjoyed the atmosphere of a traditional Irish pub, but the kitchen was the reason for a three star rating. Good food, but it took over an hour and a half to get the meal. To the waitstaff and managers credit, they provided multiple free drinks and an app to compensate. Really handled the bad situation like...\n\n\nMore"], ["Nice place to sit on the patio.", 4.0, "August 19, 2015", "Steve P", "Clontarf, Queensland", 191, 160, "This place is situated not too far from Dupont Circle, without the prices. It has a nice patio out front and a few steps up from the street, giving it a little privacy from passing pedestrians and a cosy atmosphere.\nThe menu is quite extensive for a pub and the service very good. Another nice place to enjoy on a...\n\n\nMore"], ["Very good informal dining", 4.0, "July 19, 2015", "SouthMO", "Lebanon, Missouri", 75, 25, "The food was good at Irish Music Whiskey Public House. The service was excellent and the food was very good. Their selections of beers is good. The whiskey choices are more limited, as expected in an Irish pub, but they had some Irish whiskeys I hadn't had before."], ["Great appetizers and beer selection", 4.0, "June 24, 2015", "cometman", "cleveland", 130, 61, "The place seemed to always be crowded and lively. Great selection of appetizers and beers. Great service, staff was friendly and attentive. I would go back."], ["Great Irish Whiskey selection, but not much else.", 3.0, "May 18, 2015", "Linz4huskers", "Kailua, Hawaii", 51, 28, "Solid Irish pub with a great whiskey selection and decent beer selection. The service was very attentive in the basement. The first floor was a bit louder and more raucous. The upstairs was reserved the night I visited, but I've heard it is nice.\nLower score due too the food and a credit card mixup. The Shepard's pie was average...\n\n\nMore"], ["Awesome Burger", 4.0, "May 2, 2015", "Chad S", "West Jordan, Utah", 54, 21, "Went here with friends. I do not drink alcoholic drinks, but the brunch menu has a burger on it called the 2 am burger that was absolutely delicious. If I could have eaten two, I would have loved too do so. It was very filling. Fun little atmosphere. The group I was with was happy with their drinks as well."], ["Not Impressed, overall", 3.0, "March 25, 2015", "neww0rldtraveler", "Chicago, Illinois", 146, 35, "It's an Irish pub motif, so in my mind, it's mandatory to get fish & chips. It was nothing mind blowing or spectacular, but it was plain delicious, at best. The interior is the wooden tables and bar you see in almost every pub in Great Britain. Their television placement left optimal viewing angles to be desired, you either craned...\n\n\nMore"], ["Terrible Brunch / Service", 1.0, "February 8, 2015", "AHCS_2015", "Washington DC, District of Columbia", 1, 2, "I went there a couple weekends for brunch and was disgusted by the food (I got the training omelet and it was watery and oily, goat cheese tasted bad). I was also really shocked by the service, the bartender (tall, dark brown hair with a beard) was very rude, and shamelessly reminded us to tip well before giving us the...\n\n\nMore"], ["Quaint and enjoyable", 4.0, "January 18, 2015", "Nick B", null, 1, 2, "Had the Shepherds Pie and a few beers. Very tasty and delicious. Downstairs room was very noisy... We went upstairs and it was quieter. Huge whiskey menu. Enjoyed our visit."], ["Looking for a cosy local pub?", 5.0, "December 23, 2014", "Mike R", null, 46, 17, "This is definitely a place that locals meet and enjoy food. We did the brunch. The wait was a bit longer than expected, but remember that locals don't turn over that quickly, especially on Sunday. There's a special on champagne, so check it out. The Eggs Benny was special with the fruit cups. I had two Bloody Mary's, which were...\n\n\nMore"], ["Quiet spot for a drink", 4.0, "November 1, 2014", "SeriousGeorge", "Washington DC, District of Columbia", 8, 2, "Met a friend-of-a-friend for a pint or two after work on a drab, wet Wednesday evening in DC. I arrived early, and noticed that it was still happy hour at the bar for another three minutes. I panicked when ordering something under such time pressure, but stuck lucky with a pint of Dublin's finest Lagunitas Pale Ale, brewed in the...\n\n\nMore"], ["Irish Whiskey Public House", 5.0, "September 4, 2014", "Michael L", "Arlington, Virginia", 68, 6, "Saw listing for this place with good reviews, decided to try it. Located in the DC not far from DuPont Circle and Farragut North metro stations. I was greeted warmly and sat at bar. They didn't have a Porter beer, but had a very acceptable Bell's Brown, so good I had two. I ordered the calamari, good quantity and taste....\n\n\nMore"], ["My favorite whiskey bar in Washington", 4.0, "August 14, 2014", "Mike W", "Washington DC, District of Columbia", 25, 17, "Having lived in Washington since Jimmy Carter was president, I can say authoritatively that this is my favorite whiskey bar in the Nation's Capital. The place serves 65 varieties of Irish whiskey.\nIt's kind of cramped inside during peak hours. The Irish food is, well, Irish food. The sandwiches are excellent. The whiskey selection is the real attraction."], ["Great atmosphere", 4.0, "July 29, 2014", "Carolyn H", "Greenville, North Carolina, United States", 19, 5, "The food is mediocre Irish food, but the atmosphere was welcoming. It is small inside, but we sat at the bar. The bartender was great. I had the fish and chips and it was not good. Went back a second night because of the bartender and how welcome he made us feel. We had the drunken chicken which was better....\n\n\nMore"], ["Friendly staff, average food", 3.0, "May 15, 2014", "notleo01", "North Little Rock, Arkansas", 118, 58, "Went here with a large group on a Friday night. It's a crowded layout spread out over three floors and an outside sitting area when the weather allows. We managed to find space on the bar level, so the service was a little slower, but the bar tender was friendly and knowledgeable about his beer/whiskey selection. The atmosphere and food...\n\n\nMore"], ["Was hoping for more", 2.0, "April 28, 2014", "LindsD53", "Clitheroe", 78, 40, "We booked this pub because our friends from Arkansas were celebrating a birthday and like whiskey. The reviews looked good and the photos on the web-site were very encouraging. As it was a celebratory meal both of the ladies got done up for the evening and were totally over dressed! We were sat at a table where 2 of us...\n\n\nMore"], ["Nice, cozy pub", 4.0, "February 14, 2014", "fldude99", "Pensacola, FL", 28, 21, "Very nice, cozy pub in a nice neighborhood. Although our hotel was close, after going here, I would go a bit out of my way to pay a visit here. Fish and chips was good and a good selection of beers on tap. I've been told the wings are great, but I can't personally attest to it. Highly recommended."], ["Fun Times", 3.0, "December 31, 2013", "cpherg", "Glendale, Arizona", 8, 1, "Irish Whiskey is your average DC bar that put a ton of time and money into their interior to create the feel of an Irish pub. The drinks are overpriced for beers, but at least they have Smithwicks on draft. Overall, it is a nice spot to snag a drink. Late night it can be full of bros stumbling about."], ["Perfect place for a pint and dinner", 5.0, "November 16, 2013", "CaliforniaLew", "South Bay area, Ca", 91, 55, "I stopped in here a couple of times during a recent trip, and thoroughly enjoyed it. Staff was friendly and responsive. They had good beer and big selection of Irish whiskey. I had a great fish sandwich one night, and a good salad another. Not touristy. Slainte!"], ["Nice Place to Visit", 4.0, "November 5, 2013", "MDann60", "Billings, Montana", 16, 3, "Was looking for a pub that would not break the wallet and yet was a local bar. Someone on the street recommended Irish Whiskey. Went down four steps to the bar and sat at the bar. Started talking with the bartender, and ended up having a great time. It was refreshing to meet someone who could do his job and...\n\n\nMore"], ["Very nice visit", 5.0, "October 23, 2013", "Matt H", "Exton, Pennsylvania", 55, 11, "The food was very good and they have an outstanding selection of Irish whiskeys with several standard bourbons. They also had a well rounded selection of craft beers on tap."], ["Pretzel Bites.", 4.0, "October 4, 2013", "ManyMilesStill2Go", "Doylestown, Pennsylvania", 155, 75, "We were wooed here even though the beer was not our favorite on tap due to a deal I had found... So glad we went. If you do not find what you like on tap be sure to look at the bottle fridge - and ask questions - the bartender is super helpful and surprises definitely await off menu. We...\n\n\nMore"], ["Great Irish food", 5.0, "August 30, 2013", "Erica Y", "Greenbelt, Maryland, United States", 10, 4, "My boyfriend and I had a groupon for this place and it was awesome! I had the best shepherd's pie of my life here. The staff was fun, the atmosphere really nice. Pretty close to the metro too. Definitely going back!"], ["Outdoor lunct", 5.0, "April 8, 2013", "njnoke", "jersey shore", 80, 30, "My family- including our 1 year old twins just enjoyed a lunch on their outdoor patio. While an umbrella would have been appreciated for those with pale irish skin in the group, and there were a few minor glitches- dressing not on the side and onions left on the burger, we still enjoyed it so much we would go off...\n\n\nMore"], ["Just kind of average. Expensive beer.", 3.0, "March 24, 2013", "michigantraveler05", "michigan", 166, 70, "This is a new-ish Irish bar in DC, great location near Dupont Circle and just up from the Farragut North metro stop. I'm a sucker for an Irish bar and wanted to try it out. My experience says I probably won't go back. Biggest problem? Expensive. It was $7 for a small glass of Guinness. (Compare this to a tall...\n\n\nMore"], ["Bangers and mash! YuM!", 4.0, "March 14, 2013", "scouseinthehouse", "New York City, New York", 44, 28, "Being a Brit I had to order the Bangers and mash. 3 Bangers (large sausage) $11 or so were on top of a ok portion of mash but they were delish, we ordered a whiskey and a Guinness to drink. The afternoon bar tender (misty) was very friendly and helpful. It was a cold day, only 6 people in there...\n\n\nMore"], ["Nice Place For A Private Party!", 4.0, "March 8, 2013", "Alison F", "Williamsburg, Virginia", 87, 19, "our Review Is Entirely Based On Being In Town for A Surprise Birthday Party. Downstairs Was SLAMMED packed But upstairs Was Fantastic! The 50 Or So Of Us Had Plenty Of Room, Decent Food And Plenty Of Help From The Bartenders. I Would Likely Go Back if I We're In The Dupont Area, But Only Upstairs. Downstairs Was A Bit...\n\n\nMore"], ["Lots of Character!", 3.0, "February 27, 2013", "Allen S", "Lincoln, Nebraska, United States", 5, 8, "I have to admit, I was part of a group that had basically reserved the main floor and basement and also spilled out onto the front patio to hold the ~200 of us for our get together. The heavy hors d'oeuvres that were provided for us by the bar were very tasty, filling, and ample. The alcohol prices were very...\n\n\nMore"], ["Super Little Place!", 5.0, "February 23, 2013", "davekristick", null, 37, 13, "Arrived at 4pm. Great service. Good selection of Dogfish Ales. The sliced bread munches are awesome!"], ["Great atmosphere", 5.0, "November 21, 2012", "boltartas", "Tasmania", 52, 14, "Went here with friends - we love seeking out Irish pubs when we travel and this one is a gem. In a historic building only a short walk from Dupont Circle. We liked it so much we visited twice in a week. Enormous selection of whiskeys, plus we had other drinks plus snacks.\nThe decor is rustic and on several...\n\n\nMore"], ["Pretty average - id give it a miss!", 2.0, "August 11, 2012", "kellyenz", "Washington DC, District of Columbia", 213, 45, "Basic pub food and drinks - ok if you like whiskey. Management was obnoxious. Better food and drinks are available in numerous places nearby and if you want drunk students then go to Rumors."], ["Farragut downtown's new upscale pub", 4.0, "May 12, 2012", "Mike R", "Washington DC, District of Columbia", 30, 17, "A new pub has opened in DC's downtown on 19th near M St. Very charming interior, great front patio seating for lunch. Menu selection of sandwiches is very tempting, I had the open-faced French dip. It was delicious, portion size just right, and nicely priced. My friend and I were both tempted by the twice-dipped French fries --- they were...\n\n\nMore"], ["New Resturant in Washington DC, something to try!", 5.0, "April 8, 2012", "trvlrz", "Eaton Rapids, Michigan", 40, 18, "I was walking back to my hotel room a couple months ago after dinner and drinks with colleagues and noticed this new resturant on the corner of 19th and M street. The name of the bar/resturant is called the Irish Whiskey. This is a nice quaint place that is small enough to feel like a small neighborhood pub but large...\n\n\nMore"]]], ["Duccini's Pizza", [["A Pizza Port in a Storm", 4.0, "October 8, 2015", "christianjcote", "Vancouver, Canada", 19, 5, "Early in our trip to Washington my girlfriend and I were desperate for a good late night pizza and took our chances with Duccini's. We were very glad we did, because the delivery was quick, it was a good value considering its size, and the pizza was great! She's from New York so she knows good pizza, and I think...\n\n\nMore"], ["Stand-Out Pizzeria in a City That Needs One", 4.0, "August 25, 2015", "ScottWashDC", "Washington, D.C.", 17, 3, "This place is so small that I’m almost reluctant to boost it for fear that it’ll soon become too crowded to patronize. But I’ll say good things anyway because, in a pizza wasteland like Washington, this place delivers the goods. This is what Duccini’s is not: It’s not one of the now ubiquitous “brick oven” pizza restaurants in the area...\n\n\nMore"], ["Perfect Late Night Food", 4.0, "August 20, 2015", "Thom M", "Raleigh, North Carolina", 122, 39, "The slices here are enormous and incredibly reasonably priced. Late at night after a concert this pizza made life complete. The pizza is thin crust with just the right amount of cheese and grease."], ["Hit the spot!!", 5.0, "August 4, 2015", "cryptik123", null, 2, 1, "My family and I had the extra large pepperoni pizza along with a large garden salad. It was plenty for a family of four. The price was reasonable and the overall taste was excellent! Delivery person was on time and pleasant. Will dine here again."], ["Great Pizza and Fast Delivery to Columbia Heights!", 5.0, "July 26, 2015", "willingtravelr", null, 39, 12, "It was July 4th and we had just finished watching the Foo Fighters at RFK. It was late and tough to find the train (since we had gone up ahead to the auxiliary stations and ended up following the crowd, but that a WHOLE other story!) back to the pizza. We finally got home and started scanning our phones for...\n\n\nMore"], ["Big pizza", 3.0, "July 19, 2015", "24112QGal", null, 79, 16, "Big slices are the their Schtick- like a single slice is a small pizza- thin crust- fine and quick takeout. Taste wise I didn't find anything memorable-"], ["Vert good neighbourhood food", 4.0, "June 19, 2015", "Fernando F", null, 33, 6, "They have a great selection of sandwiches and pizza toppings. My favorite here is the Philly sandwich, I have it woth extra meat and pepperoni. Obviously it is not a healthy meal. But it is very tasty, staff is OK and try to do things right. Price is good and tou can eat a lot with 10 bucks. Jumbo slice...\n\n\nMore"], ["Great Delivery Pizza", 4.0, "June 11, 2015", "Gary P", "Brandenburg, Kentucky", 105, 35, "We were tired of the crowds and decided to have pizza delivered to our hotel. We ordered to pizzas. Both were excellent, spicy and hot. Also had garlic bread and it was very tasty and hot. If we are ever in DC again, we will order from Duccini's."], ["Don't follow their own policy", 1.0, "June 2, 2015", "max42590", "Washington DC, District of Columbia", 1, 0, "These idiots don't even follow their own \"3 mile delivery radius\" from their website. Even after having delivered to my address (which is 2.4 miles away) in the past, they called to say they wouldn't do it again. I'll never order from them again, even when I'm nearby. I have to choose how and when I visited for this review,...\n\n\nMore"], ["Excellent!", 5.0, "April 28, 2015", "corylong", "Omaha, Nebraska", 13, 10, "Staying in a nearby hotel, ordered a pizza online at 6:13; The delivery driver called to inform me he was in the lobby at 6:31.. 18 minutes for Pizza Delivery? Wow! I thought the pizza was outstanding.. The driver was super friendly and the prices were good. I only wish this place was in Omaha!"], ["okay gyro", 3.0, "March 1, 2015", "Mark M", "Kaneohe, Hawaii, USA", 228, 45, "The delivery was great. We and chicken gyros. Too much sauce overwhelmed the gyro. Need to try the pizza next time."], ["Great pizza with a great price", 5.0, "September 28, 2014", "Sharrief T", null, 1, 1, "I have ridden past this restaurant so many times and didn't even know it was there. Small corner location next to equally small places.\nHowever the food is fantastic and the value undeniable. The service is fast and friendly.\nIt's always a treat to grab a pizza or steak and cheese after work or a night out.\nLove this place."], ["Vegan Jumbo Slice", 5.0, "September 26, 2014", "Tom D", "Boston, Massachusetts", 19, 5, "Late night vegan jumbo slice. Every visit to D.C. includes a slice of pizza the size of my head, covered with daiya. But if you want a slice made vegan, you gotta call ahead and have 8 slices spoken for. Never a problem if you are rolling with a crew, but troublesome if you are running solo. But it is...\n\n\nMore"], ["Great delivery and late-night slices", 4.0, "September 25, 2014", "JT M", "Washington DC, District of Columbia", 158, 53, "Duccini's is where I call when I order pizza for delivery in Adams Morgan. I usually get white pizza with chicken and mushroom. Very good. There are a wide assortment of pizza options and toppings for take-out or delivery, plus salads, etc.. In their small storefront, Duccini's also offers takeout and a limited option of large slices, such as cheese...\n\n\nMore"], ["Great pizza, but know the protocol!", 4.0, "August 17, 2014", "bru12345", "london", 65, 22, "This place is busy, and frequented by many regulars, so if you're waiting to order in the evening, the staff will expect you to know what you want, so think through your options before crowding the counter! The pizza is delicious: fresh sauce, just right dough (not thin unless you ask) and plenty of cheese! The slices are huge and...\n\n\nMore"], ["Good service", 4.0, "July 14, 2013", "mssvspain", "Muscle Shoals, Alabama", 9, 2, "Love the pizza! The delivery guy was very friendly and they stay open late. I would definitely order here again."], ["Bland", 2.0, "June 21, 2013", "AJ C", "Washington DC, District of Columbia", 169, 35, "There is albertos. There is matchbox. There are slices up in Adams Morgan. Why buy this. Not tasty. SaUse on cardboard. Pizza is easy and they make it hard. Blah blah blah. Terrible I'm afraid."], ["Never delivered a pizza", 1.0, "May 27, 2013", "P Y", "London, United Kingdom", 32, 13, "Ordered there for over a year because it was a good value - however they didn't deliver one time and didn't even care.\nWhen in to talk with their manager, and I kid you not, all of the employees were out back chasing out rats that had gotten in from the alley. That pretty much ended me ever going and...\n\n\nMore"], ["Great pizza, fast", 4.0, "May 1, 2013", "mahlerific", "mahlerific", 41, 22, "Duccini's offers far-better-than-average hand-tossed pizza at a good price. You've probably seen their ubiquitous delivery vehicles if you live in NW DC, a symptom both of Duccini's popularity and its three-mile delivery radius. While many come to Duccini's for jumbo slice, you should consider stopping by for takeaway; get a full pizza, choosing from their creative menu options or individual...\n\n\nMore"], ["fast service and great food", 5.0, "October 14, 2012", "wdoerner", "Washington DC, District of Columbia", 65, 26, "Got a Meal Buster pizza delivered today while working at home. Service was 15 min faster than expected and pizza was extremely tasty! The delivery guy wasn't extremely friendly, which surprised me but the great pizza made up for it."]]], ["Cashion's Eat Place", [["Very good food", 4.0, "October 11, 2015", "Evie9242", "Washington DC, District of Columbia", 28, 8, "A truly odd cocktail -- imaginative and it contained absinthe, so I tried it and mostly liked it. Gnocchi were very tasty; tortilla soup good but not great; bib lettuce salad ample and worth the effort. But the scallops were just incredible. Grilled to perfection, but only three of them for $29.00. I went back again two nights later (luckily...\n\n\nMore"], ["I've never understood why people like this place", 3.0, "October 4, 2015", "ThickDescription", "Washington", 18, 9, "meh, meh and more meh... Tries hard, but just doesn't measure up. I live in the neighborhood and choose to eat elsewhere."], ["Good place for many occasions", 4.0, "August 28, 2015", "Prawet J", "Washington DC, District of Columbia", 238, 73, "A group of us decided to look for a nice place for getting together during weekday happy hour. We decided to try Cashion's Eat Place. It is situated near the intersection of Columbia Road and 18th Street in Adams Morgan. The day we went, the place was not crowded so we had no problem to get seats. The place is...\n\n\nMore"], ["Totally disappointmg", 1.0, "August 16, 2015", "Janis T", null, 11, 6, "Cashions was overpriced and almost inedible. The cocktails were good but the dinner was a serious disappointment and we would never go back. We ordered the tempura which was so oily you could not eat it. The salmon was so salty that it was almost inedible. I had heard great things about the restaurant but this was actually really bad....\n\n\nMore"], ["What a disappointment", 3.0, "July 13, 2015", "1Jodie23", "Washington DC, District of Columbia", 18, 6, "The food was great. My issue was with the service and attention to detail. Four of us ordered the rockfish. My husband requested \"no vegetable matter on the plate\". All the meals came out, including two rockfishes and my husband's order which had no veggies on the plate, except for the chives and such on top of the fish. So...\n\n\nMore"], ["Disapointing brunch", 3.0, "July 8, 2015", "DCfoodman", "DC", 31, 14, "We had family in from abroad and the west coast and chose Cashion's for brunch. Overall it was disappointing. Food generally was OK. The issue was three of our party ordered a dish with arugola. What came out were leaves that were yellowing, browned at the edges and a few actual rotting ones. When we complained the waiter took them...\n\n\nMore"], ["Not For Sunday Brunch", 2.0, "July 6, 2015", "Travelbug43210", "Montreal", 58, 28, "I am one to always looks for the positive but I should have known the experience was going to be 'iffy' when they had the daily brunch menu printed on the reverse side of another day's specials with a line thru it.\nThe Biscuit with Homemade Strawberry Marmalade was not served with strawberry marmalade nor were we advised of the...\n\n\nMore"], ["Only eat here if you are not terribly hungry", 3.0, "June 21, 2015", "Alen R", "Fair Oaks, California", 112, 40, "I have to say I was pretty disappointed with the disconnect between the size of the big plate versus the starter and the ridiculous price charge for obvious appetizer portions. We chose this restaurant because the menu sounded good. The neighboring restaurants were busy compared to the 4 couples at this site.common sense did not prevail. We ordered the teeny...\n\n\nMore"], ["Everything Old is New Again", 3.0, "May 27, 2015", "wideeyedandtraveling", "East coast", 41, 40, "Went to Cashion's on Memorial Day weekend as they were preparing for their 20th anniversary. It was a nostalgic visit, and a return to a place where I've generally gone for brunch. Food was as good as I remembered, but the service was lackluster. With the restaurant not being full to capacity, it was hard to understand why.\nWe were...\n\n\nMore"], ["\"Parents Last Dinner with Groom\" before wedding", 5.0, "May 1, 2015", "Carol S", "Davidson, North Carolina", 221, 49, "We were last here for New Years with our son several years ago and it seemed right to return to celebrate our son's upcoming wedding. This is one of his favorite DC places to eat so to mark the occasion was terrific. The food was excellent and service divine."], ["Deeeeelishous", 5.0, "April 1, 2015", "carolinemasi", "New Jersey", 37, 20, "the pork, the shrimp tempura, the potatoes, the cauliflower...all fabulous. YUM. great drinks as well, say my friends (I can't drink). I liked that they have small plates so that you can have 2 entries, or an entree and a few sides. Reasonable prices for the quality of the food. Love the tzatziki."], ["Small plates for big money", 3.0, "March 18, 2015", "Laura_Travels196", "Washington", 86, 46, "When a carnivore and a vegetarian are dining together, small plates seem like the ideal option to be able to sample a range of dishes. At this restaurant, the variety for vegetarians was limited and the one dish that the waiters raved about when we sat down (\"Potatoes Anna\") was already sold out by 7:00 pm, the peak dinner hour....\n\n\nMore"], ["In the weeds", 3.0, "March 8, 2015", "PetePope1", "New Orleans, Louisiana", 490, 128, "A popular place, overcrowded, the chef was having a bad night. My companion ordered the fried chicken, was told it would be a half hour wait but we were OK with that. Forty minutes later our dishes came, her chicken was bloody. The waiter was understanding, sent it back, and then 30 min later brought out a second plate. Same...\n\n\nMore"], ["Onion and garlic to hide poor cooking", 2.0, "February 23, 2015", "Aladara", "London, United Kingdom", 7, 10, "A very reduced menu versus promises of their site and prices stupidly high for the quality, that are hidden as your main does not include any wedge. At the end, you smell as a garlicky onion and you wallet is much lighter. A lousy experience, avoid it !"], ["Great place for brunch", 4.0, "January 18, 2015", "amergalinpretoria", "Washington DC, District of Columbia", 51, 20, "I just ate here today with my 10 year old for the first time. Service was very good. We had a very friendly and attentive waitress. Both myself and daughter were quite pleased with the food though they do not have a \"kids' menu.\" We had the eggs benedict, greek yoghurk , French toast and the clafoutis for our dessert....\n\n\nMore"], ["Terrible service", 2.0, "December 14, 2014", "Merchanda", "Washington DC, District of Columbia", 110, 48, "Went there for brunch and came out deeply disappointed. I'm scratching this one off the list for ever. Food wasn't bad, it was good in fact, however the size left a lot to be desired and I don't think it was worth the money but the really low point was the service. What a dreadful service. It seemed like the...\n\n\nMore"], ["Revamped Menu - Stellar Service", 5.0, "December 3, 2014", "DCN2012", "Washington DC, District of Columbia", 42, 3, "We're regulars at Cashion's and find the service as warming as the food and ambiance. It's obvious the chef loves a good challenge and seeks to create menu items that you wouldn't normally consider; a foodies dream.\nIn recent months, they've revamped the menu to make it more inviting both economically and optionally without sacrificing quality; although some portions are...\n\n\nMore"], ["Decent Brunch - Great People Watching", 3.0, "November 17, 2014", "Melissa K", "Boston, Massachusetts", 36, 19, "Visited Cashion's for brunch with a couple of friends. We decided to go here because of their online menu and once we were seated, we realized that the food we saw online was not available on their menu anymore. This place is great for people watching if you sit outside or can snag a table by the big windows. The...\n\n\nMore"], ["Delicious meal - exciting new menu", 5.0, "November 8, 2014", "Cabell R", "Washington DC, District of Columbia", 7, 2, "It had been a year since my wife and I had been to Cashion's and after an amazing dining experience, I can confidently say that it will not be that long until our next visit.\nWe sat at the bar and had the pleasure of meeting Billy and George, the bartenders and two of the owners. They were incredibly welcoming...\n\n\nMore"], ["Worth visiting repeatedly.", 5.0, "November 1, 2014", "Britlynster", "Washington DC, District of Columbia", 2, 0, "Consistently great food & service. Excellent for dates, business meetings & late night Happy Hour. Revolving menu is always a hit."], ["Good people watching, lousy service", 3.0, "October 20, 2014", "Nancy E", "Chicago, Illinois", 40, 11, "We sat outdoors, the weather was beautiful, the people watching fascinating so the experience wasn't a disaster. The food was pretty good, what we received. We ordered five dishes between two of us and ultimately were brought three. My husband and I shared the watermelon tomato salad-I've had a lot better-then waited over forty-five minutes for our mains and sides....\n\n\nMore"], ["A unique dining experience", 5.0, "October 5, 2014", "JPotter_12", "Weston", 13, 3, "Cashion's is a special place. The food is wonderful and the décor and ambience is special and unique, something that can be hard to say about the plethora of multiple location (a.k.a. corporate) high end restaurants which, although I appreciate and dine at, sadly permeate the gastronomic landscape of the 21st century. Try the slow roasted Goat or the Duck...\n\n\nMore"], ["Phenomenal", 5.0, "September 15, 2014", "HeidiandJohn", "Washington DC", 28, 10, "Great service, ambiance and food. This is where to go to get great food in the heart of Adams Morgan - food was so fresh and uniquely prepared."], ["Will return!", 5.0, "September 11, 2014", "Lookingforsun4", "PNW", 92, 135, "Wonderful service, wonderful food, and relaxing. The food was fresh and tasty. We ordered a variety of different plates and loved them all."], ["Still one of the best in DC", 5.0, "August 21, 2014", "MD2FL", "Naples, Florida", 68, 48, "I've been going to Cashion's since it opened in 1995. (Wow! Time flies when you're having fun.) I just never get tired of this place. Probably because the menu is always changing and they never stop improving on old favorites. Last night my friend and I shared a burger, the duck, potatoes, the watermelon/mint/feta salad and a few other apps....\n\n\nMore"], ["Yum!", 4.0, "August 18, 2014", "dc2150", "Washington DC, District of Columbia", 30, 10, "Four of us had a wonderful meal, sitting out on the patio. The food is fresh, with a wide variety of choices to mix and match. The service was really good. Terrific wines. Definitely should be on your list of places to eat in DC."], ["Eclectic & tasty", 4.0, "August 10, 2014", "Joe C", "Herndon, Virginia", 91, 22, "Reviewing the menu made me think that place would be a tad too \"out there\" for my taste (there were four of us dining) but it appealed to my wife, so in we went. My hesitation was soon gone. Our server was attentive, personable, knowledgeable and very forthright (on one occasion, dissuading us from ordering something because it hadn't turned...\n\n\nMore"], ["Pretending is not good for food", 2.0, "August 4, 2014", "LuBart", "Washington DC, District of Columbia", 45, 19, "Yes, this restaurants pretends to be \"inventive and local\", according to their website. Unfortunately, this is not the case. It's certainly fashionable to sell \"local food\" in Adams Morgan, but what really matters is how you prepare it. I'm going to give two quick examples: the buffalo tartare and the crispy potatoes. Preparing tartare is very difficult; you need super...\n\n\nMore"], ["The search continues...", 3.0, "August 3, 2014", "GoSeeDoBe", null, 9, 1, "A few friends and I visited this place for Sunday Brunch. The Adams Morgan location gave it a lively yet comfortable vibe, but parking was a little dicey. If street parking doesn't work out, there is a small private lot available for use a block or so away for a $15 fee.\nThe outdoor seating was comfortable and spacious, so...\n\n\nMore"], ["A 3 stars for me because of the fish.", 3.0, "August 3, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Frankly I cannot remember how I come across this place, I eat out a couple of times every week. Decided to try this place last night. Made a reservation via Open Table.\nLike the fact that the restaurant took note my request to be seated by a window, but I did call back ah hour before the reservation to remind...\n\n\nMore"], ["Always a winner!", 5.0, "July 9, 2014", "RachieBrooke", null, 1, 0, "Warm, inviting space with a yummy new menu! Bean and beet salad was delicious and I loved the \"flesh and bones\" lamb ... Like meat candy!"], ["Best in DC!", 5.0, "June 24, 2014", "Ashley S", "Washington DC, District of Columbia", 59, 20, "This was one of our neighborhood haunts for years and we miss it so much! Just visited again and got the best surprise - Billy is back to join the other Cashion's Boys, John, Justin and George! Tucked in the midst of 18th and Columbia in Adams Morgan, Cashion's is a restaurant that you will want to visit much more...\n\n\nMore"], ["Went for Sunday Brunch ...... Overall excellent !!", 4.0, "June 15, 2014", "Track1089", "Florida", 317, 111, "This is from a wonderfully Sunday Brunch ...\nComfortable neighborhood eatery. Looks like any other. Hopefully if your in another part of DC you'll venture over but as all over DC, parking is tough.\nGood, attentive service. Different menu selections from other places.\nVery good tasting food ... had chicken hash under poached eggs, sunnyside sandwich with salad, basic eggs...\n\n\nMore"], ["Great Drinking spot", 5.0, "May 28, 2014", "JBMartiniguy", "Hartford, Connecticut", 85, 42, "We've only eaten at th bar, but its a must do spot whenever we are in DC. The after dinner crowd is full of live, we always meet new people, the manager, waiters, and bartender...the entire staff is attentive and fun to be around. Its hard to leave and they do stay open quite late."], ["Loved the brunch", 5.0, "January 7, 2014", "Alice P", "Washington, District of Columbia, United States", 66, 34, "No, it's not cheap, but I loved this place. Great for brunch with friends. Not too noisy and they had a great playlist when we were there. We didn't feel rushed and the staff was attentive. We were able to eat and enjoy our dear friends. And isn't that what brunch is all about?"], ["good food, but average for the price", 3.0, "January 4, 2014", "ppp4p6p89", "San Francisco, California", 16, 7, "as someone who enjoys creative cooking and is willing to pay for it, i was not wholly disappointed by cashion's. i'd say go for it - if it's convenient. this price point, however, gets a very high creativity standard from me, and this place didn't quite meet it."], ["Great food... when they have it!", 3.0, "January 4, 2014", "Tracy H", "Arlington, Virginia", 5, 5, "So Cashions is a great spot, delicious food, and a fantastic ambiance. BUT, I have been there 3 times now, and each time I have not been able to get something I wanted to try because the kitchen has run out. Last night they were also out of a house beer, and had several items on the menu that were...\n\n\nMore"], ["underwhelming - so many better food options in DC", 3.0, "December 22, 2013", "Avaya109", "Barcelona, Spain", 72, 29, "A completely underwhelming experience.\nThe food was lackluster. For starters, we had mezze, fried green tomatoes and gumbo. They don't really offer a green salad starter, the only salad is a beet salad. For entrees our table mixed it up b/w bison, rabbit, fish and chicken. While nothing was bad, nothing stood out either. For the price, there are now...\n\n\nMore"], ["Much better than before", 4.0, "December 18, 2013", "diploconcierge", "Hanoi, Vietnam", 302, 150, "Cashion's used to be our favorite restaurant in Kalorama/Adams Morgan - fresh ingredients, seasonal menu, friendly service, casually upscale setting - and then it fell off, which was disappointing. Friends had been telling us that the restaurant is now back to what it used to be and, after our meal there last night, I concur.\nOur server was friendly and...\n\n\nMore"], ["A good but not great experience", 4.0, "November 29, 2013", "Barb1976", "Chicago, Illinois", 161, 72, "We had heard a lot of good things about Cashion's, but our recent dinner there didn't really live up to those standards. It was a perfectly nice restaurant, with decent service and an interesting menu. Some of our choices (the wild boar belly, pulled goat, tagiatelle with pork bolognese) were outstanding but others weren't so successul (a beet salad was...\n\n\nMore"], ["Favorite restaurant in DC!", 5.0, "November 12, 2013", "Lauren D", "Washington DC, District of Columbia", 7, 2, "We live in the neighborhood and keep coming back to Cashion's over and over again. It's so amazing! The food is outstanding, they have a great wine selection, and it's nice to see the waiters who have worked there for years. It is truly a special gem."], ["Nice brunch", 4.0, "October 27, 2013", "Alice P", "Washington, District of Columbia, United States", 66, 34, "I can't believe I haven't been here before. Lovely brunch place; great playlist and music not too loud. Portions are not huge but everything thoughtfully prepared. Even the New Yorkers we brought were impressed."], ["Great place for brunch too", 4.0, "September 17, 2013", "Paul C", "Chicago, Illinois", 237, 55, "Had an enjoyable lunch in their outdoor seating area. Food was creative and tasted very good. Excellent service. Was a bit more expensive than we thought because of the cost of mimosas."], ["Wonderful Food and Thoughtful Wine Pairings", 5.0, "September 4, 2013", "SleeplessInDC", "Washington, DC", 47, 17, "This is THE place in DC for a foodie looking for some gourmet comfort food. Professional staff are rare and this place takes pride in making you feel special and well-cared for. Perfectly balanced and seasoned dishes focus on seasonal, locally sourced produce and meat. The generous portions make for a relaxed, extended stay so plan on taking your time...\n\n\nMore"], ["Food has so many layers of flavor. Excellent service.", 4.0, "August 3, 2013", "schlrn", "Wilmington, DE", 11, 14, "I had the beet salad that I could have made a meal out of. However, I'm glad I did not. I had the steak that was cooked to a perfect temperature and the flavors, again, outstanding. This place is expensive, however, worth every penny if you enjoy really good food, flavored and excellent service."], ["A great bison steak!", 4.0, "July 27, 2013", "whollows", "Naples, Florida", 129, 29, "That's right - I'm a fan! A friendly and helpful maitre d'. Good service, nice ambiance and good food.\nI had a bad steak the night before so I was thinking of fish this night. When I mentioned this and asked the bar tender for his suggestion, he said the bison hanger steak would definitely make-up for it. He was...\n\n\nMore"], ["Decent Brunch", 4.0, "May 28, 2013", "xoxlilxmissxox", "Richmond, Va", 36, 11, "The brunch menu was limited but I did enjoy the poached eggs in a puff pastry, it was topped with a tomato base crawfish sauce served with collard greens. The brunch cocktails however did have an impressive menu, just as long as the food menu. I did enjoy the seating style facing the busy sidewalk. The service was a little...\n\n\nMore"], ["Fine Place for a Sunday Brunch", 5.0, "April 21, 2013", "dlosea", "Silver Spring, Maryland", 459, 149, "A super spicy Bloody Mary to start...eggs w/cured halibut, a dish of waffles and doughnuts divine. Cashion's is to be found in Adams Morgan, a unique part of DC that has something of the feel of West Broadway in Manhattan. We had a great time and closed the place down for the afternoon. Arrive on foot, cab or bus (don't...\n\n\nMore"], ["Good food, great service", 5.0, "April 8, 2013", "blink88", "Chicago, Illinois", 37, 15, "Cashion's is a good place to dine with friends or colleagues. The atmosphere is very lively, with an energetic, smart crowd. Food is good, with very interesting selections (in particular, the goat). What I would especially highlight is our waiter, who did a great job explaining dishes, was just the right degree of attentive, and generously offered a taste of...\n\n\nMore"], ["Nice place - great bar area", 4.0, "January 27, 2013", "kellyenz", "Washington DC, District of Columbia", 213, 45, "Fairly good Greek style food. Drinks were well made and the wine list very reasonable. The bar area was the highlight - it's raised up by the dining area - I think tat eating at the bar would be better than at the tables. Service was a bit average but we will be back. 120$ for two for dinner."], ["Better than Typical", 3.0, "January 23, 2013", "Dani24-DC", "Washington DC, District of Columbia", 44, 20, "We went for breakfast and the food was very good, but I felt the portions were on the small side and therefore over priced. The service was fine and the place was not too crowded, despite the hype that I expected. Better than the usual brunch faire but not worth the price tag."], ["Just ok", 3.0, "January 2, 2013", "tikidream", "bethesda, md", 388, 110, "We stopped in at the bar for a drink and declined appetizers due to the lack of food options. While our drinks were good, both the bar menu and restaurant menu are heavy on pork items, leaving little to choose from for a non-pork eater.\nThe bar and restaurant were not crowded, and we had an enjoyable drink before dinner...\n\n\nMore"], ["Lovely Sunday Brunch", 5.0, "November 20, 2012", "TLRand", "Pullman, Washington", 2, 0, "As a tourist who was just a little bit lost, I stumbled into Cashion's Eat Place in much need of coffee and something to eat, late on a Sunday morning. As soon as I entered the restaurant, I was made to feel completely at home. The meal was lovely, the coffee delicious, and the service was excellent. Prices were a...\n\n\nMore"], ["Last went over 15 years ago - the next visit will be sooner.", 4.0, "November 6, 2012", "gillraynut", "Bethesda, Maryland", 54, 15, "My wife and I had Sunday brunch there years ago and somehow forgot about it until we heard good things recently.This time it was a busy Saturday night with another couple and we were all pleased with the food and service we experienced. Our server was able to describe every dish we asked about in loving detail and although we...\n\n\nMore"], ["Good service, Good Food", 4.0, "November 5, 2012", "mmpaolo", "Falls Church, Virginia", 10, 4, "One of the best parts of our brunch last Sunday at Cashions was the outstanding bread -roll accompanying our basic eggs & scrapple and oyster poor boy with slaw dishes. Not a sourdough, more of a tuscan, the loaf was fresh, tasty and one of those meal highlights (like really good coffee) that puts an otherwise average meal a step...\n\n\nMore"], ["Great taste in good style!", 5.0, "November 5, 2012", "msnform", "Carlsbad, California", 9, 1, "Had a delicious and daring (for me!) meal of sweetbreads, lamb brain, and scallops.These three dishes were a delight! I'd never had brains before and am usually shy of offal however the most engaging Krishna encouraged me to try them and he was spot on! The textures and tastes of both the brains and the sweetbreads were enhanced by their...\n\n\nMore"], ["Fantastic meal from start to finish!", 5.0, "November 5, 2012", "d_hops", "Washington DC, District of Columbia", 41, 18, "The atmosphere, the food, the wine, the service - all impeccable, memorable and delicious. We ordered everything based on the suggestion of our server and were not disappointed by anything! Special note: the bison hanger steak was one of the best steaks I've ever eaten, and I had no idea smashed fingerling potatoes could taste so good. I'll be back...\n\n\nMore"], ["Schizophrenic not Eclectic", 3.0, "November 4, 2012", "Westpo", "Medford, New Jersey", 148, 45, "My wife and I ate at Cashion's on a weeknight with 2 friends from town who had heard great reviews. Unfortunately, the restaurant does not live up to it's reputation. First, the menu is trying to be New American but comes off at not knowing what it wants to be (heavy Greek influence with some southern mixed in). There is...\n\n\nMore"], ["Great Service...", 4.0, "October 25, 2012", "Alwayslooking2travel", "Minneapolis, Minnesota", 81, 31, "The food and service were fantastic. photos in the men's bathroom were a tad odd- small children!!??! Tight quarters with seating."], ["Excellent food and service", 5.0, "October 23, 2012", "bswolfman", "Washington DC, District of Columbia", 58, 11, "We went to Cashion's Eat Place tonight for my wife's birthday. The food was excellent, and the service was too. The food was well prepared and high quality. We had a wonderful mushroom and palenta appetizer and just about the best scallops we've ever had for our main course. The home made bread was great too. Pricey, but we knew...\n\n\nMore"], ["Trendy and Modern", 4.0, "September 23, 2012", "worldwide002", "Manchester, United Kingdom", 196, 52, "We sat at the bar for a pre dinner drink, very modern and chic, without being overdone. The menu looks very good, but isn't huge."], ["As good as it gets", 5.0, "September 17, 2012", "CDinDC20009", "Washington DC, District of Columbia", 90, 80, "Disclaimer: Cashion's is my favorite restaurant. Superior food. Extremely thoughtful young owners. Careful service. Really smart wine advice. Cloth napkins. Really terrific music selections. My impression over multiple visits is that they want the diner to be happy. No shortcuts of any sort. And you can talk to your dinner companions without yelling.\nNo headaches. Just good memories that keep...\n\n\nMore"], ["If your dating a foodie, Cashions is a great option", 4.0, "August 26, 2012", "TommyPfromDC", null, 18, 13, "Took a date to the place last night enjoyed a wonderful meal at the cafe out front. No reservation was necessary, and the staff was courteous and attentive. I glass fell and broke, and our wait-person made sure that those wearing sandals checked their feet, and that all of the shards were picked up. Then she recommended two wonderful fish...\n\n\nMore"], ["Great food and fantastic host", 5.0, "July 20, 2012", "ggtirevite", "Westfield, New Jersey", 66, 54, "We went to Cashions after reading some very good reviews, on a weekend trip into DC. This was our first stop after a four hour drive. As we didn't have a reservation, we sat at the bar where they serve the full menu.\nWhat a great choice. We were greeted by Krishna, a very jovial bartender/waiter. He took fantastic care...\n\n\nMore"], ["First Class Gem", 5.0, "July 14, 2012", "globetrotterjon", "Washington, DC", 56, 23, "Cashion's is no longer the fashionable rage it was when it opened some time ago, but it never fails to satisfy with upscale Southern cooking. The dishes are artfully executed, not overwhelming -- despite some intimidating sounding dishes like bison steak -- and very good value. The wait staff is friendly, helpful, and will guide you to the better menu...\n\n\nMore"], ["Delicious..delicious..delicious!", 5.0, "July 7, 2012", "AsianBelle98", "Washington DC", 194, 74, "Did I say delicious? We just got this dinner treat from Travel Zoo..the appetizers were excellent, we had the tuna and the fried soft shell crabs, also ordered the tomato salad with watermelon, a bit odd but it tasted so good. The entree was simply superb, dessert was to die for, even the coffee tasted great. Hard to get parking...\n\n\nMore"], ["My favorite restaurant in DC...can't be beat", 5.0, "June 26, 2012", "steff0566", "international", 175, 159, "I have been to Cashion's many times over the last 5 years and the latest visit lived up to my expectations. The restaurant is located at the 'sleepy end' of Adams Morgan and is deceiving since the cheesy sign out front screams 'DINER' but it is anything but. The restaurant has a lively little patio, a relaxing dining room and...\n\n\nMore"], ["Small but great", 4.0, "June 15, 2012", "ExPat0331", "Arlington, Virginia", 393, 122, "Cashion's is small, but the decor will fool you into thinking it's twice it's size with all the mirrors. I love everything I eat there. It's really good. I like to sit at the bar too for a less formal atmosphere."], ["Eat Place is THE Place!", 5.0, "June 9, 2012", "Colinc88d", "Ashburn, Virginia", 13, 8, "I bought a coupon for this place online after reading about it in the Washingtonian. After enjoying one of the best three course meals I have ever had in a very long time, I couldn't believe that I hadn't heard about it sooner!\nTwo things make a great restaurant- good food AND good service. Cashion's has both bases covered. Our...\n\n\nMore"], ["Cashion's to the rescue!", 5.0, "June 8, 2012", "AppliedAquinas", "Treasure Island, Florida", 50, 52, "The first time I ate at Cashion's was easily over a decade ago. It's certainly not for the nostalgia that I return, but for the consistently complete package of excellent food, relaxed atmosphere (which easily accommodates jeans or a suit), and familiar service. I generally take new DC-arrivals to this solidly great restaurant for a \"welcome meal\". The double-edged sword...\n\n\nMore"], ["great DC spot", 5.0, "May 30, 2012", "jcrowne", "Fairfield, Connecticut", 60, 21, "excellent variety in menu and wine list, professional service in a trendy area (Adams Morgan) highly recommended"], ["consistently good!", 4.0, "May 28, 2012", "citygirl4evah", "silver spring, md", 28, 13, "Cashion's is located in the slightly 'nicer' section of Adams Morgan in DC - so outside dining is pleasant and relaxed. Reminiscent of elegant establishments of years past, it is a dressy casual restaurant. The menu changes with the seasons - seafood is always good, and the salads and appetizers are interesting and tasty. The bartender knows how to mix...\n\n\nMore"], ["Very good food - service just ok", 4.0, "May 22, 2012", "TRVLALOT_9", "Trenton, New Jersey", 54, 42, "I highly recommend Cashion's for the food. Very interesting menu items that are increadibly well prepared. I only wish that the service was as good as the food which would make this place outstanding. I had a veal liver appetizer and the bison steak for my entree. Both were great."], ["The worst dining experience ever!", 1.0, "May 19, 2012", "tennisplayer1", "washington dc", 16, 8, "Let me start by saying that I have never wirtten a negative reviiew on a restaurant in my life. But this was the worst experience I have ever had in any city in the world. The problems started immediately. Atfer we were seated, I asked the waitress for a light since the place was very dark. She said they didn't...\n\n\nMore"], ["Great food, great service, only downside--parking", 5.0, "April 24, 2012", "CookWashingtonDC", "Washington, DC", 143, 69, "We met a couple who have this as their special place. It is wonderful. We all had great meals and experienced great service to include plates that are hot to keep the food warm. I had the Mushroom and Crab Crostini, as did my friend, the mushrooms were delicious and the crab added an extra taste. I had the Dorade...\n\n\nMore"], ["servers think you owe them a favor", 2.0, "April 15, 2012", "dcor5", "Port Crane, New York", 42, 11, "Very snotty service! Try get waited on and it takes hrs, no one seemes to want to do any work. When we finally ordered, my chicken came under cooked (raw in the middle) another person at our table's beef was also so raw you could hear it moo. Mine was taken back and when cooked correctly was very good. The...\n\n\nMore"], ["Great Staff", 4.0, "April 11, 2012", "Wayngel", "Washington DC, District of Columbia", 4, 0, "Stopped in for a late night drink and some nibbly bits. Ate & was merry. Left very happy."], ["Very Noisy", 3.0, "March 27, 2012", "diane28970", "Washington DC, District of Columbia", 65, 29, "We went to CAshion's on a Friday night. It was packed and so noisy we could barely talk to our friends. The food was very good, but it took over an hour for us to be served and during that time our waitress never came back to the table to reassure us that food was on the way, or give...\n\n\nMore"], ["Inventive, cozy... excellent", 5.0, "March 8, 2012", "Frmrswife", "GA", 54, 38, "Our first time at Cashion's, and it was delicious. I had the sweet potato soup (with a kick) and a new dish - grilled lamb. I'm really not a fan of lamb normally, but I thought it looked good and it was! The sides that came with it were also divine - a greens and split pea mix with feta...\n\n\nMore"], ["Don't try the tasting menu", 3.0, "March 3, 2012", "Sonny844", "Alabama", 98, 24, "The tasting menu was only available if every one at the table had it, this was a problem because one of our family doesn't eat red meat due to allergies, the server and management were totally inflexible about substituting and thing for the red meat and were indignant that we would even ask. The food which we were able to...\n\n\nMore"], ["Try the Tasting Menu with Wine Pairings!", 5.0, "February 26, 2012", "MDMomof3", "Bethesda, MD", 137, 67, "We recently had the tasting menu and absolutely loved the food. It consisted of about 6 courses -- braised short ribs, ahi tuna, and other wonderful dishes. For each course, the sommelier poured a generous pour of a wine specifically paired with the dish. The pairings were really masterful. The wines really brought out the flavors in the food (and...\n\n\nMore"], ["Nice neighborhood place", 4.0, "February 4, 2012", "slj101", "Washington DC, District of Columbia", 69, 19, "I tried the fish, which was good. It sat upon a smallish layer of mashed potatoes and a layer of wilted spinach. The potatoes were incredibly rich and smooth, and the spinach was excellent.\nMy companion ordered an off-menu vegetarian plate that was stupendous! The spaetzle was a favorite on that plate, and the green bean medley was also very...\n\n\nMore"], ["Cozy neighborhood place for foodies", 5.0, "January 18, 2012", "cvdhmd", "Chapel Hill, North Carolina", 102, 34, "Two brothers man the kitchen and bar of this delicious romantic place. Goat cheese souffle, veal sweetbreads with spinach, goat liver with squash puree, and spit roasted pulled goat with black eyed pea salad were some of the unusal perfectly cooked dishes. Finished with a salty chocolate caramel tart. Lots of great wines by the glass and George gives good...\n\n\nMore"], ["Good Service, Great Flavor", 4.0, "January 11, 2012", "brmusicman", "Chicago, Illinois", 916, 489, "It had been years since I visited Cashion's for dinner, but I went with a friend recently. I was impressed -- it's certainly one of the best restaurants in the Adams Morgan area of DC, with an innovative menu that really shows off flavors. The dining room is casual, but cozy enough for a special night. No complaints about the...\n\n\nMore"], ["Innovative Menu", 5.0, "December 6, 2011", "megwalker87", "Washington DC, District of Columbia", 46, 18, "Lovely, innovative menu. I had the pork hash, while others in the group had waffles and bison buger. They also serve warm, fresh bread to start.\nThe atmosphere inside is cozy and welcoming.\nThe service is very good - our coffees were always full, and food did not take too long to come out.\nI recommend making reservations at opentable.com....\n\n\nMore"], ["They Let our Dog Sit Outside", 5.0, "October 6, 2011", "JugglerrelgguJ", null, 15, 5, "A wonderful find in Adams Morgan. They allow dogs (on the patio), and the menu is local and changes daily."], ["Another restaurant I have been going to for years - 2 thumbs up", 4.0, "October 3, 2011", "Incabod", "Grecia, Costa Rica", 43, 23, "Not much for reviews I am finding that I am doing more and more of it these days. Forgive the lateness of some of them....\nWhat can you say about Cashions... Excellent food, service and a lively atmosphere. I do not eat much steak in life but I always break that rule when it comes to this place. Melt in...\n\n\nMore"], ["This is the best food in Adams Morgan...perhaps DC.", 5.0, "September 30, 2011", "dammarell", "Washington, DC", 3, 2, "The menu changes frequently. The artistic combinations of flavors can only have been thought up by a clever person who enjoys cooking. The fish is never over done. The pastry selection is world class and imaginative. The wine list is top notch. We locals love the place.\nAnne"], ["Friendly restaurant in Adams Morgan also has inventive food.", 4.0, "September 12, 2011", "S6usanne", "Key West, Florida", 56, 28, "This restaurant was an easy walk from the Washington Hilton, and a world away from the touristy crowds on Connecticut Avenue. The food was very good-- mostly of the American meat and potatoes type, but with a European touch of creative sauces. Sit outdoors if weather permits, and enjoy the sense of being in a pleasant, leafy neighborhood, among friends."], ["A Special Experience", 5.0, "August 8, 2011", "Ninjaneer1", "Centreville, Virginia", 121, 199, "We have been to Cashion's before and always been pleased, but this particular visit was memorable. From the moment we arrived, we were treated like VIP's by the friendly and professional staff. The menu changes daily so there is no chance of being bored with a return visit. We had a marvelous shrimp appetizer that one of the owners (Justin)...\n\n\nMore"], ["I'll be back!", 5.0, "June 29, 2010", "JohnL41", "North Carolina, USA", 6, 4, "Excellent, imaginative food. Lovely use of watermelon in a picture perfect green salad. Among the best gumbo - warm, as in spicy - I have ever had and I have had gallons in N.O and elsewhere across the years. Less noisy inside than other eateries in Adams Morgan, which by the way is an interesting and fun neighborhood - definitely...\n\n\nMore"], ["Excellent Food, Uneven Service", 4.0, "June 14, 2010", "STYLEONTHEGO", "New York City, NY", 342, 108, "The quality of the food and the preparation are what this place is all about. Inventive and unique dishes are well represented on the eclectic menu. While seafood is the most featured item, there are numerous lamb and duck dishes as well. The service, however, is slow when it comes to the kitchen delivering the food. The waiters and bus...\n\n\nMore"], ["One of my favorite places in the city.", 4.0, "June 2, 2010", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of my favorite places in the city."], ["Over-priced, over-hyped; in fact plain over.", 2.0, "April 8, 2010", "Northers", "Bristol, England", 6, 3, "Fish with sweetcorn and radishes?! I swear you couldn't make this up. Some random salad leaves, some beetroot, a small amount of mozzerella and some nasty pippy pomegranate bits. Dull, dull, dull. Whatever this restaurant once was it surely is no longer. The waitress was nice; the bill was ridiculous. I went because it had a good review in my...\n\n\nMore"], ["Meh", 2.0, "April 5, 2010", "LCrumley86", "Augusta, GA", 15, 7, "The menu was so limited for brunch, I'd say about 10 options, that we walked out. And out of those 10 options I'd say only 2 were breakfast and only 1 was vegetarian friendly!"], ["I expected more.", 3.0, "September 24, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I expected more."], ["Went for brunch and was...", 4.0, "February 22, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Went for brunch and was not disappointed. My eggs were great. I finished and still wanted more. Great banana bread too."], ["great brunch spot.", 5.0, "August 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great brunch spot."], ["Wholly unimpressive.", 2.0, "July 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Wholly unimpressive."], ["Too loud at times, and food is creative and tasty almost all the time. Breakfast is memorable.", 4.0, "July 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Too loud at times, and food is creative and tasty almost all the time. Breakfast is memorable."], ["favorite neighborhood fine dining restaurant with great late night bar food and drinks.", 4.0, "June 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "favorite neighborhood fine dining restaurant with great late night bar food and drinks."], ["Not cheap, but worth every penny. Excellent atmosphere with a creative menu in D.C.s swankiest neighborhood.", 5.0, "June 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Not cheap, but worth every penny. Excellent atmosphere with a creative menu in D.C.s swankiest neighborhood."], ["Is this stillopen?", 4.0, "May 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Is this stillopen?"], ["Excellent food, not cheap.", 4.0, "May 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent food, not cheap."], ["Great food and Wine.", 4.0, "May 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great food and Wine."], ["Shrimp and Grits were rediculous", 4.0, "May 7, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Shrimp and Grits were rediculous"], ["so good, so expensive", 5.0, "April 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "so good, so expensive"], ["An old favorite. FOod is...", 4.0, "April 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "An old favorite. FOod is consistent and has new chef. Small and crowded"], ["Cashions, in Adams Morgan. Very good food & wine list. The food is influenced by southern cuisines, but has a...", 4.0, "April 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Cashions, in Adams Morgan. Very good food & wine list. The food is influenced by southern cuisines, but has a modern spins."], ["Great food using whatever is fresh. Truly American cuisine, and always creative.", 5.0, "March 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great food using whatever is fresh. Truly American cuisine, and always creative."], ["Pricier good eats in the...", 4.0, "March 11, 2008", "avrussell", null, 28, 3, "Pricier good eats in the local zone"], ["I would say one of the best neighborhood spots in Washington, DC and it only improves over time...excellent food and...", 5.0, "March 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I would say one of the best neighborhood spots in Washington, DC and it only improves over time...excellent food and wine selections."], ["A little expensive for what it is", 4.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A little expensive for what it is"], ["love this place small fun and always good food", 5.0, "February 3, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "love this place small fun and always good food"], ["Fun, but ok.", 3.0, "February 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fun, but ok."], ["Eggs benedict here is just okay. Place is not that clean.", 3.0, "January 19, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Eggs benedict here is just okay. Place is not that clean."], ["One of my favorites in the city. Try to sit near the kitchen where you can view the chefs prepare your food. Menu...", 5.0, "January 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of my favorites in the city. Try to sit near the kitchen where you can view the chefs prepare your food. Menu changes daily using fresh ingredients of the day."], ["Lovingly prepared and presented food in a once-cool neighborhood now overrun but frat boys and exurbanites.", 2.0, "January 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Lovingly prepared and presented food in a once-cool neighborhood now overrun but frat boys and exurbanites."], ["Need some Vegan food!", 3.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Need some Vegan food!"], ["another top joint, great...", 4.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "another top joint, great food, good locations, great int he spring and summer as you can eat outside"], ["Love love love it here.", 3.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love love love it here."], ["I love cashions. I love...", 5.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I love cashions. I love a good neighborhood joint that could command pretention but decides to do otherwise. Food is always playful while being extremely refined. Bar service is wonderful too even if you just want a good glass of vino or a cocktail."], ["Delicious and quite pricey.", 5.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Delicious and quite pricey."], ["Serves a nice brunch, but it's small and tends to be crowded.", 4.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Serves a nice brunch, but it's small and tends to be crowded."], ["expensive but creative and delicious", 5.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "expensive but creative and delicious"], ["Great food and great atmosphere but somewhat expensive.", 3.0, "December 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great food and great atmosphere but somewhat expensive."], ["Not cheap.", 5.0, "December 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Not cheap."], ["A must eat!", 5.0, "December 25, 2007", "GruboRyba", "Boston, Massachusetts", 12, 15, "What a great place! The waiter was friendly, attentive, and knowledgeable. The wine list was limited, but the recommended wine was perfect with my meal. The meal began with Gumbo and Cockles as appetizers...both were excellent. The entrees at the table included a divine bison with a gorganzolla wine reduction sauce that was cooked to perfection as well as wild...\n\n\nMore"], ["the bar offers the best...", 3.0, "December 23, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "the bar offers the best views in the restaurant"], ["decent, meh.", 2.0, "December 21, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "decent, meh."], ["Good food; May not be a...", 3.0, "December 21, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good food; May not be a lot of vegetarian choices on the menu. But don't hesitate to ask the server if they can prepare the meals vegan style."], ["Romantic. Tasty.", 5.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Romantic. Tasty."], ["have not been in years... but when i did go I liked it", 3.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "have not been in years... but when i did go I liked it"], ["Similar to Komi. Great seasonal dishes and great atmosphere. If you don't want to spend a lot of money, try their...", 4.0, "December 1, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Similar to Komi. Great seasonal dishes and great atmosphere. If you don't want to spend a lot of money, try their brunch. It's not as pricey as their dinners but very good."], ["Great wine list, unique...", 4.0, "November 29, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great wine list, unique and ever changing menu"], ["People seem to love this...", 3.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "People seem to love this place but I found it pricey and middle of the road. Very meat-heavy menu."], ["Sublime food with wonderful friendly service - Great surprise!", 5.0, "October 28, 2007", "Matars_Z", "Washington DC", 311, 455, "I recently had one of the absolute best meals I have had in DC at this resaturant. Our waitress was a lovely woman from Austin who was attentive all evening, without being push or bothering us, and we really had a perfect meal. Our goat cheese souffle appetizer was simply sublime. The duck I had was cooked PERFECTLY, with the...\n\n\nMore"], ["Awful Service.... decent food", 2.0, "October 1, 2007", "arainbow", "Washington, DC", 2, 3, "Service was HORRENDOUS. I had made a reservation and when we walked in the door, I saw a great table right between the window and patio area. I immediately asked the hostess if we could have that table. She RUDELY told me it was \"reserved.\" I explained that I had a reservation, but she promptly directed me toward a table...\n\n\nMore"], ["Disappointing Dinner", 2.0, "May 17, 2006", "berrigad", "usa", 8, 2, "Nice decor, attentive but slightly rude service, bland and overly salted food. All in all, we will never go back to this restaurant and certainly won't recommend it to friends. If you do end up there, the crab cakes and the quail appetizer were ok. This place is pretty expensive so one expects better...."], ["Great place for dinner", 5.0, "January 18, 2006", "fakename", "Alexandria, Virginia", 6, 19, "Cashion's is a nice place to enjoy a wonderful meal by a great chef. Ann Cashion has been cooking some of the best fish dishes in DC near the corner of Columbia Road and 18th Street for the past 10 years. I've eaten their often and have never been disappointed in the least. You can get a quiet table and...\n\n\nMore"]]]]