[["Bar Pilar", [["Top notch", 5.0, "September 7, 2015", "Dianah R", "Oakland, California, United States", 269, 92, "Excellent drinks, cool vibe and great eats! We had a few appetizers and left to eat elsewhere where we were very disappointed. I wish we would have just stayed there for dinner to enjoy more of their delicious food."], ["...great place to celebrate a friend's b'day.....", 5.0, "August 20, 2015", "Giorgio G", "Washington DC, District of Columbia", 72, 14, "i had not been there in at least three years, and i was glad to find that the same creativity that was there a few years ago is still there, so visible in the dishes served... while not everything was stellar (the avocado was pretty unripe and that was a setback for a dish of great potential) most of the...\n\n\nMore"], ["Unbelievably Horrible", 1.0, "July 14, 2015", "adventuregirl62", "Worldwide Traveler", 151, 86, "Biggest disappointment on 14th. Everyone talks how great this place is ... we don't get it. We've stopped in here twice in the past two months. Sat at the bar both times. Ignored on both occasions. Bartender too busy chatting with friends to pour a beer; so we never get the chance to order food. What a waste of a...\n\n\nMore"], ["Favorite Bar in DC", 5.0, "July 13, 2015", "Silvia D", "Washington, DC", 3, 1, "Best place in the area to meet up for drinks. The bartenders are great and super enthusiastic about creating new drinks. I've asked for a cocktail based on a certain spirit or flavor several times and never been disappointed. I love the dark wood of the bar and the decor of the place and the music selection is always changing...\n\n\nMore"], ["excellent drinks and small plates", 4.0, "June 18, 2015", "nac212", "New York City, New York", 18, 9, "I came here on a warm Friday night, and I arrived 30 minutes late to a reservation. They graciously held our table, which was unexpected and awesome. Service was very friendly, and our waitress in particular was suggestive and personable.\nI had several of the same cocktail, piñata something? Gin and yuzu. Not too sweet. Fruity but not headache inducing....\n\n\nMore"], ["Love this place", 5.0, "June 6, 2015", "Michael H", "Washington DC, District of Columbia", 26, 6, "Lots of good seasonal choices for taps and drinks. The servers are very helpful with recommendations. I recommend getting in early and waiting for a table at the bar or getting reservations."], ["Cute dinner", 4.0, "May 2, 2015", "Aburel", "Bucharest, Romania", 574, 271, "More a tapas place. Nicely decorated and serviced. Food was good but portions small. Delicious salads, ceviche, fish. The asparagus salad was great. The wine list and the cocktails were balanced. Atmosphere was very enjoyable."], ["Awesome; Can be a Quiet Candelit Date or Loud Friday Night", 4.0, "April 15, 2015", "Sahra S", "Washington DC, District of Columbia", 9, 3, "So I've been to the Hemingway themed Bar Pilar more than a handful of times. I've been for brunch (their hangover bowls seemed to help!), a weekday date night set to candlelight and delicious cocktail recommendations, after work drinks and snacks with friends, and most recently on a Friday night with parents in tow (quite possibly my worst idea; one...\n\n\nMore"], ["Enjoyable dinner experience", 4.0, "March 21, 2015", "VanNessVoyager", "Washington DC, District of Columbia", 105, 88, "A group of 5 of us visited Bar Pilar on a Friday night. The tapas are good, albeit a bit expensive when you start to order a few each. We especially liked the potatoes (they might only be available as a special for their 10-year anniversary celebration - a pity!), the brussel sprouts (delicious!) and the mushroom (wish I had...\n\n\nMore"], ["Great food and atmosphere", 4.0, "February 3, 2015", "finny123", "Tshwane, South Africa", 105, 79, "We were upstairs...downstairs might be different scene due to the bar but it was cosy and not too noisy. The menu is very unique, tapas-like with a twist. The portions are small so you need to take 2-3 dishes each but it's priced well so it doesn't pinch too much. Definitely a \"younger set\" but we were 4 all over...\n\n\nMore"], ["Aggressive, Condescending, Rude. Go if you want to be treated poorly.", 1.0, "December 17, 2014", "Van H", "Washington, District of Columbia, United States", 1, 1, "I'll be honest, I've never written a review of a restaurant (or any other business for that matter) in my life. I've experienced bad service, but coming from the customer service sector, I always like to give the house the benefit of the doubt.\nWith that said, I am writing this review now because I am so offended by Bar...\n\n\nMore"], ["Hidden gem!", 5.0, "October 14, 2014", "Newport L", "Newport, Rhode Island", 18, 10, "First time to DC, friends suggested Bar Pilar before we headed to a concert at the 930 Club...we plugged in the address into our phone and when it said we were there...we didn't believe it, thought it was closed but good thing we tried the door. It looks like a dive bar but has some of the best service and...\n\n\nMore"], ["Great place!", 5.0, "October 1, 2014", "pandzillophon", "Berlin, Germany", 9, 7, "Try the gnocchi. Great staff, good food, cool drinks! Loved the music and the friendly barman upstairs. Totally recommended."], ["A standout on 14th Street!", 4.0, "September 21, 2014", "Ant0ni01985", "Seattle, Washington", 18, 15, "Bar Pilar is often the exception to the rule on 14th Street as of late - the food and service are outstanding and the drinks are among the most creative and appealing anywhere in DC. The snacks and antipasti that we sampled were great - definitely try the duck prosciutto! For entrees we both sampled the fish options - the...\n\n\nMore"], ["A peaceful Sunday brunch", 4.0, "July 13, 2014", "brucetaylortravels", "Madrid, Spain", 162, 90, "We came here for our last meal in DC before catching the flight home to Madrid. It was less crowded than Ted's Bulletin which had a 45 minute wait for a table.\nBar Pilar we were told by a local (our daughter !) is more of a night spot and only opens at 11 am on a Sunday. Upstairs is...\n\n\nMore"], ["Great happy hour with local brews", 4.0, "July 6, 2014", "mlibed", "Hoover, AL", 15, 5, "Fun find! Very different vibe from other places in DC. Although my colleagues and I stuck out in our business attire, the hipster staff was great. Within minutes of sitting down our waitress was bringing us tastes of the local brews on taps. And they were as unique as they were delicious! Also enjoyed several small plates to share. Highly...\n\n\nMore"], ["Bar Pilar", 2.0, "April 6, 2014", "Michael L", "Arlington, Virginia", 68, 6, "While walking the 14th/U Street area, I discovered a place for a beer, Bar Pilar. You really have to find it squeezed in between other small places. It has two floors and for Saturday afternoon, it was very crowded. A younger adult crowd engaged in animated discussions with sports on the few TVs. They have several crafted beers. I tried...\n\n\nMore"], ["Favorite Bar In DC", 5.0, "January 4, 2014", "KABC1980", "Washington DC, District of Columbia", 35, 11, "Favorite bar in DC. Been going for years, great service with a nice local neighborhood feel which is becoming harder to find in DC. Small plate menu which is always changing but always excellent, pork shoulder is a must. Nice bottle and draught selection with interesting cocktails. Great decor especially if you are a Hemingway fan."], ["Between a 3.5 and 4 Stars", 4.0, "December 22, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I wish there is a 3.5 star rating, but there isn't, so I will give it a 4, because both the hostess and waitress were friendly and helpful. I fount his place via one of the food blog I visit from time to time. I made a booking via Cityeats, which I don't normally use. The hostess was very friendly,...\n\n\nMore"], ["You will leave hungry and broke", 2.0, "November 8, 2013", "W t", "Washington, DC", 3, 3, "The food is very hit or miss. Their autumn plates like pumpkin have absolutely no flavor to them and the small plates are SMALL (3 bites) and very overpriced. The drinks are expensive too. Grab a burger beforehand. The atmosphere is nice."], ["Good service, ok food.", 3.0, "October 27, 2013", "david717", "Washington DC, District of Columbia", 73, 13, "We were a party of six on a Saturday night. Wait staff was attentive, menu wasn't very extensive but was reasonably priced. We shared some small plates to start and the portions were actually quite generous. Loved the building, narrow row house with lots of exposed brick. Very cozy. My major complaint was that, at least upstairs where we ate,...\n\n\nMore"], ["Great place to meet friends for Happy Hour", 5.0, "September 12, 2013", "Connie P", "San Antonio, Texas", 61, 18, "This is a great place for happy hour. Their appetizer menu is unusual and varied. The service was great and the staff was most accommodating--not easy since we had a large group. Very service oriented and friendly.\nAs a single woman, I would feel comfortable stopping in for a drink alone. Not many places you can say that about in...\n\n\nMore"], ["The pork shoulder is a must", 4.0, "July 16, 2013", "Cyanicdelphis", "Seabrook, Maryland", 18, 13, "First things first, bring at least 3 people with you if you go, that way you get to try at least 6 of the many amazing dishes they have at Bar Pilar. Some of our favorites: pork shoulder (so good we ordered it twice), fried buttermilk chicken, grilled asparagus, deviled eggs, heirloom tomatoes, and homemade chocolate toffee bars. Some of...\n\n\nMore"], ["dissapointed", 2.0, "May 19, 2013", "Petisita", "Washington, DC", 59, 65, "I used to be a solid guest to this place when I was local and when it was just a small bar. Now it has expanded adding a 2nd floor with a full bar. The food was simply not good. I wouldn't say terrible, but just not up to all the buzz. I ordered a \"lightly sauté\" vegetables which actually...\n\n\nMore"], ["Perfect balance of cuisine, ambiance, hipster, and fun!", 5.0, "May 8, 2013", "flygirlclb", "Annapolis, Maryland", 6, 4, "In the newly revived 14th street area of DC, this restaurant was a gem!! The owner, staff, and clientele were just what we were looking for....being a diverse group of mature, professional women, who still seek the artistic side of every scene! Some of us travel internationally quite a bit, some are close to professional chefs, and our bar is...\n\n\nMore"], ["Ok overpriced food with bad service", 2.0, "April 8, 2013", "pnmar5h", "New Orleans, Louisiana", 8, 3, "Food was ok, not bad, but not great. Server seemed to be hungover from previous night or otherwise just oblivious to anyone and any requests anyone had."], ["Great small bites", 4.0, "March 13, 2013", "Cstueart", "Siena, Italy", 20, 9, "On a business trip, I had dinner alone here one night. I sat at the bar and had mushroom soup, grilled octopus, and pork shoulder. All were cooked perfectly and delicious. I also benefited from happy hour deals on a cocktail and wine. My only complaint would be that the seats at the bar are packed very tight, they could...\n\n\nMore"], ["Great atmosphere", 4.0, "February 18, 2013", "pbgvluv", "Washington, DC", 119, 37, "My husband and I stopped in for a drink - can't comment on the food. We sat at the bar, and the service was good. The place has such a unique feel - antiquey, dark, glam. Very Ann Rice feeling - vampireish maybe? Not too loud. Fun place to enjoy a cocktail."], ["Great time", 5.0, "January 8, 2013", "Jason K", "Exeter, New Hampshire", 189, 94, "We went there to meet friends who have lived in the neighborhood for a few years. They go here for a bite to eat and drinks a few times a week, but rarely on weekends, tonite was Saturday and it was packed. We had a nice table and the noise level was good to talk and the atmosphere was nice....\n\n\nMore"], ["A favorite hideaway on 14th", 5.0, "January 4, 2013", "J C", "Washington DC, District of Columbia", 41, 15, "Even as the neighborhood gets increasingly trendy, Bar Pilar remains true to its low-key start as a favorite locals' bar."], ["Cool place.", 3.0, "November 30, 2012", "Houdini666", "Pittsburgh, PA, USA", 42, 14, "Rad spot in a cool neighborhood. They weren't very busy when we got there. We sat at the bar. Ordered 2 drinks and a shot. The bartender forgot the shot until we were putting on our coats. Seemed like we would have gotten better service if we were locals like the other patrons. We left....you'll have that......I won't, but you...\n\n\nMore"], ["Good Food but Loud!", 4.0, "April 23, 2012", "labrescue", "Washington, DC", 6, 4, "Great food, Great Service ... just be prepared for a loud bar/restaurant. We were having dinner w/friends that we had not seen in a while and we literally had to SCREAM almost to talk to one another. Again, I'll go back but maybe earlier so I can actually hear who I am having dinner with.\nAlso, pork shoulder. Its not...\n\n\nMore"], ["It felt like an April Fool's joke...", 2.0, "April 12, 2012", "brlnyc82", "New York", 20, 3, "Where to begin... I guess I should start out by saying whenever you go to restaurant where they have the stones to serve a $25 plate of pasta, there are certain expectations...\nWe ordered a couple glasses of wine, and waited, I kid you not, a solid 25 minutes for them. A second glass of wine took another 15-20 minutes...\n\n\nMore"], ["Great tapas", 4.0, "August 1, 2011", "Grebnevaagain", null, 51, 35, "Love the tapas here! Extensive wine and beer list. Can be loud and hot during the summer, but still a great place to hang out"], ["Food was awful, drinks were great", 2.0, "March 9, 2011", "MikeMfromWashDC", "Washington, DC", 148, 89, "This is not a restaurant. Do not go here if you are looking to eat. The menu is full of ridiculously \"fused\" dishes, high on pretension, but low on taste and value. Eat elsewhere first."], ["Cool bartenders. Drafts...", 3.0, "April 19, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Cool bartenders. Drafts were great but there were only five or six available. Seemed like a cool scene for the Logan/Dupont crowd."], ["Perfect pub scene. Food...", 4.0, "August 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Perfect pub scene. Food is strong too (sometimes a little salty)."], ["Excellent food and great...", 4.0, "May 13, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent food and great atmosphere. Small, but cozy."], ["Great drinks..amazing non-Spanish tapas! Really great old world vibe.", 5.0, "April 4, 2008", "Amanda B", null, 4, 2, "Great drinks..amazing non-Spanish tapas! Really great old world vibe."]]], ["Subway", [["subway washington", 4.0, "October 6, 2014", "suzanneb313", null, 11, 6, "Fairly easy to access machines for tickets, cash or debit or credit card. Travellers willing to help. Conductor announces each train station. Connecting train lines are a little challenging but staff behind glass can help you."], ["Good!", 4.0, "August 19, 2014", "Momoftwo711", "Round Rock, Texas", 49, 36, "Just like our Subway at home. Sandwich shop w/ multiple choices. Clean restaurant and friendly staff. Affordable in expensive DC."], ["Why Subway is so Popular", 4.0, "July 18, 2014", "Dan R", "Kensington, Maryland, United States", 33, 14, "If you've never been, be ready to be surprised at the variety of meals you can buy, it's not just about classic subs. The bread is dependable, the portions generous, the staff efficient."], ["Fast service", 5.0, "August 23, 2013", "NewjerseyCaracol", "New jersey", 60, 37, "The staff is very helpfull but you do have to pay $5 to get the card and then you add the fare, this is not a good thing for tourist"], ["Metro", 5.0, "July 22, 2013", "Juan C G", "Tucson, Arizona", 6, 1, "Oh what a delight; get off the plane; a short walk and presto get off across the hotel. That is the way it should be in all large city. Great!"]]], ["National Academy of Sciences Cafeteria", [["good", 4.0, "June 5, 2015", "Edward M", "Lawrenceville", 14, 2, "regular short order don't expect much food is ok but a shade above BK and Dairy Queen but not nearly as efficient as McDonalds. Somewhat pricey so workers must be union and not into production at all more like snails pace. Used to be better 10 years ago."], ["A great value and setting", 5.0, "April 22, 2015", "Kim T", "Washington DC, District of Columbia", 126, 33, "This is a cafeteria in a secure facility, so not open to the general public. Prices seem subsidized. Food has been good in my experience, and the setting is a pleasantly furnished and day-lighted central court."], ["Nice spot", 5.0, "April 21, 2015", "JTB1239", "Washington DC, District of Columbia", 14, 9, "The southern part of Foggy Bottom near the Mall is a culinary wasteland, limited even in fast food options except for the food trucks. This is one of the few USG building cafeterias that is open to the public (as of 12:45). It's quiet and comfortable, and always features two interesting and well-prepared entrees that change each day along with...\n\n\nMore"], ["Nice, cheap food", 4.0, "April 10, 2015", "Morten O", null, 8, 6, "Exellent food for a nice price! This is in a canteen and therefor it is not the best looking place, but the food is great and that is absolutely the most important part!"], ["Very decent", 3.0, "December 2, 2014", "L G", "Washington DC, District of Columbia", 10, 2, "Had a variety of vegetarian options; better than most cafeterias, especially if you're at the academy for other reasons but not a space to seek."], ["Very convenient for those around the area that want to have a lunch", 4.0, "January 17, 2014", "darwinsail", "Washington DC, District of Columbia", 379, 305, "It is the cafeteria for the employees and visitors of the National Academy of Sciences. They open to the public at 12:45 pm and close at 1:30 pm. They serve hot plates, salad bar, and sandwich bar in a workplace cafeteria environment surrounded by nice Japanese art Work. After or before a visit to the Academy, including its different historical...\n\n\nMore"], ["very nice place!", 5.0, "April 17, 2013", "Pitboy", "Miami", 26, 10, "Love the place, awesome view and near the ice skate place, nice food and very chic, the service is really nice, also is a nice place to hide for the cold wheather when it gets too cold outside on winter times.\nyou won't be dissapointed!"]]], ["Chipotle", [["Fab", 5.0, "April 29, 2015", "tinytrace", "Swansea, United Kingdom", 242, 102, "First visit to a chipolte and decided to go here as the queue the previous night was out the door! It did not disappoint. You chose what you want a bowl or burrito and u think there was other options then what fillings you would like. Super filling, super tasty. Well worth a visit! We want one in the UK...\n\n\nMore"], ["Delicious mexican food", 4.0, "June 17, 2014", "cassully", "Florida", 51, 11, "This restaurant service organic food and has very thing healthy including the meat they choose. It is a great place to get lots of healthy good Mexican style food in a hurry. It setting is casual with disposable dinner ware or take out. It is definitely on my list to return to."], ["good and healthy fast food", 5.0, "December 1, 2013", "B L", "Den Bosch, The Netherlands", 78, 24, "Yes this is fast food. But it is a healthy fast food concept. Goed taste. Vegetables.\nAnd a good vibe at the staff\nIf you're in a hurry and you want some healthy food. This is the place to be."]]], ["No. Ten Thomas Restaurant", [["Cozy and charming. Hotel from 1965 :) Some history here...", 4.0, "September 1, 2015", "Anatoliy I", "Buffalo Grove", 14, 3, "We liked our breakfast buffet after a morning run, it was pretty good, I would say better than normal. Fresh squeezed juice load us with some energy. There are few types of buffet, so see what option works."], ["Food was average", 4.0, "July 17, 2015", "Sue S", "Warriors Mark, Pennsylvania", 24, 4, "While the hotel presented a menu that was varied and appealing, the food was only above average. I had the meat lasagna and the top was burnt so I could not eat it. I also ate the salted caramel cheesecake which was tasteless. The second day I ate there the food was better - the creme brulee was delicious. I...\n\n\nMore"], ["Decent food but not the best service and would stay away.", 2.0, "July 15, 2015", "Stephy3026", "Manalapan, New Jersey", 67, 37, "I came to this restaurant on Monday afternoon to have lunch with my 2 year old son and to kill time since I just checked out of my hotel room and was waiting for my husband to finish with his business work. When I arrived in the restaurant I was greeted by a polite older man and was taken to...\n\n\nMore"], ["Excellent Comfort Food", 5.0, "July 10, 2015", "Kristian3107", "Palm Cove, Australia", 4, 1, "Simple, in hotel restaurant that is very good. My family enjoyed meat, seafood and pasta dishes from the menu. These were the sort of meals that you are longing for if you have been travelling for some time. Generous portion sizes, fresh and well cooked. This place is worth finding."], ["A dining experience that you will remember as one of the best.", 5.0, "June 15, 2015", "sarajeck", "Portland, Oregon", 8, 1, "Our hostess from Denmark was most gracious. Our server, India, met our every request with topnotch professionalism while making us feel at home. We had fish and chips that were lightly battered and flaky. The fish tacos were hot and spicy and delicious. Who would think that a wedge of sald with fresh blue cheese dressing and bacon could taste...\n\n\nMore"], ["Slow service", 3.0, "June 14, 2015", "SPKinVA", "Reston, Virginia", 259, 68, "We sat at a table outside by the pool for about 20 minutes and were never waited on. We went to our room and changed and ate inside hoping to get better service. Inside service was slow. Other tables were offered bread. We were not asked if we wanted bread. We had to wait forever to get our check. Next...\n\n\nMore"], ["Big portions/slow service", 4.0, "December 31, 2014", "flattops", "Colorado", 93, 56, "My wife and I had dinner here on a weekday. There seemed to be some confusion about whether the dining room was open or only the lounge area, and restaurant staff were notably absent for long periods. We eventually sorted things out with the nearby Front Desk staff and sat by a nice fireplace in the lounge.\nOnce our waitress...\n\n\nMore"], ["Above Average Hotel Restaurant.", 4.0, "December 12, 2014", "CaptainMHB", "Fort Lauderdale, Florida", 257, 185, "Was pleasantly surprised.\nI was staying at the underwhelming Washington Plaza and needed to get dinner after a long day of work.\nBeing on the road 200+ days a year, I am very familiar with adn comfortable with Hotel bars, so went into the bar for dinner.\nThe \"International Lounge\" is serviced by the 10 Thomas Restaurant as they are...\n\n\nMore"], ["A well kept secret", 4.0, "December 10, 2014", "anikod", "Washington DC", 31, 9, "We have been to Ten Thomas for Sunday brunch three times in the past couple of months - and enjoyed it every time. Surprisingly, it is not crowded, which if you enjoy excellent food, healthy options, unlimited mimosas/bloody mary's (yes, you can switch around), and a classy, quiet ambience, this is the ideal Sunday spot for you. The food is...\n\n\nMore"], ["Breakfast Buffet", 4.0, "December 1, 2014", "212Moree", "Tampa, Florida", 47, 33, "Lovely restaurant with great service. We enjoyed the breakfast buffet (including an omelet station) our last morning before heading to the airport. Fresh fruit, delicious hot food, all sorts of pastries, breads and bagels. Yogurt, oatmeal, cold cereals. All very good."], ["Great service, excellent food", 5.0, "November 27, 2014", "Illysa I", "Columbia, Maryland", 48, 16, "We had our Thanksgiving dinner here and the turkey was great. I was not a big fan of the sides but the rest of my family loved them. They had a very nice salad, though, so I was happy :) Desserts were excellent. But mostly, I have to commend the staff. They were cheerful and fun, yet professional -- from...\n\n\nMore"], ["Superb!", 5.0, "October 21, 2014", "PaigeHones", null, 3, 4, "Five stars for the Washington Plaza's restaurant, No. 10 Thomas! Excellent food and service. I visited for brunch and enjoyed it immensely. Whether you are touring DC for a visit, or a local looking for a meal, I highly recommend dining here!"], ["Good food, good service", 4.0, "October 6, 2014", "vivavino", "Towson, Maryland", 56, 32, "This hotel restaurant was surprising good. Service was quick, food was done correctly, and they had a nice selection of drinks."], ["Yummy", 5.0, "September 3, 2014", "Annieabc", "Revere, Massachusetts", 9, 1, "Loved this place, they have the best Steak salad, chicken fingers for the kids and everything was really fresh and made to order. We also had breakfast which I would highly recommend. The service is awesome!"], ["great deal", 5.0, "August 10, 2014", "redrt", "Lake View, New York", 19, 10, "If you get this included in the price of the room it is the best deal in town. Not sure what kind of coffee they serve, but I haven't had any like it since the disappearance of the old neighborhood donut shops. In other words it was great. very full buffet which included omelets and some very fine bakery. Watch...\n\n\nMore"], ["eat somewhere else", 1.0, "July 21, 2014", "sv b", "Tarpon Springs, Florida", 64, 34, "we were tired from walking the mall and decided to eat at our hotel. the fish n chips were really greasy and was left uneaten. the service is weak. i had to go to the bad to let him know that we were at a table and ready to order. the salmon salad was ok. the salmon was bland but...\n\n\nMore"], ["Don't go...", 1.0, "June 18, 2014", "Shaba84", "Toronto, Canada", 29, 12, "I was very disappointed in the meal I had at the restaurant. I ordered a simple spinch pasta with a meat sauce. There was no flavor, all the noodles were stuck together and it was just a waste of $16"], ["Great Breakfast", 4.0, "June 16, 2014", "Tom K", "Wilton, Connecticut", 11, 6, "Wonderful breakfast buffet and conveniently located right at the Washington Plaza Hotel at 10 Thomas Circle"], ["Good breakfast, but sometimes service was slow", 4.0, "June 7, 2014", "SusanDFW", "DFW", 154, 66, "I ate breakfast here and the buffet was good. They made omelets, eggs, and waffles to order, had a fruit and yogurt bar, an assortment of cereals and oatmeal, a nice array of cold cuts and cheeses, a bread assortment, a pastry station, and hot foods that included really great bacon every morning.\nThe service was often slow. One way...\n\n\nMore"], ["Good food, spotty service", 3.0, "May 8, 2014", "NorthFlorida", "Lake City, Florida", 41, 15, "We ate breakfast in the restaurant five mornings and had dinner one evening. There is a breakfast buffet that has the typical breakfast food. I had a french toast one morning and it was average. The wait staff could be more attentive to refilling coffee. The restaurant was not busy so service could have been better."], ["Great brunch", 5.0, "April 15, 2014", "AndrewJ0716", "Alexandria, Virginia", 2, 1, "I went to their brunch (a new thing for them) on March 30th, and it was great. I love the idea of doing a mix of buffet and passed food items. The food was tasty. The dessert buffet for the lunch was amazing - especially the panna cotta and the doughnut holes. Oh my goodness, those homemade doughnut holes -...\n\n\nMore"], ["Excellent Food", 5.0, "September 9, 2013", "Deborah B", "Swansea, United Kingdom", 2, 1, "Breakfast buffett. Excellent choice of food. Waiting staff brilliant. Dinner menu excellent and all not too badly priced."], ["Great Breakfast Choice", 5.0, "August 29, 2013", "houdini444", "New York City", 6, 9, "the buffet breakfast includes omelets cooked to order and awesome Belgian waffles. If you are staying at the hotel it is definitely a good choice. The staff is very attentive as well."], ["Don't miss brunch", 4.0, "August 28, 2013", "Chuck C", "Preston, Idaho", 12, 11, "The breakfast/brunch is first rate, with a series of selections that will fill the needs of anyone. The catering/restaurant managers, Steve Cunningham and Darrell (I apologize, didn't get his business card or last name) are worth their weight in gold. They run a restaurant that flawlessly handles the many demands of the guests in a busy capitol city eating establishment....\n\n\nMore"], ["Great food", 4.0, "August 9, 2013", "KKfromAK", "Talkeetna, Alaska", 54, 25, "The dinner was exceptional, the price for dinner was in line with others in the vicinity. The price for continental breakfast is high compared to some to the others, but you find that with most on site restaurants."], ["Best breakfast brunch ever!", 5.0, "August 1, 2013", "RetiredTarheel", "Los Angeles, CA USA", 14, 6, "It can't be described. If breakfast is your favorite meal, don't miss this one. It was certainly worth the money and the coffee was fantastic."], ["Service was friendly and food was okay.", 3.0, "July 28, 2013", "Frequent-Traveler-PA", "Pittsburgh, PA", 61, 68, "The service was friendly, but the food was okay. This restaurant fortunately does not get too crowded. The menu selection is decent, but I would have preferred more vegetarian selections."], ["New menu", 4.0, "June 27, 2013", "S M", "Boston, Massachusetts", 64, 11, "The food was very good and creatively prepared. The waitstaff was attentive, but not overly so. It was quiet the nights that I ate there, so I appreciated that!"], ["Good Service, Food Lacks", 3.0, "June 22, 2013", "Autopiloted", "Atlanta, Georgia", 288, 114, "I was staying at the Washington Plaza Hotel and ate here twice. The service was good, especially the nice waitstaff. I just didn't care for the food. My pasta fresca was bad and my mac and cheese was only alright. I did like the French onion soup, but that didn't make up for the other weaknesses. The price was much...\n\n\nMore"], ["We did lunch", 3.0, "June 7, 2013", "billandmeche", "Virginia Beach, Virginia", 26, 9, "Not enough light lunch choices. My husband's chile was mostly beans but the service was excellent. I had what seemed like a pizza with tomatoes and cheese but again it was not up to par."], ["OK Breakfast", 3.0, "June 6, 2013", "Lisa S", "Ashland, Pennsylvania, United States", 11, 3, "Breakfast was ok, but the price was a little high. It was included in our package )park and stay package). We probably would not have eaten there if it had not been included due to the price."], ["buffet brunch", 3.0, "March 26, 2013", "sbjbt", "Philadelphia, Pennsylvania", 24, 22, "The buffet brunch had an omelet station, pancakes, bagels with lox, as well as plenty of the standard hot items and fruit options"], ["Great food!!", 5.0, "March 1, 2013", "bmal77", "Philadelphia, Pennsylvania", 86, 25, "Come here once a week when I'm in DC. They serve some really good food and the prices are reasonable. If you're not staying in the Plaza, you can just call ahead and pick something up and they will have it ready at the bar or restaurant. Staff and bartenders are very friendly."], ["What a great experience tucked away within Washington Plaza Hotel!", 5.0, "January 23, 2013", "lakethoreaubreezes", "MANASSAS", 49, 10, "We tried the crabcakes with mashed potatoes - fantastic! Very minimal breadcrumbs unlike most places.\nThe grilled salmon caesar salad was pretty good; the salmon prepared just right.\nYes, I also had the cheescake with fresh strawberries and whipped cream even though I was stuffed.\nBut what made the experience truly fun was Faith, our server who was an absolute...\n\n\nMore"]]], ["DCity Smokehouse", [["Unbelievable Ribs", 5.0, "September 19, 2015", "Lee S", "Palmerston North, New Zealand", 239, 77, "This place was recommended to me.\nIt is a real \"hope in the wall\" operation with only bench seating for about 5 people. I struck it lucky and was able to get a seat, otherwise it is takeout only.\nThe ribs were fantastic and the sides brilliant, I had coleslaw and onion strips.\nThe neighbourhood could best be described as...\n\n\nMore"], ["Spectacular disappointment", 2.0, "August 22, 2015", "CWnut", "Bethesda, MD", 229, 55, "I have been looking forward to this BBQ since this place opened. I don't think we caught them on a bad day. I think it's lousy food and service. We ordered a platter that included ribs, but got no ribs. Had to go back to get them. We requested mild & chipotle sauce and only got chipotle. They skipped over...\n\n\nMore"], ["... we went for a quick snack on a hot afternoon and got hooked..", 5.0, "July 20, 2015", "Giorgio G", "Washington DC, District of Columbia", 72, 14, "...i had heard about the place and been told it was phenomenal, but honestly did not know what to expect.. we walked in on a hot afternoon this past weekend and expected to find a place with tables at least... well, surprise!!! the place appears to be take out only, and whether anyone can stand and eat in that handkerchief...\n\n\nMore"], ["Oasis in the DC barbeque desert", 3.0, "July 19, 2015", "Tevin S", "Woodbridge, Virginia", 73, 42, "Be warned: it's a hole in the wall with few seats and a long line, and it's in a shady area. It gets better: a pig statue smiles at you as you approach the door. DCity Smokehouse is the best barbeque option in DC. The mains are good -- try the pork belly, ribs, wings, or any of the sandwiches...\n\n\nMore"], ["Not worth the wait (time, not line)", 3.0, "July 18, 2015", "Robert M", "Washington, District of Columbia, United States", 44, 17, "I waited some time before patronizing this establishment. I know people who swear by this place, and it's a darling of the local press. I decided to finally go and my opinion is that it's good. The place as a following, and It's nice to see something successful on such a cruddy location. They could really be part of flipping...\n\n\nMore"], ["1# Over Rated", 1.0, "June 30, 2015", "dc_smoot", "Washington DC, District of Columbia", 10, 4, "Born and raised Washingtonian so I know there are small pickings for barbecue here. What that said I'd rather travel 30min out to Laurel to Famous Daves... My husband and I order the sample stopper 30$, boy was I pissed.\n-4 small slices of brisket\n-6 smoked winglets\n-4/ 5 rib tips\n-2 small sides (not bad, but not good...\n\n\nMore"], ["Great \"hole in the wall\" BBQ", 4.0, "June 15, 2015", "DWElwell", "Silver Spring, Maryland", 30, 2, "Love this place for lunch; probably the best BBQ in DC! Carry-on only, be sure to order ahead and get there early."], ["Might as well carry salt lick!", 1.0, "June 14, 2015", "ScottieLover66", "Tampa, Florida", 33, 17, "Kept reading all the rave reviews on Trip Advisor and Yelp. Had to have it delivered to our hotel. Being a Southerner I love BBQ, but this was the worst meal I've had in my entire life. Ordered Pulled Pork Sandwich, hush puppies, Brussel sprouts, brisket, chopped pork and cheese grits. SERIOUSLY?!?! Did someone dump 50 cups of salt on...\n\n\nMore"], ["Excellent BBQ", 4.0, "June 5, 2015", "Allrelative", "Fremont, California", 82, 24, "After visiting the best BBQ in Georgia (by Thrillists), Wiley's Champion BBQ in Savannah, we had to try the DCity Smokehouse (best in DC by Thrillists). We braved the heavy rain and it seemed like ages to get there from the Metro (NoMa station, Red Line). We ordered to go the sampler dinner with ribs, wings, & brisket; sampler with...\n\n\nMore"], ["DCity Smokehouse has great food!", 5.0, "June 2, 2015", "David S", "Washington DC, District of Columbia", 3, 0, "It is not a secret any more - DCity Smokehouse is a great place bbq. Although it is only carryout and the neighborhood is a little bit shady, the food is great. The beef brisket and smoked turkey are great. The half smoke is a DC classic. Don't forget the sides -we love the brussel sprouts."], ["Best BBQ", 5.0, "June 1, 2015", "CharlieVVancouver", "Vancouver", 109, 60, "Visiting Washington DC, between sites of Arlington Cemetary and National Cathedral. Found a listing of BBQ spots which had DCity listed. So with GPS set found this spot. Arriving everyone in the car gasped as it is in a seedy area of DC. But I foraged ahead. What we found was a line of folks ordering the finest BBQ I...\n\n\nMore"], ["Best bbq in DC and I have tasted it all.", 5.0, "April 4, 2015", "talley01", "Washington DC, District of Columbia", 54, 24, "I have lived in DC for 15 years and have travelled all over to taste and try different BBQs. I recently read reviews from different food blogs that was giving this place high marks. So I tried it out via Postmates delivery due to limited parking around the restaurant. I order the Bbq sampler, wings, and side of slaw. The...\n\n\nMore"], ["BBQ in DC Really - Yep", 4.0, "March 27, 2015", "Norman p", null, 33, 12, "This some of the best BBQ in the DC area. It would not win a competition but its very good . All the meats come un-sauced so you can taste and judge on the meat itself. I had the brisket which was tender and juicy. Also had 1/2 rack of ribs - good smoke not over powering and a hint...\n\n\nMore"], ["Best BBQ in DC", 5.0, "March 25, 2015", "Mary M", null, 12, 5, "For my husband's birthday, I wanted to surprise him with his favorite meal, BBQ. I ordered him, ribs, chicken wings, and brisket, plus onion rings, hush puppies, jalapeno cheese grits, and the Brussels sprouts. Everything was a hit! The ribs, wings, and onion rings were his favorites. I was amazed by how creamy the grits were. It's rare to find...\n\n\nMore"], ["Great Menu Selections!!!", 4.0, "March 17, 2015", "Andrea H", "Washington DC, District of Columbia", 11, 7, "I've been hearing good things about this place so I had to check it out. Was not crazy about the location, no parking. But the sandwich was AWESOME, I got the lunch special, (dollar off sandwich) the Torta. I don't usually go for avocado on or in my food, but this was great. The chicken was nice & tender &...\n\n\nMore"], ["Really tasty food for take out", 4.0, "March 8, 2015", "nreyesok", "Potomac, Maryland", 246, 98, "Went out of our way to try this place - we called in an order and still had to wait an inordinately long time (the place is tiny and packed). Not sure why the order was not ready after 30+ minutes advance notice. Neighborhood is not someplace you want to hang out in either....\nso wasn't optimistic the food would...\n\n\nMore"], ["Good BBQ, Great Fried Brussels Sprouts", 4.0, "March 3, 2015", "Robert C", "Washington DC, District of Columbia", 28, 13, "Great barbecue takeout joint. I wanted the barbecue to be great, but I would consider \"very good.\" Whatever you do, don't miss the brussels sprouts. As weird as it sounds to rave about brussels sprouts from a bbq joint, these are fantastic -- fried to a crisp and so good they're addictive. I would suggest ordering for a group of...\n\n\nMore"], ["Killin it!", 5.0, "February 9, 2015", "Rachel N", "Washington DC, District of Columbia", 72, 20, "If you are craving BBQ, go here! There isn't really anywhere to sit, so plan on getting it to go. They have the best grits I've ever eaten (not that I have much experience in this field). I would also suggest the chicken and waffles or the Showstopper (sampler).\nThey have really unique sauces too!\nI will be going back!!!!"], ["Must have been a really off day...", 2.0, "January 23, 2015", "Lynnshops", null, 16, 9, "We were willing to overlook the serious traffic congestion, dubious neighborhood and lack of any type of parking but the food did not live up to the hype. We ordered ribs, rib tips and brisket and all three were severely overcooked and dry. The side sauce was cloyingly sweet. The one outstanding item was the red chile coleslaw. That was...\n\n\nMore"], ["Not the best but okay", 3.0, "December 28, 2014", "WDW621", "Bloomington", 46, 26, "While visiting DC for Christmas, we decided to try out DCity as we had heard great things about it. The barbecue was okay. The brussell sprouts were way too salty so couldn't enjoy them. The bbq chicken was dry but had a good flavor. The service isn't good at all. Trying once was enough for us. Also, it's not a...\n\n\nMore"], ["Best brisket I've had", 4.0, "December 26, 2014", "kdawg1122", "Toronto, Canada", 45, 25, "Generally speaking, I'm not a fan of bbq or smoked food. That being said, the brisket and ribs were absolutely to die for! I actually wanted to eat more. The portions were huge. We ordered 2 meals and ended up only eating half of it. (Which worked out great because we had the rest on the flight home the next...\n\n\nMore"], ["To die for!!", 5.0, "November 3, 2014", "Vanessa F", null, 14, 7, "I can not stay away from this place. it is finger licking good and I just want more every time. I had the pork and brisket sandwich and a side of greens."], ["Some of the best beef brisket in DC", 5.0, "November 1, 2014", "Kevin P", "Falls Church, Virginia", 266, 71, "I came across this place while sitting in traffic after work. It's not in the best part of the city so have fun with that. But the food and nice service makes up for it. I got the beef brisket champ on a friday night and ate it saturday afternoon. It was moist, flavorful, and a good balance of salt....\n\n\nMore"], ["Take care in neighborhood, but do order a takeout..its great", 4.0, "September 11, 2014", "CSSnowshoer", "New York City, New York", 724, 327, "If I were a tourist staying at one of the local hotels and read the reviews, I would and did plan my dinner for this restaurant. What I did not realize is that you need to be prepared for the neighborhood. If you walk or take the metro there are both blocks with no one in sight as well as...\n\n\nMore"], ["Take away, don't stay", 2.0, "September 6, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "We only realized that this is not a sit down restaurant when we arrived there.\nIt's a tinny space with 6 bar stool seats facing the wall just across the kitchen, with no AC. It was so hot and smoky that at certain point it was hard for me to breath.\nThe brisket was good and the Brussels sprouts were...\n\n\nMore"], ["Ups and downs for food and service.", 2.0, "August 29, 2014", "cakedeco", "Cleveland, Ohio", 278, 247, "I went in to get take out for hubby and me while visiting DC. It is in a run down area but I was dropped at the curb and picked up later with bag of food.\nThere were four orders ahead of me so I had a while to observe the ordering procedure. Orders were taken quickly and given to...\n\n\nMore"], ["Best BBQ/Smoked meat in the DC area!", 5.0, "July 27, 2014", "Sara S", null, 36, 14, "Picked up some carry out Brisket as well as Red Chili Coleslaw. Both were outstanding and I would highly recommend this BBQ. Tried many places in the area and it's steps above Rocklands and Urban BBQ. Just do it...make the trip. It is well worth it! It is a hidden gem on the edge of Eckington/Bloomingdale."], ["Small but good", 4.0, "April 15, 2014", "Autumn M", "USA", 971, 236, "There is a small row of seats against the wall. This place is a closet. The wings, brisket and grits are all good. The ribs were not tender and I didn't like the sausage. They have a bunch of different sauces. I didn't like any of them with any of the meats."], ["Best BBQ I've had in years", 5.0, "February 8, 2014", "LesJoEllen", "Washington DC, District of Columbia", 23, 10, "This little hole in the wall in a miserable neighborhood had the best chopped pork sandwich I've had in years! Lots of great flavor, plenty of crunchy 'burnt ends.' I met a friend there for lunch. They are a tiny, tiny place, designed more for carry out (there are 4 stools set against a very narrow shelf if you do...\n\n\nMore"], ["Better than the BBQ down south!!", 4.0, "November 10, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Read about this place in Eat DC. Decided to give it a try. The 4 stars are for the food, it is amazing BBQ, better than those I had in the south. However, it is literally a hole in the wall. The man who responsible for the amazing food is former Hill Country Barbecue piitmaster Rob Sonderman. I salute him....\n\n\nMore"]]], ["Lawson's Grill", [["Second time", 4.0, "August 26, 2015", "Barbitini", null, 11, 0, "Visiting DC and remembered this cafe type place. Fresh ingredients, fast, and friendly. Plenty of beverages to choose from. Fresh carved turkey in my panini that was very good. Could have used a side salad, but didn't see any. A bit confusing which counter to order from, but it wasn't busy so there weren't lines."], ["Lawson's Grill", 5.0, "August 10, 2015", "Mark M", "Cedar Park, Texas", 14, 4, "Nice sandwich shop but was a little hard to find.\nFairly inexpensive\nVery close to the Marquis Hotel\nWide variety of menu choices and very quick service"], ["Great Local Place", 4.0, "February 11, 2015", "Robert G", "Valdosta, Georgia", 36, 14, "Nothing fancy inside but great food at good prices. I have eaten lunch here a few times and it is always quick with a great selection of food. Lots of locals eating here."], ["Great little place ... little high priced though", 5.0, "November 8, 2014", "wan001", "Louisiana", 59, 13, "the deli meat is freshly sliced and as good as i've had. we had salads and wraps and were satisfied."], ["A nice escape from the convention center", 4.0, "November 7, 2014", "NatAtl", "Atlanta", 74, 31, "The place his well located and a nice quick walk from the convention center. I had a very fresh, very good Greek salad with chicken. Staff was great. Place was clean. Definitely reccomend"], ["Thank goodness for Lawson's", 4.0, "September 10, 2013", "RickThreeBears", "Washington DC, District of Columbia", 15, 1, "I do not have much time for lunch. I'm working at the new City Center project across the street from Lawson's. The food is good, the prices nice. Some people say the service is poor or slow. I haven't experienced that. Of course I am polite when I order and say Please and Thank you. I've always had good service."], ["Fast and Fresh", 5.0, "July 26, 2012", "BandBFan4ever", "Greenbelt, Maryland", 47, 14, "Eat here at least once a week. Love the fresh salad bar where I can make my own creation. New pizza and mac and cheese bar are fun. The staff is great both friendly and helpful."], ["REAL Food - Healthy & Delicious!", 4.0, "December 30, 2011", "HealthNut9", "Harpers Ferry, West Virginia", 23, 7, "I found this gem while attending a conference in DC. It's one of the few places I found that offers healthy, delicious, gourmet food using excellent ingredients with quick service to boot! This is where the locals go, and I made it my destination for breakfast and lunch for the duration of my stay. Great prices and variety! My one...\n\n\nMore"]]], ["Potbelly Sandwich Works", [["Great Food", 5.0, "September 25, 2015", "Gregory H", null, 2, 0, "We had breakfast and both our sandwiches(Bacon,Eggs&Cheese on a square bun), were great. The staff was also very friendly."], ["Great", 5.0, "August 18, 2015", "msyke", null, 9, 2, "Went for lunch while visiting DC. Order proceed is a little odd but the sandwiches was great. We also had a smoothie that was very refreshing."], ["Great Sandwiches and Hot Soup", 5.0, "August 10, 2015", "EpicureanFunTraveler", "Burr Ridge, Illinois", 911, 476, "My choice was a double meat turkey and chicken noodle soup.\nWe were a small group of 6, and we all really enjoyed our lunch at this Potbelly's.\nI had everything on my sandwich including the hot peppers. Potbelly has delicious, flavorful, and perfectly spiced hot peppers that really made the sandwich perfect.\nThe hot peppers are really spicy and...\n\n\nMore"], ["Service improvement needed", 3.0, "August 2, 2015", "Val A", "Dublin, Ireland", 61, 14, "Service personnel are too laid back and cool. Need to realise that the customers are the most important component. More urgency is required.\nThe food is average to good for the price charged. It is what it is. Not designed for healthy long cholestrol free living, more aimed at db2.\nIf you are hungry the sandwiches will hit the spot....\n\n\nMore"], ["Good sandwiches/salads for family", 3.0, "July 26, 2015", "Nocruisesever", "New Orleans", 101, 43, "We went here for lunch and had a good meal. We found the workers to be good though not highly enthusiastic enough it was not busy. The tables were not cleaned which made it a challenge for our group to sit down. We bussed the spot where we ended up sitting."], ["Great sandwiches", 5.0, "July 22, 2015", "SueTrev93", "Winter Haven, Florida", 23, 8, "Nice variety, little challenging for the little ones but big kids and adults loved it. Food was very good."], ["Great salads and sandwiches.", 5.0, "July 8, 2015", "Cindy J", null, 2, 1, "My farmers salad was great. I added avacado to it and it was awesome. Thr sadwiches that my hubby and son had were awesome also!"], ["Damn Good Sandwich!!!", 5.0, "June 15, 2015", "CrazyGeno", "Costa Mesa, California", 43, 3, "OMG what a great place for a quick bite...the different types of sandwiches and soups all all made to order and the taste is WOW!!! I had the chicken cheddar and it really hit the spot. The service is spot on and all the employees were willing to give you suggestions on what to order. So, if you are in...\n\n\nMore"], ["food", 5.0, "June 12, 2015", "Stephen K", "Sutton,SURREY, United Kingdom", 5, 6, "A lovely sandwich at Potbelly and helpful staff. one of the best sandwiches , I have ever had.IT WAS GOOD VALUE FOR MONEY."], ["Good food", 3.0, "April 25, 2015", "FunTravels69", "United States", 62, 21, "Food was great. Staff were short as we didn't know how to order with their terminology. Good for quick food."], ["Best meal when touring DC", 5.0, "April 14, 2015", "Jonathan W", "San Diego, CA, United States", 131, 80, "There are an enormous amount of sites to see in DC. Sitting down to a 1-2 hour lunch will rob you of seeing some of these sites. Thats where this place comes in. Even if you sit down and eat, you are out 30 minutes tops....and its a good healthy meal! I recommend the chili and a half sandwich. Its...\n\n\nMore"], ["Okay sandwich....too loud workers", 3.0, "April 7, 2015", "Customer912", "Georgia", 25, 2, "The sandwiches were good. It reminded me of firehouse subs. Could have did without the loudness of the workers talking to one another😁. Changing shifts can be done more orderly. We were trying to eat and the loudness made it somewhat unbearable. However, when those workers left, it calmed down again. At this point I was ready to leave with...\n\n\nMore"], ["At least the bread is great", 1.0, "January 10, 2015", "fhungolfer", "newport news, va.", 55, 22, "Potbelly is just like a Subway sandwich shop... Except it is filthy; food is of poor quality; and, the staff does not have the time to explain how one orders. I watched one employee grab a quick smoke outside, then return to his station without washing his hands. I asked him to put on gloves before fixing my sandwich. (If...\n\n\nMore"], ["Terrible", 1.0, "December 29, 2014", "Jamie T", null, 2, 3, "The service was absolutely terrible. The woman behind the counter had an angry attitude and basically threw the sandwich at me. Everyone in line had the same experience. Worst lunch spot in DC. I highly advise avoiding this place at all cost, unless you enjoy being yelled at and treated like a prisoner in a little place called \"Hell\""], ["Jerks", 1.0, "December 29, 2014", "Fez360", null, 2, 1, "Rudest people ever. I'm so sorry to bother you while you work.\nObviously the owners don't care that the employees joke around behind the counter then literally throw an order together while laughing then turn to the customers with a rude look of disdain. I know the world owes you everything even your job.\nI don't know why I am...\n\n\nMore"], ["If you're looking for someone to bark at you whilst you order a sandwich...", 1.0, "December 28, 2014", "Mister_Roo", null, 17, 20, "Must I really have to deal with some moody strop-queen when ordering? It seems I did. If staff are insisting on taking orders at the other end of the counter from where the menu is, then of course we're going to struggle with the options; particularly if those options are being barked at you in frustration! When you do answer...\n\n\nMore"], ["Possibly the coldest, rudest service ever", 1.0, "December 28, 2014", "tonytonychoppa", "Leeds, United Kingdom", 32, 20, "The female \"lead\" employee here is dreadful. No smile. Looks straight through you and expects you to know what the place sells and how the set up works.\nThe decor is dreadful and resembles a condemned, run-down cafe ready for demolition. Turned out this was part of a chain with the same concept as a Subway outlet with non of...\n\n\nMore"], ["Cheap, filling, healthy lunches!", 4.0, "December 6, 2014", "Marie D", "Adelaide, Australia", 14, 11, "Large, healthy soups and subs at a very cheap price! We ate lunch here every day - sometimes stayed in, sometimes took it on the run."], ["Take-away recommended", 3.0, "October 29, 2014", "juergfrombern", "Bern", 31, 24, "I know Potbelly from Dulles airport and do love their sandwiches. But when I tried to grab a sandwich at this place at 12th street I could not stand the disgusting smell inside and left without ordering anything. The sandwiches might be good but if you want to eat inside go somewhere else."], ["Nothing to write home about...", 2.0, "October 26, 2014", "usa_banjo", "Peoria", 77, 36, "The employees seemed like drones going through the motions wishing they were someplace else. It is pretty much serve yourself and they make a sandwich for you. My wife wanted a cup of ice for the bottled drink you get out of a refrigerator. The employee waited on 4 other people after her before she went to get the ice....\n\n\nMore"], ["Great place", 5.0, "October 16, 2014", "jaygilgert", null, 85, 22, "We were starving and saw this place. Got in line and despite it being long am employee with an iPad came and took orders of the people to far back to put it in. This speeds up the process and the line moved swiftly. I asked for a recommendation and he roccomneded the turkey bacon cheddar melt on flat bread....\n\n\nMore"], ["Great Sandwiches!", 4.0, "October 13, 2014", "Pamela E", "Plantation, Florida", 13, 5, "This is a cute sandwich shop with seating inside and outside. I had an Italian sandwich and the cheese and broccoli soup, both were great!"], ["Delicious and quick sandwiches", 4.0, "September 10, 2014", "Andrea B", null, 10, 4, "I went close to closing time which meant they moved slower than normal. But overall good. The sandwich was fresh and the cookie was delicious."], ["Wreck is a winner", 4.0, "August 14, 2014", "VonnieFoodie", "Stellenbosch, South Africa", 70, 26, "We shared a Wreck with everything for a quick lunch. Good value for money and the staff were very friendly."], ["great place for a quick lunch", 4.0, "July 3, 2014", "MAMCBE2002", "Canton, Mississippi", 79, 25, "We had lunch at the Potbelly near the Mandarin Hotel. I had a Mediterranian Salad that was really good. My husband and children got sandwiches and liked theirs as well. These shops are scattered throughout DC and are good options or quick meals."], ["Fast, efficient and tasty", 4.0, "April 24, 2014", "Yakir N", null, 12, 3, "Don't be worried if you see a huge line, these guys know how to work! the employees will treat you nice, and you will get what you ordered and fast! the sandwich I ate was good too."], ["Best value we found our whole trip", 5.0, "October 20, 2013", "Sugarloafer4evah", "Hancock, Maine", 10, 4, "We grabbed a quick lunch here and were not disappointed. Tasty sandwiches are made to order and pretty good sized. I had a black bean and tomato soup and ham sandwich. Both were delicious."], ["Great Sandwich Shop", 4.0, "August 3, 2013", "coolbreeze2", "Chicago, Illinois", 285, 138, "After walking around the mall area sight-seeing, we were looking for a place to have a light lunch.\nWe found this Potbelly and ordered the Wreck sandwich. It is our favorite at Potbelly's.Good service and the food was very good."], ["Excellent sandwiches", 4.0, "July 31, 2013", "Dave G", "Stratham, New Hampshire, United States", 88, 34, "We chose this place on a whim, while walking around the Smithsonian Museum area. The menu was limited, but the sandwiches were very good and reasonably priced. The dining areas are adequate, and the service was quick. Great place for a quick lunch."], ["Blah", 2.0, "July 18, 2013", "AJ C", "Washington DC, District of Columbia", 169, 35, "Average average average. Bread isn't fresh. The meat is cheap deli meat. Meat ball subs are without taste.\nWhy people go here is beyond me. So many other real choices. If you love a great sandwich don't go here"], ["nice choice for a quick meal", 4.0, "July 18, 2013", "A C", "Chattanooga, Tennessee", 125, 66, "There are many sandwiches (you can add some toppings) and drinks to choose from. In addition, there are cookies, milkshakes and smoothies. You will also find the standard rack of chips.\nOverall, good food that wasn't expensive."], ["YUMMY SUBS", 5.0, "July 10, 2013", "RhondaF", "Lakeland, Florida", 10, 12, "I highly recommend ! good prices and you an order online and pick up fast service at lunch time also friendly staff nice toasted yummy subs, big yummy salads and chips and lots of drinks like soda fountain bottled tea , coffee bottled water , shakes are good and they have cookies and free music by local artists while you...\n\n\nMore"], ["Good food good value", 4.0, "July 3, 2013", "MtDuffy", "Marion, Iowa", 29, 9, "All the meals on the mall were getting old so we ventured off the beaten path and found this sandwich shop. For the same money we would have spent on the same old hot dog and chips on the mall we got a very good toasted sandwich and a comfortable place to sit down and enjoy our meal. People were...\n\n\nMore"], ["Crisp Salads and Thick Shakes", 4.0, "May 20, 2013", "Korrie L", "Lewisburg, Pennsylvania, United States", 7, 1, "Very good for a quick lunch or dinner. The salad was very fresh and the chocolate malt milkshake was very good as well!- If you order a shake, you'll love the cute little cookies they put around the straw! :)"], ["Better than Expected!!!", 5.0, "May 15, 2013", "Marisol L", "Sunrise, Florida, United States", 17, 14, "We stumbled upon this place on our way back to our hotel. We had the meatball, pizza, and Italian sandwich. They were all amazing!!! Price was very reasonable, and the service was fantastic. Overall, awesome dinner at PotBelly!!"], ["Yummy and cheap! (in a good way)", 5.0, "April 26, 2013", "JWLee87", "Lebanon, Missouri", 15, 3, "I never thought I could get a decent sandwich and a drink for under $10 in downtown DC. The sandwich was loaded and delicious, in fact I ate there 3 times while I was in DC that week. If I ever plan a trip to go back, I will be stopping in probably multiple times. Service is pretty friendly too!...\n\n\nMore"], ["GREAT PLACE.", 5.0, "March 24, 2013", "ppwillme1", "Russellville, Arkansas", 66, 31, "Wonderful sandwiches, good prices. Fun place. Try the MED sandwich with humus. It was great. Service was good, atmosphere casual."], ["Should I really let you in on this?", 5.0, "March 17, 2013", "travelz9", "Washington DC, District of Columbia", 70, 17, "So, it is a sandwich shop but a sandwich shop like no other that I have been in.\nGood, inexpensive food which can be configured just the way you want it.\nThe places in downtown DC can be busy at times but everyone just stands in line and waits for their order to be taken.\nYou must eat here."], ["Skinny Hammy... wow", 5.0, "February 25, 2013", "AnnTerryGM", "Washington, DC", 20, 11, "They give you a choice of whole wheat which I love, the bread is toasted and sandwhich has a lot of flavor, all for $4.00 good value, good sandwhich, I like it...."], ["Great Lunch Spot..", 5.0, "January 29, 2013", "flcruiser51", "Ocala, Florida", 6, 1, "Loved the sandwich & soup selections..reasonalbly priced! The outdoor seating made a great spot to sit & people watch in D.C."], ["Pre-Game", 4.0, "January 17, 2013", "GoodFood88", "Washington DC, District of Columbia", 594, 253, "This Potbelly is part of my pre-game ritual before Capitals games. I am a big fan of Zapp's Potato Chips from all my trips to New Orleans and they hit the spot along with my sandwich before a game. This location is always clean and the stff are competent and do their jobs well. HIghly recommended if you are in...\n\n\nMore"], ["A delicious sandwich - nice lunch!", 4.0, "November 12, 2012", "CoralExplorer", "Schenectady, New York", 28, 47, "Potbelly's was a small sandwich shop just around the corner from our hotel (Hyatt Regency Bethesda) so we stopped in for a quick lunch before touring Washington D.C. This is my kind of sandwich shop - lots of choices. Turkey, ham, meatball, italian mixed, chicken and cheddar, tuna or chicken salad and mediterranean (the one I chose) which is amdelish...\n\n\nMore"], ["Good, fresh food", 3.0, "November 10, 2012", "CanadianTraveler65", "Burnaby, Canada", 149, 92, "We went to the shop near the National Archives and had a couple of very tasty sandwiches. This was our first experience with this chain and were impressed with the quality and reasonable prices. service was quick and friendly."], ["Better than Subway", 3.0, "November 5, 2012", "PatrickBear", "Los Angeles, California", 56, 28, "Popped in for a fast sandwich. The turkey was fine. The bread tasty The service? A request for \"light on the mayonnaise\" I guess came across as \"a big hunk of glop please.\" But other than supervising more closely, it is the place to go for a quick bite."], ["Always good in DC", 4.0, "September 30, 2012", "Incorporeal", "Lexington, Kentucky", 21, 27, "I know it seems that there is one on every corner, but it is very good and reasonably priced. If you are looking for a good sandwich and nothing over-the-top, then this is your place. Obviously not a place for \"foodies\" but nonetheless consistently good."], ["Late lunch", 5.0, "September 25, 2012", "cmurphy-jones", "Florida", 1, 0, "Awesome food & good music! First stop after checking into our hotel. The service was fast, & friendly. Music food was super good!"], ["Excellent Sandwiches and Salads", 5.0, "August 1, 2012", "Arthur G", "Scarsdale, New York", 222, 70, "After spending hours walking around Washington DC we had a great lunch at Potbelly Sandwich Shop. The sandwich we shared was fresh and made to our specifications and the salad great too!"], ["Not a fan of Potbelly...", 3.0, "July 29, 2012", "AlexanderDelarge", "Omaha, Nebraska", 626, 1183, "I have been to Potbelly's on a few occasions and have not come away impressed either time. I have tried a few different sandwiches and did not care for them. The size of the sandwiches are small. You could easily eat 2 or 3 of them in order to be full. The ice cream malts are pretty good which is...\n\n\nMore"], ["The best meat ball sub I've ever had", 5.0, "July 7, 2012", "Bradburne", null, 52, 26, "This place is amazing. I noticed a few of them around Washington, being from the UK I had never heard of them before. I certainly have now. I had a couple from there during my stay in Washington, it's the best meatball sub I've ever had."], ["Absolutely delicious!", 5.0, "June 18, 2012", "Jeanette524", "Bridgeport, CT", 264, 100, "Just wandering in Union Station in D.C. thinking about something to eat and lo and behold! Potbelly's! What a welcome sight! I had visiting one in Indianapolis the previous day and boy was I glad to be able to have their delicious tuna salad again! It is so good, I couldn't try any of their other menu items. I was...\n\n\nMore"], ["Fast and tasty", 5.0, "May 28, 2012", "glarat", "Monterrey, Mexico", 4, 2, "Excellent food, fast service, with a lot of places to sit. Menu is complete, prices are very good, we will come back"], ["Healthy Food Too!", 4.0, "May 22, 2012", "Paula33559", "Brandon, Florida", 99, 25, "This is a great little franchise with a great selection of sandwiches including some low cal on very good toasted bread as well as some nice soups at a reasonable price. It sure beats the $5 hot dogs around the Smithsonian."], ["Old time subway just 50 times better", 5.0, "April 10, 2012", "cdawg717", null, 2, 1, "Good food good service. A good place to get a quick bite to eat."], ["A Must Try!", 4.0, "April 8, 2012", "ToPSFoodie", null, 36, 7, "Awesome... Get the Italian (Big Size... It's not that big) Hot Peppers are so good that if one falls on your paper bag while eating you don't let it go to waste. Great prices. Will definitely eat here again."], ["Potbelly gave me a POTBELLY!", 5.0, "March 27, 2012", "Jesslikestravel", "Chattanooga, Tennessee", 55, 23, "So, this was right down the street from our hotel. We decided to give it a try and it was delicious! Definitely give it a try!"], ["Good Eats, Good Value", 4.0, "March 27, 2012", "cjenk45", "Damascus, Maryland", 27, 9, "Food is simple and good. Its soups, salads and sandwiches with alittle flare. Many choices so that if you have a group of friends, everyone can if something they like on the menu in one spot!"], ["Great eats for a great price", 5.0, "March 23, 2012", "jrankw", "Washington DC, District of Columbia", 72, 57, "Great sandwich place. Hard to beat prices and the lines move fast. The one in Dupont is cool , they have live music sometimes"], ["sandwich lunch", 5.0, "March 4, 2012", "toys4dad", "Winthrop", 192, 66, "wander into this sandwich shop got an excellent sandwich very fast"], ["Not Especially Memorable Food but Good Service and Value", 3.0, "September 8, 2011", "GetawayPlanner2016", "Winter Haven, FL", 22, 11, "I went with co-workers for lunch during a hectic period of whirlwind activity. Perhaps this is why nothing about the food stands out in my memory as either bad or good. Looking at my receipt, I think $6.60 is not a bad total price for a Lil Tuna sandwich and a Nantucket Nectar. And I do remember that the staff...\n\n\nMore"], ["Quick sandwich before departure", 3.0, "August 30, 2011", "subdave", "The Woodlands, Texas", 93, 52, "Ate at this sandwich chain after a depressing trip through the holocaust museum. Bright skys Sunday morning after Hurricane Irene went north made the luncheon on the outdoor patio an enjoyable one. I had the big tuna and chili while my family had the pepperoni, pizza, and mushroom veggie subs. The chili was just OK after finding out that the...\n\n\nMore"], ["Fun place for lunch", 5.0, "July 29, 2011", "whyayepet", "Northumberland", 87, 46, "Nothing like this in the UK so it made for a fun lunch: amazing selection of breads then fillings and then salad stuff all delivered with a smile. Sit, relax and watch Washington go by :)"], ["Great place for lunch", 5.0, "July 2, 2011", "dtjwnbarr", "Pilot Mountain, North Carolina", 34, 21, "Excellent sandwiches for everyone's taste. The service was quick. We spent more for lunch at the McDonald's in the Space Center than we did here. We got more food and it was 10X better. It was small, but we got there before 12 so we had not problem."], ["Hot sandwiches and cold salads", 5.0, "June 14, 2011", "Bchgrl9", "Cardiff", 374, 292, "After visiting Ford theater, we stopped for lunch nearby. My 12 yr old grandson is a picky eater, and we found the $4 \"hammie\" sandwich on a thin roll with only the toppings he selected to be a wonderful surprise. We also had a \"wreck\" sandwich and a crisp, fresh salad, although I don't remember all of the ingredients. It...\n\n\nMore"], ["Good quick service, good sandwhich", 4.0, "April 4, 2011", "OntarioCanuck", "Canada", 801, 435, "Good location, limited seating, good sanwhich and shakes, 2 sizes, choice of bread, good for a stop."], ["Great sandwiches, Quick service", 4.0, "May 14, 2010", "publius358", "Millbrook, Alabama", 161, 93, "Stopped here to get a quick bite for lunch before heading back to Arlington. Service was quick and courteous. The food was delicious and the prices were reasonable. Limited seating, but most patrons seemed to order to-go."]]], ["Beacon Bar and Grill", [["Nice neighborhood restaurant.", 4.0, "October 11, 2015", "Leslie M", "Dallas, Texas", 25, 4, "Above average Sunday Brunch. Fried Chicken, Grits, Macaroni and Cheese, Salads were all GREAT! Omelette Station GREAT! We will definitely return. Nice atmosphere. Service was great. Endless Champagne, Mimosas, and Bloody Mary's. I am so glad I finally tried this place."], ["Nice little restaurant", 4.0, "September 20, 2015", "MEKMOM", "Boston, MA", 33, 44, "Ate here a couple of times while staying at the hotel. Decent food. We had a variety of appetizers and small plates instead of a big dinner. Love the sliders! The bartender was great and noticed when we needed refills."], ["Happy Hour, HH", 3.0, "September 11, 2015", "Mariela M", "Philadelphia, Pennsylvania", 2, 3, "Happy Hour at the bar and grill was reasonable and in line with HH expectations. The bartender was very friendly and knowledgeable of the area. It was perfect for what I needed, a few drinks and email checking time before a social event."], ["Good neigbhourhood restaurant", 4.0, "August 28, 2015", "JustNOZ", "Maryland", 54, 5, "We eat here quite regularly so the wait staff know us. Its a cheap easy place to eat and the service is good and quick. If you like burgers go on Monday for the half price deal. If you live in the neighbourhood ask for the neighbourhood discount. They have weekly specials that are always good value."], ["Average brunch", 3.0, "July 13, 2015", "THTK", "Jersey City, New Jersey", 13, 6, "We went there for a Sunday brunch. We didn't make a reservation but we were able to find an outdoor seat for a party of four after waiting a couple of minutes. The service was excellent. The food was good but I am not convinced if it justified the price. The place is located in the center of the city."], ["Good food, great drinks", 5.0, "June 27, 2015", "momconrad", "Sautee Nacoochee, Georgia", 24, 2, "Good food & great drinks, eat at the bar. The bartender is worth the stop. The food was excellent and we had a great time even though we were tourist."], ["Great Sunday brunch", 4.0, "June 16, 2015", "MickeyD2011", "Goodyear, Arizona", 13, 15, "Good, fresh, food with lots of creative options for the brunch. On beautiful days, there will be a waiting line so get there early if you want to eat alfresco."], ["OMG", 5.0, "June 15, 2015", "classieloreen", null, 6, 2, "Excellent staff and superb food! A little pricey, but, you definitely do not leave hungry or thirsty!"], ["Great drinks....Better service", 5.0, "June 15, 2015", "Kmm3063", "Phelps, New York", 2, 0, "Bartender Jim at Beacon Bar was outstanding!!\nMade fantastic drinks and was very friendly! He even stopped when he saw my daughter and I at breakfast to say hello and inquire about our plans that day and to wish us a safe return home."], ["Great experience for my 30th!", 5.0, "June 3, 2015", "White2tn", "Washington DC, District of Columbia", 93, 86, "I must admit I was a little apprehensive initially as this place has highly mixed reviews. However, time and location was of the essence and I desperately needed to solidify a place to celebrate my 30th that could accommodate 15 people for a dinner reservation off their regular menu! I called up BB&G and they were able to accommodate us....\n\n\nMore"], ["Had a hard time with a big group", 3.0, "May 29, 2015", "Dawn D", "Houston, Texas", 65, 23, "Food was ok, but the wait staff struggled with a big group that wanted to eat at the same time. Only ate breakfast at this restaruant, but the food was pretty decent."], ["Very slow service", 4.0, "May 26, 2015", "gtadennis", "Wilmington, North Carolina", 84, 34, "The food was great, when we finally got waited on. Location to Philippine Embassy was very nice. Be careful as you walk to this area as there are homeless walking close by and you could be clipped!"], ["Bar", 3.0, "May 26, 2015", "HulaRoss", "San Diego, California", 2, 0, "I only ate in the bar for happy hour. It was not bad at all. Got noisy one evening with hardly any seating. There are a couple of universities close by."], ["Bad service, bad food.", 2.0, "April 28, 2015", "MikeMfromWashDC", "Washington, DC", 148, 89, "I live and work very near to this place, so I would like to come more often. But the fact is it's a poorly run restaurant with bad food. The staff was rude, the food was mediocre, the atmosphere was so-so. Try Nage across the street."], ["A nice place to eat", 3.0, "April 25, 2015", "Redsilence", "Maidstone, Kent", 126, 73, "Make sure that you are sitting in the Restaurant rather than in the bar as food served there is better and I have to confess that my steak was marvelous. Service though was not quite to expectation as the staff had more eyes for a group of young ladies on a neighboring table, but still, we enjoyed it and we...\n\n\nMore"], ["Very good food.", 4.0, "April 21, 2015", "GRITS1946", "Hooksett, New Hampshire", 59, 11, "We had food tickets for breakfast which entitled us to the American breakfast. This was fine for the two days we had breakfast there - eggs, potatoes, meat, toast, coffee and juice. Sunday morning was busy due to setting up for brunch."], ["Lousy breakfast but excellent service", 1.0, "April 17, 2015", "smichaelb", "Sacramento", 23, 19, "We were staying nearby and it was the closest spot for breakfast. We should have trudged farther. We went simple; I ordered eggs over-easy with sausage, potatoes and toast. My wife ordered oatmeal and toast. My eggs arrived over-just-past-medium-but-not quite hard; there were two small link sausages - both shriveled from overcooking; the home fried potatoes were barely warm and...\n\n\nMore"], ["Easter brunch!", 4.0, "April 5, 2015", "KPR18", "Bowie, Maryland, United States", 222, 53, "This was not our first visit to BBG for brunch and it won't be our last. They pull out all the stops for their Easter brunch and it did not disappoint. The had a made to order omelet station, carving station, fresh waffles, and as many other entrees, salads and desserts that you could hope for. We sampled a few...\n\n\nMore"], ["Don't Bother", 1.0, "March 25, 2015", "adamcohenil1", "Princeton Junction, New Jersey", 41, 10, "The food is ok at best. However for a business dinner, they had the Worst service I've seen in a good, long while. It was actually a bit unfair to keep a group waiting as long as they did, and it wasn't even a large group. Totally inefficient operation, so my suggestion is to go somewhere else."], ["Saturday Brunch", 3.0, "March 16, 2015", "RaeToGo", null, 67, 16, "What a disappointment. After all of the reviews and rankings I expected so much more. Maybe they were great at one time but started to rest on their laurels. The staff was not very welcoming. Almost as though they didn't want to be there or want you there. It was not just the way they treated me and those in...\n\n\nMore"], ["I go even when I'm not staying at the hotel.", 5.0, "March 3, 2015", "Chrisla2082", "Largo, Maryland", 35, 24, "All I can say is Sunday Brunch! Great food and unlimited champagne! Happy hours are great during the week and food selection is always good. They seem to be converting to alot more healthier choices which I love. Try the Kale and Quinoa Caesar Salad..You'll Love it!"], ["Sunday Brunch with great variety", 4.0, "February 21, 2015", "AARB", "Lumberton, New Jersey", 10, 4, "This is a great spot for Sunday Brunch. Lots of selection for adults and children alike. Does get crowded so make a reservation in advance. All ages but due to layout I would say no smaller children or strollers."], ["Great Happy Hour", 5.0, "February 21, 2015", "BoredAgent", "Rockford, MI", 16, 40, "From 4 p.m. to 7 p.m. every day. Very reasonably priced drinks and apps. The staff there are nice. I have not been to the Sky Bar, but I've heard good things about it."], ["Casual bar food place", 3.0, "February 11, 2015", "neur14", "New York City, New York", 286, 81, "Food was more bar-food style than I had expected with a somewhat abbreviated menu and relatively small portions -- eg only about 8 ribs for the pork ribs. But everything was good including a surprisingly good risotto."], ["brunch", 5.0, "February 7, 2015", "Kevin R", "San Diego, California", 2, 2, "Very busy brunch on Sunday. Thanks to the hotel manager Steve we were able to get in without a reservation. The food was amazing and service was good with the number of people in the restaurant."], ["Great place to brunch", 5.0, "January 18, 2015", "Hamptongirl1998", "Baltimore, Maryland", 52, 15, "What a great place to brunch in the DC area. The brunch buffet was amazing offering an array of salads and desserts as well as a host of breakfast items-hot and continental. I would highly recommend reservations being made and the sooner you arrive, the quicker you will be seated. Again, this is a great place to brunch and not...\n\n\nMore"], ["great bar and brunch", 5.0, "January 6, 2015", "rainiPA", "Philadelphia", 8, 4, "Brunch menu has a lot to choose from. Food and Bar service was excellent. Jim and Richard at the bar were great!"], ["Awesome!", 5.0, "January 3, 2015", "Kaila R", "Wrightsville, Pennsylvania, United States", 31, 10, "Excellent brunch experience. Food was awesome, service on point and mimosas were never empty. Thank you! I will be back!!!!"], ["A fine compliment to the hotel", 4.0, "December 19, 2014", "Cdestree", "Denver, Colorado", 33, 19, "I recently stayed at the Beacon Hotel (see separate review) and wound up not only eating most of my meals at the the Beacon Bar and Grill, but inviting various colleagues and friends to join me for breakfast, lunch, dinner, coffee, and drinks. All the meals were very well prepared and often with creative touches. There is a quiet, more...\n\n\nMore"], ["Magnificent brunch buffet", 4.0, "December 9, 2014", "gerdag60", "Washington DC, District of Columbia", 23, 10, "Delectable breakfast, lunch and dessert choices. An omelett and waffle station, plus a great selection of seasonal salads round out the brunch buffet. Did I mention the unlimited Mimosas and Bloody Marys? It's best to come hungry and plan to stay for several hours to truly enjoy all the delicious offerings."], ["Small but competent menu", 3.0, "December 1, 2014", "Bizzie D", "Wannaska, Minnesota", 15, 2, "I needed dinner after a long day out. The restaurant was empty other than a couple of restaurant staff and the bartender. There are a half dozen tap beers, including a couple of local brews. Steak was properly cooked, with just enough bearnaise to be tasty but not overwhelmed. The canned music was autotuned mishmash but turned down just enough...\n\n\nMore"], ["Great Sunday brunch", 5.0, "November 16, 2014", "Michele L", "Pearl River, New York", 28, 5, "Went for Sunday brunch. Decor was interesting and really nice and table was comfortable. Nice variety of food and Mimosas were tasty and bottomless. Coffee was really good too. Food was nicely prepared. Only the fish veracruz was dry. Caribbean meatballs are a must to try. Omelettes were great. Staff was friendly and helped us with the luggage we were...\n\n\nMore"], ["Execellent", 5.0, "November 12, 2014", "ElleEye", "Washington DC, District of Columbia", 34, 15, "The Sunday brunch is absolutely amazing!! Great service as well. The salon served during brunch is absolutely amazing!"], ["Great little hotel restaurant -good food and service", 4.0, "October 29, 2014", "lajavaguy", "New York City, New York", 22, 9, "I often eat at least 1 or 2 meals here when in town because of its location, quality of the food and service. Nicely laid out so you can have a working meal as a group, or eat alone and read or watch the TV. Very nice selections on the menu, and a very comfortable space."], ["Weak service for average food.", 3.0, "October 26, 2014", "Bearsuit01", "Spearfish, South Dakota", 48, 17, "We stepped in with a party of 5 for dinner and drinks. It was 7 PM Sunday and they seemed like they were not sure if they were open or not as they were not that busy and confused when I asked if they were still serving? They said \"yes\" and We sat ourselves as we were directed and waited,...\n\n\nMore"], ["Good Food and Convenient to Hotel", 4.0, "October 25, 2014", "ValleyLB", "Sun City, Arizona", 12, 6, "First of all, it is located in the hotel where we stayed. The food was good, prices were moderate, and there was a good wine selection. An easy and enjoyable option if you are staying at the Beacon Hotel and don't want to travel far to eat."], ["From incredible to ok to why did we come here", 1.0, "September 14, 2014", "jacksondc", "Washington DC, District of Columbia", 186, 103, "How the mighty fall. This brunch was simply awful. The cakes were old, the food shut down at 225 and there was about 5 salads and soggy waffles. It simply sucks. And the dj (y?) had half the restaurant leaning to hear the music and the rest couldn't talk it was so loud. This needs a major renovation. Step back...\n\n\nMore"], ["Sunday Brunch-better than hotel continental.", 3.0, "September 13, 2014", "Megasaurus-rex", "Des Moines, Iowa", 21, 11, "The Sunday Brunch (Grande) was about $43 with tip. The bottomless bloodies were not particularly inspiring, I have had better at dive bars in the middle of Nebraska. However, they could not mess up the mimosas if they tried. It was easy to get an 1100 reservation for 6 by calling the night before. Brunch included an omelette bar, many...\n\n\nMore"], ["Decent Rooftop Bar", 3.0, "August 26, 2014", "ChanceMan00", "Orlando, Florida", 107, 19, "We were on our way to dinner and decided to get a cocktail at the Beacon Rooftop Bar. The area was intimate with a few tables and a small bar. A band was setting up under a covering. The view from that part of town was not as thrilling as we hoped but the cool breeze was welcome on such...\n\n\nMore"], ["Great small plates", 5.0, "August 20, 2014", "mjmClevOh", "Macedonia, Ohio", 99, 32, "While staying at the hotel we decided to try out the small plates and drinks. The weather allowed us to sit outside which was cozy and not too crowd. We tried several small plates and they were all excellent. Definitely give guacamole, fish tacos and brie a try."], ["What happened to you, Beacon Bar and Grill", 2.0, "August 19, 2014", "DCsunseeker", "Washington, DC", 91, 48, "I have loved Sunday brunch at this place but something has gone wrong. It will be awhile before I return.\nThe buffet area was filled with smoke, not the pleasant smoky salmon scent but smoking hanging in the air, likely because of poor ventilation from the omlet or waffle stands. The dining room was unpleasantly warm The combination left us...\n\n\nMore"], ["It's ok", 3.0, "August 5, 2014", "Diego R", "Washington DC, District of Columbia", 26, 7, "Their tapas are very tasty and they have a good drink selection. Unfortunately their service is not that good. I was there around 3pm on a Friday for a late lunch. The bartender gave me a lunch menu and after I placed my order (10 minutes after placing the order) he told me that the kitchen would not make the...\n\n\nMore"], ["The GM is the BEST!", 5.0, "July 24, 2014", "vipspalife", "Fairfax County, Virginia", 2, 0, "I had a wonderful brunch experience at the Beacon Bar and Grill! The General Manager, Kamran, was super friendly, attentive and seemed like he had everything under control, despite the busy brunch rush. The selection of food is vast and everything tastes delicious. There is definitely something for everyone! I will continue to eat here as part of my monthly...\n\n\nMore"], ["Good Breakfast", 3.0, "July 22, 2014", "Janninedf", "Austin, Texas", 14, 28, "Enjoyed our breakfast there. Dinner happy hour was just ok, but that could have been because it was July 4th. Only ate there twice"], ["Just cocktails", 4.0, "July 22, 2014", "Boatchick9", "Anchorage, Alaska", 65, 17, "I loves the friendly staff and great sunny atmosphere of this place. The bar tender has been around and is both traditional and creative, though he will make whatever you would like."], ["Great bartenders!", 4.0, "July 11, 2014", "Joshb2j", "Charlottesville, Virginia", 256, 156, "Was staying at the Beacon Hotel and had drinks a couple of times here. Good happy hour pricing. Great layout of the bar/grill--very spacious. Great bartenders...some of the friendliest and funniest I have encountered in a while. Will definitely pop back in here for a drink when I can."], ["Don't miss the guacamole", 3.0, "June 26, 2014", "EBrowne", "Pasadena, CA", 26, 8, "Fun place that usually has room (unlike the Sky Bar which is a \"scene\" and very crowded). Good drinks (I liked the muddled cherry lemon tequila thing that Jay made), excellent guacamole and salmon salad. Skip the sliders."], ["Cold food uncaring management", 1.0, "June 8, 2014", "robin t", "Phoenix, Arizona", 2, 8, "After 30 minutes, no phone answered -- went down in person told 30 minutes to receive food - got food that was cold and was told \"well we have a big operation here.....\""], ["Great Place to Eat", 5.0, "May 29, 2014", "16002014", "Washington DC, District of Columbia", 1, 0, "I have been several times to this restaurant, as I WORK JUST ACROSS THE STREET FROM IT. I have never been dissappointed."], ["Sunday Morning Breakfast", 3.0, "May 29, 2014", "JeffreyH617", "Boston, Massachusetts", 87, 26, "We were staying at the Beacon Hotel and they were offering 25% off of breakfast so wee gave it a shot. The service was decent, but i was surprised to find out they only serviced rye bread. I have never been to breakfast place that only services one kind of bread. My food was good other than that, but my...\n\n\nMore"], ["Sweet place", 5.0, "April 21, 2014", "Lauren R", "Tampa", 15, 13, "I didn't like the oatmeal - could have used some ground nuts - much but the omelette made to order was fabulous. The waitress needn't look so tortured. I love the music playing and the ambiance overall."], ["Brunch was ok...:-)", 3.0, "April 15, 2014", "Camilledd", "Blue Bell, Pennsylvania", 41, 26, "Had a great time eating here. The food was ok but the service by Alina was remarkable. She was exceedingly attentive and she made the food seem much better than it actually was...:-) The highlight for me were the omelets (perfectly cooked)..the rest of food was either - What a strange offering? or What is this missing?"], ["average", 3.0, "March 29, 2014", "Robyn H", "Farmington, New Mexico, United States", 16, 6, "It was nice to have the option of having a drink or breakfast at the hotel during our stay. The breakfast was average. The wait staff were very pleasant at the restaurant and bar."], ["Overrated brunch", 3.0, "March 24, 2014", "qastudio3", "USA", 13, 2, "I went for brunch with a group of friends... the best part was the company not so much the food or price. This place was very busy and I have no idea why. The price of $35+ tax + tip includes mimosas but for people who don't drink it is not worth paying this price when you don't consume the...\n\n\nMore"], ["Good food after walking around D.C.", 4.0, "March 17, 2014", "DDBjen", "Grand Rapids, Michigan", 86, 32, "After spending the afternoon walking around Washington D.C., I just wanted an easy meal. I chose the Beacon Bar & Grill because I was staying at the Beacon Hotel. It was good food. I generally have lower expectations when I eat at a restaurant connected with a hotel. However, this place was good. I started with a Late Harvest Salad...\n\n\nMore"], ["A good breakfast place", 3.0, "March 11, 2014", "K-nine15", "Atlanta, Georgia", 241, 68, "Breakfast is prepared properly and served promptly. The atmosphere is what you might expect in an upscale restaurant. But go there after 5:00 PM and it is a different story. It is loud,loud, very loud and understaffed. The severer was friendly and tried to be helpful but there were too many customers and too few of him. It is a...\n\n\nMore"], ["No joke on the bottomless mimosas!", 4.0, "February 26, 2014", "hellokitae", "Atlanta, Georgia, USA", 35, 17, "I think we ended up staying here for about 2.5 hours just chatting and drinking. This is definitely a boozie brunch spot! The food was okay, but staff was nice and a value!"], ["No flavor", 1.0, "February 25, 2014", "Lauren928", "Phoenix, Arizona", 13, 12, "I decided to eat here after a long day of traveling, since usually the hotel resturant is ok. I had the prosciutto wrapped chicken. It didn't taste like anything. I took a couple bites and gave up, it wasn't edible. There were a bunch of resturants down the street that I wish I would have just walked to instead."], ["Good service, good food", 4.0, "January 24, 2014", "fivefromco", "Denver", 81, 35, "I stayed in the hotel two nights for business, and both nights ate in the restaurant. I know, not exciting. But it was convenient and the food was good. Price was higher than restaurants at home, but pretty average compared to what you find in DC. I recommend the burger and the salmon."], ["Great Beacon", 5.0, "January 8, 2014", "Rob D", "Perth, Western Australia, Australia", 34, 18, "Had a good selection of drinks and I enjoyed my Pinot Grigios along with my triple sliders. Jim, the batman was very efficient and we had a wonderful conversation that made me feel very comfortable."], ["OK", 3.0, "January 5, 2014", "Timothy T", "Old Hickory", 3, 0, "Limited menu pricy, loud music. One dish was good the other was OK Only ate there because the Tripadvisor had a 50% off deal"], ["Only did the breakfast.", 5.0, "December 27, 2013", "BarbH1980", "Houston, Texas", 6, 3, "Tasty, quick service, nice atmosphere, reasonable prices. Stayed at the Beacon, so, obviously very convenient for the cold mornings we were having."], ["Awesome Sunday Brunch", 5.0, "December 16, 2013", "MrsNEvans", null, 3, 0, "Food was great, service was excellent. Not your typical Sunday brunch. Guaranteed not to be disappointed. Will return again. Kudos to Chef Dillon, Host Cameron and the wait staff Desi. Thank you guys!"], ["It all depends on the company you keep", 4.0, "December 15, 2013", "Lisa H", "Alexandria, Virginia, United States", 52, 9, "Joined a few friends for a pre holiday Sunday brunch. The mimosa's flow freely and the service was A-1. There was a crowd and they were in definatly ready for the holidays. The decor was great as the BBG is located in the basement of a historic DC hotel of the same name. It is the food that holds me...\n\n\nMore"], ["Sumptous Sunday Brunch", 4.0, "November 5, 2013", "Delores S", "Washington DC, District of Columbia", 14, 13, "A taste for every palette: salads, salmons, shrimps, grits, mashed potatoes, assortment of meats with carving bar, fried chicken, vegetables, soups, bread and breakfast fare and plenty of desserts."], ["Friendly service", 5.0, "September 10, 2013", "aileenTorontoCanada", "toronto canada", 25, 8, "Very good finger food and terrific guacamole. The service was excellent even though we were just there for food and did not order a drink"], ["Great happy hour and weekend brunch", 5.0, "September 9, 2013", "adricornell", "Amsterdam, The Netherlands", 165, 77, "Terrific food and drinks, friendly service, and a diverse crowd (which had more locals than people staying in the hotel)."], ["Steak and Potatoes a must!", 5.0, "September 3, 2013", "kkcarter1", "Washington DC, District of Columbia", 22, 32, "The Beacon Bar and Grill was great, the service is great and the décor in the main dining room is beautiful! The Teriyaki wings and the steak and potatoes with the gravy is delicious."], ["Yummy French Toast!", 4.0, "August 18, 2013", "Leslie W", "Mobile, Alabama", 3, 0, "We ate breakfast here before we checked out to go home. French toast was sooooo delicious! Yes it was a tad pricey, almost $20 for tea, meal, and tip. But that's what happens in a hotel restaurant- you pay for the convenience of not having to leave your hotel! Service was quick, server was somewhat cold and without personality. I...\n\n\nMore"], ["Late but great!", 4.0, "July 25, 2013", "vikki b", "Johannesburg, South Africa", 104, 47, "After a function in DC we made our way to the Beacon, it was 2030'ish, so quite late, but we were welcomed and shown a table. Service was tip top. I really thought as we were a big party that things could be chaotic. But everyone ordered and everyone was happy !! the food was gorgeous, from the hamburgers to...\n\n\nMore"], ["Great", 5.0, "July 21, 2013", "Vickie C", "Houston, Texas", 5, 2, "Food was excellent. Atomsphere was great. Customer service from staff was excellent. I would recommend to family & friends."], ["great food", 5.0, "July 20, 2013", "bayonnemom", "Bayonne, New Jersey", 46, 16, "nice place, piano player was extremely talented. the wait staff pleasant. food was excellent! prices were decent"], ["Breakfast was overpriced.", 3.0, "July 15, 2013", "Colette L", "Virginia Beach, Virginia, United States", 6, 10, "The servings were huge but overpriced. A basic veggie omelet will cost about $20. The decor was very nice. I appreciated the adorable half booths. Also the service was great. I loved our waitress."], ["Grilled Salmon Cool Cous Cous Salad, Moroccan Carrots & Tzatziki", 4.0, "June 23, 2013", "Boeleke", "Belgium", 73, 88, "Diner on the terrace. Everything was good and tasty. Nice white wine (happy hour price!). Good service."], ["Only had breakfast from room service", 4.0, "June 18, 2013", "D G", "New York City, New York", 2, 1, "Good, but wouldn't have added an additional tip had I realized there was both a delivery charge and a service feel."], ["Hostel", 1.0, "June 9, 2013", "michaelw1074", "Alexandria, Virginia", 37, 17, "We were here yesterday after Gay Pride. There was a group of 6 and a child. We walked in and I asked if we are able to go to the rooftop with a child. The hostess and manager said yes. We went to the rooftop and ordered food and cocktails. After and hour of spending money, a waitress named \"Gentle\"...\n\n\nMore"], ["Beacon", 5.0, "May 31, 2013", "relldy01", "Saint Charles, Missouri", 34, 11, "Have visited the Beacon Hotel for lunches and snacks before and we were not disappointed this year. Always good!"], ["The brunch was good but the service was terrible and it is terribly overpriced!", 2.0, "May 29, 2013", "wombat1223", "Charlottesville, Virginia", 335, 168, "We ate here several times while staying in the hotel. Each time the service was remarkably poor. For brunch we were told we could not eat inside only outside because of all the people with reservations but then most of the tables inside were empty. Finally we insisted on eating in and the tables remained empty the whole time. The...\n\n\nMore"], ["Good sandwich bad beer advice", 3.0, "May 24, 2013", "Andrew M", "Latham, New York", 3, 2, "Stopped in for a sandwich while my wife was shopping. Had the grilled cheese with short ribs sandwich. It was very good. Saw some beers with which I was unfamiliar and asked the bartender what they were; long story short he on his recommendation I choose a beer that he said was a pale ale, one of my favorite types...\n\n\nMore"], ["Creepy!!!!", 1.0, "May 22, 2013", "hmmreally", null, 1, 0, "Advice to the single ladies. The day time shift manager that goes by the name of st*ve is just simply creepy.He will sit and stare the whole time while you eat lunch.He also makes ridiculous, flirtatious, unwanted, remarks which made me feel extremely uncomfortable. Advice to the ladies,I strongly advise not to go there alone."], ["Don't pass up the Chef's Special", 5.0, "May 5, 2013", "David P", "San Francisco, California", 12, 5, "Don't pass up the Chef's Special during Lunch! Incredible and delicious food that was healthy and nourishing, not to mention extremely affordable! Eat here for lunch - trust me - you'll find yourself more than satisfied :)"], ["Cherry Blossoms WDC 2013", 5.0, "May 1, 2013", "dglukach", "Bedford, Texas", 63, 11, "Outdoor dining; exotic, retro decor; friendly staff; delicious, healthy menu; affordable; happy hour prices; super great $5 martinis."], ["Very good brunch", 4.0, "April 21, 2013", "KPR18", "Bowie, Maryland, United States", 222, 53, "It had been quite some time since we had been to BBG for brunch. It was as good as I remembered it was. The selections were very plentiful, with both breakfast and lunch items prominently featured. I honestly believe anyone could find something they would be happy with. All of the food looked very fresh and the presentation was nice....\n\n\nMore"], ["ok food, ok setting", 3.0, "April 13, 2013", "belviking", "Leuven, Belgium", 37, 12, "we were not inpressed by the food nor the atmosphere at Beacon Bar and Grill. This is a typical hotel style restaurant with ok food and ok atmoshere. You would not go there except if you do not want to leave the hotel."], ["Entrees Average Desserts Amazing", 3.0, "April 12, 2013", "GeorgiaSwimFamily", "Georgia", 7, 1, "We went there Sunday for the brunch. I made a reservation almost a week ahead and got one of the last times, which made me think the food was going to be amazing. I think the draw is the champagne and mimosas. We don't drink, so the price wasn't worth the food. The service was good, and the waitress was...\n\n\nMore"], ["Easter brunch turned dinner", 5.0, "April 1, 2013", "teatime679", "Woodstock, New York", 9, 1, "We arrived for the \"brunch\"at 3:30 - actually planned as an early dinner for us. We had reservations and were seated in the banquet room of the hotel. This might be great if you are with a large party but our group was just 5. I was not at all impressed by the room - very loud , many large...\n\n\nMore"], ["Great Bar", 5.0, "March 28, 2013", "Bruingal79", "Los Angeles", 8, 4, "This is a cool bar for after work drinks. Great martinis and the bartenders were fun. They run a pretty long happy hour and was a much better option than the restaurant at the Courtyard."], ["Best Brunch in Northwest Washington", 5.0, "March 3, 2013", "ReneeMona", "Pittsburgh, Pennsylvania", 26, 19, "Beacon Bar and Grill is a jewel in Northwest Washington. Their Sunday brunch is delicious serving both breakfast and lunch entrees. They have an omelet station as well. They have a huge selection of desserts - so hard to choose. The pecan pie and the carrot cake were my favorites.\nThey serve bottomless champagne, mimosas, or bloody mary's with their...\n\n\nMore"], ["Try it !", 4.0, "February 18, 2013", "garbeba", "Antwerp, Belgium", 30, 37, "Went for brunch and it includes all you can drink mimosas and champagne! Food :, certain selections were better than others. Omelets are prepared as you wish. My favorites the omelets and waffles ! Oh and they offer a large selection of desserts, yummy !"], ["Not Great at All.Will never be on my list of places to go again", 1.0, "February 18, 2013", "CDT22", "Washington DC, District of Columbia", 6, 1, "Food was not good, The Gumbo was not an Gumbo but an Soup. Everything we had was two days old. This was not a good start of a romance week-end . Only because my dinner partner had really wanted to show me a nice valentine day did I go out to dinner here . Never again, I know the Chef...\n\n\nMore"], ["Noisy for drinks, a bit too \"hopping\"", 3.0, "February 16, 2013", "boybanker", "Washington DC, District of Columbia", 141, 67, "Great venue, nice space with lots of glass to watch the street in the 17th Street neighborhood.\nFor drinks after work the wines were on the pricy side and the servers didn't seem too interested when it was clear we weren't having food. A shame, given how popular it could be."], ["Not So Great", 2.0, "February 9, 2013", "zipdip1212", null, 61, 26, "Food not that good and neither was the service. Staff was arguing in the kitchen. Wish I had skipped breakfast to be honest eggs were runny."], ["Wonderful Sunday Brunch", 5.0, "January 27, 2013", "JSan261", "Denver, Colorado", 2, 1, "Very good food. The place is fun on Sunday. The staff are wonderful. It is a great place to be for brunch. I recommend this place for a nice end to a party trip in DC."], ["Pricey, but average", 3.0, "November 26, 2012", "GoingNewPlaces", "Indiana", 118, 54, "We ate dinner here while staying in the hotel. Service was attentive (we were the only ones there) and food was good....not memorable, but good. We did have a mexican white cheese dip for an appetizer which I would recommend. Otherwise, our bill was about double of what we usually pay, but food wasn't anything special."], ["Good vibrant bar", 4.0, "November 25, 2012", "Howie13", null, 24, 24, "A hidden Gem near the DuPont Circle, great staff and awesome brews. Sunday Brunch is awesome and happy hour is between 4 and 7 pm"], ["I left, after they refused to serve me a Bloody Mary", 1.0, "November 25, 2012", "hypercritical", "London, United Kingdom", 59, 106, "I have been visiting the USA for many years. I have a property business in Miami. I have been travelling to Washington DC since 1994. I say that to make the point that I am an experienced traveller in the USA, and that I am not a spring chicken. I am, in fact, 45 years of age.\nWhy is this...\n\n\nMore"], ["Amazing Brunches!", 4.0, "October 10, 2012", "ScottinDC1975", "Washington DC, District of Columbia", 53, 20, "I have been coming here for years now and normally for Sunday Brunch. They have very good food buffet style on Sundays and a fixed menu on Saturdays. Both days have the option of adding bottom mimosas or bloodys. The price has varied and varies by Sat/Sun, but around $25-$30. Highly recommend reservations for prime time brunch on Sundays."], ["Great Fall menu lunch specials!", 4.0, "September 25, 2012", "Frank V", "Miami Beach, Florida, United States", 74, 13, "Warmish fall day had to eat outside. Tasty butternut squash soup and a grilled chicken salad with grilled acorn squash, dried cranberries, and pecans with a butternut squash vinegarette dressing. Great price great food attentive service!"], ["Bottomless!", 5.0, "September 15, 2012", "FromGoth2AZ", "Phoenix, Arizona", 205, 96, "My friends made a reservation for Sunday Brunch at Beacon. I was not sure what to expect since I am not a big fan of anything close to buffet style. But I was looking forward to the bottomless mimosas and/or bloody mary's . The place gets pretty full really early and reservations are a must. We were seated promptly at...\n\n\nMore"], ["I'm a fan!!", 4.0, "August 9, 2012", "msfiyah01", "Washington DC, District of Columbia", 60, 99, "Love this place! Went last week for my birthday with a bunch of friends. It's so hard to get attentive and courteous service in the city, but Sarah, our server, was absolutely AWESOME! The Beacon has a great happy hour, with tasty apps and delicious cocktails... oh, and great service! :) Cocktails that are not on the happy hour menu...\n\n\nMore"], ["Just ok...", 3.0, "July 14, 2012", "MrsAType", "Upper Marlboro, Maryland", 14, 8, "Dined her for father's day. Had heard many reviews about the brunch. No impressed at all. For the amount they charge I was expecting more than the typical salads, omelet station, desserts, and carved meats. The endless Mimosas were definitely the highlight. The entire restaurant has THREE highchairs - totally ridiculous. Won't be going back."], ["Unsatisfied", 3.0, "July 10, 2012", "Selmin K", "Istanbul, Turkey", 21, 15, "I liked the breakfast room because it was clean, quiet and we were seated. It started well then when we ordered continental breakfast it was disappointing because the portion was small. My husband wasn't satisfied so we had to order extra turkey sausage which actually I didn't like. By the way continental breakfast doesn't meet the fee you paid."], ["Great Mothers Day Sunday Brunch", 5.0, "July 9, 2012", "JulyLadyjaye", "Woodbridge, Virginia", 44, 8, "The Mothers Day Sunday Brunch was excellent. We were seated on the same level as the buffet which made it very nicy. Our server was excellent and filled out glasses (water and/or Champagne) before we could ask. She made the day very special.\nThe food was very good and there was a wide selection for all ages."], ["Lunch Disaster", 1.0, "June 13, 2012", "Surely_U_Jest", "Washington DC, District of Columbia", 63, 63, "First time local diners with high hopes that ended up as big regret. Arrived a few minutes after Noon on a pleasant sunny Wednesday. Seated on the patio which was about 50% full. We were greeted promptly by the server, received menus and placed a drink order. Shortly thereafter a different server came up to our table to inquire about...\n\n\nMore"], ["just the right menu choices", 5.0, "May 11, 2012", "MikeFalley", null, 26, 18, "The restaurant had a nice variety without having \"book\" menu."], ["Good food and ambience.", 4.0, "April 30, 2012", "1chunkyguy", "Morgantown, Kentucky", 22, 18, "My wife and I ate here on a Sunday afternoon. The atmosphere was good and relaxed. The menu was small (we were told because it was Sunday) with cheeseburger, pork chop, chicken, and lobster cheese macaroni. My wife ordered the pork chop and I the chicken. They were both cooked very well and tasted good. It was our first time...\n\n\nMore"], ["Racist establishment", 1.0, "April 28, 2012", "travelphil81", null, 1, 1, "Refused service because I had a legal temporary Texas ID. This establishment fabricated some rule that they could not serve a thirty year black male."], ["great food", 4.0, "April 24, 2012", "brooklyn_trini", "New York", 2, 0, "I liked the fact that it was in the lower level of the hotel"], ["Food is not bad, but not cosy, romantic or trendy att all - average foodcourt feel", 3.0, "April 23, 2012", "JeroenAlexander", "Washington DC, District of Columbia", 30, 17, "We tried the place as it was marked as a great brunch spot, but likely wouldn't return. No complains about the food, it was allright. Their royal with the mimosa's (true bottomless) and overall reasonable value for money. But the place has this foodcourt/fastfood vibe that doesn't match with the neighbourhood. It quite loud and crowded, probably great if you...\n\n\nMore"], ["Great brunch", 4.0, "April 23, 2012", "MaKuFL", "Miami, Florida", 142, 75, "Great brunch, outdoor dining is in prime location."], ["Great location, really small tables", 4.0, "April 21, 2012", "newflyer", "CT", 204, 141, "We were staying near this hotel and decided to try a new place for breakfast each day and choose this place one morning. The food was great. We are 2 adults and twin 10 year olds. Each of us had a completely different item for breakfast and we were all very pleased with our meals. The table was very small...\n\n\nMore"], ["Quick beer...", 1.0, "March 27, 2012", "TEXASconnie", "San Antonio", 24, 3, "Enjoyed the beer, nice location, waiter nice & fast."], ["Best Sunday Brunch in Downtown DC", 4.0, "March 15, 2012", "Tony J", "New Jersey", 302, 594, "I have been here at least Fitteen (15) times for my most favorite (BEST) DC Sunday brunch located near my favorite Roman Catholic Church the Cathedral of Saint Matthew The Apostle down the street from Beacon. My party of eight (8) arrived on time at 11:30am and we were seated immediately. As usual the choices and quality of food did...\n\n\nMore"], ["Awesome!!!", 5.0, "March 12, 2012", "Craig S", "Columbus, Ohio", 1, 0, "Had an awesome brunch and the price was great for that kinda of great food served"], ["Poor Food, Service Not Good, Will not go back", 2.0, "March 11, 2012", "bubba086", "Fort Lauderdale, Florida", 212, 74, "This place is known for a great Sunday Brunch which I have visited before, but during the week it was horrible, I will never go back - The Service was very slow - fish looked it was frozen and breaded, if you like green beans they were fresh and crispy"], ["Convenient", 4.0, "February 24, 2012", "R O", "Magnolia, Texas", 138, 37, "Dined at this restaurant because it was connected to the hotel where we were staying for a business trip, for dinner and breakfast. Dinner menu was not extensive but all of the items we ordered were quite good. Service was attentive. Restaurant was relatively quiet (only about half full), which made dinner conversation effortless. Breakfast was excellent."], ["Inexcusable", 1.0, "February 13, 2012", "DCFed", "Washington DC, District of Columbia", 83, 33, "What Beacon is doing on Sunday is inexcusable! I will never go back.\nOn Sunday they do a good brunch, expensive but good. I went and after driving around for parking than waiting in line they asked how many, when I said 2 they said sorry, there are no tables for two, \"PERIOD\" I said \"there wont be any tables...\n\n\nMore"], ["Phenomenal Brunch-great price & bottomless mimosas!", 5.0, "February 13, 2012", "Kimmy-Rae81", "Washington DC, District of Columbia", 18, 5, "I read the reviews & agree that the bottomless Mimosas OR Champagne was an added touch to a Saturday Brunch. It was inexpensive--3 course brunch with bottomless for $22.95, & really good. he had the steak & I had the waffle...neither were disappointed & we made happy plates--well I almost did ;). We even took our 3 course dessert home...\n\n\nMore"], ["Best DC Brunch", 4.0, "January 8, 2012", "Tony J", "New Jersey", 302, 594, "I have been here at least ten times for my most favorite DC Sunday brunch. My party of eight arrived on time at 11:30am and we were seated immediately. As usual the choices and quality of food did not disappoint any of us. Unlimted champagne, mimosas and spicecy bloody mary's is what this place is all about. Eggs any style...\n\n\nMore"], ["Unlimited Mimosas!", 4.0, "December 31, 2011", "homosassa1", "Crystal River, Florida", 18, 14, "After reading some reviews I thought I'd give this place a go. Like other reviewers mentioned, be sure to get a reservation for brunch. The food was very fresh, and tasty. The wait staff will not let your mimosa glass go empty. I definitely plan on making a trip back. Nice atmosphere, and if the weather is nice I'd recommend...\n\n\nMore"], ["Scrumptious brunch!", 4.0, "December 16, 2011", "Jennifer W", "Washington, District of Columbia, United States", 2, 1, "I've been here for brunch a few times, dinner twice, and a few happy hours. Drinks and meals are reliable, and happy hour is very fairly priced.\nThe brunch, however, may be the true standout. A whole room of salads, omelettes, carving station, cakes and pies, pasta, and fruit draws a huge crowd every weekend. It's not cheap ($30/head) but...\n\n\nMore"], ["Nice atmosphere, very good food", 4.0, "November 26, 2011", "Patricia R", "La Paz, Bolivia", 72, 26, "They have a bar, which can get noisy, and the restaurant in the back. It is nicely decorated, the food selection is very good, and service is excellent"], ["Didn't really love it", 2.0, "November 10, 2011", "brooke2h", "Round Rock, TX", 53, 15, "I had wanted brunch but they didn't start serving till 11 and I wanted to get out to go sight seeing. So I settled for the breakfast menu. I ordered the Belgian Waffle and it was okay but honestly it could have been a waffle out of my toaster oven. There are other places in the area that I would...\n\n\nMore"], ["After work happy hour - no atmosphere", 3.0, "October 27, 2011", "gregv_ma", "South Burlington, Vermont", 136, 75, "The bar attached to the Beacon Hotel. Gets some after work happy hour business. Otherwise, has all of the atmosphere of a Denny's"], ["Brunch goes too late, and food decent not amazing", 3.0, "October 18, 2011", "Jay S", "Newton, Massachusetts, USA", 414, 152, "Went there on a Saturday for what we hoped would be lunch (I believe we went around 1:30pm -- whatever time it was, it was definitely after noon) but arrived and were told they were only serving brunch. While I understand having brunch hours extend that late, I don't understand why the lunch menu couldn't be available also. Anyway, we...\n\n\nMore"], ["decent food, but better go elsewhere", 3.0, "September 17, 2011", "portland97227", "Portland, OR", 6, 13, "I stayed at the hotel for work. I am a foodie. I came down for dinner and was shown to a table. I had to wait at least ten minutes to get any service at all. It was an almost empty restaurant. the waitress vaguely apologized she hadn't realized I had been seated, but continued to forget about me all...\n\n\nMore"], ["This review is only for their Sunday brunch", 4.0, "September 15, 2011", "P G", "Toronto, ON", 54, 29, "This place has a lot of bad reviews - with respect to their Sunday brunch, I think it is great IF you know what you are getting. It is $30 for buffet brunch and all you can drink champagne/mimosas/bloody marys. This is a great deal if you want to have a long relaxing brunch with a lot of drinks. The...\n\n\nMore"], ["avoid the waffle", 2.0, "August 18, 2011", "jujSF", "San Francisco, CA", 45, 16, "best brunch in DC? ummm, that's sad if it is.... maybe if we had gotten the prix fixe with bottomless mimosas, the booze would have confused us into thinking the food was actually good. but we decided not to do the prix fixe option since we only had slightly more than an hour for brunch, so we didn't really have...\n\n\nMore"], ["Awful", 1.0, "August 3, 2011", "dc150", "London, United Kingdom", 1, 0, "very slow service, when food arrived one persons food was missing, after asking after it, it turned out it had been forgotten it took another 10 minutes after that, drink order was completely messed up, received a glass of coke after asking for vodka and ginger ale, when food finally arrived there was a hair in it, after complaining the...\n\n\nMore"], ["Impressive service", 5.0, "June 12, 2011", "lenny077", "Washington DC, District of Columbia", 1, 0, "had an excellent brunch at the bar & grill, the food was delicious and the service was perfect. just when i thought i had it all, i went to the front desk for quarters for the meter and kingsley at the front desk treated me like a guest staying at the hotel with courtesy. enjoyable experience!"], ["Mother's Day Brunch - eating time limited to two hours, yet this not advertised", 2.0, "May 9, 2011", "Ruth1203", "Washington DC, District of Columbia", 1, 0, "On Mother's Day my family members and I were told by the waitress that last round on service would be in 10 minutes, enforcing a two hour limit for eating/drinking that was not advertised. At that time I had not started desserts. This restriction ruined my day. I will not go back even though the food and service were good....\n\n\nMore"], ["Poor food, worse service", 2.0, "April 24, 2011", "60795Nick", "Philadelphia, Pennsylvania", 5, 3, "Based on tripadvisor we tried this, and wished we hadn't. The food was poor, service was worse, and the waiter increased his tip when he ran our credit card after we left."], ["Jolly atmosphere and good honest food", 4.0, "December 31, 2010", "Judeteach", "Cardiff, UK", 135, 54, "The Beacon Bar and Grill is a lively, happy place with good service. Has a good range of food, e.g. as a semi-vegetarian {I eat fish} there were quite a few options for me. I settled on Cod and chips which was filling and nicely cooked. My meat-eating frioends were very happy with their fare."], ["Awesome brunch", 5.0, "September 7, 2010", "ande070806", null, 90, 99, "Beacon Bar and Grill is located in DC’s Dupont neighborhood. I made reservations through open table. We were 5 minutes late due to having problems finding the place from the Metro (we are not familiar with DC); however, we were seated immediately. I would have liked to sit outside because the weather was beautiful but we ended up inside. I...\n\n\nMore"], ["Best veggie meatloaf", 5.0, "August 13, 2010", "Christine S", "San Francisco, California", 12, 8, "This is a very nice restaurant located near DuPont Circle. It has an attractive outdoor patio, and our meals were delicious. I had the veggie meatloaf, and loved it. The service was outstanding."], ["Great food, service and value", 5.0, "September 25, 2009", "NCLuckyWon", "Concord, NC", 24, 10, "We ate lunch at Beacon Bar & Grill during a recent trip to Washington and were very impressed with every aspect of our meal. The food was excellent (between the four of us we tried two salad entrees, a pasta dish and a burger), service was exceptional and the atmosphere was elegant, fun and enjoyable. We were told by several...\n\n\nMore"], ["Nice restaurant", 4.0, "August 30, 2009", "pina71", "New Jersey", 40, 12, "We were staying at the Beacon Hotel so we had a 15% coupon for any meals at the Beacon Bar & Grill. We had one lunch there and the rest were breakfasts. The food was good and plenty and the service was very nice. We recommend it!"], ["Great option for brunch...", 4.0, "April 19, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great option for brunch! Free cappuccinos, bellinis, and bloody marys with a bountiful selection of brunch items. Park in a nearby garage for $5."], ["$24.95 brunch buffet with excellent selection and unlimited mimosas.", 4.0, "May 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "$24.95 brunch buffet with excellent selection and unlimited mimosas."], ["Just Lovely!", 4.0, "May 9, 2008", "rara8698", "rara8698", 79, 51, "My boyfriend and I happened upon this place walking back to our car after a haircut in the city. It's set in bushes and bushes of roses! You can't even see the restaurant b/c there are so many rose bushes in front- it's just gorgeous. So we took a look at the menu and decided to give it a try....\n\n\nMore"]]], ["Black Rooster Pub", [["Very good experience", 5.0, "September 28, 2015", "Tedward1964", "Springfield, Virginia", 38, 18, "Went for lunch and really enjoyed it. Very good food. The staff was friendly and helpful. Our waitress, Emily, was attentive without being intrusive. I had the blackened chicken sandwich on special and it was delicious! The soup tasted like homemade. I will be back to try more."], ["Real Pub experience", 4.0, "September 18, 2015", "Bruce R", "Sarasota, Florida", 41, 17, "Hit the Black Rooster for happy hour and Tuesday was half priced burger night. The burgers looked awesome and were excellent. Large, juicy, and a selection of toppings adds to the treat. Draft beer was $4.00. Can't beat that for this area. The service was good and I recommend going early because it does get busy."], ["Good pub food", 4.0, "August 26, 2015", "Godguy", "Reston VA", 283, 201, "Typical bar fare but well done. My grill cheese was done with good sourdough bread, two layers of sharp cheddar, bacon, tomatoes and onions. It was delicious. My one complaint was that the onion rings and french fries were not drained properly. They got soggy quickly. Emil was a great server. Would return if in the area."], ["Nothing to brag about", 2.0, "June 16, 2015", "lphennicie", null, 5, 7, "We needed a quick bite after arriving late and stumbled upon this place. It was your average bar atmosphere. The food was greasy and lacked flavor. The service was us approaching the bar ourselves for everything we needed. Drinks were over priced for the type of establishment."], ["Nice Pub with Great Food!", 5.0, "April 20, 2015", "David A", "Williamsburg, Virginia", 2, 3, "I have enjoyed this pub on two of my visits to Washington, DC. I highly recommend the fish & chips. The service was attentive and polite. I will be sure to visit again the next time I'm in DC."], ["Cozy and friendly", 4.0, "April 8, 2015", "MisterMet", "Massapequa Park, New York", 101, 85, "Stopped by for burgers and beer while we were staying at a hotel nearby. Cozy with a lot of charm. Burger was excellent and the beers/sodas were cold. Friendly waitress. The other menu choices all looked tempting. I would definitely go back"], ["Great Local Pub", 5.0, "January 27, 2015", "Daniel S", "California", 66, 17, "Long Happy Hour until 8pm and good food. Good selection of premium and micro brew beer. Been there for a long time I highly advise you to try it out."], ["Cool Pub, Service Fair", 3.0, "December 9, 2014", "Jennifer B", "Florence", 235, 57, "We got into DC late and wanted to grab a small bite to eat and a drink. There was a lack of service at the tables so we had to approach the bar to get menus and place our order. Food was good, atmosphere was cool - just the service was lacking outside of the bar. The bartender was great...\n\n\nMore"], ["Very friendly pub", 5.0, "December 9, 2014", "Tucker70", "Wilmington, North Carolina", 9, 4, "This place is unlike the other bars we visited in D.C. It was old pub decor but not stuffy or stale. Very relaxed atmosphere and everyone was friendly. We took the last 2 available barstools and almost immediately the bartender, Chris, greeted us and got our drink order. In fact, her words were, ''What are you kids having tonight?'' and...\n\n\nMore"], ["Cosy pub great food", 5.0, "December 2, 2014", "biarritzblue", "Baltimore, Maryland", 48, 13, "This is a small pub with a cosy atmosphere. Had the salmon fillet salad and Rooster steak, both great good and good value. The owner is often on site just having a drink and chatting with people."], ["A pleasant find...", 4.0, "September 26, 2014", "Dave O", "Springboro, Ohio", 14, 10, "A very comfortable pub. Service was good and unusually friendly, the bar backsplash was beautifully handcrafted wood more than 100 years old. Happy hour prices on food and drinks made for a great value. I will definitely return..."], ["Worth a Try", 3.0, "September 9, 2014", "Yossarian47", "Ann Arbor, MI", 15, 30, "My lady and I stopped in at the Black Rooster this last week while staying in a nearby hotel. We sat at the bar and experienced fast, friendly service. We ordered some typical bar grub that turned out to be better than the average. Overall we marked it as a good place to stop in for good food and a...\n\n\nMore"], ["Great food!", 3.0, "August 15, 2014", "Natalka7101", "Washington DC, District of Columbia", 57, 38, "It was our first time here and we experienced very slow service. In waitress defense: they were short-staffed! But the food was very delicious! We will come again and hopefully get faster service :)"], ["Loved the Pub", 4.0, "June 18, 2014", "Chrissy204051", "Brisbane, Australia", 104, 39, "This was a really friendly place to have a cold beer and chicken wings. The food was very good pub grub, the wings sauce, the best we have tried. The décor of the pub is really detailed and provides a really great atmosphere for a drinks with friends."], ["More like dead ducks", 1.0, "July 26, 2013", "eagleterry", "Lincoln, Nebraska", 96, 42, "Perhaps the worst meal we had in DC. The services was very slow, not correct and boarding on rude. Our meals were incomplete, and cold. My fries must have been sitting on the counter for about 20 minutes (a raw potato might have tasted better). The beer was not very cold, and it was way too loud. Not again!"], ["Emphasis on the libations", 3.0, "June 28, 2013", "Eddy35", null, 55, 10, "Great stuff on tap and the bottled beer selection is good. The decor is not so much pub as bar, and the food is not the strong suit here. The menu reminded me of what one sees in a chain short order restaurant. I would return for a cold beer, but not for the food."], ["Who would have thought", 5.0, "June 12, 2013", "travelz9", "Washington DC, District of Columbia", 70, 17, "a place that looks so small could be as good a place to eat as I have experienced. The wait for service was less than a minute, the order taken quickly and delivered just as fast. Ate off their Happy Hour Specials menu (listed as 5:00 to 8:00 PM Monday - Friday). One does have to purchase a beverage in...\n\n\nMore"], ["Just a pub", 3.0, "March 26, 2013", "margaretelise", "Rego Park, New York", 94, 36, "Before last week I'd only ever been here at night drinking with international dev people. This time we had lunch. Service was fine - very friendly staff though my companion is a 'regular' so that probably helped :) I started with chili which was slightly above average for a bar but lacked onions or cheese. Then I had a salad...\n\n\nMore"], ["Affordable meal in a expensive city", 4.0, "December 11, 2012", "TTPC", null, 17, 8, "A group of 4 of us ate and had some drinks at this pub. Atmosphere is typical bar/ pub. Food was very good and portions were on the large side. Price was very affordable. Service was ok but nothing to get excited about. Would eat here again."], ["Just don't order the fish and chips!", 2.0, "October 17, 2012", "ccincalif", "Los Angeles, California", 58, 120, "I was walking the DC area by myself and spotted this pub so went for lunch on my birthday as I love fish and chips. The pub itself is nice enough, but I was so incredibly disappointed with the fish and chips. It looked really good when it came out, and I was so looking forward to it, but after...\n\n\nMore"], ["Nice Little Neighborhood Pub", 4.0, "July 5, 2012", "CWH3", "Philadelphia", 88, 62, "Saw the reviews here and, since I was in the mood for a good beer, headed over. I was expecting a crowd, but the place was fairly quiet. Great selection of beers...I had a pitch black IPA, very rich and flavorful. The service was prompt, the waitress very friendly. Dinner menu was very typical pub fare, nothing that stood out....\n\n\nMore"], ["Great food ,great atmosphere", 5.0, "June 23, 2012", "Basbabru", null, 34, 9, "Very nice bar / restaurant\nBest ribs in DC, falling off the bone\nStaff was very helpful"], ["Best reuben I've ever had!", 5.0, "June 18, 2012", "AKjazzj", "chicago", 200, 79, "I popped here looking for some relief from the busy streets of DC and found that and more...great food! After so many gleaming, salad places in DC it was wonderful to find an actual pub with good food. I had a reuben and it was steaming hot and made with tender corn beef. The service was terrific and the price...\n\n\nMore"], ["Burgers!!! Mmmmm", 4.0, "May 28, 2012", "JackSchnauzer", null, 32, 15, "Great place to hang out, love the burgers!!! Mmmmm...."], ["Atmosphere and service with a smile", 5.0, "March 23, 2012", "love_2_travel666", "Durham, England", 58, 61, "great pub, staff very friendly and welcoming, very reasonable costs for beer."], ["A proper pub in DC", 4.0, "October 28, 2011", "Anthony_B_02", "Washington DC, District of Columbia", 81, 49, "They have a large bar, a good beer selection, plenty of seating for a bar this size, and the food is actually pretty good. I also like the atmosphere. Its very unlike DC to have a pub like this. I'd come back here"], ["Great Pub!", 5.0, "August 27, 2011", "WynneWoody", "Washington DC, District of Columbia", 281, 270, "I agree with the other reviews. This is the real deal - not some tacky \"pub\" chain. The service is friendly and engaging and the food is good. The atmosphere is intimate and casual, with the feeling that you are in a local hangout - because you are. Nice place that hits the mark for what it is trying to...\n\n\nMore"], ["Great food and fun!", 5.0, "August 20, 2011", "SATXtraveler55", "San Antonio, Texas", 50, 38, "Went here late for dinner and was not busy. They were happy to take a restaurant .com coupon and we had some great sandwiches and fish and chips. the waitress was very engaging and funny. They may consider a childs menu but was still affordable with full size plates. Clean and interesting narrow pub with some outdoor seating in a...\n\n\nMore"], ["Quiet pub that locals go to", 5.0, "April 12, 2011", "Brug72", null, 21, 9, "If you want a quiet drink and pub food in Washington DC without too much hype then the Black Rooster is worth stop. Good service and the staff seem to enjoy working their. Food was good and reasonably priced for pub food. Quite a few locals seem to drink their too. Whether by yourself or with a few friends, this...\n\n\nMore"], ["The Black Rooster is a non-descript narrow/deep pub that knows what it is and is not trying to be something it is not...", 4.0, "May 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The Black Rooster is a non-descript narrow/deep pub that knows what it is and is not trying to be something it is not. If you're looking for a fake Irish pub that is trying hard with fake Irish looking decor, this is not the place for you. Rather, Black Rooster is a throwback to the old pubs of the 70's...\n\n\nMore"]]], ["Sweetgreen", [["Leaves you feeling great!", 4.0, "February 27, 2015", "LuisaCordoba", "Washington DC, District of Columbia", 7, 2, "This is near my office so I do go there often. Their produce is really top quality, their staff is super courteous, and I particularly like their prepared salads -- the rad thai and spicy sabzi (sriracha!). A salad is a full meal, and never leaves you feeling heavy ... or you know, that feeling when something in a salad...\n\n\nMore"], ["Best and freshest salads", 5.0, "September 16, 2014", "John A N", "San Juan, Puerto Rico", 158, 63, "Excellent,fresh and seasonal selections of salads. Fast and courteous service. Best salad eaten has been the rad thai salad"], ["Delicious!", 5.0, "August 25, 2014", "nancycleveland", "Cleveland", 30, 7, "Salad was fresh and delicious! The employees are caring and competent. I tried the kale Caesar ...yum!!!"], ["Healthy Eating", 4.0, "July 31, 2014", "Route66travel", "Albuquerque, New Mexico", 129, 33, "Very interesting \"salad bar\" with lots of good stuff to eat. Will try it again. Try some of their suggestions, they are very good."], ["very tasty fresh salads prepared quickly", 4.0, "May 22, 2014", "transnick", "San Francisco Bay Area", 74, 57, "Every salad we had there was super fresh and super tasty.\nPlace is modern and super clean.\nI like my salad with enough dressing to taste it (they offer three levels, no charge).\nThey do offer reasonable drinks, including a simple glass of water.\nSo a great salad prepared fresh and quickly for $11 or so.\nWhy does healthy food...\n\n\nMore"], ["just your average Sweetgreen, not many choices", 3.0, "May 2, 2014", "jg325", "WashingtonDC", 489, 320, "I been to this Sweetgreen a few times because it's very close to my house, but unfortunately, it does not hold a candle to Chop't.\nThis Sweetgreen is like any other one around town, which is good and bad at same time. At least you know what you're getting. But I find that the options here are not very numerous...\n\n\nMore"]]], ["Rito Loco", [["Savory and Sweet", 5.0, "July 9, 2015", "va70aux", "Falls Church", 21, 6, "As their food truck isn't represented on TripAdvisor, leaving my review on their brick and mortar place.\nFirst, go to Rito Loco's website and sign up to be a VIP. At the time of writing this, you will receive a 2x1 coupon by e-mail. My coupon stated it could be redeemed at their truck (at the time I received it,...\n\n\nMore"], ["Fantastic food!", 5.0, "July 5, 2015", "Apey1000", "Lake Villa, Illinois", 27, 17, "Amazing food! Good spice, but not overpowering. Even my kids loved it! Would definitely come back if in the area again!"]]], ["Chicken Rico", [["Awesome front counter restaurant", 5.0, "September 5, 2015", "carlos f", null, 21, 6, "I have stopped by this quaint little restaurant on several occasion and these guys are consistent:-). Warm smiles hot meals great price."], ["Chicken lover loved this place", 5.0, "April 14, 2015", "joerie", "Oak Park, Illinois", 58, 40, "I am a chicken snob and have a high standard for rotisserie chicken- I was delighted at this new Peruvian chicken restaurant. I ordered half a chicken with the plantains and they were delicious. The plantains are one of their specialties and paired well with the chicken. Chicken was tender juicy and fresh- I loved the skin - one of...\n\n\nMore"], ["Follow your nose!", 4.0, "March 17, 2015", "Czajka_Madness", "Waldorf, Maryland, United States", 25, 19, "This place is better than most at Union Station and is a short walk away. You can get lunch and a drink for about $10. Freshly charbroiled Peruvian Chicken is excellent. I got a quarter white meat with two sides to go. What most impressed me, and I'm not sure it was this particular server, is that they put the...\n\n\nMore"]]], ["Sichuan Pavilion", [["Authentic Chinese food in downtown D.C", 4.0, "September 27, 2015", "Mr_Boo", "Pennsylvania", 24, 6, "I'm sorry to say that downtown D.C is not the place for good Chinese food, this is probably one of few Chinese restaurant that offers authentic Chinese dishes in D.C. Don't come here for Beef and Broccoli like my son because it's not below average.....We had Braised tofu (amazing vegan dish if you like tofu) and Chinese Spanish with garlic....\n\n\nMore"], ["Good Food and Quick, Friendly Service", 4.0, "September 13, 2015", "GolferKen", "Mount Joy, Pennsylvania", 69, 19, "We were looking for a quick meal and certainly got it. After ordering a beer (no Chinese beer in a Chinese restaurant??) and a pina colada my wife thought was excellent, we received our food within minutes of it being ordered. Despite our initial suspicions of it sitting around waiting for someone to order, we were surprised by the freshness...\n\n\nMore"], ["Reliably very good food, and great service", 4.0, "August 22, 2015", "JZBach", "USA", 62, 13, "We go here once a week for lunch, and occasionally for dinner. The food is very good, and the service is excellent. Try the Wonton Soup and the Shrimp and Cashew entree."], ["Good Chinese Food", 3.0, "August 16, 2015", "CatoMtsio", "Chania Town, Greece", 51, 25, "I found this eating establishment en route to eat at Noodles & Company. I am open to eating at commercial style eateries but I prefer authentic ethnic restaurants instead. I had early dinner. I observed the following: the restaurant décor seemed dated but dining area seemed clean; service was prompt; food prices seemed reasonable for the location. I would return...\n\n\nMore"], ["Chinese food - just as we like it", 4.0, "August 2, 2015", "LeneBBruun", "Oelgod, Denmark", 10, 2, "Great restaurant with lot´s of atmosphere and friendly staff that took the time to make the group feel welcome and also took the time to explain the menu so everybody understood it."], ["Very bad taste", 1.0, "August 1, 2015", "Sarkan K", null, 3, 0, "The service was good and they were friendly somehow but the taste of food was disaster.\nVery bad duck, very bad orange chicken, very bad scallop. Before five years ago I ate in this restaurant it was good. I don't know why today was disaster."], ["Horrible Food and Horrible Service", 1.0, "July 16, 2015", "BKYESS", null, 37, 37, "Visited for the 1st time, surely will be the last time. The food that I ordered took less than 2 minutes to come to the table (Wonder How), extremely over priced. I also felt discriminated as I was there 20 min before the restaurant closed and I was told please hurry up. There were 2 more separate parties that came...\n\n\nMore"], ["tasty, quick-service restaurant", 4.0, "July 11, 2015", "dellamarie11", null, 19, 7, "Delicious flavors, big portions.\nLove the tea they give in the beginning of the meal - the little things truly make the difference\nFood came out quickly, servers were excellent.\nI would definitely come here again - especially if I was short on time."], ["Superb authentic Chinese food; below par service", 4.0, "July 10, 2015", "S_Biks", "Singapore, Singapore", 14, 4, "Don't miss Orange Chicken, Spicy Tofu.\nServing sizes are generous, ensure u don't over-order.\nBe prepared for long queue, rude customer engagement and poor service"], ["Tasty food but arrogant service", 2.0, "July 8, 2015", "zevadrouilleur", "Washington DC, District of Columbia", 71, 35, "The food is tasty and authentic Chinese but not at the level expected for this price level. The menu has a good selection. The place is busy but lacks a bit of character. The service is fast but lacks interest in the client and is very arrogant. Sure, the service is fast but that does not compensate the remaining aspects...\n\n\nMore"], ["Not trying hard enough", 4.0, "June 30, 2015", "TravelingTartar", "Washington DC, District of Columbia, USA", 81, 24, "I love going to Sichuan Pavilion. In fact, I've gone with two out of town Chinese friends who liked it very much. But neither of them was astounded. Nor was I. This is a good restaurant. The food is genuine Sechuan. But it's not perfect. I'll give you a concrete example. I'm vegan and go there relatively often. I order...\n\n\nMore"], ["Authentic, tasty, great", 5.0, "June 14, 2015", "DBrynR", "Doha, Qatar, Middle East", 15, 8, "Super stuff. Delicious food that delivered exactly what it promised. The three dishes I tried were all very tasty and anyone who was looking for some real Sichuan food would surely recognize the menu and enjoy it."], ["Authentic, busy, and delicious!", 5.0, "April 9, 2015", "hokies_k", "Washington DC, District of Columbia", 13, 8, "This is my go to place for authentic Chinese food. The food there makes it worth both the wait and the money. I would avoid lunch/dinner rush hours. Best time to go for lunch is before 11:30 AM, and dinner before 6 PM.\nIf you are adventurous and can handle spicy food, try out their Pork Intestine In Hot Pot...\n\n\nMore"], ["This is a terrible restaurant", 1.0, "April 1, 2015", "Joe888544", "Seattle, Washington", 1, 0, "By searching internet, we chose this restaurant for our first night dinner. It was very disappointed. The food is not good at all. The table is tiny and the service is bad. Tea tasted terrible. It was very expensive too. I would never come back to this restaurant. Of course, I would not recommend to anyone."], ["Okay food, nicely decorated restaurant", 3.0, "February 11, 2015", "BrandingExpert", "Seattle, Washington", 61, 17, "We have Chinese food in restaurants at least once per week. While this restaurant has an extensive menu, the taste of the food was rather bland even though it was spicy as Sichuan food usually is. There was not one outstanding dish among the many that we had. Squid, okay. Fried rice, mediocre. Chicken dishes, spicy but very little taste....\n\n\nMore"], ["Very good authentic Schezuan", 4.0, "January 27, 2015", "TheDeacon87", "Great Falls, Virginia", 300, 213, "There are lines out the door and there is good reason for that. This is some of the most authentic food that I have had. The service is undoubtedly spotty but the place is so darn popular that it is hard to blame them. I would give the place five stars if it was a little better scenery and the...\n\n\nMore"], ["the real deal", 5.0, "January 25, 2015", "trav419", null, 10, 1, "I have absolutely no idea what the poor reviews are about. I have been here many times and the food and service are always great. They serve very large portions at a great price, especially considering the area. We had dinner here a few weeks ago on a busy Saturday night and everything was amazing as always."], ["Poor service and low-quality food", 1.0, "December 13, 2014", "SZ49", "Toronto, Ontario, Canada", 42, 26, "I had eaten at both Sichuan Pavilion and Chalin for more than 20 times for social purposes. The service was awful, and the 15% tips were mandatory for all the times that we went there for lunch or dinner. If you friends arrive more than 10 minutes than you, they will not allow you to sit. They are also very...\n\n\nMore"], ["Food good. Owner rude.", 1.0, "November 20, 2014", "momtothreegreatkids", null, 3, 4, "We go regularly. Food is good. Owner is rude. Recently we had a large group dinner there and the owner asked us to leave the minute we were finished eating so he could turn the table. We couldn't even order dessert!!"], ["Great food", 5.0, "October 29, 2014", "Gail D", "Mount Prospect, Illinois", 27, 21, "The food is great and reasonable priced. The staff was very attentive. Our water glasses were never empty and the food was brought promptly to our table."], ["Booking advised...don't turn up in hope", 3.0, "October 28, 2014", "Walford2", "Ross-on-Wye, United Kingdom", 27, 13, "A very average chines restaurant serving absolutely massive portions. Our rice dish plus two others would have served six easily! Expensive and not good value for money."], ["Delicious find in Downtown D.C.", 5.0, "October 18, 2014", "Rachel Y", "Baltimore, Maryland", 12, 6, "Stumbled upon this place on Christmas Day one year and it turned out to be a beloved favorite. They have a section of the menu labeled 'authentic' dishes that seems to be the source of much controversy online. The truth is I could care less what is authentic or not and I'm not sure what that word even means anymore...\n\n\nMore"], ["Good Food but less Authentic", 5.0, "September 12, 2014", "fzwa1964", "Washington DC, District of Columbia", 80, 28, "I ate here a few months ago with my friend and his family. The restaurant has many options. Some of the dishes sound authentic but actually taste quite Americanized (I am Chinese myself). It's still good though. The food is a little expensive because it's in downtown DC. It can get quite crowded and noisy because it's really small and...\n\n\nMore"], ["Average food, terrible service", 2.0, "September 9, 2014", "LauraButcher87", null, 1, 1, "First time in washington dc with my husband. Tried this place after good reviews on tripadvisor. Arrived just after 9pm, place shut at 10pm. Told at 9:15pm they would be bringing starters and mains all out at the same time because they wanted to close the kitchen. Then at 9:40 began putting their jackets on, got the brooms out and...\n\n\nMore"], ["Good food, terrible service", 3.0, "September 5, 2014", "David Debrah M", null, 25, 10, "My fiance and I ate there on a Saturday evening. If you plan on going in the evenings, expect to wait at least 30 minutes to be seated which is what we had to wait. Once we were seated we ordered three dishes along with fried rice. The food took approximately 20 minutes to arrive and came out one dish...\n\n\nMore"], ["Good food", 3.0, "August 30, 2014", "Lve2", null, 4, 6, "The place is easy to find and is clean. The food we ordered was good. The only issue we had was that we received our food a dish at a time and by the time it all came out to our table the first dish was cold. There are usually wait times for tables that exceed 30 minutes so plan...\n\n\nMore"], ["Solid Chinese meal but not stellar", 3.0, "August 16, 2014", "tferro88", "oxford, pennsylvania", 29, 19, "This is a dependable choice for anyone looking for Chinese in the district. We had a 20 minute wait on a Saturday night, but worth it. Ordered dumplings, chicken lo mien, General Tso's and veggies including a really tasty eggplant dish. Food served promptly and hot, and the service was very good, pleasant atmosphere about 90 percent ethnic Chinese. This...\n\n\nMore"], ["Best best good good!!!", 5.0, "August 9, 2014", "Eti-avital", null, 2, 2, "We visit Washington , and looking for chines restaurant. The best chines food I aver eat!!! I really recommend on this restaurant!!! We eat duke and tofu spicy . Very enjoy!!!"], ["Great lunch spot", 4.0, "August 7, 2014", "JKV_R", "Washington DC, District of Columbia", 8, 2, "My go to spot for great little Chinese restaurant, with unique dishes (at least around DC area). I love the hot dry pepper chicken dish! It's like Chinese popcorn chicken with sichuan peppers kick. Always packed with locals and visiting Chinese tourists."], ["Fish Filet with Pepper Salt...", 5.0, "May 28, 2014", "627deedeeb", "Waldorf, Maryland", 31, 5, "THis restaurant has been reviewed in the Washington Business Journal. I order for lunch from Sichuan Pavilion at least twice a month or so. My favorite dish is the Fish Filet with Pepper Salt. Very good and a nice size portion that I always end up taking home to finish for dinner. The delivery service is awesome."], ["The real deal", 4.0, "May 13, 2014", "Walter O", "Tucson", 62, 16, "This place was recommended by embassy staffers and they certainly knew what they were talking about! The food is authentic and good with attentive service. The restaurant itself is not the fanciest place in town but that is actually a plus in a town known for its white tablecloth establishments. The bottom line is, if you're in the mood for...\n\n\nMore"], ["Pork dumplings, tea smoked duck and Kung Pao chicken", 5.0, "May 4, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "This time we decided to taste some typical dishes from Sichuan cuisine.\nWe started with the pork dumplings with Sichuan sauce, they were very tasty.\nThen we had the tea smoked duck and the Kung Pao chicken. Both were terrific.\nThe duck comes with some buns and scallions. It has a a very intense and interesting smokey flavor.\nWe also...\n\n\nMore"], ["OVERATED Dissapointment", 3.0, "March 20, 2014", "gidtanner", "Albany, New York", 19, 8, "Nothing special . You'd do better going to Chinatown. The food here was very oily. Duck was a bit old. Reservations required and busy, I suppose because of high ratings here. Almost broke my neck on greasy restroom floor , the grease was so thick that it stuck to my shoes and made walking slippery for half a block after...\n\n\nMore"], ["Yummy Chinese Food in Downtown DC", 4.0, "March 17, 2014", "PLW1358", "Silver Spring, Maryland", 23, 5, "I went to Sichuan Pavillion for the first time a couple of weeks back for a co-worker's birthday celebration and was impressed. We ordered five different dishes to split and all of them were wonderful! The favorites for me were the crispy beef - which was perfectly cooked and flavored - and the shrimp in garlic sauce. The shrimp were...\n\n\nMore"], ["Authentic", 4.0, "March 14, 2014", "NWtraveler", "Spokane, Washington", 116, 46, "Very nice flavorful \"Dan Dan\" noodles which are nice and spicy. Perfect size portions, not too small. General Tso chicken is deep fried but not too much batter and chicken was perfectly moist, not dried out or drenched in sauce. service was quick/efficient as well. 1.5 blocks west from Farragut west MTA station."], ["Good food at reasonable prices", 4.0, "March 3, 2014", "Sabena Y", "London, Ontario, Canada", 105, 43, "My daughters and I stopped here for lunch before going to the National Geographic museum. The location is very convenient to the subway. We got off at the Farragut West subway stop and the restaurant was about a 2 minute walk. We walked in and were seated immediately (1PM on Saturday). The service was quick and efficient. We ordered the...\n\n\nMore"], ["nice fish", 4.0, "February 26, 2014", "SeanTravelz", "Changzhou, China", 242, 76, "Great fish here... everything was great the only thing that I would say is traditionally kung pao chicken is not deep fried...here it was deep fried, not a deep fried guy... oh well,,"], ["Excellent, Robust, Fiery", 4.0, "January 29, 2014", "John V", "Annapolis, Maryland", 161, 99, "Just got back from another visit to Sichuan Pavilion. I hate going into downtown DC, but when I have to be there. I make every effort to grab a meal here.\nIt’s a far cry from DC’s Chinatown, which means it’s also a long way from tourists. So the food here is authentic, and doesn’t cater to sanitized, Americanized tastes....\n\n\nMore"], ["Excellent Atmosphere, Authentic Chinese Cuisine, Delicious", 5.0, "January 16, 2014", "Steven Y", "Ames, Iowa", 1, 0, "This restaurant ranks in my opinion in the top quality of Chinese food you can find in US. The amount of food for the price was reasonable in my opinion for DC. The restaurant itself felt a little crowded and the service was harried but quite professional.\nTip added to bill, for a midwesterner like myself this put me off...\n\n\nMore"], ["First but not last visit to Sichuan Pavilion", 5.0, "January 5, 2014", "leochen24551", "Forest, Virginia", 4, 1, "Probably coldest January night ever outside. This was our second choice; our first choice suffered from a lack of parking space in Chinatown on an event night at the Verizon Center -- Wizards/NBA.\nWe arrived at 6:30 PM which is critical because sidewalk meter parking becomes free then. We thought that this must be a tourist trap restaurant, because it's...\n\n\nMore"], ["Best Chinese We've had in Years", 4.0, "December 8, 2013", "chefluee", "Seacrest Beach, Florida", 205, 97, "The second of five DC restaurants was also a hit. Sichuan Pavilion. Four of us ate here on our first evening in DC and it was the best Chinese we have had in years. Forget Chinese food in Atlanta. I was almost to the decision that I didn’t like Chinese food any longer. But I have now realized how much...\n\n\nMore"], ["Best Chinese food I have ever tasted", 5.0, "December 3, 2013", "BirdtownRep", "Cherokee, North Carolina", 38, 12, "Absolutely delicious food. First time I have ever had anything besides standard American Chinese buffet food and man am I happy my wife and I tried this place. Would recommend it to anyone but beware if it says it's spicy it is SPICY. I loved it."], ["Normal Food Served Abnormally Fast", 3.0, "December 3, 2013", "Matt P", "Lutherville, Maryland", 98, 36, "For lunch we ordered Ma Po Tofu, Bok Choy and Black Mushrooms and Fried Tofu with General Tso's Sauce. The food arrived in less than five minutes, leading me to believe the kitchen mass produces these and other menu items, then just dishes them out to turn tables as quickly as possible. The Ma Po was ok - a bit...\n\n\nMore"], ["Authentic Sichuan food", 5.0, "October 23, 2013", "Jing F", "Las Cruces, New Mexico, United States", 5, 1, "Great food. I got Ma Po Tofu, which tasted pretty authentic. The place was pretty full even at lunch time, but the service was fast. If you go there for dinner, it's probably best to make a reservation."], ["Good food", 4.0, "September 27, 2013", "Michael C", "Virginia Beach, Virginia", 3, 3, "Good food, especially the whole duck. Not infant friendly but still good. Can get very busy so be ready to wait a bit"], ["yum!", 5.0, "September 23, 2013", "jeaniebeanie74", "Seattle, Washington", 30, 57, "Standard Chinese cuisine, but all of it was very good. Nothing particularly Sichuan about it, though. Good food, good value, and the owner was very patient with us dividing up checks between 8 of us."], ["Disgusting food and rude staff.", 1.0, "August 30, 2013", "Jacky-in-Boston", "Boston", 21, 24, "We ordered the Kung Pao Chicken, Lamb in hot garlic sauce, pan fried dumplings and steamed rice.\nThe food was awful. Everything tastes the same and was floating in a disgusting mixture of oil, soy sauce and corn starch.\nThe wait staff was rude and unapologetic. My daughter's glass had lipstick marks on it and when we requested that the...\n\n\nMore"], ["Excellent Sichuan Cuisine", 5.0, "August 26, 2013", "Craig R", "Washington DC, District of Columbia", 88, 24, "The Sichuan Pavilion is on K Street, NW. Pay attention so that you don't walk by it mistakenly. It is well worth the visit. I had the chicken with cashew. A huge portion that I wound up taking with me, not that i minded doing so at all. I'll be back as there were too many choices on the menu...\n\n\nMore"], ["Very Good Food and Excellent Service", 5.0, "July 22, 2013", "CorpSpy", "Rockville, MD", 134, 41, "We were passing the restaurant on a Sunday evening and since there seemed to be a good size crowd inside, we decided to give it a try. There were several people in the restaurant waiting for \"pickup\" which tipped me off that the food may be very good. We were not disappointed. My wife ordered a fish dish while my...\n\n\nMore"], ["Catch-Up Lunch", 4.0, "July 19, 2013", "wallyguy", "Indianapolis, Indiana", 49, 14, "Met a fraternity brother here for a catch up lunch. He's a K street attorney, and I was a bit worried about showing up in jeans and an oxford (ah, self-employment), but it's a very casual place.\nThe food is very good, and the portions are quite large. There are no lunch portions available.\nWe split an order of dumplings...\n\n\nMore"], ["Great Chinese Restaurant", 4.0, "July 17, 2013", "Oscar L", "Rogers, Arkansas", 9, 0, "We were visiting DC and wanted to try a good Chinese Restaurant and found Sichuan. Food was excellent, but be aware! the portions are so big that one entree can be shared between 2 people at least (unless you are extremely hungry and don't want to share).\nWe order our waiter's recommendations and were not disappointed. We like spicy food...\n\n\nMore"], ["excellent", 5.0, "July 4, 2013", "Redwood26", "Roseville, California", 33, 26, "Got seated right away for a table of 5 on a Friday night. Place was mostly full. Service was excellent. Most importantly, food was perfect. I especially like the mongolian beef. Prices were reasonable ($86 including tip for 3 main dishes and soup/egg rolls). Overall, I highly recommend this establishment."], ["Great Chinese food", 5.0, "June 16, 2013", "Ryan1011", "Melbourne, Florida, United States", 3, 1, "Food was good. Only negative was all the wait staff staring at us while we ate. Maybe it was because we were the only non Asians having dinner"], ["Best Chinese Restaurant", 5.0, "May 22, 2013", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "Tip: reservation is recommended. Busy.\nPros: delicious Chinese food (normally I don't like it), authentic, very popular among Asians, good for share, nice decor and helpful staff.\nWe had some different types of dishes: beef, (spicy) shrimp, mushrooms and squid. Everything was delicious."], ["Quick service. Tasty food. Good location.", 4.0, "May 20, 2013", "Jairaj H", null, 236, 202, "The interiors are no different from most of the Chinese restaurants in the country. Lanterns, red silk trim and round tables. The food is very good, reasonably priced and served quickly. Portions are large enough to share. Three entrees for a party of five to share is plenty.\nThe restaurant is always full but a ten minute wait is all...\n\n\nMore"], ["Maybe a little too authentic", 4.0, "April 21, 2013", "Rohrshack", "Farmington, Connecticut", 248, 88, "The atmosphere was wonderful and the restaurant was chock full of Asians who all seemed to enjoy the food a lot more than I did. The others in my party truly enjoyed the food a lot more than I did. Coming from NYC I guess my tastes might be more Americanized. This food was a bit too spicy for my...\n\n\nMore"], ["Authentic Chinese, fabulous service", 5.0, "April 20, 2013", "Candiejo", "Atlanta, Georgia, USA", 78, 31, "This Kung Pao chicken was the best I have ever had and the dry hot pepper chicken (authentic menu) was really good, I have never had that type of chicken before. The vegetable Spring rolls were very crispy. The portions were huge, especially for a Saturday lunch as they didn't have a lunch portion menu.\nThe service was excellent. The...\n\n\nMore"], ["Fabulous Dinner with Family", 5.0, "April 15, 2013", "ruckb", null, 2, 0, "We had a grwt time. The foid was exceptional. The staff was attentive. We will all be back as often as possible."], ["Want Chinese? Real Chinese? Go here!", 5.0, "April 15, 2013", "todd_fix", "Winter Springs, Florida", 144, 63, "During our visit to D.C., my husband and I (as always) looked for any and all Asian restaurants. We stumbled upon Sichuan Pavilion on the internet and after looking at many site's reviews, decided to give it a try. My husband is Chinese (from Malaysia) and has a keen taste for authenticity. I've also travelled to Asia with him many...\n\n\nMore"], ["Average Chinese with Downtown prices", 3.0, "April 10, 2013", "Seth J", "Seven Corners, Virginia", 480, 162, "I found absolutely nothing special about this place. It's your regular chinese joint with slightly higher prices to justify its downtown location. The space is small and crowded, but the service is good."], ["Yum", 5.0, "April 9, 2013", "dovecanyon", "Highlands Ranch, Colorado", 76, 54, "I ordered the Pan fried noodles with the combo of meat, chicken and seafood. It was very tasty. The waiter was very pleasant. The food was delivered very promptly. Tasted very good on a cold DC evening."], ["Great Chinese food in DC", 4.0, "April 7, 2013", "localsurf", "Washington DC, District of Columbia", 81, 39, "This industrisl scale operation manages to produce great food with minimal hassle from bad waiters. It is arguably the best Chinese place on that area, on that price range. The fried rice and shrimp is great. Service is bad, but that's what makes the price reasonable for that quality of food. Top notch."], ["Great", 5.0, "April 6, 2013", "radcat", null, 15, 8, "Our party of five included three teenage children. We'd been to more expensive restaurants on the previous two nights but this was our best meal on vacation in Washington DC. Sichuan style suited us."], ["Food was good but service was spotty", 3.0, "March 31, 2013", "dobcat", "Washington DC, District of Columbia", 11, 4, "Ate at Sichuan Pavillion Easter weekend 2013. Our entrees came out 10-15 minuts apart. Weird. Food was pretty good, but the servers didn't seem real motivated. Seemed to be doing a land office business with Asian tour groups. I suppose that's a plus. Prices were ok. Didn't knock my socks off."], ["Authentic", 4.0, "March 25, 2013", "Aussiebitz", null, 25, 21, "Food was delicious. We had the dumplings ( we dined with two kids) sesame chicken, duet of beef and bokchoy with black mushrooms, amazing!\nOverall ambience could be improved but it felt authentic and I appreciated that.\nService slightly rushed but overall very attentive. Very reasonably priced. Would definitely recommend."], ["Truly Chinese food", 5.0, "March 14, 2013", "Robert W", "Wellington, Florida, United States", 25, 2, "Excellent, authentic Chinese food, go for an adventure and order some exotic plate, don't go for the traditional American -Chinese. Food is spicy but if you don't like it, you can tone it down.\nGo there before twelve and leave before 12:30, you'll get a 10% discount. After twelve is externally crowded. Excellent service and fairly priced."], ["chinese", 3.0, "February 27, 2013", "Arch L", null, 216, 53, "we found this restaurant out from surprisungly small rooms, close together tables, great service our waiters were wonderful, efficient, quick. the corn soup, kung pao were yummy but sweet. had to add hot oil. we ordered the chix veg substituting white sauce for brown. that was ok. my 4 yr old luved the kung pao and i ordered yang zou...\n\n\nMore"], ["Fairly Priced, Fast and good Service", 4.0, "February 24, 2013", "fansntt", "Bellevue, Nebraska", 51, 22, "My wife is a fan of authentic Sichuan Cuisine and this was the first restaurant we hit after arriving to D.C. We got good service, our food was served promptly and the price is very very fair for its location.\nWe ordered Comb Of Beef Tripe - Tendon, Tender Beef In Hot Sauce, Duck Red, Beef Tendon, Tripe. All of...\n\n\nMore"], ["Excellent Authentic Sichuan Food", 4.0, "January 29, 2013", "Nads82", "Falls Church, Va", 423, 110, "This is one of DC's best sit down Chinese restaurants. Keep in mind, DC doesn't have many sit down Chinese restaurants that are noteworthy. It is traditional cuisine from the Sichuan province, so expect it to be spicy. I loved the spicy green beans. The hot dry pepper chicken was fried bits of chicken in a mount of red dried...\n\n\nMore"], ["Best Chinese Food - Authentic, Spicy and Addictive", 5.0, "January 23, 2013", "akalsahai", "Washington DC, District of Columbia", 24, 18, "1 - Avoid Lunch Rush\n2 - Go in the evenings on a weeknight and be served in about 10 minutes!\n3 - Get free tea for dine-in\n4 - Pretty good take-out\n5 - Hot Dry Pepper Chicken and MaPo Tofu are the best best dishes ever."], ["Good Enough", 3.0, "January 15, 2013", "Matt P", "Lutherville, Maryland", 98, 36, "We arrived just before the lunch hour crush and were seated promptly, but don't be surprised to wait for a table on weekdays, especially after 12:30 - 12:45. Parties of 5 or more may have to wait a little while, but the wait staff does its best to turn tables quickly. We had three vegetarian entrees - Ma Po Tofu,...\n\n\nMore"], ["Best Chinese I've had in DC", 4.0, "January 6, 2013", "bkarmstrong1", "Washington DC, District of Columbia", 26, 16, "As above, this is definitely the best Chinese I've had in DC. I had the pork buns (not on the menu), Triple Delight, and the Chialing Chicken. All were excellent, but the Chialing chicken stands out as one of the best Sichuan style dishes I have had ever (never been to china though). I got takeout as the decor is...\n\n\nMore"], ["One of my favorite places in the area", 5.0, "January 6, 2013", "Abhi B", "Washington DC, District of Columbia", 39, 12, "This has become a favorite working lunch venue for me and my colleagues. The hot pepper chicken is heavenly while duck in hot garlic sauce is worth the wait. The waits can be a bit long but would recommend it for lunch or dinner, with good ambience, nice staff, quick service and good food."], ["The best chinese sichuan food in washington dc", 5.0, "January 1, 2013", "Antonthedy", "Jakarta, Indonesia", 134, 78, "My children suggest us to try this chinese sichuan food based on tripadvisor review, we went there, queue for a while, a busy resto a good signed of good food. We were party of 8 but this resto only got max table of 6 person so we split.\nWe order the chilly fried chicken the icon of sichuan food and...\n\n\nMore"], ["Great chinese in DC!", 5.0, "December 15, 2012", "DaniDL", "Rome, Italy", 27, 10, "Saturday evening and the place was packed; lots of Chinese people too which I thought was a good sign. I was amazed we were told the wait would be 10 minutes only as I thought, with so many people, we should stand in line for at least half an hour. We had decided on a take-away anyway so we ordered...\n\n\nMore"], ["Good food but floor slippery", 3.0, "December 7, 2012", "BHUANG69", "Berkeley heights, New Jersey, USA", 188, 68, "I enjoy going to Chinese restaurants, especially those specializing in Shichuan province cuisine. The spice that they added really gives a kick to the food. My friend and I came here on a weekday night. The restaurant is located in a business district and we were surprised to see that the restaurant was almost packed. I have never been to...\n\n\nMore"], ["Excellent Food, Horrible Service", 3.0, "November 25, 2012", "Hnjammal", null, 55, 13, "I went based on the many recommendations from friends and TA. The place is great. Nice decor and pretty clean looking. The food was excellent. I missed having decent chinese food here. I would highly recommend their seafood soup and the chicken pancake thing (sorry dont know the name). My friend ordered some pork items which he really enjoyed. Now...\n\n\nMore"], ["Excellent Food", 5.0, "November 15, 2012", "TheMcLeanVAFive", "McLean, Virginia", 87, 52, "I attended a business lunch at this K Street restaurant\nAt first I was taken aback by the crowd and the small, small size of the restaurant. The restuarant is really two rooms both on the smallish side.\nThe hallway between the two rooms had lots of people waiting and waiters coming and going jostling the people waiting.\nI asked...\n\n\nMore"], ["Tasty food", 4.0, "October 22, 2012", "MaduraiTraveler", "Madurai", 25, 24, "Visited this place with friends. All the food items we ordered were fresh and tasty. Love to go again if I get a chance."], ["Awesome", 5.0, "October 11, 2012", "auroranyc1", null, 22, 11, "We ordered while visiting DC and had it delivered to our hotel! They deliver to hotels, they call once they arrive at the lobby. We ordered the crispy duck, eggplant and basil and dan dan noodles (sorry for the spelling!). Everything was delicious - I would recommend!"], ["Pretty Good.", 4.0, "September 13, 2012", "ozrotorhead", "Newcastle", 20, 6, "The trick here is to eat at 16:30 - no crowds. Very good pork dumplings, mu-shi pork and kung-pao chicken. Not the best I've had but 8/10. Cheap. All up with drinks under $50 for two. Can't beat that."], ["No.", 1.0, "September 4, 2012", "templebar8", "Los Angeles, California", 40, 55, "Per several referrals (including TA), this was the best Chinese food DC had to offer. The reviews looked good, the line out the door was promising and the lilting sound of Cantonese speaking servers made me super excited.\nYou can ask any Chinese person, going without Chinese food for too long, Cantonese in my case, is a pain akin to...\n\n\nMore"], ["Very fast service, little flaky around the edges", 3.0, "August 25, 2012", "weechancer", "Chester, United Kingdom", 159, 47, "Arrived and there was a queue - good sign. Being on my own, I was shown directly to a table. Again good sign. Lots of authentic choices...But. Plates and metalware/chopsticks looked liked they had been used for the last 30 years and could do with replacement, not a good sign and it highlighted the cleanliness of the place,\nOrdered a...\n\n\nMore"], ["Better than takeout", 3.0, "August 14, 2012", "LisaR1018", "Philadelphia, Pennsylvania", 16, 6, "We did not order authentic Chinese food, but what we did get tasted fresh. The wonton soup was delicious. We did however feel a bit rushed by our waiter."], ["Spicy Chinese In DC", 4.0, "August 3, 2012", "MiksAdventures", "Dhaka", 138, 42, "It's the second best spicy Chinese food in the area. The other is in Rockville which a serious commute. The mapo tofu is good as are most of the other dishes. The prices are nice too."], ["Good food, fast and efficient, reasonable price for DC", 4.0, "August 1, 2012", "memeEye", "Loudonville, New York", 39, 22, "We were in DC for lunch. The menu is extensive; I tried the pan fried chicken dumplings, the mongolian beef and the cashew chicken. All were great; it is true, they do have a lunch rush and the do try to rush you out so they can do two seatings per table during the lunch rush, but everyone is trying...\n\n\nMore"], ["Great Chinese and fast efficient service.", 5.0, "July 15, 2012", "MOSSAV", "Savannah, Georgia", 37, 14, "The menu was extensive and the speed with which our food arrived was great, if you are not into an evening of dining. Our group of 4 were in and out in 50 minutes. The food was as good a Chinese meal as my party had eaten in quite some time. Best if you have a reservation, no waiting."], ["Crazy excellent!", 5.0, "June 25, 2012", "aprueitt", "Atlanta, Georgia", 102, 28, "Tip: 1 entree is enough for 2 people!\nThe treasure soup and the beef two ways are excellent.\nEntrees range from 10 dollars to 25 dollars for the seafood and speciality dishes.\nFor a good date idea, start here and the walk to The White House!"], ["Delicious!", 5.0, "June 4, 2012", "funkychic", "London", 62, 24, "Incredible tasty authentic Chinese cuisine. This place is always packed, and service is sometimes slow but the food is quite worth it"], ["Authentic Sichuanese food an old favorite", 5.0, "May 29, 2012", "Ben T", "Annapolis, Maryland", 8, 2, "They are wonderful at accomodating large groups, though they fill up quickly. Call ahead if you have more than 4 people.\nThe food has always been great and the service prompt.\nI love their salt and pepper shrimp, beef strips in spic broth, and eggplant dishes.\nThe Mapo dofu is zesty and has great flavor. The Sichuan string beans are...\n\n\nMore"], ["Fine but whats all the fuss?", 3.0, "May 24, 2012", "dylancasb", "Towson, Maryland", 41, 9, "Good prices, fair quality. The pot stickers were very good and the sichuan chicken was ok. Spicy, but nothing as fantastic as would be imagined based on other reviews. If staying in the area worth a try, but don't bother if it's a metro ride away."], ["Worst service EVER", 1.0, "May 16, 2012", "Anialw13", "Washington DC, District of Columbia", 14, 13, "I have been ordering delivery for my office from here for several years and the choice was always from here despite higher prices due to better quality of food. I usually got fast delivery times, friendly delivery person, and the order was correct.\nNot so today! I called in an order for 6 people and I ordered the lunch combo...\n\n\nMore"], ["Genuine", 4.0, "May 5, 2012", "TravelingTartar", "Washington DC, District of Columbia, USA", 81, 24, "Sichuan Pavillion feels genuine. The staff, the food and even the decor take me to China. In fact, I went there with a Chinese friend the first time because he told me that this is where most Chinese go to eat in DC. Clearly, being a vegan, I appreciated the vegan fare as well.\nMy only caveat is the service...\n\n\nMore"], ["Best choice for Christmas Day", 4.0, "April 26, 2012", "ZimmIllinois", "Illinois", 44, 27, "Well prepared food - including a menu for \"native Chinese.\""], ["It was ok", 4.0, "April 8, 2012", "Svapo3", null, 6, 4, "We were lucky and got the last table . We ordered crispy duck - Not knowing it has no Sauce. Duck was extraordinary but due to lack of dip dry. Service was busy and unpersonal... Typical Chinese. Prices are ok. Reservation recommended, Long line built up as we left."], ["My first choice for this part of town - but make a reservation!", 4.0, "April 6, 2012", "megwalker87", "Washington DC, District of Columbia", 46, 18, "This is great value for money in an otherwise pricy part of town. It feels like a local Chinese restaurant right on K st – plus there are a few traditional gems on the menu (like the eggplant dish). Flavorsome, reliable dishes, modest décor and fast service.\nThere are not many other reasonably priced dining options in this part of...\n\n\nMore"], ["Great Chinese", 4.0, "April 3, 2012", "raiatea5", "Seattle, Washington", 35, 13, "Well prepared food with lots of interesting and, for some, unusual items on the menu. Very friendly service and a nice choice in the middle of expense account land"], ["Delicious, authentic Chinese! Excellent service", 5.0, "April 2, 2012", "Goldenchop", null, 8, 0, "Four adults and four kids (10 and 11 yrs) and everyone devoured the food. Many local Chinese patrons (great sign). Mongolian lamb, Hunan chicken, seafood soup, sweet sour pork were excellent. Appetizers dumplings and spring rolls excellent as well. Will definitely come back!"], ["Good food but bad service", 3.0, "March 31, 2012", "Jie Y", "Washington DC, District of Columbia", 1, 0, "After reading several good reviews about this restaurant, we decided to try it. The food is the typical Chinese cusine and tastes well. The price was also okay. But the service of waiter was rude! Despite of terrible service, the waiter charged us 20% service fee instead of 15% for our lunch! We will never visit the restaurant again considering...\n\n\nMore"], ["Not \"Fast Food\"", 4.0, "March 22, 2012", "Courtney G", "Texas, United States", 6, 1, "If you like authentic Asian food, this is your place. If you're used to \"fast\" Asian food, order a dish you recognize. I ordered \"dan dan noodles\" hoping they'd be comparable to PF Changs, but they were more soupy than I was expecting. The chicken dumpling appetizer was great!"], ["Delicious!", 5.0, "March 18, 2012", "wps24", "Springdale, Arkansas", 58, 10, "My family of four, including a twelve year old and a ten year old, really enjoyed our dinner. We shared three dishes among us and had plenty of food. We ordered the Kung Pao beef, General Tso's chicken and chicken lo mein. Everything was very good- lots of flavor. My husband said it was the best Chinese food he's ever...\n\n\nMore"], ["Loved it!!", 5.0, "February 21, 2012", "swaldman111", null, 33, 38, "Went this evening with my 2 boys (14+11), who really don't venture out to try new dishes. We had chicken fried rice, general tso's chicken(all white meat), and crispy beef. They also have a authentic chinese menu for those wanting to try non-american chinese food. Even though we ordered the typical american dishes, it tasted fantastic! There was very little...\n\n\nMore"], ["Great Food and Friendly Service", 5.0, "February 19, 2012", "Halle B", "Pittsburgh, Pennsylvania", 24, 12, "My husband and I wanted some spicy and delicious Sichaun food and this is definitely the place for it! The waiter was helpful in suggesting a couple of items that we might like. The chicken dumplings are out of this world for the appetizer! They have an \"ethnic menu\" that is not included online or the handout. Don't be afraid...\n\n\nMore"], ["Great and spicy authentic Chinese food", 5.0, "February 18, 2012", "david_andrews", "Chicago", 48, 29, "I ate here with several Chinese colleagues who were attending a meeting with me. Outstanding and authentic Chinese food, very spicy but not gratuitously so (you know it's authentic when there is a beef tendon dish on the menu). The 5 of us split 3 mains plus some appetizers, which was more than enough food; they even had a drinkable...\n\n\nMore"], ["Our quest for good Chinese food is over", 4.0, "January 22, 2012", "aboudd", "Arlington, Virginia", 13, 14, "This area has a paucity of good Chinese food. One block from our apartment is China Garden and the food is mediocre on their best day. About 20 minutes away is Peking Gourmet Inn, Perfect for duck, OK for everything else but very busy and often a long wait even with a reservation. So while doing a google search this...\n\n\nMore"], ["It's not Chengdu but its good Michigan food.", 5.0, "January 1, 2012", "Dave198", null, 9, 0, "The foods good, service is decent and, its not a bad value. We had mapo tofu, Shiu niu rou and sweet sour pork (for kids). Wasn't as spicy as we hoped and the Mrs complained it was salty, I however thoroughly enjoyed it."], ["Great Prices in a convienent Location", 5.0, "November 28, 2011", "GMP_2011", "Detroit, Michigan", 30, 24, "Restaurant is right near the white house. We arrived about 7:00, and had a 20 minute wait. It is authentic enough to draw a predominately Asian crowd, which encouraged us to wait. The staff was helpful and friendly. Serving portions were large, food was hot and well prepared. The waiter took the time to make sure we were happy. We...\n\n\nMore"], ["Not terrible", 3.0, "November 26, 2011", "Scott22-10", "Stamford, Connecticut, United States", 163, 66, "Much like nearly all chinese restaurants in the US the level of flavor and spice has been substantially reduced to satisfy the local market. The food is nice and the service is quick but a long way from genuine Chinese food."], ["Excellant Food, Reasonable Prices, Comfortable Setting", 5.0, "November 14, 2011", "USALoveTraveling", "Ohio, USA", 54, 104, "We would highly recommend the Tea Smoke Duck, Spinach with Garlic, and the large shrimp with red peppers (I think that this dish was on the Chinese menu but I don't remember the name of the dish). Actually, all of the dishes were being served around us looked great. The portions were large, so we had enough for the next...\n\n\nMore"], ["Excellent food, super-friendly service!", 5.0, "October 11, 2011", "mistyake", "Kansas City, Missouri", 34, 22, "We took a chance on this because it had only a handful of reviews, but we knew we were in the right place when we saw many Asians there already! You can order off the regular menu, or the more Chinese one--although some of the entrees are the same. The food was piping hot, and the service was superb. It's...\n\n\nMore"], ["For 3 years, the best chinese food in DC - and cheap", 5.0, "September 18, 2011", "elmasgrande", "Washington DC", 116, 132, "I have been to Sichuan Pavilion for the first time in 2008, recommended by a Chinese colleague. She told me \"this is the closest you get to real chinese food in DC\". I have no idea whether that's true or not (have not been to china yet), but the food is certainly delicious. I have been back maybe 20 times...\n\n\nMore"], ["Not your run-of-the-mill food", 5.0, "September 14, 2011", "Islandtexan", "Galveston", 56, 53, "This restaurant is not in Chinatown, nor is it a tourist attraction. As others have noted, the clientele often predict the outcome. This place is obviously a favorite for the younger upscale Asian diners. Food is Szechuan but not overly spicy. We were particularly pleased with the tea-smoked duck. Service is impeccable, nice decor and the bill required a second...\n\n\nMore"], ["Great Food/Service", 5.0, "June 28, 2011", "PsB1313", null, 36, 29, "I am a Foodie...So, I checked online here for great restaurants to visit while we were visiting DC. Not disappointed here. We had a wonderful meal. Superb service ... and not terribly expensive for DC. DH and I used to be regulars in NYC Chinatown and this more than held up. String beans w/Garlic :)"], ["Good and inexpensive, but not great", 4.0, "June 28, 2011", "MomFromOrondo", null, 175, 51, "Fed six with a bit left over for $75. The two adults even had a sake. We ate two orders of dumplings---very good. In addition, cashew chicken, noodles, salt and peppered squid, and crispy beef all good, but not great."], ["Great find, great experience.", 5.0, "April 26, 2011", "EliseteAnthony", "New York City, New York", 38, 16, "Thanks to Trip advisor we enjoyed the Best meal of our weekend. Looking for a chinese restaurant I found Sichaun Pavilion on this site and we enjoyed the best broccoli in light garlic sauce we ever had. Many Asians eating in the restaurant is always a good sign. The entire experience was a good one. Great meal."], ["Very good food, reasonable proces", 4.0, "January 13, 2011", "Vermonter05036", "Brookfield VT", 21, 16, "While stranded in DC due to a Northeast Blizzard I wanted dinner and to avoid the outrageous DC hotel room service prices. Trip Advisor led me to Sichuan Pavilion and I was pleasantly surprised at a great menu, fast service and good food. The Sichuan dumplings were fresh and spicy and the Shrimp Duet has lots of jumbo, perfectly sauteed...\n\n\nMore"], ["YUMMO!", 4.0, "September 20, 2010", "Canechick82", "Fort Myers, Florida", 6, 6, "Best Chinese food I've had in years.....unfortunately where I live (Ft Myers, FL), there is an abundance of chain-type Chinese restaurants...they all have different names, but the same old blah menu and the same old blah taste. This restaurant reminded me of Chinese food you'd find in Chinatown NYC. We had the vegetarian spring rolls, broccoli and garlic sauce, kung...\n\n\nMore"], ["Good location, good food, and good setting.", 4.0, "July 27, 2010", "xztravel", "colorado", 7, 3, "It's our first time in DC and I just found this restaurant from TripAdvisor last night. We went there today for dinner and just got back hotel. Its location is close to the White House (15~20min walk) and also very close to two Metro Stations (which is good for us to get back hotel). Most of us like spicy food,...\n\n\nMore"], ["Like eating in Beijing, authentic and low cost", 5.0, "June 10, 2010", "LLFauntleroy", "Key Biscayne, Florida", 52, 64, "My son just return from living in China for three years and said this place is his favorite. His explanation is that the cooks were professional cooks in China before they immigrated to the US, and are unfamiliar with American Chinese cuisine. The Chinese are very adaptive, and tailor their menus to the host country, such that Washington DC Chinese...\n\n\nMore"], ["Many Asian guests = great Asian food", 4.0, "May 3, 2010", "Journeyman31", "International", 20, 15, "Found this restaurant accidentally using an iphone App in desperation. Gave it a go and would definitely visit again. Reasonably priced great tasting food. Especially like the spicy dumplings and hot shrimp entree. mildly disappointed with chicken curry - though only mildly."], ["Good spicy chinese food", 4.0, "April 5, 2010", "antonius66", "Wherever the cheap fares take me", 87, 110, "Went here on a recent trip to DC based on reviews. Seems to be authentic, as the place is filled with Asians eating, and as a previous poster says, this is generally a good sign as to the authenticity of Asian restaurants. The food is Sichuan style, so it is generally spicy. We had an appetizier on salt and pepper...\n\n\nMore"], ["Terrific food at a reasonable price", 5.0, "March 26, 2010", "n2history", "St. Louis, MO", 222, 187, "This is not your normal \"Americanized Chinese\" cuisine. The menu features a wide variety of items, from chicken and shrimp to pork intestines and sea cucumber. We immediately noticed that most of the diners were Asian--not because we were profiling, but thinking that this was a sign that people who are more likely than us to know good Chinese food...\n\n\nMore"]]], ["City Lights of China", [["Pleasant evening", 3.0, "September 29, 2015", "Chris K", "Rockhampton, Australia", 26, 9, "We were staying in the area and came a cross this restaurant and decided to try it. The eating time was early and we were the only ones in the place. The decor was passable and the menu reasonably extensive. My wife and I ordered two dishes with steamed rice and they arrived promptly. The wine list is virtually non...\n\n\nMore"], ["Worth a visit", 4.0, "September 27, 2015", "Sarah U", "Johannesburg, South Africa", 34, 18, "Decent value for money and a nice change from some of the other restaurants. They had dumplings which were the best priced dumplings that we found in the city. Nice food."], ["Best Chinese food!", 5.0, "September 13, 2015", "Kmiller091", "Aberdeen, United Kingdom", 30, 17, "Best Chinese food we have had in ages! Staff were so friendly and you really felt relaxed having a meal here. The food was fab and portions were huge. Would highly recommend this place if staying in the area - you won't be disappointed!"], ["I always stop here when I visit DC!", 4.0, "July 26, 2015", "Ray Q", "Pasadena, California", 154, 34, "Whenever I stay near Dupont Circle, I make a point of eating here, even if it's just take-out to bring back to the hotel. This place serves up big portions of good Chinese food, that is quite authentic, well flavored, and not too salty or greasy. I always feel like it's my own secret place, because the entrance is a...\n\n\nMore"], ["Yummy Chinese Food", 5.0, "July 14, 2015", "Pamela A", "New York City, New York", 52, 24, "I love authentic(inexpensive) Americanized Chinese food and my family and I had just that and more here. The sesame chicken and rice were amazing. We had fresh food and large portions that were shareable. This was the closest restaurant to the Courtyard Marriott and we decided to try it out. I was hesitant at first but upon arriving, we saw...\n\n\nMore"], ["Good Food - Hidden Gem", 4.0, "July 12, 2015", "Rlblum", null, 17, 8, "This was a short walk from our hotel. Nothing fancy but the food was really good. My family thought they had the best hot and sour soup. Dishes were plentiful and cheap for dc. Would come back again."], ["Good Food, Good Service, a Gem", 4.0, "May 19, 2015", "C T", "Albuquerque, New Mexico", 11, 16, "While attending a conference, two co-workers and I had dinner at the City Lights of China restaurant, just a short walk from our hotel. I did some research before I arrived and decided this would be a good spot for Chinese food. My instincts served us well.\nIt’s not a fancy restaurant at all; in fact, quite unassuming. Located one...\n\n\nMore"], ["Quick", 3.0, "April 23, 2015", "Steve S", null, 13, 9, "I have never been in and out of a restaurant so quickly. It was only 25 minutes from being seated to paying the check. If you need to have a quick feed go to this place otherwise work out a strategy to lengthen the experience. The name suggests a more authentic Chinese cuisine however it is just your average suburban...\n\n\nMore"], ["Good food", 4.0, "March 18, 2015", "Richard R", null, 5, 5, "The service paid attention to the customers and the food was tasty and hot with crisply cooked veggies. I would certainly go again."], ["Not Bad", 4.0, "March 1, 2015", "Moose957", "Long Neck, Delaware", 68, 25, "The food was average for Chinese, but the mustard was kicking !! I had the Hunan shrimp, good but not exceptional. The egg rolls were very good and like I said the hot mustard was excellent. Service was good and the food was hot. I would not hesitate to eat here again."], ["Good meal...", 3.0, "February 22, 2015", "Fred N", "Spearfish, South Dakota", 202, 70, "We walked down the hill from the Hilton looking for a place to eat and happened upon \"City Lights of China\". After making our way down into the place we were greeted by a friendly hostess. This isn't a chain restaurant but a small quaint place. I ordered the Sweet and Sour Chicken and very much enjoyed the meal. I...\n\n\nMore"], ["Authentic and Delicious", 5.0, "February 20, 2015", "John N", "Clarks Summit, Pennsylvania, United States", 9, 7, "My wife and I enjoyed a delicious dinner, far better than the 5 or 6 restaurants we have tried in the China Town section over the years. Authentic cuisine spiced to individual taste (none to very spicy). The spring rolls were unremarkable, but both entrees (chicken and sour cabbage, seafood delight) and dessert (green tea ice cream) were superb. Neighboring...\n\n\nMore"], ["Good food, below average service, dreary and outdated vibe", 3.0, "January 19, 2015", "ranran70", "Rehoboth Beach, Delaware", 84, 41, "We heard that the food was good here so off we went.\nWe sat down, ordered tea and water arrived with our tea. Nice. Server brought over two small little saucers of fried noodles. However, the server did not supply or offer any sauces. Our soups arrived and they were very hot and very enjoyable. After a few minutes of...\n\n\nMore"], ["Excellent chinese food", 5.0, "January 1, 2015", "Michael W", "Munich, Germany", 75, 39, "First time I ordered chinese food in the US. The dish I ordered was much better what I got last year in a good restaurant in Beijing.\nExactly spicy as I requested. Good portion. Very good taste. Quick delivery.\nJust one thing was missing ... chopsticks. Next time I will ask for it. :-)"], ["Small Place - BIG Flavors", 4.0, "December 4, 2014", "DCN2012", "Washington DC, District of Columbia", 42, 3, "A line of booths to your right and a few tables on the left...WELL PREPARED EATS all around.\nThe staff is pleasant. The food is just plain good. We've been going here for over 20 years and always pleased. A mainstay for us!"], ["just average", 3.0, "October 23, 2014", "SDPeg", "Alpine, California", 69, 23, "We ordered by phone for delivery....the lady on the phone was quite succinct (as-in curt), our order was delivered about an hour later (we were only 4 blocks away, should have gone to pick it up), it was complete and hot. The food was just average, the prices were quite reasonable. We were concerned that the portions would be small...\n\n\nMore"], ["good food", 5.0, "October 5, 2014", "Gregory C D", null, 2, 0, "I am not an expert on any form of oriental cuisine...but I've eaten at City Lights multiple times and I've loved the food each and every time. It is, quite simply, really good food."], ["Best Chinese Food in DC", 5.0, "August 9, 2014", "Travelergirl998", "Baltimore, Maryland", 189, 94, "Chinese food is generally not great in this part of town but this place works. Located in a basedment, it is nothing fancy but if you are looking for that greasy shrimp fried rice and crab raggoon this is your place. The only complaint I have is given the layout, people are constantly brushing by you in most seats so...\n\n\nMore"], ["(partial) delivery", 2.0, "July 18, 2014", "gallerist52", "Washington DC", 14, 8, "I'm a local and have been a loyal customer for MANY years. The food continues to be good however, regrettably, ordering food by telephone and having it delivered is a DEFINITE problem. Every order I receive has something missing i.e. one rice instead of the two ordered, one package of dry noodles for soup instead of two, etc., etc. One...\n\n\nMore"], ["Great Find", 5.0, "June 17, 2014", "blemschock", "Denver, Colorado", 67, 13, "We wandered in after flying to DC and had a quick nice meal at City Lights. Cool and relaxing downstairs eatery right on Connecticut in the middle of many hustle & bustle. Waiter helped me find a medium spicy vegetarian dish that I loved. Delivery was bustling out the back, so it looked like a good choice for that as...\n\n\nMore"], ["Unwanted email", 1.0, "June 12, 2014", "DCGrandma2014", "Elk Grove, California", 1, 0, "This is a food court in the Ronald Reagan Bldg.\nAfter paying for my food with my credit card, I returned home to find an email receipt from City Lights. The only exchange I had with the employee was to order, pay with my credit card and ask for napkins. How did they get my email address?"], ["Great easy & fast Chinese food", 5.0, "May 28, 2014", "J S", "Boston, Massachusetts", 5, 12, "I actually was sick (to my stomach, and on the verge of vomiting,) and I still could not stop taking bites. The spicy spinach & garlic was great, the dun dun noodles (?)were delicious and seemed \"elegant,\" and everything else was so good. Enjoy this place!"], ["Nothing Special", 3.0, "October 31, 2013", "YankeeRalph", "East Amherst, New York", 94, 50, "I am not sure what all the fuss is about this Chinese restaurant. It's OK, but nothing special. If I lived in the neighborhood and had no other Chinese restaurant to go too, it would suffice. The décor is dated and service was good. I have had better Chinese food from little hole in-the-wall take out places at half the...\n\n\nMore"], ["Reviews were on point", 4.0, "September 15, 2013", "AFPagano", "NJ", 72, 40, "Overall I would rate this restaurant as above average\nI had the BBQ ribs. They were crispy and tender\nThe General Taos chicken was also crispy but a bit over cooked.\nThe rice and veggies were very good"], ["Really Great Chinese", 5.0, "August 17, 2013", "jsworld", "Sofia Region, Bulgaria", 115, 56, "A friend and I enjoyed a great meal at this neighborhood Chinese restaurant--a great find. The food was authentic, served quickly and moderately priced--what more can you ask for. The service was great and the restaurant is in a convenient location a couple of blocks from Dupont Circle Metro station. Will definitely return!"], ["Pretty good food and really good service.", 3.0, "July 26, 2013", "Rune H", null, 4, 0, "Ok food and really good service. The restaurant was a bit worn down though. The price was suite lie compared to the rest of the area"], ["Consistently delicious Chinese food!", 5.0, "May 7, 2013", "paradingpangea", "Istanbul, Turkey", 6, 6, "This restaurant has the best Chinese food I've found in DC. I've been here with friends and family quite a few times. I've tried a number of their vegetarian entrees and never been disappointed with the food!\nMost people order take out, so the seating area is small but cosy. The servers aren't chatty, but they're gracious and attentive."], ["Basement dining meets great food", 4.0, "March 29, 2013", "RareAthlete", "Roanoke, Virginia", 43, 16, "When you step down off of Connecticut into the basement dining that is City Lights, you might question whether or not this is such a great idea. The decor is plain and a bit dated. Resist the urge to scoot down the street for something trendier. The food is tasty and the service is great. They have some great options...\n\n\nMore"], ["Tasty Quick", 4.0, "March 14, 2013", "LadyinMotion", "Annapolis, Maryland", 107, 28, "Great menu choices, reasonable prices for downtown DC, tasty selection, and fast service. Would have been close to perfect if requested chopsticks had been sent along with the meal."], ["Good Food, Fast Service", 4.0, "February 14, 2013", "TravCT2", "West Hartford, Connecticut", 84, 11, "This basement restaurant is a good find. Most options include a lower fat sauteed option. The king pao saute was very good and the service was as well."], ["Good, but not great", 3.0, "October 28, 2012", "jax848", "Jacksonville Beach, Florida", 75, 39, "This was (emphasize \"was\") a favorite place of mine when I lived in the neighborhood sometime back. On a recent trip I took a group back here, and, sadly, it is now the same in name only. After seeing how run down it's become I avoided the pricier fish. The menu still has abundant choices but the overall quality of...\n\n\nMore"], ["Tasty Chinese food at friendly prices", 5.0, "October 24, 2012", "Moritz73", "Santiago", 87, 87, "As a fan of Chinese food, I was happy to have had the opportunity to eat at this small restaurant in Washington DC. The restaurant was about to close, but the manager did not mind me having the meal in the restaurant, albeit eating from the take-away 'amenities'. I had a half Peking Duck, which was certainly abundant and very...\n\n\nMore"], ["Good value", 4.0, "September 30, 2012", "Jeff H", "Portland, Oregon", 35, 12, "Another review recommended the Banyan leaves near DuPont circle. We stopped by on our way back to the hotel. I'm sure their food is very good but it was way out of our price range. As we continued back, we passed City Lights, looked at their menu, and went in. It's a bit of a hole in the wall so...\n\n\nMore"], ["Cockroach in the brown rice", 1.0, "July 19, 2012", "Amina H", "Clarksburg, West Virginia, United States", 3, 0, "Half way through our very expensive take out we found a cockroach in our brown rice. Can you say, vomit? Later a local friend told us they wonder how its still in business because locals know not to eat there. Avoid it like the plague no matter how many people are eating there!"], ["Good Chinese Food", 4.0, "June 21, 2012", "RobinRat", "Kingston, Jamaica", 7, 11, "We asked the Concierge where to find the best Chinese food near to the hotel (The Mayflower) and he didn't hesitate to point us to city lights. OK its not much to look at but I wasn';t there to take pictures (lol). The food was excellent, a bit pricey but hey we were on vacation."], ["A great place gone bad", 3.0, "June 7, 2012", "Darrell6t", "Washington DC, District of Columbia", 45, 15, "City Lights used to be such a good place despite it's rather strange robotic servers. But things have changed. Maybe a new owner? Our experience the other night was so very disappointing. None of the food was up to the quality of past visits. And paper on the tables instead of cloth. Service was prompt and adequate. We may give...\n\n\nMore"], ["Yum!", 5.0, "June 6, 2012", "CSailor71", "Tampa, FL", 44, 25, "The expansive menu gives you a little of everything. We ordered several items for our group and everything was wonderful. We will definitely go back!"], ["Great hole in the wall food", 5.0, "May 2, 2012", "PeteBentley", "Melbourne, Australia", 89, 48, "A DC classic, put it on your list. Very resaonably priced and loads of flavour. Get into the hot and sour soup"], ["Great Food", 5.0, "April 27, 2012", "Elayne P", "Panama City", 65, 40, "My husband and I ate here one night and the food was excellent. My curry needed a little more spice in it, but not everyone likes it hot. My husband had a shrimp dish and it was excellent. Try this place, it's worth it. More expensive than Florida, but it was a good price for good food."], ["I tried to eat one egg roll for lunch", 1.0, "March 19, 2012", "ddcarver", null, 28, 34, "I bought an egg roll for lunch. It was dried out and over cooked . I asked for one that was not dried out. They gave me another dried out egg roll. I do not recommend the egg rolls."], ["What's happened to City Lights of China?", 2.0, "February 4, 2012", "ExSpec5", "Northern Virginia", 51, 26, "What's happened to City Lights of China? It used to be a bustling place with well prepared dishes. Four of us went in on a Friday at around seven & the place was almost empty. It also looked run down & shabby.\nOh, well, I thought. So what if the paint is peeling and the booths look they they haven't...\n\n\nMore"], ["No More Chances", 2.0, "December 22, 2011", "DCTraveller40", "Washington, DC", 31, 23, "For over a year, I have kept giving City Lights another chance. All too frequently, something was not right about a meal: The Hot and Sour soup might be too spicy, or not spicy enough; on several occasions when I have gotten a \"pick up\" meal, on getting home I found that the order was either incorrect or incomplete; etc....\n\n\nMore"], ["City Lights shines brightly in my book!", 5.0, "November 3, 2011", "Susan D", "Washington DC, District of Columbia", 14, 4, "The food is delicious (I highly recommend the combination noodle soup and the steamed General Tsao with asparagus). The space is cozy. The people are extremely friendly. Delivery is fast. Prices are good (for DC). What more could one ask for?"], ["Good food except for the beef and broccoli!", 4.0, "August 23, 2010", "AngRachel", "Mississauga, Canada", 25, 10, "We had fried rice (similar to Yang Chow), beef and broccoli, calamares, crispy shredded chicken, orange chicken, barbecue pork and noodles. Our family liked the food except for the beef. I think it had more of the baking soda (or whatever was used as tenderizer).\nService was great. I think the restaurant can use a little fixing - my son...\n\n\nMore"], ["A fairly good chinese for any night of the week", 4.0, "July 9, 2010", "thetravellingwaffle", "New York, New York", 6, 15, "I ate at City Lights while staying in D.C. on a hot night in July, and while the walk in the 95 degree heat from my hotel was not so pleasant, the restaurant was surprisingly very much so! All in all very good food, especially the seafood combination dish that came in a surprisingly tasty and well seasoned broth. This...\n\n\nMore"], ["TERRIBLE FOOD - WORSE SERVICE !!!", 1.0, "April 15, 2010", "PEIGOLFER", "Hooksett, New Hampshire", 140, 60, "Ordered dinner - Got one entrie 15 minutes after the other two. The fried rice was sticky and yellow. The entries were cold. The waitress never came to see if things were OK or get me another beer. NEVER AGAIN !!!"], ["My favorite Chinese in the city. The...", 5.0, "March 10, 2010", "PBHva", null, 2, 0, "My favorite Chinese in the city. The General Tsao's chicken and Triple Delight are wonderful and must tries!"], ["Ain't What it Used to Be", 2.0, "February 15, 2010", "luxuryops", "washingtion, dc", 1, 1, "This was or favorite Chinese restaurant in DC, but due to the decrease in portions coupled with a substantial increase in prices, it just isn't worth it any more. The food is still very good, but a lunch or dinner for the family simply costs too much."], ["Didn't live up to its billing", 2.0, "November 30, 2009", "Roycal", "Charlotte, North Carolina", 167, 101, "We'd read that this restaurant near Dupont Cir. had good food. Not. We dropped in on a recent Friday night. I had sweet and sour soup that was quite good, but beyond that our Vietnamese-style spring rolls, chicken with cashews and orange beef were awful. The beef was dry and tough -- like eating leather. Service and atmosphere were o.k....\n\n\nMore"], ["A Treat Near Dupont Circle", 4.0, "November 8, 2009", "VABFB", "Northern Virginia", 34, 17, "Walking around the Dupont area, and wanting something to eat, we walked both sides of Conn Ave and looked at all of the choices (there's alot of them!), and decided to go with City Lights of China.\nIf you like the places that feel like a \"hole in the wall\", this would suit you just right. A dim atmosphere, and...\n\n\nMore"], ["Good food, not great food", 3.0, "July 19, 2009", "RayBannon", "Kent, Washington", 42, 40, "Had steamed beef dumplings, Tingling Bell Pork with steamed rice, and two gin & tonics. Drinks were way better than some of the variations I had in DC and at half the price. Dumplings were flavorful. Tingling Bell Pork came in an I-kid-you-not scorching pot. Port was tender and the veggies were crisp; sauce was tasty but a little indistinct...kind...\n\n\nMore"], ["Different from other Chinese places. Nice variety, authentic.", 5.0, "November 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Different from other Chinese places. Nice variety, authentic."], ["this food was so gross", 1.0, "August 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "this food was so gross"], ["What about those home-made noodles? I could eat them, and eat them, and eat them... for the rest of my short life.", 4.0, "July 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "What about those home-made noodles? I could eat them, and eat them, and eat them... for the rest of my short life."], ["Love the Garlic Chicken...", 5.0, "May 19, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love the Garlic Chicken! Big pieces of chicken instead of those little slivers like some places. Delivery is definitely the best."], ["Delivery is better than...", 4.0, "April 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Delivery is better than eating there."], ["Best Chinese Deliery but...", 3.0, "March 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best Chinese Deliery but still crappy food."], ["used to be better. new...", 2.0, "March 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "used to be better. new management."], ["The best Chinese in DC!", 5.0, "March 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The best Chinese in DC!"], ["Went for Chinese New Year...good times with some solid Chinese dishes.", 3.0, "February 19, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Went for Chinese New Year...good times with some solid Chinese dishes."], ["I've eaten this more times for work than I care to remember. AND NONE OF IT IS GOOD.", 1.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I've eaten this more times for work than I care to remember. AND NONE OF IT IS GOOD."], ["Really good healthy chinese food.", 3.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Really good healthy chinese food."], ["Great, great service and...", 4.0, "January 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great, great service and good food. Decently priced for a Dupont-area restaurant. Highly recommended."], ["Good Chinese food at decent prices in the city.", 3.0, "January 27, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good Chinese food at decent prices in the city."], ["It has slipped a bit lately, but still offers decent Chinese. Good location, right on Connecticut just north of the...", 3.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It has slipped a bit lately, but still offers decent Chinese. Good location, right on Connecticut just north of the metro."], ["It's a take-out favorite...", 2.0, "January 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It's a take-out favorite just cuz it's convenient and quick... food is hit or miss to be honest... dine-in service is friendly and efficient... but it's good days are behind it B-"], ["I think this place is way overpriced for Chinese food and the food is very average.", 1.0, "December 28, 2007", "eteplinsky", "Washington DC, District of Columbia", 33, 2, "I think this place is way overpriced for Chinese food and the food is very average."], ["dependable quality and fast delivery", 3.0, "December 23, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "dependable quality and fast delivery"], ["Mr. Katz Bean Curd!", 4.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Mr. Katz Bean Curd!"], ["A lunchtime favorite to...", 5.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A lunchtime favorite to order in!"], ["over rated", 2.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "over rated"], ["One of the best chinese...", 3.0, "December 15, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of the best chinese places in town, but I haven't been in ages."], ["great chinese food. home-style bean curd is good.", 4.0, "December 11, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great chinese food. home-style bean curd is good."], ["My favorite Chinese food...", 5.0, "December 8, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "My favorite Chinese food in the city."], ["City Lights has been around forever. I don't particular like too many dishes from them. But the ones they do well they...", 3.0, "December 1, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "City Lights has been around forever. I don't particular like too many dishes from them. But the ones they do well they do very well. Their crispy beef is very good."], ["The freshest Chinese food I've ever had.", 4.0, "November 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The freshest Chinese food I've ever had."], ["Mmmm, take-out.", 4.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Mmmm, take-out."], ["A little gem in the heart of Dupont! You might walk past it on the street, as it's on the basement level, but TRUST...", 4.0, "November 11, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A little gem in the heart of Dupont! You might walk past it on the street, as it's on the basement level, but TRUST me, this place is EXCELLENT. Almost any dish you get there will be good. Yes, it's just that good. And reasonably priced too."]]], ["Longworth Building Cafeteria", [["You aren't here because you have options :)", 4.0, "October 1, 2015", "Ted M", null, 9, 2, "But it's still really good. Get the Mac and Cheese (scooped off the top, obvi), add hout sauce/ketchup, eat, repeat."], ["Decent food while on the hill", 3.0, "October 1, 2015", "Brandon K", "Flagstaff, Arizona", 317, 95, "As others have noted, this is not a place to seek out but is a good spot to refuel if you are already here. We were here for visits in the Cannon offices after lunch so we stiopped here. It was nice to have so many choices from grilled to pasta to sandwiches to vegetarian. The place was packed and...\n\n\nMore"], ["Congressional hangout", 4.0, "September 30, 2015", "rockwell121", "WDC", 173, 42, "Don't make a special trip, but if you're on the House side of the Capitol, Longworth is a good deal. Huge salad bar and multiple stations for sandwiches, burgers, specials, etc."], ["If you are on the \"hill\"", 3.0, "September 28, 2015", "ksqred", "Washington DC, District of Columbia", 7, 6, "Not recent but a few occasions. One of the better cafeterias as far a food variety but not really friendly as far as accessibility."], ["its a Cafeteria", 3.0, "September 15, 2015", "scottbadesch", "Washington DC, District of Columbia", 33, 6, "It's a cafeteria so what more can I say. The prices are good and there are a lot of choices and it is in a Congressional Office Building. But it isn't a place where I would go just to eat."], ["Inexpensive and Efficient!", 5.0, "September 12, 2015", "JimFitz210", "Santa Barbara, California", 79, 22, "This is the simple locale where staffers and Members of Congress eat their lunch. It's tucked away in the corner upstairs, and at the height of the lunch hour can be fairly crowded. There's selections of hot plates; pizza; a sandwich bar; and quick prepared items if you're really in a hurry. AND there's a view! Seriously, while watching for...\n\n\nMore"], ["Something for everyone - cafeteria style", 4.0, "August 14, 2015", "tuffy", "oxnard, ca", 44, 55, "We ate here while visiting our daughter who was interning at the Capitol. It was lunch time and busy but the lines moved quickly. Our group had the salad bar, fried chicken combo with mac n cheese and turkey sandwich. Nothing special but inexpensive and fast. Their cookies were as big as my hand (fingers spread!)\nI felt the atmosphere...\n\n\nMore"], ["If you have to eat here", 2.0, "August 14, 2015", "GoGators1986", "Kensington, Maryland", 28, 5, "When stuck on the hill and on the house side the Longworth Cafeteria is an ok option. Food is edible however prices are very high. Food truck prices but not food truck quality."], ["Great Lunch", 5.0, "July 11, 2015", "EdnaU_13", "Jourdanton", 39, 8, "We had visited our representative, then stopped for lunch. Excellent selection of food choices in the cafeteria. I had a salad bar (priced per pound) and ice tea for about $10. I thought the prices were reasonable and the food excellent."], ["In Between Hill Meetings - Check this out", 5.0, "July 7, 2015", "Brenda B", null, 10, 0, "Great little place to grab a beverage or quick bite. Always friendly staff and food is good a lot of daily specials too."], ["Solid food with great prices", 4.0, "June 29, 2015", "CoachDaddy85", "Ocean City, Maryland", 69, 24, "One of the better values in DC. Friendly staff. Vibrant environment. Great food selections from healthy to hangover. Got to have the bean soup. Annual highlight for me."], ["Great value for the area", 4.0, "June 3, 2015", "Daphne H", "Washington DC, District of Columbia", 4, 5, "If you happen to be around the Federal SW metro station you will notice there really isn't much in the area, so there isn't too much to compare in the neighborhood. That being said the cafeteria is a good choice for value and selection in the area. First a bit about it's location, the Longworth Building Cafeteria is located inside...\n\n\nMore"], ["Lifesaver", 4.0, "May 26, 2015", "Barney_Thelma_Lou", "Missouri", 69, 10, "We were going to eat at the Capitol visitor center but it was temporarily closed due to evacuation. Someone mentioned going across the street. We were pleasantly surprised at the variety. It was pretty reasonable compared to the $70 we spent for lunch at the Smithsonian place (family of four). We had the taco bar and also the chicken strip...\n\n\nMore"], ["Lunch in the Bowels of Congress", 3.0, "May 19, 2015", "Jay P", "Cruz Bay, St. John", 48, 20, "The cafeteria food here is edible and the people-watching is kind of fun. Mostly filled with staffers and some visitors trying to grab a quick bite to eat between writing more laws to regulate the masses..."], ["Very cool!", 4.0, "May 12, 2015", "historygeeks05", null, 63, 12, "This is a great place to grab something to eat. There is a lot of variery. The cafe can get busy during peak times. However, if you look around, there is usually someone leaving. Recommended!"], ["Few tourists and great fried chicken.", 4.0, "April 21, 2015", "rassors", "San Francisco, CA.", 105, 52, "We found this place by accident and what a great find. Lots of choices from pizza to salads.Fried chicken was superb , decent prices but the best part was really being part of the legislative milleu and hearing snippets of conversations. \"He's not as conservative as most people think\" .\nIt's a great break from being a tourist . Cafeteria...\n\n\nMore"], ["Pretty good", 4.0, "April 13, 2015", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "This is a pretty good cafeteria, and convenient, since you have to go through security to go in and out of the buildings. It's nice not to have to do that."], ["Good prices and choices", 4.0, "April 13, 2015", "OhioState94", "Columbus, Ohio", 15, 5, "Although this is not the most formal of locations, this cafeteria has many options for food that is well priced. Good option for in between meetings"], ["Average Cafeteria Food, But Good Selection", 3.0, "January 11, 2015", "WhirldWind", "Southeastern U.S.", 224, 162, "If you find yourself in need of some lunch in-between House Office meetings, this is one of your options. Always a big crowd and lots to choose from. Keep in mind that you can get a freshly prepared meal (elsewhere) for about what you will pay here, but sometimes the weather or time factors in and this place becomes a...\n\n\nMore"], ["Was great until the BBQ left...", 3.0, "November 14, 2014", "sunfalcon", "ashland, ohio", 12, 4, "Well, I loved coming to the Longworth Cafeteria every time I visited our Congressional staff for one thing - the BBQ Brisket. I just went there today, and alas, after five years, they no longer have it. Thus, even though it is a good value for the money, I am very disappointed. I had the fish and chips and it...\n\n\nMore"], ["It is Awesome!", 4.0, "July 2, 2014", "Ruth N", "Green Bay, Wisconsin", 21, 8, "Lots to choose from and you might get to sit down and visit with one of your representatives or their aides! Right in the heart of DC where all the laws are made."], ["Great value. Busy place.", 4.0, "June 26, 2014", "plastx2", "Boston, Massachusetts", 342, 123, "Across from the Capital are the 3 House of Representative and Senate buildings; Cannon, Longworth and Rayburn with their own cafés. Great sandwiches, salad bars, hot foods. You can go into these buildings after going through security. Walk around and drop in on your state congressmen. Really interesting and fun."], ["Such a great food court!", 5.0, "June 7, 2014", "dwhite2011", "Chandler, Arizona", 138, 38, "So much choice, and very reasonable!\nAs healthy as you want to be~ great salad bar, wraps, nice pizza, fried foods, and even desserts!\nWe went twice in a week - very affordable. Staff at checkout is very friendly."], ["Handy and Affordable", 5.0, "June 6, 2014", "DougTMesa", "Mesa, Arizona", 205, 60, "If you are down in the Capital area and want a good meal at a great price, go to the bottom floor of the Longworth building. Yes it is a Cafeteria, but the selection is wonderful and the price is right."], ["Great food for a great price", 4.0, "May 13, 2014", "candyminnesota11", null, 53, 19, "Lots of variety, interesting people-watching and I enjoyed everything I chose to eat. My Washington friend knew about it, otherwise I would never have found it!"], ["Great place to eat after touring the Capitol", 4.0, "August 11, 2013", "StillDoreen92", "San Francisco, California", 59, 28, "A little on the pricey side, but it was a great place to be right after we toured the Capitol. Fresh salads, hot entrees and desserts."], ["Typical Cafeteria.", 3.0, "July 9, 2013", "Gerard C", "Media, Pennsylvania", 43, 12, "Good place to stop when you need a break from working the Hill. The food is typical cafeteria fare and, all things considered, reasonably priced. You will see a very interesting group of people in this place."]]], ["McDonald's", [["Overpriced Mickey Ds", 2.0, "September 17, 2015", "Jetsetter24-7", "Washington DC, District of Columbia", 21, 1, "The prices were way too high. They take advantage of hungry tourists. Go to a location outside of the museum or go to another restaurant near by."], ["Just Right! Just As Expected!", 5.0, "September 16, 2015", "Diamond_Girl88_11", "Shelburne, Canada", 87, 42, "Reliable, \"cheap n' cheerful\" good ol' McDonald's gave us a good, healthy and fast start to our big day of sight-seeing in Washington, D.C. This location was clean and bright and busy. Staff were very friendly."], ["Why go to McDonalds?", 5.0, "September 11, 2015", "winnie4751", "North Mankato, Minnesota", 13, 2, "Disappointing. We just tried to get an ice cream cone or ice cream shake & the machine was not working & out of service."], ["Something for everyone", 5.0, "October 29, 2014", "Dr Edward D", "Greensburg, Pennsylvania", 82, 17, "Now there's a healthier selection of sliced apples, various salads, or just a Egg Mcmuffin and there's still the old school selection for the person who enjoys a double cheese burger of Big Mac, with fries. Or a supersize coke, with several apple or cherry pies. Don't forget, it's usually the best price in town if your on a tight...\n\n\nMore"], ["Feeding the masses world wide", 5.0, "September 2, 2014", "EdShafik", "Nottingham, Maryland", 37, 5, "Wherever you go in America or abroad McDonald's golden arch stands high with a promise of feeding the masses everywhere a hamburger and French fries at a cost less than a tip you pay in a restaurant. They call fast food ready to deliver in one minute or two, I call it fast hunger binge crusher when you're on the...\n\n\nMore"], ["So many other options !!!", 1.0, "August 5, 2014", "darwinsail", "Washington DC, District of Columbia", 379, 305, "DC offer a lot of local and chain healthy eating options, so you don't need to choose this particular brand that offer too much calories and not very healthy options !!"], ["A Tiny McDonald's!", 4.0, "March 9, 2014", "Thomas S", "Fiddletown, California", 21, 26, "There is indeed a tiny little McDonald's permanently planted right there on the side of the Air/Space Museum there in the SDmithsonian complex.\nLikes: I liked my made-on-the-spot burger/fries and soda. which taste different (better) than usual there is a tiny little seating area right there in the great outdoors that has birds whom have figured out how to get...\n\n\nMore"], ["Amazing Staff", 4.0, "October 8, 2013", "KevinSunshineCoast", "Sunshine Coast", 25, 9, "A very busy restaurant (Probably the busiest) that had been planned with precision movements in mind. The eating area was clean and large enough to cater for the massive crowd that was there on the day we visited."], ["Air and Space Museum has a Macdonald's", 5.0, "July 14, 2013", "BarrieRes", "Barrie,Ontario", 56, 28, "Well planned layout and friendly staff make this an inexpensive and easy access location to eat while visiting the National Mall and the Museums."]]], ["Smithsons Restaurant", [["Good place for a quick bite", 3.0, "September 30, 2015", "Chinapjs", "Washington DC, District of Columbia", 520, 117, "Though nothing special this is a good, quiet place for a quick bite. Has both a sitdown restaurant and a sandwich takeaway area. Both do to go meals. Located in the Holiday Inn. Easy access to the VRE and to various parts of the Smithsonian Museums."], ["Awesome with a large dose of class!", 5.0, "September 15, 2015", "Yvonne F", "Bowie, Maryland", 4, 0, "Very, Very, nice I actually went to a conference there and the customer service was great! The lobby is awesome with alot of modern displays. Real cozy!"], ["Ok", 2.0, "August 18, 2015", "Hyenin C", null, 5, 0, "Ok over all, nothing too much. The food is not bad, but not great either. Very expensive as expected."], ["Good place to eat", 5.0, "August 14, 2015", "725francinee", "Washington", 2, 0, "The place is nice and clean and really a lot of good food, location is somewhat hard to find to park....you will not be disappointed"], ["good food", 5.0, "July 21, 2015", "saw55", "Los Angeles, California", 43, 11, "I liked the food and pairings. They ran out of food quickly. It was a nice place to sit and chill. Beautiful items surround you. And those gardens! A treat with the creativity in the garden."], ["Quality vs price and variety", 3.0, "July 15, 2015", "marcopelli2015", "Washington DC, District of Columbia", 10, 3, "The food is good, but there aren't many options, and the available option don't vary....EVER. And one more thing is that the food is really expensive. So....pros: good food. vs Cons: expensive and not much variety."], ["Excellent Hotel Bar", 4.0, "July 8, 2015", "Sonja G", "Glen Allen", 1, 0, "Excellent food, good value. I really love the steak salad. Service was also good. Would eat there again."], ["The Choice is Yours - Explore", 3.0, "June 18, 2015", "Sure_122", "Washington DC, District of Columbia", 31, 28, "Reasonably Good Food\nDC High Prices.\nWhy settle for Hotel food with Sooo Many good and varied restaurants in DC.\nCheck out Georgetown, Adams Morgan, the Hill.... lots of choices.\nEXPLORE EXPERIENCE"], ["Wonderful meal", 5.0, "June 4, 2015", "RachelCeleste", "Oxford, United Kingdom", 4, 1, "I've been welcomed by a very nice member of the staff, they let me choose where to seat and in a few second the barman/waiter brought me the menu. I ordered a burger, the meal arrived fast enough and the waiter apologized for the delay, I ordered a medium well burger so I was aware that I had to wait...\n\n\nMore"], ["Hot scrambled eggs!", 4.0, "December 9, 2014", "carole c", "Groton, Connecticut", 112, 42, "Knew I needed a large breakfast to fortify me for the long Monday ahead of me. I do not usually eat a large breakfast. I was aware the prices would be high. I was not aware of a breakfast buffet on a Monday morning. Individual offerings were quite pricey in my opinion so I inquired of the buffet. Buffet included...\n\n\nMore"], ["Great Food", 5.0, "October 27, 2014", "1bunbun", "Detroit, Michigan", 136, 67, "We ate here often and was happy with all of our choices! Food was always good and tasty! Staff was nice and pleasant and usually didn't have a wait!"], ["A bit pricey for what it is...", 3.0, "September 27, 2014", "pauloinnyc", "New York City, New York", 114, 48, "The problem? Not any other restaurants in the is immediate area. SO Get out and explore!! We ended up heading over to Dupont Circle and tooling around for the evening. Great fun."], ["Great deal and friendly staff", 4.0, "July 27, 2014", "Matt H", "Norwich, Connecticut", 12, 7, "Wonderful breakfast buffet, kids eat free on weekends. The staff was friendly and engaging, seamed very happy to see us every morning."], ["Adequate", 3.0, "June 29, 2014", "basketbunny1", "Salt Lake City, Utah", 51, 12, "We are breakfast in this restaurant and one dinner. The service was good and the food was perfectly adequate."], ["Hard pancakes, overcooked sausage, yuck.", 1.0, "June 16, 2014", "stationwagonman", "Galion, Ohio", 79, 33, "I am not a picky eater. I thought we landed a good deal as we negotiated free breakfast vouchers with our stay to each breakfast at this restaurant. Sometimes I guess you get want you pay for. The buffet was so bad that by the middle of the week my wife stopped going to breakfast and by the end of...\n\n\nMore"], ["Take more money for terrible food", 1.0, "May 27, 2014", "Nimal V", "New Haven, Connecticut", 15, 18, "If you eat at this place you will ended up paying more than you eat at least 60%. We purchased two kids meals since they said they do not have anything listed on the kids menu. $14.00 for two kids. But we were charged $32. That is their policy according to the founder. The restaurant manager on duty May 26,...\n\n\nMore"], ["Good", 5.0, "May 12, 2014", "Vanessa-NC", "North Carolina", 60, 26, "Good but dont go in a big hurry or plan accordingly. I really enjoyed the good customer servie and friendly smiles. I really enjoyed going in for a nice breakfast and prepare for my day."], ["Expensive for what it is, but food good.", 4.0, "May 6, 2014", "GetMeOuttaHere07076", "Scotch Plains, New Jersey", 50, 20, "This review is for dinner ordered off the menu, not the buffet. The food was good but was overpriced for what it was (burger, salad, crab cake). Would eat there again because of convenience and the fact that there is just about nothing else nearby."], ["Excellant", 5.0, "January 25, 2014", "Keith W", "White Plains, Maryland", 2, 0, "Everything was excellant, location, tours, and food! The drive was not that long, the people we came in contac was helpful and very polite!"], ["lots of choices", 4.0, "January 8, 2014", "saradhaV_13", "Edison, New Jersey", 8, 1, "As a vegeterian, my options are always limited to cheese pizza at other places, whereas smithsonian was a culinary treat with lots of options ,everything tasting yummy!"], ["Just OK", 3.0, "October 17, 2013", "alexjam60", "Surfers Paradise, Australia", 4, 7, "Breakfast was good but I suggest you go across town for a better meal, service etc for any other meal"], ["good", 5.0, "October 12, 2013", "Angie H", "Baltimore, Maryland", 14, 1, "We chose to order a pizza from the restaurant. We are vegetarians, so the pizza choice was perfect. It was well worth the amount we paid. I would definitely eat there again. We may actually dine in next time. It was crowded the night we stayed, so we just ate in the room."], ["don't go out of your way", 3.0, "July 30, 2013", "TexasInd", "Columbus, Ohio, United States", 18, 6, "we kept passing this walking from hotel to the Mall....and heard from several fellow tourists they had a good buffet....perfectly defined as \"average\" ... wanna remember a meal? try Mitsitam"], ["Bufett is average", 3.0, "June 18, 2013", "RickHWilson", "Wilson, North Carolina", 3, 1, "The food was decent with really good bacon. The waitstaff was a bit lazy with refills non-existent. Overall decent price for a lot of okay food."], ["Top Notch Food and Staff", 5.0, "June 17, 2013", "JKCIllinois", "Illinois", 20, 7, "You don't have to waste your money and time looking for another restaurant. Stay at this this hotel and know you always have a good meal that is convenient. The price is right, he buffets are generous, the dining room very clean and the staff is very attentive. What more can you ask for?"], ["Nice place to rest and relax!", 5.0, "May 30, 2013", "MaggieThomasPam", "Virginia", 47, 31, "Buffet is very nice, but a bit pricey - $14.95. If you have kids, kids eat free which helps if you are a family! The waiters are attentive and helpful. The food is very good. My kids love it."], ["Badly managed", 3.0, "April 20, 2013", "FlorenceNewt", "cornwall", 102, 39, "The managers of this restaurant appear not to be interested in their job or their customers: the wait staff, however, are charming, pleasant and unfailingly helpful. Sack the managers and promote the staff. Food ok, but nothing inspiring. Given the dearth of places to eat in this area, we had a hard time finding anything else."], ["A breakfast and Dinner all good", 4.0, "April 19, 2013", "VangeInternational", "Sydney, Australia", 361, 1562, "This is the main restaurant to the Holiday Inn Capital,,that serve a good full buffet breakfast and have a good lunch and dinner menu. My erstwhile vegetarian friend was very pleased as there were some good options while I had the New York cut steak, all good and the service was just fine."], ["bad service", 2.0, "February 22, 2013", "Susan C", "Louisville, Kentucky", 2, 0, "Staying at a Holiday Inn Capital for four day , good location but the service is bad. On Tue February having a lunch at a Capitol Bistro , been waiting to be seat for five minute. The staff there is not friendly specialy the African ladie name is Hanna , I don't know she's is a host or supervisor, very...\n\n\nMore"], ["OK for a hotel", 3.0, "January 14, 2013", "GoodFood88", "Washington DC, District of Columbia", 594, 253, "I used to work right here and would sometimes do business lunches at Smithsons. It is ok, the burger is actually quite good, but you are better off getting the buffet and going at your own pace rather than waiting on the wait staff, who can be slow. The remodel they did a few years back really helped open the...\n\n\nMore"], ["Very good meals", 4.0, "December 17, 2012", "Nathaen M", "Brisbane, Australia", 319, 176, "Smithsonians at Holiday Inn Capitol\nWhat a wonderful dinner. I had a steak whilst my wife enjoyed the fish. The staff were super attentive and the meal was sensationally delicious. Two big thumbs up and highly recommend. Very reasonable prices too!"], ["Old Standby Over Time", 3.0, "November 15, 2012", "Bringstheeagle", "Aurora, Colorado", 167, 49, "I've eaten here many times over the years. It's okay for lunch if you have time. Waitstaff seems prompt but takes forever for food and check. If you're in a hurry skip these guys.\nThe food I had two days this week was decent. I had their salmon salad which I found tasty, well prepared, with a generous portion of...\n\n\nMore"], ["Smithsons Restaurant", 2.0, "November 5, 2012", "jms1104", "Pittsburgh, Pennsylvania", 13, 1, "The food was over-priced and very mediocre. The service was good. It was convenient but there are much better options if you are willing to leave the hotel."], ["The best", 5.0, "November 1, 2012", "John F", "Melbourne, Australia", 9, 5, "This is a great place... beautiful fresh food, great menus, carefully prepared to your liking..it really is great and wonderful staff."], ["Food actually good", 4.0, "June 16, 2012", "MichGirl14", "Midland, Michigan", 6, 4, "We were surprised that the food was actually good - but very expensive as with everything in D. C."], ["Great family restaurant", 5.0, "May 6, 2012", "annette m", "Newcastle, Australia", 103, 62, "We at here and found the food to be home style. Kids ate free."], ["not brilliant", 3.0, "April 26, 2012", "cornishsimon1980", "St Austell, United Kingdom", 32, 24, "could do with some work on the layout and look as well as the menu and the staff serving, they were friendly but not all that good !"], ["Decent food, a little expensive.", 3.0, "April 23, 2012", "Kelley P", "Peoria, Illinois", 38, 5, "I had the breakfast buffet twice and Easter dinner buffet. The food was simple but good. The breakfast was tasty but cost about $15. That did include beverages so it really wasn't much more than ordering off the menu. Not bad for hotel food."], ["Great buffet", 4.0, "March 3, 2012", "Debbie H", "Fredericksburg, Virginia", 37, 18, "I ate here for weekday lunch and it was very good. Everything I ate from the soup to the dessert was great. I had cobbler for dessert, my kids had bread pudding which they liked. The baked chicken and mashed potatoes were my favorite buffet items but I think I tried everything!!"], ["A decent hotel restaurant...but nothing to write home about.", 3.0, "November 22, 2010", "leilanimoo", null, 4, 1, "The food wasn't bad but if we knew of more places close by, I don't think that we would have eaten there. Prices are a little high for what seems to be appleby's like food. And service was friendly but slow and somewhat unresponsive after you get your food."], ["Go somewhere else", 1.0, "August 7, 2007", "t515cc", "San Antonio, Texas", 149, 208, "This is the hotel restaurant of the Holiday Inn - Capitol which is an easy walk south of the Smithsonian Air and Space Museum in Washington DC. The hotel fronts on C Street, 550 C St., SW.\nAte here once and only once. One of the worst dining experiences I have ever had. Too many things wrong here to list....\n\n\nMore"]]], ["M Street Bar & Grill", [["Perfect mid-week meal with work colleagues", 4.0, "September 29, 2015", "MoDC", "Washington DC, District of Columbia", 68, 67, "A work group from different parts of the world just came in town. The 8 of us were looking for a place nearby with good food but not so loud we couldn't hear each other. I had tried this place for crazy but yummy brunch and heard the dinner fare was prepared well, so we took a chance. I hadn't...\n\n\nMore"], ["Good food with professional staff", 5.0, "August 28, 2015", "lexnaturalis", "State College, Pennsylvania", 5, 1, "The food and service were both excellent. While I was eating there was a minor incident where someone wandered in off the street and was causing a tiny disturbance. The bartender handled the situation absolutely marvelously. He was kind, professional, and full of poise. If they had filmed it I'd say you could use it to show any service employee...\n\n\nMore"], ["Great experience", 5.0, "August 21, 2015", "LMoore611", "San Antonio, Texas", 16, 3, "Delicious food, festive atmosphere and attentive service at this restaurant. Everything we had at this restaurant was wonderful"], ["Nice experience but not so great on customer service", 3.0, "August 11, 2015", "MissBooBoo", "Wilmington, Delaware", 10, 2, "We had so many great choices for my son's 21st birthday brunch, and settled on this spot for the central location and the appeal of live jazz. I informed them when I made the reservation and when I called back to adjust our numbers that if they could do a simple birthday acknowledgment it would be appreciated. They unenthusiastically agreed...\n\n\nMore"], ["Very Good", 5.0, "August 4, 2015", "Beachfinder66", "Toronto, Canada", 162, 114, "We had a great meal that was great presentation and with excellent customer service. Highly recommend."], ["Nice additional to St. Gregory Hotel", 4.0, "July 26, 2015", "Rose L", null, 67, 16, "We stayed at the St. Gregory during out stay in DC in July.\nThis is the restaurant and bar inside the hotel.\nWe had breakfast there several times. It is pricey but food\nand presentation were good. If you stayed at the hotel, show them\nyour room key for a discount for all meals all day.\nWe had cocktails after...\n\n\nMore"], ["Beyond Disappointing", 1.0, "July 13, 2015", "luxurybarginlover", "Reston, Virginia", 74, 31, "Please save your money and enjoy one of the many other fine restaurants that DC has to offer. The service was non-existent. The food was over priced and was about the quality you'd get at a high school cafeteria. Not to mention the place was nearly empty on a Saturday night so the ambience was anything but lively."], ["Lunch", 3.0, "July 7, 2015", "Patti B", "Grandville", 7, 1, "The service was a bit on the slow side which surprised me as the restaurant really wasn't busy. It especially took quite a long time after we had finished lunch for our server to come back, and even then I had to ask for our check. The food was pretty good though."], ["slightly overpriced, but convenient", 4.0, "July 1, 2015", "KAL731", "Harrisburg, Pennsylvania", 4, 0, "the tiger shrimp from the app menu were fantastic, but there were only 4 and the salad just ordinary. drinks were tasty but not strong, and everything was a couple dollars more than it should have been. service very friendly, but slow."], ["Disappointing", 2.0, "June 22, 2015", "goonertraveller2", "London, United Kingdom", 53, 29, "This restaurant has a short menu which looks appealing - and I generally think that short menus mean the restaurant does a few things well. Not so. The waiter got both my starter order and my main course order wrong - wrong salad for the starter and had sauce on the plate instead of on the side for my main....\n\n\nMore"], ["Great value", 5.0, "May 26, 2015", "WegieCat56", "College Station", 3, 3, "Food and service were excellent for a very reasonable price. I was staying in the hotel for business and ate there 3 nights -- it was always very, very good."], ["Delicious", 5.0, "May 26, 2015", "amber05281985", "Quincy, Illinois", 14, 3, "Enjoyed the Sunday Brunch. The mimosas were delicious. I had the South of the Border and it was definitely something I'd order again."], ["worth visiting and having a meal", 4.0, "May 26, 2015", "toxicologist", "Riyadh, Saudi Arabia", 64, 27, "this was next to my hotel (St. Gregory Luxury Hotel & Suites). had great atmospahre and lounge area. very rich menu and reasonable price.\nfriendly staff and fast service. many offers and different dishes."], ["Arrogant Bartenders", 3.0, "April 27, 2015", "LazyProjector", "Tennessee", 101, 27, "I really enjoy staying at the St. Gregory, but my opinion about the M Street Bar & Grill is less enthusiastic. The bartenders looked at me like I was suspicious. Maybe because I am young (27)? I had a voucher for a free cocktail, so I ordered a jack and coke. The bartender gave me a coke, so I politely...\n\n\nMore"], ["First trip to DC", 5.0, "April 18, 2015", "scottl690", null, 6, 3, "Staff was very accommodating for us as my wife is hearing impaired. Food was wonderful and service excellent."], ["Misleading ad and unhelpful staff", 1.0, "April 17, 2015", "Linny288", "Seattle, Washington", 12, 6, "My mother and I were staying at the hotel the M Street bar is located in (I do not recommend it) and we went in for a champagne brunch and waited by the sign that told us to do so. After 10 minutes of waiting I found a manager who told us they'd stopped serving brunch.\nThe website said 3pm,...\n\n\nMore"], ["Convenient location, strangely soulless, boring food", 3.0, "April 8, 2015", "MrsRehoboth", "Washington DC", 231, 92, "We were hungry; just moved into our hotel across the street. It was late. This was the closest restaurant. That's the best I can say about it. Actually no. The Bar is quiet and is a pleasant space. But the food was predictable - american basics like hamburger and fries. If you have to eat something - it's ok."], ["Super Salmon; So-So Service", 3.0, "April 4, 2015", "KCM_Live", "Washington, DC", 53, 33, "The atmosphere in the M Street Grill was very nice. We were there with a large group and seated in a semi-private area. The bread was NOT good, which was disappointing, because I LOVE bread. My salmon was good, and my husband's steak and fries was okay, but both were overpriced. It was satisfactory but we won't be back."], ["Best bottomless brunch around!", 5.0, "March 22, 2015", "Alexis A", "Washington DC, District of Columbia", 18, 23, "My girlfriends and I had brunch here yesterday. You can either order a la carte and the mimosas are $4 each or choose the 3 course meal with unlimited mimosas for $27; the latter is what we chose.\nThe restaurant is inside of the St Gregory hotel. Every one was friendly, the service great and the food was amazing. Our...\n\n\nMore"], ["Large group handled sell", 4.0, "March 19, 2015", "Ken D", "Akron, Ohio", 92, 21, "We had 20 clients in our group and the servers were attentive and handled it well. Kitchen put out food all at once and meals were good temperature and tasty. Well done."], ["Food was great!", 4.0, "March 17, 2015", "Melissa K", "New York City, New York", 13, 5, "Came here for breakfast before we headed back home. While the food was just eggs, bacon and potatoes, it was done really well. It was the best version of those items. Both my boyfriend and I were pretty impressed."], ["Great service", 4.0, "March 9, 2015", "Dale R", null, 104, 45, "The service was very good for our group of 12. The menu is just a little limited for dinner. The food was very good and well presented. We had reservations but they were not at all busy. The prices seemed fair for DC. The bar is small & somewhat noisy. Our group all enjoyed their dinners."], ["Overpriced", 2.0, "February 9, 2015", "gricela123", "Manassas, Virginia", 2, 1, "We had breakfast here and the food was completely over priced for the quality and they forgot an item with my dish."], ["Pass - limited choice", 2.0, "December 9, 2014", "Jennifer B", "Florence", 235, 57, "We only went here because we stayed the St. Gregory. The room service options had more than what was offered in the actual restaurant. The service was good until a large party came in and it was just us and the other table. Food was ok - nothing to brag about.\nThe Bar - the first day in town we...\n\n\nMore"], ["Perfect For Lunch", 4.0, "December 7, 2014", "ivstman", "Alexandria, Virginia", 31, 5, "M Street Bar & Grill is the perfect business lunch spot. It has a great location, lots of variety on the lunch menu and excellent service. Always a positive experience."], ["good breakfast", 4.0, "November 11, 2014", "Paul C", "Vineland, New Jersey", 43, 37, "I'm not used to D.C. prices, but this a good value. Service was very attentive. Waitress was always there just when we needed her!"], ["Wonderful Botique Bar and Grill on M Street", 5.0, "September 25, 2014", "Paul M", "Carlisle, Pennsylvania", 49, 16, "In DC on business, we decided to stop her for a cocktail and some food. Food choices appear to be limited but inventive. We end up here 3 days in a row for cocktails provided by Dan who is a master mixologist and entertaining. My business partner and I love Old Fashions and rarely find someone who can fix them...\n\n\nMore"], ["Chef is excellent", 4.0, "September 23, 2014", "IEEEtraveler", "San Diego, California", 21, 8, "some items are $$$, many are $$ -- those are great value. Restaurant and bar are co-located, so vrfy noisy sometimes at night."], ["An expensive breakfast option", 3.0, "September 22, 2014", "Don_K_Kingston", "Kingston, Canada", 346, 172, "This is a difficult restaurant to review. The food was actually quite good. I had an omelette and the chef was very generous with fillings. In contrast, the potatoes and toast were very plain. My biggest complaint was the cost; a simple cranberry juice was $5.00. I ate dinner at a nearby restaurant for less than my breakfast here. The...\n\n\nMore"], ["Good atmosphere and food", 4.0, "August 3, 2014", "Formerteacher2", "Solon, Iowa", 29, 7, "This restaurant has a very nice atmosphere. The salmon with rice and baby carrots was cooked well and presented nicely. The food seemed to be reasonably priced for the DC area. The staff was friendly. I would visit again when I'm in the area."], ["Great Martini Specials!", 4.0, "June 1, 2014", "Amber197925", "Milwaukee, Wisconsin", 29, 3, "Overall good food and they had $5.00 martini's. Staff was nice,very helpful, prompt. Menu selection is decent too!"], ["Excellent Food! Excellent Staff!", 5.0, "May 13, 2014", "Jay R", "Atlanta, Georgia, USA", 44, 42, "I absolutely love this place! Our waiter was fantastic and the food was even better. The drinks were awesome and the prices were decent. The atmosphere was very nice as well."], ["Find the right sever", 4.0, "May 12, 2014", "Nighthawkasl", "USA", 28, 10, "My wife and I went to this restaurant for Breakfast on Mothers day. We had great food and good conversation. The seating was extremely limited since they had a brunch later in the morning and some people were asked to sit at the bar. Isaac was a server at the table next to us and took better care of us...\n\n\nMore"], ["Quick breakfast", 3.0, "May 9, 2014", "LawGuy1028", "Providence, Rhode Island", 7, 3, "Decent food - 15% discount for staying at St. Gregory. Nothing special. Service was relatively quick but the selection was small."], ["Nice for happy hour", 4.0, "April 22, 2014", "JanetSEgan", "Wall Township, New Jersey", 16, 5, "Drinks are good and service is nice. Always have good deals and a long happy hour! Portions are huge but as apps they are fine."], ["Not great", 3.0, "March 14, 2014", "Lois161", "Bowling Green, Kentucky", 43, 11, "I went with a group of about 14 who were in town for a conference. Our server right off told us she didn't like us because of who we were affiliated with, kind of joking, but not really. I ordered the salmon, which was just ok. The crust was very tasty, but the salmon itself was not very good. We...\n\n\nMore"], ["Best Food with reasonable price", 5.0, "February 11, 2014", "Djdial", "Baltimore, Maryland", 3, 4, "Has variety of food for both kids and adults. Steak sandwhich is my favorite along with the peach cobbler or bannana bread pudding."], ["brunch with girls.", 4.0, "November 27, 2013", "S S", "Upper Marlboro, Maryland", 3, 0, "I was disappointment that brunch wasn't buffet style as depicted in pictures......................................................................................."], ["Sunday Brunch", 4.0, "November 4, 2013", "Arien C", "Washington DC, District of Columbia", 6, 3, "This is a nice, chill atmosphere for Sunday Brunch. They play live jazz music as the lady plays the piano. The staff was very friendly and even offered me mimosa's at the bar as I wait for my guests. I recommended the French toast which were very good."], ["Good Eats", 5.0, "November 1, 2013", "49MAK", "Seattle", 3, 0, "The happy hour small plates were great! The Sunday brunch was very fun. Can't beat bottomless mimosas."], ["Average breakfast", 3.0, "October 14, 2013", "leylim", "Istanbul", 39, 12, "This restaurant has a very pretty website which makes it look a bit cooler than it really is. It's an average spot, the food (we were there for breakfast) is not superb but not disappointing, either. You can try it out if you're already staying at the hotel, but I wouldn't recommend making the effort to go here if what...\n\n\nMore"], ["Great", 5.0, "October 6, 2013", "Chris O", "Silver Spring, Maryland, United States", 5, 2, "Stayed at the hotel and this was located in the hotel. Loved the food and intimate setting. The staff was amazing and very friendly."], ["Great time and drinks!", 4.0, "September 25, 2013", "Zookster", "Ocean View, Delaware", 8, 2, "Staff very friendly. Drinks very good. Would go again. Only had deserts but they were great. Took drinks up to room with no problem. Very clean."], ["Avoid if you can", 2.0, "September 8, 2013", "Maureen Y", "Trenton, New Jersey, United States", 6, 1, "Had a very bad experience with service .. Waitress was very goofy. Ordered a bottle of merlot, brought the Pinot noir. En when she opened she was reaching across the table and spilled all over my husbands hand. Then spilled more as she was pouring my glass.. No offer to clean up or even move closer to pour mine after...\n\n\nMore"], ["Not bad, not great", 3.0, "May 18, 2013", "whollows", "Naples, Florida", 129, 29, "Had a friendly business lunch here. Nice decor in trendy area off M Street. Service was good. Nice selection of vegetarian menu items.\nCaesar salad was decent and I had fried shrimp on spinach salad. Not a large dish but good size for lunch. Overall food was okay. I'd eat here again."], ["Not Worthy", 2.0, "April 29, 2013", "Dec2501", null, 47, 15, "Went to this place for a hosted birthday party for a friend ( we all paid our fair share ).\nIt was on a Saturday and it was dead. The food served was not good ... Costco food is better. It was chips, salsa, hummus, pita bread and wings. The main course was fine ... Nothing special at all. It...\n\n\nMore"], ["Too expensive for breakfast", 2.0, "April 13, 2013", "Chi-Shiun C", "Hsinchu, T'ai-wan, Taiwan", 23, 11, "The dish is relative small than most restaurant. It was the first time that I was not full after taking the American breakfast"], ["Very nice service and good food", 4.0, "April 5, 2013", "Paul M", "London, Canada", 7, 0, "We ate at the restaurant mainly because we were staying at the St. Gregory Hotel and didn't feel like going far to dine on a cold night ! We were pleasantly surprised as the food was very good and the service, excellent. All in all a very pleasant place to dine. Breakfast and dinner both were very good."], ["Great place to eat and drink", 4.0, "March 7, 2013", "Erin M", null, 24, 4, "This was an easy option for us as it was round the corner from our hotel on a very, very cold night! But it was worth it. The food was great - steak cooked to perfection and the drinks were very tasty too! The staff were great and helpful.\nI did find it a bit pricey though but it is...\n\n\nMore"], ["Great brunch with bottomless mimosas!", 5.0, "February 16, 2013", "grvdggr71", "Carroll Valley, Pennsylvania", 69, 46, "We met friends here for brunch following a recommendation from a coworker. The service was excellent from the moment we walked through the door. The brunch is a set price, includes bottomless mimosas, champagne, or orange juice, an appetizer, main, and dessert. I had the Eggs Benedict, which were prepared perfectly - the eggs were poached just right, the English...\n\n\nMore"], ["Good but pricey", 4.0, "January 9, 2013", "Jennifer B", "West Melbourne, Florida, United States", 20, 8, "No kids menu, but the service was good and the food was good. Prices were a little high, but not too bad. There's a 10% tax on food and beverages in D.C."], ["Great Sunday Brunch!", 4.0, "November 19, 2012", "Chapman2003", "Waldorf, Maryland", 50, 17, "Their sunday jazz brunch was wonderful!! The food was very good and plentiful. The wait staff was also very attentive and were constently filling up our mimosa glasses. The only neagtive I can think of is it would have been nicee if they had a larger selection of desserts. Overall I was very happy with the meal and will go...\n\n\nMore"], ["Meh! We were unimpressed", 2.0, "November 19, 2012", "drmikemaroon", "Hartford, Connecticut", 17, 11, "Meh! We were left thoroughly unimpressed. We visited M Street Bar & Grill with during a family trip to Washington DC and made reservations on the recommendation of the hotel concierge. Perhaps they were having a bad day, but our food & service was disappointing. Many of the entrees were cold. Service was slow and there was a general lack...\n\n\nMore"], ["Steaks yummy but sauce a bit over-powering", 4.0, "November 2, 2012", "smartiq", "Athens Greece", 239, 132, "We were hungry for steaks and fries, which were good, but the sauce was a bit much. 12-ounce seemed no bigger than 6 ounce to my eye by the way although cost more. Service was fine. We walked in, bar was full, but restaurant empty by 8 pm."], ["Burgers are Awesome!", 5.0, "November 2, 2012", "Jackie S", "Boston MA", 2, 0, "Great Space- Nice lighting --\n4 out of our party of 6 got Burgers- all different toppongs- all were fantastic !"], ["Outstanding food", 5.0, "October 8, 2012", "HappieDawn", "Chicago, Illinois", 385, 112, "The meal we had was absolutely amazing - fresh, very well prepared and high quality meals. The service was very good. Ambience left a bit to be desired as there was a lack of energy in the restaurant, but the quality of food and service make this a worthwhile stop for lunch or dinner."], ["M is for Marvelous!", 5.0, "September 26, 2012", "Cleindian44", null, 26, 11, "This is my favorite DC hangout! Happy Hour is the greatest. They have a ton of $5 drink and food specials. The drinks are potent. No rush, because Happy Hour is from 5 until close (10 PM during the week)."], ["Fine breakfast", 5.0, "September 3, 2012", "fredricwilliams", "Lake Geneva, Wisconsin", 23, 5, "At full price (around $15 for most basic breakfasts), a bit costly (we had a 50% discount from the St. Gregory's hotel), but the food was excellent -- all seven of us were happy."], ["Good service, food not impressive", 3.0, "August 26, 2012", "MV05", "miami", 56, 33, "Very nice restaurant at the St. Regis. I got dissappointed when we were seated, the place was very empty yet they sat us right next to the kitchen door where we could hear all the noise inside. I asked to be relocated. The service was excellent, they catered to our needs, especially our children, we asked for small plates for...\n\n\nMore"], ["Boozy Brunch!", 5.0, "August 6, 2012", "Regina D", "Harlem, New York, United States", 8, 2, "This was an amazing brunch. Location was very lowkey, the food was good and the mimosas were strong. Definitely my kind of place."], ["Very good burger!", 4.0, "July 29, 2012", "klpsmom", "Orlando", 118, 29, "We popped in here for lunch and enjoyed their burger special (1/2 off the month of July). Good service, nice location and ambiance."], ["Bring an empty stomach and be thirsty!", 4.0, "July 10, 2012", "trixietrix", "maryland", 26, 12, "I went here for the first time at the end of June 2012 for Sunday brunch. For the price, it wasn't bad! You get a choice of appetizer, entree and dessert for about $25 - $29. There is a live musician \"Yvonne\" who I've met before, so it was a pleasant surprise to see her there. She's very talented. But...\n\n\nMore"], ["Good food and wonderful staff!", 5.0, "July 10, 2012", "Laraine M", "Estero, Florida", 3, 3, "Staff is so nice, attentive, and makes sure everything is perfect! Great drinks, good food with nice variety! Thank you!"], ["Horrible Service", 2.0, "June 4, 2012", "mlelikeshotels", "Indianapolis, IN", 20, 16, "Slow and forgetful server. Food was cold by the time I got my silverware. Decent happy hour."], ["Average", 3.0, "May 27, 2012", "bubu3", "New York City, New York", 197, 167, "The food here was quite good, although served with an attitude that I didnt like. It also has a very rigid closing time with no flexibility (or warning) for residents."], ["so so", 3.0, "March 11, 2012", "jkim3", "San Diego, California", 73, 13, "We had pan seared salmon and chicken panini. soup of the day was rice and bean soup with sausage."], ["meh", 3.0, "February 21, 2012", "cicily1288", "plymouth, ma", 17, 3, "nothing special here - not bad - but not OMG. I was one of three in the place the night i arrived - sat at the bar - still waited a long time for a beverage etc...not a big deal but still"], ["Smart classy cafe close to the Mariott Washington", 4.0, "February 5, 2012", "Dallamjm", "Akron", 88, 54, "I set out on a sunny January Day, I know, strange, and walked a few blocks, and settled on this cafe, sits 160 people, but it still looks cozy and small due to its mult-layer set up. The small plates were great, and they have top shelf liquor. During the day, you can get a sunny table and enjoy the...\n\n\nMore"], ["Mediocre at best", 3.0, "January 31, 2012", "ToxOut_Foodie", "Toronto, Canada", 73, 32, "Steak was thin and overcooked. Fries were awful frozen things that had gone to mush. Admittedly this was a large function with 20 people but still not up to snuff. Salad to start was nice."], ["excellent service", 4.0, "January 18, 2012", "irishspider", "Richmond, Virginia", 31, 11, "the food was good but the service was wonderful. accomodating of our special requests, attentive and friendly - Phillipe made our evening special."], ["Nice hotel lounge", 4.0, "December 27, 2011", "strongforu", "philadelphia", 44, 29, "I enjoyed a quick bite to eat and a perfect martini at the M Street Bar & Grill over Christmas 2011 weekend."], ["Champagne brunch to die for!", 5.0, "December 22, 2011", "TravelHoundNY", "New York", 25, 18, "Absolutely no complaints, EXCEPT maybe that the French toast selection would have surpassed heavenly with REAL VERMONT MAPLE SYRUP and not the Karo stuff they served. Still, an incredible presentation, and a sinful pleasure for the palate."], ["Pleasant", 4.0, "December 15, 2011", "JimboMaine", "Bangor, Maine", 7, 1, "Good experience - they were just about to close but I was welcomed in for dinner.\nGood soup of the day (clearly homemade manhattan clam chowder - not my favorite but EXCELLENT). Sea scallops on a bed of risotto - also decent but kind of gray in hue (from the mushrooms) and a little different than the grits it was...\n\n\nMore"], ["lame hotel restaurant/bar", 2.0, "December 5, 2011", "BoozyCoffee", null, 15, 7, "i sat at the bar for a couple of drinks and a snack before meeting out for the night. the food was chain restaurant quality. the drinks were uncharmingly expensive. they used crappy rail gin for martinis and didn't chill the glasses!\nbasically, it's just a bunch of business people who are staying at the hotel eating crappy business people...\n\n\nMore"], ["Food was great. Service...not so much.", 4.0, "November 12, 2011", "Oriolezgurl", "Waynesboro, Virginia", 120, 33, "My colleague and I had breakfast at the M Street Grill while staying at the Westin near Georgetown. The food was pricey, but very good. I got the oatmeal with apples, honey and walnuts and a side of fresh berries. The berries consisted of blackberries, blueberries, strawberries and raspberries. They were a special treat, especially on a cold November day....\n\n\nMore"], ["Cool little bar and great restaurant.", 4.0, "November 2, 2011", "TC182TC", "Sydney", 57, 61, "Restaurant I have been to this \"Bar and Grill\" both times I have been to DC from Australia, that’s how much I liked it.\nThe atmosphere is relaxed and vibrant in the bar and the same can be said for the restaurant area that i ate in both times that is up stairs.\nThe staff are friendly and professional. The...\n\n\nMore"], ["Excellent.", 5.0, "November 2, 2011", "SadTravellingOnMyOwn", "Perth, Australia", 45, 27, "Read my review of the st Gregory hotel of which the m street bar & grill is part of. Really excellent. Good vale good food good people."], ["FANTASTIC BRUNCH", 5.0, "October 19, 2011", "scuba888", "Germantown, Maryland", 2, 0, "Best Brunch in town. The food was awesome and service was very friendly"], ["Good Food and Wonderful Staff", 4.0, "August 16, 2011", "SpitfireTraveler", "NY", 12, 5, "We stumbled upon the restaurant via \"Open Table.\" The food was great, but we were especially grateful to the staff for their patience with us and our 2 small children. They were very helpful and accommodating."], ["Fabulous Mother's Day Lunch", 5.0, "May 17, 2009", "NoSnakesPlease", "Texas", 82, 28, "The M Street Bar & Grill is in The St. Gregory, a boutique hotel and it's a hidden gem. We had the Mother's Day menu and I couldn't believe the delicious food! This place must have gotten a new chef and he or she is extremely talented. Everything was truly delicious: the Lobster Bisque, the delicate Rockfish accompanied by egglant...\n\n\nMore"], ["M for Miserable...", 1.0, "February 14, 2009", "ardbeg10", "New York", 1, 2, "Valentines dinner here was incredibly disappointing. I kept wishing that chef Gordon Ramsey would suddenly appear, scream at everyone and all would be right with the world. Sadly he didnt and the meal was BAD.\nFrom the monent the front of house manager greeted us with a nervous stressed out welcome I knew things werent going to go well.\nOur...\n\n\nMore"]]], ["DC Reynolds", [["Hidden gem, with bogo?!", 5.0, "October 1, 2015", "Leah K", "Fairfax County, Virginia", 52, 11, "As usual, with most of the Columbia heights bars, I tend to forget about this place, which is truly only to my detriment.\nEvery time I come here I'm impressed with the ambiance, service, deals, food and the whole place to be honest.\nWhile I'm not sure what this spot is like when it's not nice weather, I do know...\n\n\nMore"], ["Unbelievable Happy Hour", 4.0, "August 7, 2015", "Alex_B_in_DC", "Washington DC, District of Columbia", 52, 53, "The Happy Hour here is RIDONKULOUS! Every drink--I mean EVERY drink--is BOGO (buy one, get one for the uninformed) from 5:00 until 9:00. That's right--until 9:00! And they don't have crappy rail drinks. They have EXCELLENT, really EXCELLENT bourbons, whiskeys and scotchs, among other liquors and beers. (To be fair, wine not so much, but who cares, it's not a...\n\n\nMore"], ["Good food in a great setting", 4.0, "September 14, 2014", "DavidTAC", "Calgary, Canada", 244, 118, "A group of us enjoyed their back patio under the warm Saturday night. The place was hopping at the bar but the picnic style tables were comfortable.\nWe sampled a variety of local beers and had the skirt steak, pork belly sandwich, lamb gyro and the scallops. Apart from the scallops which were rather small, the rest of of the...\n\n\nMore"], ["great atmosphere", 5.0, "March 31, 2014", "jenny9049", "Vancouver, Canada", 33, 18, "What a great atmosphere at night! came here to celebrate my bf's bday. bartenders and waitress were friendly. though they were busy, drinks were quickly served up. everyone seemed happy.\nCame back the next morning for brunch and food was great. best part was the french pressed coffee...which i was told is freshly roasted by a local coffee house. being...\n\n\nMore"], ["Surprisingly good food in a dive bar type atmosphere", 4.0, "September 25, 2013", "Punchy_but_accurate", "London, United Kingdom", 61, 33, "Okay, so I'm not American and where I live we don't have the term 'dive bar' but I've been to enough (good and bad) ones in the States to feel like I can use that word to describe an establishment with confidence. DC Reynolds was recommended to us by the locals we were staying with. We go and stand outside...\n\n\nMore"], ["Great happy hour", 4.0, "July 13, 2013", "SGM Tully", "Washington DC, District of Columbia", 41, 9, "Everyday except Sunday 5-9 happy hour, two for one great cold beers, great staff, indoor/outdoor setting, meet and greet place - local tavern"], ["Unique and surprisingly good", 5.0, "June 3, 2013", "Zha-MD", "Annapolis, Maryland", 201, 147, "Attended a birthday celebration on the outdoor patio. Super pleasant bartenders, creating tempting mixes from scratch, including margarita's and fresh squeezed lemonade (not the fake powder stuff). Enjoyed deviled eggs with a horse radish blend topped with pork belly, fresh burger ground with bacon (inside the meat)...really cool, with a super fresh bun. French fries among the best anywhere. Met...\n\n\nMore"]]]]