[["The Raven", [["Great little dive bar.....)", 5.0, "July 25, 2015", "EverybodyisaCritic", "Amsterdam, The Netherlands", 12, 0, "Love the customers, the bartenders, the well worn (circa 1930's) decor. Cold beer, strong drinks, friendly atmosphere....love it!"], ["Best dive in town", 5.0, "July 14, 2014", "Redzuny", "New York City, New York", 27, 14, "Solid jukebox, great dive, great people, cheap drinks. No food, but you can order delivery from somewhere else and eat there."], ["Great Dive Bar", 4.0, "August 17, 2013", "Steven W", "Atlanta, Georgia", 21, 1, "I have been here a couple of times when visiting Washington DC and enjoyed it. You could easily walk past it if your wont paying attention. The drinks are always good and the atmosphere is great. I would recommend checking it out if you are in the area."], ["Best Dive Bar in Mt. Pleasant", 5.0, "May 24, 2013", "JeansFriday", "Washington, District of Columbia", 24, 8, "The Raven used to be the best dive bar in DC (it always made me feel like I was hanging out in Baltimore, big surprise, I guess), but now it's one of a pretty solid handful. That said, it's the best dive in Mt. P and beloved by locals. Cheap drinks, good jukebox, appropriately dark and just enough of the...\n\n\nMore"], ["Quaint.", 3.0, "August 2, 2012", "zellywelly", "Virginia", 118, 37, "I like this place because even though it's small it's never been crowded for me. The people who work there are very laid back and everyone has always been pretty nice there. It's nothing fancy though, it IS pretty small and it's dark too but as far as a local place to go to unwind, this place is pretty good."]]], ["Crepeaway", [["Great fast food with flair", 4.0, "August 11, 2015", "ML0101", "Suffield, Connecticut", 14, 2, "Recently went for the first time and found this place to be delightful. The food is made to order and they had some great menu items to choose from. Given the cost, I thought it was a bargain. The crepes are super thin & crispy, the favors were great. It's not fancy, and there is no real table service. But...\n\n\nMore"], ["Vacation", 5.0, "August 1, 2015", "Char S", null, 7, 0, "We love crepes and don't have any place like this where we live in Florida! Great atmosphere, great crepes! Everyone was happy!"], ["Delicious!!", 5.0, "July 11, 2015", "lauragtrow", "Wheaton, Illinois", 3, 0, "Seriously one of the best crepes I've ever had. The place itself is so charming and the service is friendly and respectful. Get the Obama crepe!"], ["Horrible Customer Service", 1.0, "December 14, 2014", "Danielle B", "Washington, District of Columbia, United States", 1, 1, "So I've been ordering from Crepeaway and going into the store for a few years now. I'm a GWU student and nothing beats delivery crepes when you're having a study sess! I really hate to give them 1 star, because the crepes are pretty good (especially for delivery!) and I've never had a problem with their employees in the past;...\n\n\nMore"], ["Awesome", 5.0, "November 1, 2014", "Anthony M", null, 6, 1, "Delicious! ! If you are on DC this is a must and they are open till 4am ..my wife has never had one she had the obama!. Mouth watering."], ["Addicting", 4.0, "October 13, 2014", "Elaine M", "Alexandria, Virginia", 45, 19, "My sister-in-law took me here and now I am a regular myself. I have only gotten the sweet crepes which are to die for! My favorite is the Carlyn; marshmallows, crushed oreo cookies, and nutella. Once all melted together and wrapped in the crepe it is heaven. A go to place in DC."], ["Not French but good!", 3.0, "September 20, 2014", "MartinR4961", "Radford, Virginia", 275, 112, "Was wanting to order a Grand Marnier Crepe and saw the sign for this restaurant. The menu is basic crepes sweet and savoury hot crepes. I tried the South Beach crepe at $7.75 which was good. The service is quick and there are tables to eat in. No knives or forks were available so you do have to eat with...\n\n\nMore"], ["Fun and different meal in D.C.", 3.0, "September 10, 2014", "amyegm", "Arlington, Virginia", 58, 35, "So, I took my kids and visited Crepeaway because they had kindly donated some gift cards for a fundraiser. When I told my kids where I was going they wanted to go with so we made an outing of it. The kids loved having dinner there. My son had the crepe equivalent of a grilled cheese and my daughter had...\n\n\nMore"], ["Great take-out crepes!", 5.0, "August 9, 2014", "ScienceTrip", "Palo Alto, California", 186, 171, "This place has a number of advantages. First, for you protein freaks, breakfast ham-and-egg crepes are available all day. Second, the seating is remarkably clean and tidy, although the music might be too much for older guests. (So, you can do what we did: take-out.) Third, there are dessert crepes as well as \"main course\" crepes.\nRE dessert, the Nutella-and-bananas...\n\n\nMore"], ["Awesome Sweet and Savory", 5.0, "July 5, 2014", "Seniye", "Portland, Oregon", 75, 22, "We happened upon this place by accident when where we wanted to eat was closed. We order several savory and sweet crepes. Everything was great. Staff was fast and friendly!"], ["Terrible management", 1.0, "May 19, 2014", "nicothed", "Washington DC, District of Columbia", 71, 43, "We were getting ready to eat a sandwich sitting on a black unmarked bench in front of this place. Shortly after, a guy was standing there, watching us and playing with his phone. After a while, he told us in the rudest way that this was his bench and we had to leave.\nI don't know how the food is...\n\n\nMore"], ["Always a great spot", 5.0, "January 21, 2014", "incumeg", "Falls Church, Virginia", 36, 22, "Been coming here for years. The crepes are consistently great. Very filling! Best crepes in DC if you ask me. Def worth a visit, very reasonably priced and you will not be disappointed. Enjoy!"], ["Crepeaway", 5.0, "October 29, 2013", "hdmurf", "Newmarket, New Hampshire", 7, 1, "So amazing! I had never had crepes before, I tried both a sweet and a savory one. Portion size is large and I planned to take one home for later, but they were so good I ate them all in one sitting. Next time I am in the DC area, I will definitely go here again."], ["Great Late Night Food", 4.0, "June 9, 2013", "bostongirlinthecity", "Boston, Massachusetts", 20, 2, "they deliver until 2 am- enough said. The nutella and strawberries is my favorite but they are all pretty good. Sweet crepes tend to be more popular than savory there. Anything with nutella- you can't go wrong."], ["YES", 5.0, "April 16, 2013", "AshBearPig", null, 30, 11, "Absolutely hits the spot at 2am, drunk munchies or sober munchies, I come here a lot. The food is really tastey and the menu is pretty big for a place that only makes crepes! Fast service and patient employees who put up with drunk patrons!"], ["YES", 5.0, "March 13, 2013", "AshBearPig", null, 30, 11, "Absolutely hits the spot at 2am, drunk munchies or sober munchies, I come here a lot. The food is really tastey and the menu is pretty big for a place that only makes crepes! Fast service and patient employees who put up with drunk patrons!"], ["Great crepes!", 4.0, "March 6, 2013", "Ydenw", "San Francisco, California", 70, 36, "I had the veggie crepe and the Obama crepe (nutella and berries). They are around $7 each but the portion is big. They both tasted good! The berries in Obama were very fresh. I had extra fun telling my friends that I ate Obama in DC. LOL!"], ["Amazing late night spot", 5.0, "August 19, 2012", "RSHAH26", "Paramus, New Jersey", 66, 27, "After going to the clubs and nightlife, when you will eat basically anything, dont settle. This spot is great for a late night option (open until 4AM). They offer sweet and savory crepes. I had the \"Obama\" which is a lovely sweet crepe."], ["Really wonderful food, good prices", 5.0, "July 20, 2012", "RCKKMK", "Portland, OR", 12, 12, "Both savory and sweet crepes were STUFFED with food -- much more than is properly French, but we're in America, darnit, and we like our food. It makes them a really good value, as a side bonus.\nDespite being a crepe fan, I loathe Nutella (just a personal thing). If you also don't care for it, the number of sweet...\n\n\nMore"], ["Disappointing", 2.0, "May 27, 2012", "islander2611", "Mississauga, Canada", 9, 4, "Don't let yourselves be fooled by the fancy website, or even by the appealing aromas wafting through the creperie! The crepes sold at Crepeaway barely deserve the name.\nWhile the crepe is warm, it already feels rubbery amd dry, not soft and buttery as it should be. A plain crepe, without the add-ons, like nutella and strawberries to give it...\n\n\nMore"], ["Great, late-night place for crepes.", 4.0, "March 22, 2012", "Ferinha", "Washington DC, District of Columbia", 61, 40, "If you have a pregnant wife who feels like eating strawberries, nutella, white chocolate and peanut butter, you are in luck: CREPEAWAY! This Downtown/Foggy Bottom restaurant serves up good, quick sweet and savory crepes up until 3 am on the weekends. My wife and I frequent this place often and always walk away with a smile on our faces.\nThis...\n\n\nMore"], ["tasty treat", 4.0, "February 28, 2012", "drwmsvacas", "Washington, DC", 28, 11, "very rich crepes with all sorts of fillings available my favorite is the chocolate Strawberry and banana."], ["Not your average crepe", 3.0, "December 19, 2011", "smilesaam", "Detroit, Michigan", 90, 20, "I would give the crepes a 3/5. The crepe itself was rather dry. But the crepe I had the topping made up for it. (banana and peanut butter)"], ["surprisingly filling and satistying...", 3.0, "September 30, 2010", "lalalanddc", null, 11, 2, "surprisingly filling and satistying lunch. Simple yet tasty. Fast service.\nnot just for dessert or the late night crowd.\nThe veggie is delicious..\nthe decor is a little worn. The restroom is foul so avoid it if you can...\nthe staff and food are consistent.\nenjoy..."], ["fun change of pace", 3.0, "June 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "fun change of pace"], ["Unless you actually enjoy bad crepes....", 1.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Unless you actually enjoy bad crepes...."], ["crepes pretty much rule", 4.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "crepes pretty much rule"], ["Yummy for sweet or savory crepes, and convenient for on-the-go dining.", 4.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Yummy for sweet or savory crepes, and convenient for on-the-go dining."], ["An easy late-night dining option in DC, Good food without the crowds", 5.0, "October 4, 2007", "mishatl", "Washington, DC", 1, 0, "I saw a sign on Crepeaway's window listing late-night hours 'til 4 am, but I hadn't had a chance to check it out until last weekend. It's only a few blocks from Play and Spank, so I was able to convince my friends to try something other than greasy burgers. We drove over to Crepeaway, could've walked but we were...\n\n\nMore"]]], ["Sticky Rice", [["Sushi/Fusion Joint Ideal for Vegetarian and Vegan Diners", 3.0, "September 25, 2015", "JSinDC", "Washington, DC", 92, 44, "Sticky Rice is a sushi/Asian Fusion joint that is more ideal for vegetarian and vegan diners, as there is not a whole lot of meat selections on the menu. There's not a whole lot of variety among the noodle and rice dishes, but there is quite a large list of sushi options.\nI'm not sure how it compares as a...\n\n\nMore"], ["A girls day in dc", 4.0, "July 11, 2015", "ms_swalton", "baltimore", 49, 23, "First stop was Sticky Rice on H St. Nice layout and crowd (not crowded). Saketini was sweet but good (it's the plum wine). Veggie tempura was done well and the chicken curry fried rice was tasty. Overall it was pretty good. I'd return."], ["Fun food & funky place", 4.0, "July 9, 2015", "ihatehaggis", "washington, dc", 38, 8, "I love Sticky Rice. It is fun Asian fusion food, interesting drinks and ... tater tots! The menu notes vegetarian and vegan options--and there are many. It is a good place to go to if you have a group with different dietary issues (dairy, gluten).\nIt is a funky place. Alternative music, no dress code for the staff and very...\n\n\nMore"], ["HIP, MODERNIZED JAPANESE FOOD SHACK", 3.0, "July 6, 2015", "Pyra-Danny", "St. Petersburg, Florida", 132, 66, "Red-ish lights, lots of wood décor, yet quirky and approachable. Just waltz in here and you know you’re in for a fun, food treat.\nFOOD PORN LOOKS\nYeah- everything here is plated sexy-ly and makes you want to devour instantly. My Cupcake Trio (from their special menu) REALLY looked like Sushi Cupcakes however 2/3 of the pieces were devoid of...\n\n\nMore"], ["Good tempura", 4.0, "June 14, 2015", "Mke_Traveler_70", "Mequon, Wisconsin", 62, 34, "We had a great time at this low-key Asian restaurant. We had fabulous tempura and a new for us sticky balls ( very good a must try) by when my daughter's food came it was the wrong item. A very good restaurant overall."], ["Random but good!", 4.0, "June 7, 2015", "jlbran84", "Waco, Texas", 67, 19, "I went here for lunch while visiting friends in DC. It seemed like a normal dive bar, but it served sushi and tater tots. The bucket of tots was great but a kind of random pairing with sushi. The sushi was great, though. The service and the cleanliness was substandard, but the food was surprisingly good. It just didn't really...\n\n\nMore"], ["Wonderful!", 5.0, "May 24, 2015", "GreekLia", "Damascus, Maryland", 111, 31, "If you come here ask for Eric to be your server! He's amazing! So patient, helpful, and entertaining! Thank you for making our dinner so much fun!!! Most of us got the Godzirra which is amazing!!!! Highly recommend this place if you like good food and service!"], ["inconsistent food", 2.0, "May 19, 2015", "MFred", "Washington DC, District of Columbia", 41, 27, "I went a month before for lunch and it was pretty good sushi. Went back for dinner and it was hard to place the order, get drinks refilled, and the sushi was not that great. Haven't been back since"], ["Great Atmosphere", 5.0, "April 21, 2015", "Japanco78", null, 13, 2, "To begin I went with my husband and another friend for lunch. Our friend had been there before and thought that I would like it and he was correct not only did I like it I absolutely loved it. The best sushi I have EVER HAD IN MY LIFE🍜. Sticky rice didn't fail to please at all. This will not...\n\n\nMore"], ["Bucket of tots", 5.0, "April 20, 2015", "Shawnwaskey", null, 208, 66, "I knew I was going to fall in love when my friend told me they have a bucket of tots on the menu.\nMy meal was delicious, service was fast & the prices were fair."], ["Trendy Sushi", 4.0, "April 8, 2015", "SaraK987", "Pittsburgh, Pennsylvania", 86, 35, "I love Sticky Rice! The sushi here is great and the cocktails are tasty as well. The service isn't always super friendly, but no one's ever been rude. I don't need super friendly to have a good experience. Know that there's always really loud music playing, but that's part of the super trendy atmosphere. GI Joe Roll is my favorite."], ["Good food", 4.0, "March 16, 2015", "sheltydog2005", "Washington, DC", 62, 28, "I went to this restaurant with 4 friends. We had a great time and had good food. Also the prices are very reasonable. Check Groupons to see if discounts are available - often are for this restaurant."], ["Not your usual sushi place, but better!", 4.0, "January 30, 2015", "Urbano83", "Washington DC, District of Columbia", 6, 1, "Lots going on and on. It's the best ROCK / Indie bar with sushi and craft beer. Down on H street is your best choice for a fun weekend start. Ask for the Godzirra and a Public DC Brau."], ["Nice noodles", 5.0, "January 18, 2015", "Renato M", null, 37, 10, "Nice place and very good staff. Nice noodle and rice plates! I tried three. The Mongolian beef was the best. Really worth the visit."], ["Great food, really interesting and unique menu and great bar too!", 5.0, "December 21, 2014", "martypongo", "Mahopac, NY", 26, 17, "We ordered take out to eat in our hotel. The food was great, but it did take quite a while for them to prepare. Call ahead at least thirty minutes if you'll be picking up takeout food.\nSo I sat at the bar while I waited. They had plenty of good choices of beer and booze, so I picked a...\n\n\nMore"], ["Some of the best sushi I've had", 5.0, "December 16, 2014", "Alex P", "Washington DC, District of Columbia", 10, 4, "This place is a unique sushi spot not like any other. The menu has sushi and some interesting bowls that you definitely have to try. Will definitely go again."], ["Good food / poor service until she wants the tip", 3.0, "December 11, 2014", "adoptme", "New York City, New York", 60, 58, "We went to Sticky Rice as Toki Underground two doors down was full, and had a two hour wait on a Monday night. We opted for Sticky Rice, as my colleague went there before, and had a good experience. The greeting server at the door was extremely nice. We liked the food, and the rolls were very innovative and creative,...\n\n\nMore"], ["One of H streets Best", 5.0, "November 25, 2014", "Rudolph404", "Atlanta, Georgia", 41, 19, "I try to stop by this place even if I have plans to meet at another location near by. They have lots of great items on the menu. My favorite appraiser is their Crunchy Ribs. Yea, crunchy. The only problem is I always order seconds and then can't finish my entree. My favorite Entree is their Szechuan Shrimp over noodles....\n\n\nMore"], ["Average food", 3.0, "October 14, 2014", "Allyson E", "Washington DC, District of Columbia", 4, 0, "The food was not bad but I expected better. Sushi was fine. I was hungry so it was good to eat but I have had amazing sushi and this just wasn't amazing. It was average."], ["Great meal and funky vibe.", 4.0, "October 13, 2014", "RobertService", "Montreal, Canada", 36, 13, "Truthfully we had tried to get into Toki Underground next door though the wait was too long so we ended up here. There was also a wait (Friday night) but we were able to get a space at the bar. The food and drink menu was eclectic. We opted for an assortment of maki and sashimi which was delicious. Would...\n\n\nMore"], ["Fun", 4.0, "October 10, 2014", "Michael C", null, 15, 2, "Each experience is different. Attentive, friendly service. Good fusion food as well as straight sushi. Really enjoyed the experience."], ["How Could You Go Wrong?", 4.0, "September 13, 2014", "LizLovesTrips", "Alexandria, Virginia", 8, 6, "Sushi + A Fryer can only lead to good things. I love this place for something a little different. This is not where I would go if I was in the mood for classic simple sushi. They understand having fun and combining interesting flavors while staying grounded in what actually works. There are few reasons I would make the trip...\n\n\nMore"], ["Consistently good", 4.0, "August 26, 2014", "HRKinDC", "Washington DC, District of Columbia", 12, 2, "Local favorite, with consistently good service and food. I heart their tots! The tempura platter is one of the best items on their menu."], ["Their service needs help", 2.0, "July 9, 2014", "Felicia A", "New York, New York, United States", 5, 2, "We came in on a Thursday night for karaoke. It was understandably packed but the service was just some of the worst I've come across in a while. I had a seat at the bar before it became too packed and tried to order food but couldn't get any service for like 15 minutes...and I tried. The bartenders would look...\n\n\nMore"], ["Outstanding Asian Fusion", 5.0, "June 22, 2014", "Stephen S", "New York City, New York", 100, 35, "The H Street corridor in DC May not be the first place you think of for Asian food but this place could change your mind. We had a largish group so we sampled a wide range of the menu from appetizers to noodle dishes to sushi. It was all excellent! In particular, try the Sticky Balls and the Godzirra roll....\n\n\nMore"], ["Gardenballs were just okay", 3.0, "March 17, 2014", "Phykos", "Atlantic City, New Jersey", 210, 140, "We had a great waitress (very attentive) and a decent seat in the high top area but the gardenballs I got were only okay. I will not be jonesing for this place anytime soon."], ["Reasonably Good Noodle Shop", 3.0, "February 7, 2014", "Brian S", "Flyover Country, United States", 37, 9, "This restaurant is located on a setcion of H street that is undergoing gentrification. It is one of the better-looking establishments on the street. We had the Singapore Rice Noodles and the the Curry Fried Rice with Chicken. The noodles were a hit: good balance of spices, nice texture and presentation. The curry rice was appropriately hot and had a...\n\n\nMore"], ["Food is overrated!! Service is not good!!", 1.0, "January 22, 2014", "Alia P", "Washington DC, District of Columbia", 15, 11, "My husband and I tried this place at least 3 times and every time we had a bad experience with their food.\nThe first time we went we ordered miso soup, which tasted more like water with a ton of salt, so we returned it. We also had their sushi and i have to say i was not impressed. Their...\n\n\nMore"], ["service left a lot to be desired", 2.0, "November 11, 2013", "Moussa T", "Washington DC, District of Columbia", 2, 4, "Like many places which are popping up on H Street and in Bloomingdale, this restaurant tries to have that trendy, popularized hipster feel which goes against the hipster ethos of being unconventional and nonconformist.\nWith it's red-painted walls, black accents/furniture, and PBR-drinking patrons, it has a grungy charm all it's own.\nFrom my initial perusal of the menu, I was...\n\n\nMore"], ["Sticky Rice policy rounds up the bill amount", 1.0, "November 2, 2013", "Steve B", "Washington DC, District of Columbia", 1, 0, "I went to Sticky Rice to pick up an order that I phoned in. The cost of the meal was $19.85, and I handed the staff member a $20.00. She went to go and get my food. After she came back and handed me my order, she looked at me oddly, wondering why I was still there. I asked for...\n\n\nMore"], ["good vibe.", 3.0, "October 18, 2013", "MisterPham", "Houston, Texas", 114, 34, "Walked by thought the name was interesting so went in. Had a good vibe. had a few dishes while we were waiting our spot at Toki underground."], ["Fantastic Spicy Wings", 3.0, "October 14, 2013", "tea16", "Clinton, Maryland", 46, 35, "Keep a keen eye or you could miss the place, it is a small, dark, noisy establishment. Server did not introduce himself, he had a matter of fact demeanor. Once we placed our order it took approximately 15 minutes before we saw the server again. My nephew and I had dinner here using a Groupon Voucher. The telephone number on...\n\n\nMore"], ["Dinner amid DJ and dance set up", 3.0, "October 11, 2013", "terrellch", "Washington DC, District of Columbia", 3, 0, "Having had a reservation later in the night, it seemed as if we were the last table to be seated where the DJ sets up. This led to a noisy experience and lots of distractions as the DJ and others were setting up."], ["Unique", 4.0, "October 7, 2013", "max55Pinehurst", "Pinehurst, North Carolina", 109, 56, "This very good rating refers mainly to the sashimi. As an old timer, traveling far to eat always weighs in on my rating. H. Street is not easy to get to. Restaurant was dark inside, basic decor.However, sashimi was delicious. Server was friendly & made error in order. She quickly apologized & brought a complementary dish. Very casual attire...aka, nothing...\n\n\nMore"], ["more than sushi", 5.0, "September 23, 2013", "Kurt S", "Washington DC, District of Columbia", 32, 10, "Love those sticky balls! Godzirra is to die for. In fact, everything on the menu is great. This is my go to sushi+ place in DC."], ["Very fun place", 4.0, "July 4, 2013", "PeteUSN", null, 92, 9, "The jalapeño margaritas have some kick to them. The tater tots are fantastic. The sushi is creative. They have sake bombs and a great bottle of organic nigori. I liked the manchurian beef noodles as well."], ["Tasty Gluten Free Haven on H Street", 4.0, "May 25, 2013", "bagnato1", "Olney, Maryland", 431, 115, "We were very pleased with the variety of fresh gluten free Asian choices here, and the knowledge of our waitress about it. We felt in good hands. This was a very busy evening meal. But the food arrived in a reasonable amount of time. Not the best sushi we've ever eaten, but very good."], ["Mediocre experience at Sticky Rice", 3.0, "April 6, 2013", "Kiki L", "Washington DC, District of Columbia", 3, 3, "I went out to dinner last night at Sticky Rice. We were a party of 7, and even with 5 people there, the restaurant wouldn't seat us. We must have waited 45 minutes to get seated partly because of the delay of the last person in our group and partly because the restaurant was being difficult. We had to speak...\n\n\nMore"], ["Ate here by chance", 4.0, "March 15, 2013", "bsebonsai", "DC", 88, 56, "We had planned to go to Toki Underground, but they were not open when we arrived. So we walked down and tried this place. Ordered sushi to start out - overall good sushi. The spicy tuna rolls were great. We both ordered noodle bowls - mine was a small noodle with curry chicken and shrimp. Very good and very spicy....\n\n\nMore"], ["Not worth the $$ for lackluster sushi", 1.0, "January 31, 2013", "lo60435", "Washington DC, District of Columbia", 9, 2, "I have heard some terrifying things about the cleanliness of the kitchen, which I obviously can't vouch for, but still take into consideration.\nThe quality of the fish used in the sushi is NOT good and not worth the money.\nI would recommend going late at night if you want to hang out with twenty-somethings drinking heavily and dancing to...\n\n\nMore"], ["Imaginative sushi", 4.0, "January 20, 2013", "MitsyCJ", "Washington DC, District of Columbia", 71, 21, "Really liked that the Asian fusion menu had new taste combinations that you don't get at a multiple-location joint like Raku does not have. The place seems to catch the overflow crowd from toki underground, but should have a loyal following of its own. There is outdoor space and a large bar area downstairs so folks should come back during...\n\n\nMore"], ["Just average", 3.0, "December 11, 2012", "dani42379", "US", 48, 13, "We enjoyed our meal here but thought it was overpriced for the quality. Luckily, we had a coupon. We'll go back but it would be best with a discount or coupon."], ["very good choice", 4.0, "November 19, 2012", "janddmom", "washington dc metro", 33, 25, "We wanted to go someplace near the Atlas Theater two blocks away. Once we checked the menu we knew it was the perfect choice since the menu has clearly notated options for the gluten free member of our group. We did not have vegan members in our group but they are also marked on the menu. We had two appetizers...\n\n\nMore"], ["Sticky nice.", 4.0, "November 4, 2012", "Ellen_and_Dan", null, 17, 5, "Good food, great atmosphere and quite a trendy setting. Really liked the tater tats, wish we had ordered more. Good portion sizes and really tasty flavours."], ["Fabulous food", 4.0, "October 6, 2012", "CT-TravelerEssex", "Essex, Connecticut", 6, 3, "Went to Sticky Rice for a birthday dinner. 6 of us for dinner... our waitress took our order - never wrote anything down. Everything was perfect!! The food was awesome !! The waitress was perfect!"], ["Nice place, good sushi", 4.0, "September 30, 2012", "Minutemen10", "Arlington, Virginia", 180, 55, "I went here for dinner the other night, I thought it was a really cool place. The service was good and the food was good. The tots were very good and I had the 2000 leagues roll. It had tempura octopus in it and it was very good. I will definitely be go back to sticky rice for sushi."], ["Ricing it up on H Street, NE", 4.0, "August 8, 2012", "Jadorevelo", "Washington DC, District of Columbia", 37, 17, "Sticky Rice is a cool Asian hangout in the middle of \"Capitol Hood\", as I call it, just a few doors down from Granville Moore.\nThey offer reasonably priced and cheap popular Asian offerings with a little bit of a twist.\nThe location is within reach of a few popular neighborhood watering hole such as The Red and the Black,...\n\n\nMore"], ["Interesting sushi rolls", 3.0, "July 30, 2012", "Kate M", "New Hope, Pennsylvania", 67, 37, "We called to make a reservation around noon and were told that they did not have any reservations available but if we came that evening they might be able to squeeze us in. We got there at 7:30 and we are seated right away as a couple of tables were opened, so not sure why they would not take the...\n\n\nMore"], ["Limited options for Sunday lunch", 3.0, "July 23, 2012", "TinaWC", "DC", 74, 31, "We arrived a little after noon on Sunday. Kitchen items were not available, they were only serving brunch and sushi (no noodle dishes and regular appetizers). For some reason, they didn't serve coffee. The place was not quiet and I wish the food came faster. Waitress was friendly though. Tatter tots were good and my picky toddler ate a lot...\n\n\nMore"], ["funky, fun, but be prepared for spotty service and loud music...", 3.0, "July 11, 2012", "DolleyMaszola", "Washington, D.C.", 46, 30, "I always enjoy my meal at sticky rice. The noodle dishes are delicious. I particularly like their enlightened take on sesame chicken, and some of the sushi is really fun, unusual and delicious. BUT, the service can be terrible. The lady time I dined in, over of the servers had just been busted outside for drug possession (true story), so...\n\n\nMore"], ["In a good way, it's not what I expected.", 3.0, "June 7, 2012", "K_The_Hon", "Baltimore, Maryland", 9, 11, "I remember the venue before Sticky Rice and was very comfortable with the atmosphere and didn't know what to expect when I walked into Sticky Rice but the Natty Boh guy in the window was already a plus for me. I met up with friends and family for a cousin's birthday over the winter here and had a great time....\n\n\nMore"], ["Get the tots!", 3.0, "May 29, 2012", "Peime2c", "Washington DC, District of Columbia", 23, 3, "The sushi was mediocre. However, those tatter tots were FANTASTIC!"], ["Where are the Asians?", 3.0, "May 16, 2012", "puchochot1", "Duxbury, Vermont", 53, 56, "Fun, down-to-earth place with excellent service. Our large group of 10 or so just walked in late one night and they immediately accommodated us. When the bartender got inundated, the host started taking orders. Drinks and food came right out.\nThe bucket of tater tots were a hit, especially with the chipotle mayo. My veggie medley noodles were too salty,...\n\n\nMore"], ["Sucky and Slow", 2.0, "May 8, 2012", "KandyGoddess", "Winchester, Virginia", 58, 32, "Hungry and in the mood for some good asian food, we stopped in on are way to a show.\nAs we waited for the hostess to find us a seat, three tables opened up and we where sat right away. At a very dirty table with dirty menus, ick.\nWe then waited a good 25 minutes for someone to\ntake...\n\n\nMore"], ["Hipster Heaven", 3.0, "March 28, 2012", "Colin T", "New Haven, Connecticut", 24, 22, "I've been here twice, most recently in March, and I thought it was better the first time. The food is good, especially the mock chicken, but it's a little pricey. On my second visit, lunch for two people, which included two appetizers and one beer (a PBR) was close to $50. Although the tots are deep fried and delicious, I...\n\n\nMore"], ["Funky fun!", 5.0, "March 27, 2012", "Audrey M", "Lancaster, New York", 9, 6, "This hidden gem on H Street is deceiving! The food was fantastic, especially the noodle bowls - bursting with flavor. Prices are very reasonable and portions are quite generous."], ["Eh... waitress was the best part", 3.0, "February 7, 2012", "DCInsider", "Washington DC", 201, 112, "Our waitress (Danielle?) was really cool and made the experience better.\nOtherwise- it's fine. Not the best Asian or sushi in town, but not a bad place before going out. Best thing is the price- it's very inexpensive.\nThere was quite a long wait (and we had a reservation) but then the food comes out FAST like they kind of...\n\n\nMore"], ["Used to be better", 4.0, "December 15, 2011", "CareInn", "Falls Church, Virginia", 151, 24, "I had been several times before their brief shut down after what I believe was a fight outside the bar and absolutely loved it however after reopening, my first visit back was a little disappointing. I noticed that the sushi chefs had changed which is understandable after a shut down because they obviously need money but I am hoping they...\n\n\nMore"], ["Good food, fair prices but not the place for a \"quiet\" dinner", 3.0, "September 24, 2011", "DrNo8909", "Lancaster, Pennsylvania", 124, 64, "Sticky Rice overall is pretty good. The sushi selection is good and the food is decently priced for the area. The downstairs bar area is exactly that, a bar, so as long as you are cool with eating in that atmosphere it is good. Upstairs has more tables and a more restaurant type feel. Overall it is good, however, it...\n\n\nMore"], ["Cool spot..", 3.0, "September 10, 2011", "ANB019", null, 13, 11, "I heard pretty good things about this place and decided to check it out for my self. I came here last night(Friday) and find the place to be jammed packed! The hostess was friendly and told us the wait would be 45mins to an 1hr! Thankful we were seated in 30mins. We sat out on the patio which was pretty...\n\n\nMore"], ["Yummy food, hipster bar, all around fun.", 4.0, "April 3, 2011", "Xfortythreex", "Seattle, Washington", 79, 32, "Went there for lunch and thought the mock chicken was super yummy. The staff were friendly... more than one person came by to talk to me. It was fast and afterward, the guy that cooked my food came out and asked me about it. It was pretty great. But I didn't go there at night.\nHad a rice beer that...\n\n\nMore"], ["Very nice, casual friendly place on H street", 4.0, "November 12, 2010", "thunderblaster1", "Washington D.C.", 30, 38, "Went there with a friend on a monday night. We liked the atmosphere, very laid back and the staff were friendly. We sat upstairs at the small sushi bar in the back (the tables were all full). We ordered several varieties of sushi including a couple of shrimp versions. Overall excellent sushi, I'd say among the better that I've had...\n\n\nMore"], ["picture is deceiving", 1.0, "October 6, 2010", "thatzit", "Columbia, Maryland", 19, 10, "We picked to go to Sticky rice as I had a coupon from restaurant.com to try out new place. The restaurant is in North East of DC, on H street where there is road construction so the street is not very easy to navigate. We came on a Wed night, and the restaurant was not very crowded. We dined upstair...\n\n\nMore"], ["Fun place, great food but not a family environment!", 3.0, "September 19, 2010", "ajwagen", "Maine", 42, 21, "Traveled to DC for my husbands 40th birthday. I lived in DC for 3 years but this place was not open back then. This would have been a place I would have gone to on a date or when single, but I was traveling with teenagers and a younger kid. Don't get me wrong, the food was great!!!! We went...\n\n\nMore"], ["Really cool spot in a cool but up-and-coming neighborhood. Great service (lots of ink FYI), they don't rush you, which...", 4.0, "March 22, 2010", "DC20something", "Nashville, Tennessee", 161, 52, "Really cool spot in a cool but up-and-coming neighborhood. Great service (lots of ink FYI), they don't rush you, which is great for chilling, but if you don't get here early you're waiting for a while (hour+ on Fri/Sat). Atlas district parents bring kids (with mohawks) so its fun for all: lots of PBR specials, MXC on tv, Blingo on...\n\n\nMore"], ["Terrible service, below average Sushi, decent bar atmosphere", 1.0, "March 15, 2010", "michenercg", "Richmond, VA", 4, 0, "First and foremost, don’t go here if you’re looking for a quiet meal, or even good sushi. When you see two guys with dreads and a random emo looking guy making the sushi, it tells you what you are in for.\nWe were there for a friend’s birthday with a group of about 12. The service was poor, and the...\n\n\nMore"], ["Flaky, Slow, Rude, Clueless, lack of any service, & below average food!", 1.0, "January 23, 2010", "TraveledWise", "Washington DC", 5, 12, "As a Washingtonian local who has lived all over the U.S. and abroad, this place is truly a joke. A waste of your time, and money. Have given it several chances (don't know why?), but yet it got worst. SLOW service. Rude, unprofessional staff and owners as well might I add. These folks are so busy trying to be cool...\n\n\nMore"], ["This is a new \"hip\" and...", 3.0, "January 4, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is a new \"hip\" and \"happening\" place. The service can be painfully slow at times (1 hour wait to be seated and then 1 hour for 7 rolls to come out). As many people have said, and I concur, the rolls are very frail and the hardest part of the meal is getting the food from your plate to...\n\n\nMore"], ["The tots are great! Order Poki!", 4.0, "September 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The tots are great! Order Poki!"], ["great food but flaky service", 4.0, "June 18, 2008", "EnaidCat", "Washington DC, District of Columbia", 12, 3, "great food but flaky service"], ["Great food at very reasonable prices.", 4.0, "June 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great food at very reasonable prices."]]], ["Five Guys", [["Great burger but overpriced!", 4.0, "August 9, 2015", "Spencertraveller", "Toronto, Canada", 132, 191, "Great burger and located in front of the Marriott. They have no combo, hence it is quite expensive here to have a burger with fries!"], ["Juicy burgers and great fries!", 5.0, "July 30, 2015", "kevinheatherz", "Benton", 5, 2, "A true burger taste made the way you want it! Found out that \"little burger\" means one patty and the regular is two patties! Great fresh cut fries too!"], ["lunch", 4.0, "July 6, 2015", "WVUFanNorfolk", "Norfolk, VA", 138, 65, "Not much else around our hotel and this was right outside the metro station haven't been to five guys in some time very good and price not bad a lot of home cut frys going back again soon."], ["Food was good, Staff were OK", 3.0, "July 2, 2015", "Brent J", "Orlando, Florida", 4, 3, "Never been before and happen to stumble across it when we were ravenous. It was basic but nice, portions were big, food was good. Staff were ok, we had a nice girl but there was another table with a loud boisterous guy we just didn't like his attitude. Probably would go again if we passed it again."], ["Five Guys", 4.0, "June 24, 2015", "MartyCJr", "Fremont, California", 25, 6, "Staff was very helpful. Good value and quality food. Portions are very large, so I would suggest ordering small burgers and sharing fries."], ["Don't try the hotdogs", 3.0, "June 23, 2015", "Princeton101st", "Atlanta, Georgia", 110, 41, "Never been to Five Guys before. The burgers are superb and that should be their focus. The meat is obviously fresh. It is pretentious to call the hotdogs Kosher, they are just beef hot dogs split down the middle lengthwise and fried; they can get rid of the hot dog buns or simply focus on the thing they do best...\n\n\nMore"], ["Courteous Staff", 4.0, "April 6, 2015", "cmorgan50", null, 48, 19, "We were going back to our hotel & wanted some fries. I didn't realize the time. I was ordering some fries & my friends were just sitting down. The guy asked me if they wanted anything before they shut down the grill. He was very nice about it & I appreciated the offer. I didn't realize that it was a...\n\n\nMore"], ["Weekend in DC", 3.0, "March 9, 2015", "NewYorkRogue", "New York", 12, 10, "Liked the food. Didn't love noisy staff. It was across from our hotel and we were hungry when we arrived. The burgers were good, but listening to the staff loudly fooling around and the music blasting wasn't really enjoyable while eating."], ["Great Burger - always!", 4.0, "January 18, 2015", "uptonrus", "Colorado Springs, Colorado", 185, 38, "You just can't beat 5 Guys' burgers for the price. And I always cave in for the fries - none better in any restaurant. This 5 Guys is open later than most restaurants in the area and has the best and quickest food."], ["Basic Five Guys", 3.0, "December 7, 2014", "Ed C", "Williamsburg, Virginia", 65, 41, "The Five Guys near the Marriott Courtyard at NoMa is a basic five guys. Dependable burgers and fries. Good value. About 10 minutes to prepare your order. Good alternative to the hotel restaurant."], ["Great Service!", 4.0, "October 16, 2014", "Michael M", null, 5, 3, "Recently stayed at the Courtyard hotel across the street from this location and my family walked over for a quick dinner. Ordered two burgers and a hot dog to go and sat down to wait. We did not wait long at all but when our food was ready, they apologized for our wait and gave us a free order of...\n\n\nMore"], ["Graet Hamburgers", 5.0, "August 12, 2014", "Bayoan", "Puerto Rico", 22, 16, "Great hamburgers, and make sure of what size of fries you request, because you will get a lots of fries potatoes. I recommend it"], ["Great Burger but the Best Fries Ever", 4.0, "July 11, 2014", "uptonrus", "Colorado Springs, Colorado", 185, 38, "The best burger for the price - hands down. The fries are my favorite of any restaurant fries no matter what the price."], ["Friendly service, average food", 3.0, "June 17, 2014", "Joan H", "Ponder, Texas", 49, 21, "The location was right across from the Hilton Garden Inn Hotel on 14th Street in DC. The prices were about right for the DC area but the food was just average. We went once and that was enough."], ["Great Burger", 3.0, "May 13, 2014", "Jay R", "Atlanta, Georgia, USA", 44, 42, "I loved my burger all the way but didnt enjoy the fries. They just seemed old and greasy. Luckily the burger was so filling i didnt need them anyway."], ["Ugh, stay away", 1.0, "April 12, 2014", "spicegrrl", "California", 54, 100, "Seldom have we walked into a restaurant and walked right out. It took us about twenty seconds to feel totally turned off by this establishment. Physically unkempt, staff more interested in each other than in the customers, bags of stuff on the floor, just really off-putting in every way."]]], ["Noodles on 11", [["Excellent Pho", 4.0, "October 2, 2015", "billyboy18", "Fairfield, Connecticut", 102, 64, "Fine casual noodle shop near the grand Hyatt. Very friendly folks. Had delicious pan fried dumplings and superb pork followed by a steaming bowl of pho tai. Fantastic."], ["Great pho", 5.0, "September 2, 2015", "Cesloan", "Arlington, Virginia", 5, 0, "Love this place - come here often for the pho soups. Always crowded at lunch which is a good sign! Broth is very tasty, service is quick. Highly recommend!"], ["Great value", 4.0, "April 8, 2015", "Lindsay H", "Little Rock, Arkansas, United States", 16, 8, "I'm pretty new to Pho but my dining companion, who has more experience with Vietnamese cuisine, also thought this was good. Was a great value - especially for DC - and a nice meal on a cold, rainy DC night. Service was great and there was no wait for a table. Even though not an experienced Vietnamese diner, I thought...\n\n\nMore"], ["Wonderful food! Service not so much.", 4.0, "November 14, 2014", "eli_puszkar", "Mexico City, Mexico", 100, 37, "Noodles on 11 is a small and casual café style Noodle place on New York Ave. The menú has a nice assortment of Noodle dishes including Pho, Hong Kong and Taiwán Style noodles. Prices are very reasonable and the food is delicious. But service was on the slow side."], ["lovely little find", 4.0, "September 8, 2014", "Cath C", "Luton, United Kingdom", 14, 12, "We were craving something different after a week burgers, pizza and steak and went looking for some Chinese take out. Most of DC's Chinese cuisine establishments appear to be in Chinatown, as the name suggests, which was a bit of a walk from our E street hotel with tired legs. We got to Noodles on 11th and decided to sit...\n\n\nMore"], ["Simply delicious !", 5.0, "August 27, 2014", "Lei L", "Honolulu, Hawaii", 4, 4, "Loved the service here and the Char Siu on rice with choy sum is a MUST. The stew on rice is so soft too so you need to try this. The people here are kind and place is clean. The broth soup is a winner ! A MUST to visit if you are ever in D.C. - we went twice...\n\n\nMore"], ["Delicious and reasonably priced", 4.0, "August 8, 2014", "Jennifer B", "Adel, Georgia, United States", 8, 2, "My husband and I ate here for lunch. Good selection. The food was very tasty, and the prices quite reasonable. We visited at lunchtime. Yum!"], ["Ok Thai food", 3.0, "May 20, 2014", "KC_Choi", "New Rochelle, New York, United States", 219, 24, "Ordered the seafood noodle soup special. Since it was a weekday night, it wasn't busy and the service was quick. Didn't think it was anything special with a lot of broth and little substance, but it seemed to hit the spot for a rainy day. I am willing to go back to this place again and try the pho."], ["Short Walk from Metro Center", 4.0, "July 30, 2013", "Ikimashoka", "Phoenix", 60, 20, "Needed a place to eat, and everywhere else had long waits. Got in, had some really tasty Tom Yum with roast pork and rice noodles. It was good, filling and reasonably priced."], ["Reasonable prices, good food, great service.", 4.0, "June 3, 2013", "ckm1956", "Bangor,Maine", 34, 24, "We'd gotten burned at another noodle place in Chinatown, so I stopped by for take out.\nThe restaurant was comfortably cool and reasonably quiet.\nAs I waited for the order, the waitress offered me water.\nThe dishes were wonderful. Mine was spicy & flavorful. My wife's had great flavor with less spice.\nWe'll be back on our next trip to...\n\n\nMore"], ["I ate here 3 times!", 5.0, "March 2, 2013", "SusanDFW", "DFW", 154, 66, "I don't understand the other reviews because I ate here three times on a recent visit and enjoyed the food each time. On the first evening I had the Pho and it was good. Hot and steamy, flavorful broth and the meat was good. On the next visit (lunch) I had the shrimp with green curry sauce over rice noodles....\n\n\nMore"], ["Call 911 if you decide to eat at Noodles on 11", 2.0, "May 4, 2011", "PDS81", "Greensboro", 15, 10, "The noodles we ordered had little flavor. The broth they came in was tepid. The meat in the broth was dry and tasteless. The vegetables in the bowl were wilted. The portions were stingy for a bowl of noodles that cost $12 - $14.\nThe service was fine but for our group this restaurant did not represent good value."]]], ["Black Jack", [["Excellent Service & Oysters", 5.0, "June 11, 2015", "Veronica R", null, 7, 1, "Orig. tried to go to Pearl Dive but wait was long so walked up stairs to Black Jack (part of Pearl i guess).\nThe host, waitress and everyone in between were absolutely fanominal that I had to write a review.\nFirst, quick seating\nSecond, host/waiter knew his stuff from drinks to food to the surrounding area for recommendations.\nThird, I'm...\n\n\nMore"], ["great bar - fun!", 5.0, "April 14, 2015", "Eriecyclegal", "Erie, Pennsylvania", 27, 4, "The bar is fun, and the bar tender really knew his stuff. Made some mixed drinks for friends that were very tasty. Great beer selection on tap as well."], ["Jekyll and Hyde", 2.0, "March 9, 2015", "Aaron M", "Lansing, Michigan", 32, 11, "Went twice in two days -- first time was around 6 on a Saturday with a group of 4; second time was around 8:30 on a Sunday with just 2 of us.\nSaturday our experience was great -- the place was busy but we were still able to get a table right away. Service was prompt, friendly, and helpful --...\n\n\nMore"], ["Good Happy Hour Choice!", 4.0, "November 20, 2014", "GlendaleCA", "USA", 584, 295, "This is a great happy hour, particularly on beer and wine. You get craft beers for $3 until 8PM. What a great deal!!\nThe pizza menu has some good choices. And for $7, the pizza is quite good. I don't think it is worth the full price of $14 but it is great for $7. The mussels are also a...\n\n\nMore"], ["Nice find", 5.0, "November 3, 2014", "coopergoblue", "Michigan", 49, 42, "We spent an afternoon watching a football game here and everyone was nice and friendly. The food was great and we enjoyed ourselves- bartenders were attentive. Don't hesitate to try Blackjacks!"], ["a rather intimate spot, but nothing special", 3.0, "March 9, 2014", "jg325", "WashingtonDC", 489, 320, "My partner and I went to Black Jack for a birthday drinks celebration, and overall, I felt it was a cozy place to have either a group or just drinks for two. At the same time, there are so many new and different places popping up on 14th Street, I didn't really see what was different or special about this...\n\n\nMore"], ["Excellent Food - Small Portions", 4.0, "July 3, 2013", "TexasFamilyGuy", "Texas", 46, 23, "We were headed to Pearl Dive (lower level), but too crowded - decided to move upstairs. Good choice. Still had the oysters from Pearl - yum!! Family of 4 each ordered separate \"entree\" - all were very good, but very limited portions. Added on a final pizza, to round things out. Suggest just go with oysters and two pizzas, if...\n\n\nMore"], ["An absolute DISGRACE!", 1.0, "April 28, 2013", "W H", "Washington DC", 1, 0, "An absolute DISGRACE! Attended a work function/celebration 4/27/13 and witnessed a colleague accosted by 3 security guards. I witnessed my colleague standing in line for the restroom and when a fellow patron decided to cut the line and was asked by my colleague to line up like all, the colleague requested assistance from security. To everyone's shock, the security guard...\n\n\nMore"], ["Fun but trendy", 4.0, "January 4, 2013", "J C", "Washington DC, District of Columbia", 41, 15, "This place gets a little too crowded on weekend nights, but it's a fun bar. If I had to choose, I would probably opt for dinner downstairs at the Pearl Dive Oyster Palace (same owner) rather than drinks at Black Jack. Still, the games in the back are fun, and the atmosphere in Black Jack is comfortable."], ["Weird bar - it has bocci ball and stadium seating", 4.0, "December 30, 2012", "deadhead_attorney", "Silver Spring, Maryland", 27, 8, "Just went here the other night. It's your average bar - standard drinks, standard food. I hear there are really good happy hour deals, but didn't take advantage. Main selling point is the stadium style bocci ball. Go to the back of the bar for a full length court, complete with stadium-style chairs. Be warned though - the line is...\n\n\nMore"], ["Gets filled up fast!", 3.0, "November 20, 2012", "PapaInternational", "Bethesda, Maryland", 118, 35, "Show up at 6pm when it opens to get seats or a table. Order fast and often, the noise level runs up pretty high and fast. Come on non-weekend maybe to get quieter experience."], ["Get the bread, I know, random.", 5.0, "November 3, 2012", "Alexandra R", null, 2, 0, "We were starving and Pearl Dive was packed so we headed up to Black Jack. We sat at the bar and asked for some bread while we waited for our mussels. Holy god, the bread they brought out was warm and delicious. The bar tenders gave us the back story on the recipe and entertained us the whole time. The...\n\n\nMore"], ["Terrific atmosphere, slow service, mediocre food", 3.0, "March 18, 2012", "MikeMfromWashDC", "Washington, DC", 148, 89, "If you are just having drinks, this place has a wonderful atmosphere, and is very impressive looking. Stick to drinks, though, because the food is blah."]]], ["Maple restaurant and bar", [["Wedding reception", 5.0, "September 20, 2015", "vanniannie", "Annapolis, Maryland", 23, 8, "My daughter and son-in-law had their wedding reception (small party) upstairs at Maple. The wait staff was very attentive throughout the evening, the various courses were all very interesting and tasty, the wine choices were wonderful , and creative cocktails kept things fun! It was a great choice for our celebration!"], ["Good, but limited options", 3.0, "September 9, 2015", "DMLehman6", "Washington DC, District of Columbia", 161, 98, "We are new to this neighborhood - and live only a block away. We heard Maple was a top restaurant and looked forward to our first dinner there. The menu is Italian influenced and they boast a good wine selection. It was OK, but missing some better choices.\nThe main course selections are limited as well. The shaved fennel and...\n\n\nMore"], ["Nice place for good time.", 4.0, "June 21, 2015", "Prawet J", "Washington DC, District of Columbia", 238, 73, "It was my first time for me but 2nd or 3rd for my other friends. I like the place because the staff were friendly and very helpful. Both bar area and dinning are nice because of tall glass windows so plenty of natural lights. Good selections of wine and fancy drinks. Food prices are OK but drink price might be...\n\n\nMore"], ["Hit and Miss", 2.0, "June 17, 2015", "doswell", "Chapel Hill, North Carolina", 18, 6, "We booked on the advice of a friend who is a frequent diner. The person taking the booking was very helpful even when we had to make changes. The food was quite varied. My wife had the fennel and arugula salad, which she said tasted sour, and the grilled octopus which was delicious. I had the burrata which was quite...\n\n\nMore"], ["Great appetizers, ok entrees", 3.0, "May 25, 2015", "L C", null, 9, 1, "I visited Maplewood with my fiancé and future parents-in-law during a visit to DC. My fiancé and I ordered a bottle of wine that took our server awhile to find. However, he was very helpful in discussing other options similar to what we ordered and based on the type of wine styles and flavors we usually enjoy. We were delighted...\n\n\nMore"], ["My Restaurant Crush.", 5.0, "December 14, 2014", "Scott L", "Washington DC, District of Columbia", 2, 1, "I live around the corner from Maple and for the first couple years it was open I only stopped in once for a glass of wine. That was a mistake. Finally, I went in for dinner about about two months ago. I have since been back five times. My girlfriend calls Maple my restaurant crush because I keep going back...\n\n\nMore"], ["Get a reservation now!", 5.0, "December 9, 2014", "SusanEllio", "Bellevue, Washington", 5, 1, "The long freestanding Maple bar is a great shared wine and dine table or settle into a cozy private table tucked along the wall. The nouveau Italian cuisine is deliciously authentic with Italian wine varietals decoded, \"if you like Syrah, then you might like...\" Tender pasta in rich ragu, tender sweet scallops with creamy farro risotto, finished with with gelato...\n\n\nMore"], ["Buon pasto città natale", 5.0, "October 11, 2014", "JPSaleebyMD", "Murrells Inlet, South Carolina", 818, 355, "Upscale and trendy. This new place has a decent wine list and adequate selections of wine by the glass. Dinner was for four and we were quickly seated upstairs. Don't leave without trying the olives starter and caponata. The pork appetizer is delish but not quite enough for 4. We would have ordered a 2nd if not for the entrees...\n\n\nMore"], ["Pleasant surprise for neighhood food", 4.0, "July 29, 2014", "oldarmy1952", "Corpus Christi, Texas", 23, 12, "Dinner for 8, dining inside, little noisy early but pleasant. Food very well prepared, tasty, and service excellent. Looks can deceive as decor very plain and does not seat many. Would go back tomorrow for pork belly appetizer and pasta dishes!!!"], ["Delicious Italian", 4.0, "June 30, 2014", "emilymelissabee", "Toronto, Canada", 34, 16, "I got the Fennel / Citrus salad to start and the Pesto Gnocchi as my main, and wow, was this meal ever delicious. I can still taste it! Lemon Pellegrino was a nice added touch to the meal."], ["Friday night surprise", 5.0, "June 17, 2014", "K1103", null, 48, 20, "Very nice neighborhood restaurant. Columbia Heights. Wandered in just as they were opening. Happy hour greeted us. $4.00 glass of wine. $10.00 old fashioned. The BAR is a great attraction. Wait person was just lovely. Food was good. Not outstanding, but good. We tried a new scallop entree. Good favors but too few scallops. Strawberry rhubarb crisp was fabulous as...\n\n\nMore"], ["Unpleasant Seating, Onion Soup", 2.0, "May 21, 2014", "Aussiesig", "Washington, D.C.", 69, 34, "We experienced unpleasant meals and atmosphere. Our food, both dishes, were bathed in onions to the point that it made us sick. The seating was so cramped my legs brushed those sitting to the right and left of me at the next tables. Food-wise, The bruschetta was lovely, and I recommend the charcuterie plate as well. It was also very,...\n\n\nMore"], ["Disappointing anniversary dinner", 3.0, "May 21, 2014", "Chad S", null, 73, 30, "We frequent maple and came for our 1 year anniversary. The service was ok and the food took ages and was covered in onions. We complained about this without apology. Very disappointing considering the expensive experience on a special night."], ["Nice for brunch but very tight seating", 4.0, "January 26, 2014", "wodaabe", "Washington DC, District of Columbia", 109, 43, "I prefer 11th street restaurants to those on 14th. They're more original and offer better quality food without a doubt. I had a delicious brunch at Maple and am eager to go back. The food was delicious and the coffee strong. My only reservation is the seating. It's really cramped and loud... So much so that I'd only go on...\n\n\nMore"], ["A Bad Night?", 2.0, "December 29, 2013", "DCTraveller40", "Washington, DC", 31, 23, "I have eaten here once before and had an enjoyable meal. The experience last night, however, was so bad, that I want to comment. Getting a seat immediately was no problem. The tables, however, are so close together that it is impossible not to here the conversations of those around you. So be careful what you say. Cocktails and appetizers...\n\n\nMore"], ["Warm and inviting", 5.0, "December 8, 2013", "Caoimhin1968", "Dublin, Ireland", 21, 12, "Love this place! Intimate, warm, modern. Excellent and friendly wait staff. Small but inventive menu and wine list. They make their own limoncello. I have never had a bad meal here, and I go often."], ["Good food at good prices, excellent service", 4.0, "November 24, 2013", "MaryRP", "Boulder, CO", 65, 66, "A bit cramped and noisy, this limited menu, but excellent choices restaurant, combines with exceptional service to make for a fun evening. Close to Columbia Park metro , this restaurant is a place for a return visit."], ["Great Wine Bar", 4.0, "November 20, 2013", "sww326", "Oakland, California, USA", 27, 19, "I stopped-by Maple only for a few glasses of wine at the bar, but the bartender was very helpful and knowledgeable about the wine selection and was spot-on with his recommendations. From what we could see on the plates of people around us, the food looks great (and the desserts, too!), though I cannot attest to its taste. It's tiny,...\n\n\nMore"], ["Good food, nice atmosphere, reasonable prices", 4.0, "September 18, 2013", "Christine M", "Vancouver, Canada", 37, 30, "Maple is helping in the transformation of 11th street - with decent food, good cocktails, a thoughtful wine list and good prices. I had the eggplant caponata bruschetta, the beet salad, the tagliatelle pesto, and the peach melba. Plus, the ginger cocktail and a nice glass of red. Everything arrived at the right time, tasted good, and made me feel...\n\n\nMore"], ["Great food but seating policy sucks!", 3.0, "September 12, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Let me start by saying that I really enjoyed my food there. They are Italicious! I only ordered Antipasti platter, it comes with different types of formaggio, affettati (it means sliced in Italian, so I think the menu is referring to the sliced charcuterie (Salumi in Italian) , and one pot of caponata (eggplant, olives, and onions seasoned with herbs)...\n\n\nMore"]]], ["Bukom Cafe", [["AUTHENTIC AFRICAN Food!!", 4.0, "October 1, 2015", "benjaminzzz", "Washington DC, District of Columbia", 64, 9, "This food is on POINT all the time every time!! And you MUST try the rum punch drink - it WILL change your life!!"], ["Great Music and Good Food", 5.0, "September 1, 2015", "Geoffrey A", "New York, New York, United States", 45, 7, "If you like Reggae and African Music and Good Food with a Ghanaian and Nigerian flavor this is the place for you. Friendly and easy going like the music, no stress but great for dancing. Those of you familiar with various African cultures know that you can dance by yourself or with a group or as a couple."], ["Live Music...Good Food", 5.0, "August 26, 2015", "Toni B", "Washington, District of Columbia, District of Columbia, United States", 10, 4, "Chivalry is not dead. It was a crowded and fairly busy night at Bukom and yet men at the bar moved to women have their seats. This was not a tactic to get a number or spark a conversation...it was simply polite.\nWHO KNEW!!!\nIt got better... I ordered the Snapper with white rice and I certainly was in heaven....\n\n\nMore"], ["Excellent", 5.0, "July 2, 2015", "mariat677", "Bogota", 2, 0, "Was perfect !!!!! If You are seeking for something different and excellent, this is the place. Good music, excellent food and service. We went thursday night and it had regge live music . It offer african food. It doesn't have tradicional taste but is delicious !"], ["Good dining experience", 4.0, "May 12, 2015", "LaRa12", "Horsham, Pennsylvania", 121, 49, "Went here for dinner during a visit to DC. The menu was interesting and drink choices were unique, however the service is quite slow.\nThey wait staff was helpful when they get to you.\nThe portion sizes were quite large and since we were from out of town there was a a lot of extra food that we could not...\n\n\nMore"], ["amazing!! fantastic offerings", 5.0, "March 25, 2015", "zchyke", "Washington DC, District of Columbia", 24, 11, "This is a cozy spot with quite a presence , distinctive character, reminiscent of some of the really memorable places we have visited in travels across the African Continent.\nThe food quality was fantastic each time out here. Service was great. Late in the evening we returned for an evening of live music and kept coming here during our stay...\n\n\nMore"], ["So disappointed !!!", 1.0, "February 17, 2015", "Debra E", null, 3, 1, "My husband and I visited Bukoms for the first time about twelve years ago and feel in love with the food and atmosphere. We decided to make it our 2015 Valentine's Day dinner. We purposely skipped lunch in anticipation of what we remembered to be a very satisfying dining experience. After being seated by a non attentive staff member, our...\n\n\nMore"], ["Real W African food", 4.0, "January 20, 2015", "nad130", null, 11, 7, "Sat at the bar. Food, according to my Nigerian date, was real, authentic, and just like home. Bartender was very friendly and attentive. We left before the music started but will definitely go back. Music was scheduled to start at 10. We arrived at 730. Called ahead on a Friday night but didn't need a reservation. Great place for real...\n\n\nMore"], ["5 star reggea bands, with 2 star food", 4.0, "January 20, 2015", "Miles S", "Waldorf, Maryland", 22, 6, "This is the place i take my friends when they come in town, solely for the live reggae experience and cold Guinness to go along. Dine somewhere else food is not a worth it."], ["Not Spicy Enough to BE West African Food", 3.0, "September 24, 2014", "Travelergirl998", "Baltimore, Maryland", 189, 94, "On paper they serve the typical west aFrican food, but when they serve you the food is bland and not cooked as it is in West Africa. The drinks are poorly mixed and the service is slow and sometimes the waiters are abrupt. Great reggae music, though I wonder why they dont play African music. Strange crowd on weekends that...\n\n\nMore"], ["Poor quality, terrible service", 1.0, "June 8, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "We arrived there on a Saturday evening and we got a table immediately.\nIt took a while for the server to come. And it took even more to get some water.\nThere was an appetizer happy hour till 8pm. We ordered suya, a spicy skewed beef. It was very good but it took a long time to come.\nWe ordered...\n\n\nMore"], ["Did the exist fall asleep?", 2.0, "May 31, 2014", "Wendy R", "Upper Marlboro, Maryland", 82, 41, "On date night I decided to try Bukom Cafe because I heard that the food was good. Once inside I was seated and after 15 mind my drink order was taken. Ok, it took 20 mins for my drink to arrive and the place had about 8-10 people inside. The waiter kept disappearing and when he finally came to take...\n\n\nMore"], ["Good food, interesting experience", 4.0, "April 1, 2014", "HahaBoy", "Singapore, Singapore", 82, 64, "Have never tried Ghanaian meal before, so it's really interesting for us to see what came to the table. We ordered curry bean rice and fried chicken & fish rice. Both tasted just nice - not too strong and enjoyable. The portion size was about right, though a bit on the big side for me. Curry bean rice consisted of...\n\n\nMore"], ["Great Food. Slow Service.", 4.0, "October 15, 2013", "rubybouvier", "Denver, Colorado", 257, 140, "I recently ate at Bukom with two friends. Our appetizers came out quickly, but it literally took an hour for our entrees to arrive! The server was sweet and brought us some plantains on the house. The food was very good. Loved the suyas and the kumasi. The egusi wasn't spicy enough for me. There isn't much ambiance- I've heard...\n\n\nMore"], ["Great West African Food in DC", 5.0, "August 1, 2013", "Constantly T", "Brooklyn, New York", 143, 73, "I was first introduced to this wonderful place in the summer of 2010 when I was in D.C. taking summer classes to get ahead in school. Every time I return to D.C., Bukom is a must visit for me. The flavors are wonderful and the African music always gets me on my feet. Try the Mama's Platter, fish dishes (beware...\n\n\nMore"], ["African Connection", 5.0, "February 25, 2013", "James A", "Owings Mills, Maryland", 4, 3, "We like the cozy seating area and live Reggae band, last but hardly least; the food was par excellent."], ["Good music", 4.0, "February 17, 2013", "Bevon", "Baltimore, Maryland", 146, 63, "This cafe and bar had a live reggae band with good vibes on a Friday evening. It's a cafe with soul and good energy."], ["Inexpensive, delicious food", 4.0, "June 15, 2012", "traveldoc42", "Boston", 176, 153, "A lot of people don't know much about West African food or think of it as very bland. As a result, I get the sense that places like Bukom Cafe aren't as popular as they ought to be given the quality of the food. We went on a weekday night and the place hardly had any people in it. We...\n\n\nMore"], ["Saturday Night", 4.0, "January 31, 2012", "desy", "Washington DC, District of Columbia", 62, 76, "I visited Adams Morgan with some friends,the entertainment was nice and the food fresh."], ["Less than authentic ..", 2.0, "October 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Less than authentic .."], ["West African food. Music at night. Give it a try.", 3.0, "September 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "West African food. Music at night. Give it a try."], ["I got chicken and it was...", 2.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I got chicken and it was so dry. Nice atmosphere but I wouldn't go back."], ["love the wings and the african salad", 3.0, "December 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "love the wings and the african salad"], ["great grub and drinks for a great price.", 4.0, "December 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great grub and drinks for a great price."], ["This is my favorite restaurant anywhere.", 5.0, "November 2, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is my favorite restaurant anywhere."]]], ["The Blaguard", [["Fun, young...definitely young...", 4.0, "March 25, 2015", "Amy Q", "Norman, Oklahoma, United States", 84, 28, "This is where I found Adams/Morgan exceptionally diverse. We'd been to Jack Rose before going into The Blaguard and, the two places couldn't be more of a contrast. The Blaguard reminded me of a true college scene. With the atmosphere, demographic, music choices and service (or lack thereof). A fun environment for those young enough - or who still feel...\n\n\nMore"], ["Authentic bar", 5.0, "December 21, 2014", "Globemarie", null, 11, 6, "I like this bar. The atmosphere is nice with some used people ! Happy hour is also very nice and the choice of beers is large. A good place for a real ambiance :)"], ["Small bar/restaurant", 5.0, "June 8, 2014", "DebbieCincinnaitOhio", "Cincinnait Ohio", 17, 25, "We stayed in Washington DC for a conference and we always look for small bars/restaurants to try. We looked up a few places and ended up at The Blaguard on 18th street, NW in DC. This bar is under new ownership and we went on a Monday evening! They have 1/2 burgers that were delicious and the best fried pickles...\n\n\nMore"], ["Fun, Loud, Casual", 5.0, "October 25, 2013", "Trace_Schmeltz", null, 10, 0, "I went to The Blaguard with some work colleagues last night. We wanted a casual atmosphere where we could watch the World Series. The bar had a great beer selection, reliably decent and casual food, and a great atmosphere. We were the oldest people in the bar, and it was loud, but it was absolutely worth it. Service was great,...\n\n\nMore"], ["Surprisingly Excellent Beer Selection", 5.0, "July 16, 2013", "kenmore4828", "New York City, New York", 39, 17, "Was looking for a place to rest and have a beer and expected this to be your typical Irish pub. Not the case. Great beer selection, nice owner, and nice atmosphere. I would love to have a neighborhood bar like this near me."], ["Great atmosphere!", 5.0, "July 12, 2013", "ericke w", "New York", 27, 17, "Great place.. just passed by and found this place. Had some beer and curly fries. Super yummy... Recommend if your in the area."], ["Great Luncheon Niche in Lower Adams Morgan", 4.0, "May 29, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Tried Blaguard for the first time at lunch - newly opening for lunch as of last week. Great selection of sandwiches and, yes! Fish and Chips. Delicious. Good prices, good service"], ["Best neighborhood bar", 5.0, "May 27, 2013", "P Y", "London, United Kingdom", 32, 13, "For 7 years, Blaguard was my neighborhood bar. Now that I've moved to London, it's probably the thing I miss about DC the most.\nNothing about the place is extraordinary, but it's just the mix of atmosphere, bartenders, and people that make it such a great neighborhood bar.\nGood beer selection, good shots, and decent food - go for Sunday...\n\n\nMore"]]], ["Aditi Indian Kitchen", [["Good Food", 5.0, "February 21, 2015", "S M", "Norfolk, Virginia", 7, 0, "Nice place to eat. Food was excellent. it was located in the underground shopping mall which was nice.\nGood place for quick food."], ["Best quick restaurant in Union Station", 5.0, "October 22, 2014", "erghammer", "Alexandria, Virginia", 44, 14, "The prices are reasonable, the portions are large, and the food is always always tasty. Can't beat that for train station food."], ["Surpringly Fabulous Food", 5.0, "September 3, 2014", "lucyanne1", "Bloomfield, CT", 122, 79, "Next to this restaurant is a Jamaican restaurant whose food didn't look so great so we ordered Jamaican food from this Indian Restaurant and it was FABULOUS!!! I had the curry goat and hubby (a Jamaican) had the curry chicken. Along with the sides, we were quite full and quite happy. The service was awesome; price reasonable and we love...\n\n\nMore"], ["Okay, nothing special", 3.0, "August 18, 2014", "gearheart", "Winston Salem, NC USA", 131, 79, "We adore Indian food - it's our favorite. And being vegetarians, we seek out Indian restaurants when we travel because we can count on their having veggies. This place is in Union Station's food court. The food court is a good place to eat because it's convenient, reasonably priced and if there are several of you, you can each pick...\n\n\nMore"], ["Great goat", 5.0, "August 7, 2014", "Jeff W", "Annapolis, Maryland", 202, 55, "You had me at GOAT! Seriously, when you can get a cheap Indian meal that's fast food and really good, you are doing very well. This is in the food court but my favorite fast Indian food in DC. Don't know why but they do it better. Lots of other good choices in Union Station besides the traditional fast food....\n\n\nMore"], ["good food , limited veg option", 3.0, "May 27, 2014", "Yogen S", "Collierville", 9, 3, "This is located inside union station . Food was good but vegetation options were limited. There were no items with paneer,"], ["Best casual Indian food with reasonable pricing", 4.0, "October 30, 2013", "Czajka_Madness", "Waldorf, Maryland, United States", 25, 19, "We go to this restaurant in the downstairs food court of Union Station every week. They usually do different meals on different days. We like going on Wednesday to get the spicy chicken (coconut based) and spicy beef dish with potatoes. Both are excellent and can get a little hot. The samosas are pretty good with sweet (brown) and spicey...\n\n\nMore"]]], ["Flavors of India", [["Overpriced Indian Food, Lacking Service", 2.0, "August 31, 2015", "TazHuss", "Los Angeles, California", 3, 1, "I am Indian, so I think fairly qualified to make comments on the Indian food :) We went to this restaurant close to closing time, but they were happy to serve us and another family who came in after us.\nWe ordered a few dishes. Food took ages to come, even though the restaurant was very quite. The Chicken Tikka...\n\n\nMore"], ["A+", 5.0, "August 21, 2015", "Benjamin F", "Pottstown, Pennsylvania", 3, 0, "Great food fast service and a lot of food for your money, food was fresh and very authentic. Very close to our hotel."], ["Everything was outstanding", 5.0, "August 19, 2015", "JohnF47", "Dallas, Texas", 165, 93, "From the large selection in the menu, I selected the vegetable pakora, lamb chop (2 huge lamb chops), and mango kulfi to finish with. All dishes were excellent! The service was very friendly and attentive. I would eat here regularly if I lived in Washington DC."], ["My primary issue is the small servings given the high prices.", 3.0, "August 17, 2015", "psm89", "Arlington, Virginia", 5, 0, "Good service, clean restaurant, decent food (except for the garlic naan, which was dry). My primary issue is the small servings given the high prices. These expenses can be mitigated, however, by using a Groupon."], ["Good Indian Food", 4.0, "August 10, 2015", "Andre2000HD", "Heidelberg, Germany", 4, 3, "Large variety of dishes on the menu, which is subdivided into fish, meat, vegetarian and vegan. Quality of the food was very good, dishes tasted excellent. The waiter was very nice and courteous.\nThere is a small bar on the 2nd floor, so one can hear the music from up there a bit, but not disturbing.\nI would definitely recommend...\n\n\nMore"], ["Good meal and excellent taste.", 4.0, "August 2, 2015", "Frederick G", "Kingston, New York", 20, 10, "The preparation and ingredients were first quality. The menu was typical Indian. I found that the service was quite good and pleasant. The place is not much to look at from the outside nor the inside, however the food makes up for the lack of ambiance."], ["Great Bar, Decent food too", 3.0, "July 28, 2015", "Danielle L", "WDC", 40, 10, "This is a great local hang out - bar is good, staff are funny and engaged with the clientele and the food is decent too."], ["Fairly good", 4.0, "June 12, 2015", "gypsybloood", "India", 116, 106, "A sudden craving for home food strikes us once in a while on our travels. Luckily, flavors of India was close to our hotel, so we went there for lunch. The lunch buffet, while not extensive, is not too bad.\nReasonably priced, fairly edible food. Not really authentic Indian stuff, but close enough. Probably worth a try."], ["Quite Simple!!", 3.0, "June 3, 2015", "sherry_navtej", "Memphis, Tennessee", 41, 13, "The only think good about the place was the helpful manager and staff as it was late and all restuarents were closed or closing,,we had to give the order in one go but thats our issue.\nAbout the food it was pretty basic - not awesone not bad..\nOnly real issue with the place was that portions were really small...\n\n\nMore"], ["DELICIOUS!! IGNORE ALL THE NEGATIVE REVIEWS!", 5.0, "May 28, 2015", "regulartraveler4", null, 5, 1, "My family visited this restaurant after reading multiple bad reviews on a couple of sites. They are completely unfounded! The food was delicious- some of the best Indian food we've ever enjoyed (and we eat it often). Also, the service was FANTASTIC! They especially catered to the needs of my preschooler, bringing her food immediately along with other items. The...\n\n\nMore"], ["Nice small and fast homemade at affordable rates!", 4.0, "May 27, 2015", "tripaPretoria", "Pretoria, South Africa", 37, 7, "A great alternative if you need a fast but taste homemade meal on your way to jol the evening in Georgetown. Tasty Indian food downstairs or fresh burgers or bar fare upstairs in Marshall Bar, all at really affordable prices."], ["Worst restaurant I have visited so far", 1.0, "May 25, 2015", "Rituahuja1", "India", 6, 2, "Very bad experience. Extremely poor service and pathetic food. I don't recommend this restaurant to anyone."], ["Should have eaten the cat food", 1.0, "May 23, 2015", "Chris C", "Washington DC, District of Columbia", 51, 14, "My wife and I tried a food delivery through grub hub from this restaurant. OMG. We just had the worst indian Food of our lives and we eat a lot of Indian food. First of all it arrived stone cold. The chicken madras had five cubes of chicken in a soupy flavorless goop that tasted like something out of an...\n\n\nMore"], ["Average food and service", 3.0, "May 19, 2015", "Loving_Canada2014", "Toronto, Canada", 54, 48, "We went on a Sunday night and clearly the place was full . Lee ordered some appetizers , dal tadka , chicken and naan. The food was just about OK and we felt we could have spent the same money on a better place with faster service .\nHaving said that the chief server was kind enough to apologist for...\n\n\nMore"], ["Good Indian, and reasonably priced", 4.0, "May 14, 2015", "Megahose", "Brussels, Belgium", 134, 96, "I love Indian food, so try to look out for places when I'm travelling. This was just down the road from my hotel. Suffering from terminal jet-lag and not wishing to tramp around for hours in the rain, I decided to take the plunge. When you enter, it's quite dark. Tables are quite close together, so this is not a...\n\n\nMore"], ["Spicy food, nice service, enjoyed outdoor seating", 4.0, "May 2, 2015", "Bubba G", "Tucson, Arizona", 282, 118, "I like this place enough that I ate here two nights in a row. Which is unusual for me. I had the lamb house specialty (forget the name). I had that dish two nights in a row too! The second night I asked them to really spice it up. Caution, it was extremely spicy! Overall, I liked this place. Not...\n\n\nMore"], ["Prepared for a Long Wait?", 2.0, "April 22, 2015", "zeethelibrarian", "Raleigh, North Carolina", 11, 12, "After viewing the beauty of the Cherry Blossom Trees, my friends and I were excited to try Flavors of India. I don't have a lot of experience with Indian food, so I wasn't sure what to expect. I want to start by saying that I, indeed, find the food to be delicious. The flavor seemed just right, so if you...\n\n\nMore"], ["Don't be fooled by the signage", 5.0, "April 16, 2015", "NorthBuffalonian", "Buffalo, New York", 10, 7, "We walked out because we thought the indian restaurant must be upstairs - it's not - someone ran after us and we went back inside. Had a delicious dinner."], ["Great find while on vacation!", 5.0, "March 31, 2015", "Stacy W", null, 4, 4, "Excellent service and amazing food! Perfect date night. The chicken vindaloo and curry were super good. Would recommend this restraunt to anyone."], ["So so at best ...", 2.0, "February 24, 2015", "MG821", "New York City, New York", 60, 46, "I stayed in DC for 3 weeks and walked past this restaurant every day .. it is almost always empty or quasi empty (a couple of tables occupied) which makes me wonder about the freshness of the food.\nI love Indian food (I have lived in India and travel to India on a regular basis) - good Indian food that...\n\n\nMore"], ["Great customer service and food", 5.0, "February 3, 2015", "Lindsay P", null, 1, 0, "Quaint little restaurant with great food and excellent customer service. You can really tell that they want you to enjoy their food and your experience. Our waiter asked all our names and introduced himself. The food was flavorful, I ordered a chicken dish. I would definitely return if I were to visit DC again."], ["Great food and service", 5.0, "January 9, 2015", "Diana W", "Salisbury, Maryland", 31, 16, "The butter chicken, chicken tikka masala, and naans and kulchas were fantastic! Service was exceptional. Add a Taj Mahal lager, and it's a great meal. Very reasonable prices for this part of DC. I think our entrees were 14.50 each. Within walking distance of River Inn."], ["Best Indian we have eaten", 5.0, "December 18, 2014", "Geekaye", "Perth", 13, 5, "For the most part the service was good, but the food was amazing!! We absolutely loved it and will be back and recommending it!"], ["quite restaurant", 4.0, "December 8, 2014", "fayeq8", "Kuwait City, Kuwait", 25, 21, "we had dinner to this restaurant with my daughter and husband the food was great especially the chicken biryani it was not too much spicy and less oil. we ordered also sambosa veggie and it was really delicious. This restaurant is considered also a romantic place to dine in. The guy who served us from Bangladesh and he was good...\n\n\nMore"], ["Disappointed", 2.0, "October 25, 2014", "2014Dan1947", "Berkeley, California", 1, 0, "We ordered Indian food to go. The promotion indicated that a bottle of water came with the meal at no charge....yet, since I didn't check my receipt closely I found that I was charged $1.95 for it. I was told the food would be ready in thirty minutes, only to have to wait an extra 20 minutes before my food...\n\n\nMore"], ["A nice relaxing dinner", 3.0, "September 7, 2014", "RoverToad", "Wilmington, North Carolina", 101, 58, "The evening was cool, the breeze was blowing and the company was great! The dinner was good, but nothing extraordinary. As a small town visitor to the big city, I'm looking that one restaurant that I want to revisit on my next return. The food/service/atmosphere was good."], ["Very disappointed", 2.0, "August 30, 2014", "PrashanthMCR", "Knoxville, Tennessee", 3, 0, "Came here based off reviews on TripAdvisor and yelp but was very disappointed. The food lacked flavor and felt very sub par. Requested the waiter to recommend a dish for us and he ordered a highly priced dish which lacked in flavor and salt. Terribly disappointed !"], ["Great Indian fare & charming wait staff", 5.0, "August 11, 2014", "alohatravelersfive", "Honolulu, Hawaii", 50, 18, "We really enjoyed our dinner here. At first we weren't sure if it would be good. No atmosphere and located on the ground floor of a brownstone next to a pub. Outwardly un-impressive. It didn't help that a waiter came out to draw us in while we stood outside decoding if we'd dine here.\nLuckily we took a chance and...\n\n\nMore"], ["Very good Indian restaurant", 4.0, "August 8, 2014", "Marcin D", null, 72, 48, "Great food, very good service, nice climat. Especially goot lamb curry and butter masala. I'm not a big fan of putting ice cubes into mango lassi, but the drink itself was great. Go there when you like Indian cuisine!\nFour main courses plus four drinks with a tip included into the check was 90$."], ["Great vegetarian options!", 5.0, "June 16, 2014", "merrillma", "Tulsa, Oklahoma", 153, 39, "location sold us on this place at first, it was so close to our hotel, but we were so glad we stopped in. The staff here was so friendly, they had the lunch buffet, and it looked good, but we wanted to try some of their other dishes. The waiter had no problem letting us order and even brought us...\n\n\nMore"], ["Great food and very friendly staff", 5.0, "April 10, 2014", "Mandy M", "Basel, Switzerland", 1, 1, "We went there twice during our stay in D.C. Because we liked it so much. The food is delicious! Especially the paneer"], ["Great food and service", 5.0, "January 7, 2014", "Deanne G", "Brisbane, Australia", 22, 17, "This restaurant was close to our hotel (Avenue Suites) and has a great atmosphere. Our hosts were friendly and made some great menu recommendations. Dinner, drinks and dessert were delicious and reasonably priced."], ["Delicious....", 4.0, "January 3, 2014", "BarleyHops", "New York", 292, 132, "Flavors of India was right near Avenue Suites, so we found the place using the TripAdvisor app (which is awesome, as it helps you find good restaurants or attractions and the distance away from your current location). The decor was very nice and the food was delicious. The staff was very accommodating."], ["Real Indian taste", 5.0, "December 29, 2013", "Annie_Marie1", null, 8, 11, "We enjoyed the popadoms, mixed starter and two mains between us, both of us could not finish mains due to size.\nExcellent taste with natural colours, good service, great atmosphere and large portions.\nWould definitely return again"], ["Paneer & Channa Masala", 5.0, "October 1, 2013", "Hea1thyTrave1er", "Washington DC, District of Columbia", 3, 1, "Took a friend here who was visiting DC on his way to Savannah and got \"know good Indian in the city\" cred. He really liked the mango lassi. My favorite was the Channa Masala. Used a Yelp deal for $20 for $10 and ended up with an incredibly low-priced good meal."], ["Great deal on meal with Groupon", 4.0, "August 16, 2013", "ktg1only", "Providence, Rhode Island", 3, 3, "Found a front row parking infront of restaurant. Was immediately greeted by a friendly smiling waiter who seated my sister and i and my 5 mo old son in a booth. Food was very good. We shared garlic naan, mango smoothy,2 beef samosas, and a lamb dish. My only complaint was there was a meal deal that included an entree...\n\n\nMore"], ["Delicious food and very friendly.", 4.0, "August 7, 2013", "Claire G", "Long Beach, California", 30, 13, "My friend and I visited Flavors of India because of the good yelp reviews it received. The host and servers were extremely friendly and very hospitable. We ordered the chicken tandoori, chicken tikka masala, raita, and assorted naan. The chicken tandoori was flavorful and tender. The chicken tikka masala was perfectly seasoned and delicious. The raita was refreshing and tasteful....\n\n\nMore"], ["Nice meal", 4.0, "June 27, 2013", "Scott_Philips", null, 10, 7, "After reading some reviews we decided to visit here. The service was great and the food was well above average.\nWould recommend a visit here for a hearty Indian meal with great staff :)"], ["Good, if average, Indian food", 3.0, "June 15, 2013", "GeneDoc57", "Cleveland, Ohio", 152, 54, "We have been here a couple of times now and it has been consistent both times. The samosas, chat, naan, butter chicken and chicken korma were all what you'd expect. Service is good and the location is near Georgetown and George Washington University. Nothing outstanding but nothing below average. A good place to go if you just want typical Indian...\n\n\nMore"], ["Raw chicken, cannot recommend.", 2.0, "April 28, 2013", "thetripchick", "Seattle, Washington", 210, 183, "We tried Flavors of India via Seamlessweb while we were staying in DC.\nWhen I bit into my first piece of Butter Chicken (A delicious preparation of tandoori chicken tikka cooked in a creamy tomato and butter sauce) and found the chicken not fully cooked, I was worried. Even more so when, just to give the benefit of the doubt,...\n\n\nMore"], ["Delicious Indian; great lunch specials", 5.0, "April 12, 2013", "GottagetawayMO", "Missouri", 6, 28, "Chicken saag was fantastic, and the lunch special was a huge amount of food and good variety. Quaint little restaurant worth trying."], ["Great Indian restaurant", 5.0, "April 12, 2013", "LarsRo", "Malmo, Sweden", 103, 29, "I stayed in DC last week and we returned more than five times during this week for their good food. Very tasty food, excellent service, friendly staff. Try their Lamb Madras, a bit spicy but very good."], ["Wonderful Indian in Georgetown", 5.0, "April 8, 2013", "georgiagir", "Athens, Georgia", 38, 24, "It was very busy and crowded the night that we went. Very good traditional Indian-tikka masala, paneers, naan. All very good reasonably priced."], ["If you like Indian, you'll LOVE this!", 5.0, "March 16, 2013", "MNMexicoFamily", "Maplewood, Minnesota", 18, 14, "This restaurant was recommended by our hotel staff when we stayed in DC on a recent trip! My husband and I love Indian food and were so happy to find something close to our hotel and fantastic. Their naan was delicious, I had the Makhani, which was very good and hubby had some chickpea chicken dish (daal), which he said...\n\n\nMore"], ["Great Indian Find", 4.0, "February 17, 2013", "Kathy L", "Harpers Ferry, West Virginia", 15, 7, "We went here as it was so close to hotel..really good gfood and service in a pretty little restaurant."]]], ["Au Bon Pain", [["Best on the go salad", 5.0, "September 21, 2015", "staciebush", "Austin, Texas", 12, 0, "Had an amazing salad made for me at 7 pm. I will say going in I was not expecting much but it was great. Fresh veggies, great chicken and served with a smile. Couldn't ask for more and it really made my night."], ["simple meal", 4.0, "September 17, 2015", "rikatz", null, 34, 7, "This is a place to have a simple meal between activities on the city. The price is fair enough, and you have a lot of options."], ["Perfect for Breakfast", 4.0, "September 1, 2015", "jthendra", "Jakarta", 127, 46, "Knew this chain cafe when i visited New York in 2013; so i'm glad to see it again in Washington DC. Looks like now they had a customized sandwich to go. The variation is good and the price is OK. Perfect place for breakfast for me."], ["Dirty Restaurant with Rude Staff", 2.0, "August 20, 2015", "Rick T", "Cary, North Carolina", 19, 9, "I visited this location on Saturday, August 15th for lunch. The two ladies working were rude and the restaurant was a mess. The trash cans were overflowing, tables were dirty and instead of cleaning they are sitting at a table or behind a counter on their phones watching videos or texting. They acted like they could have cared less."], ["Clean with good selections", 4.0, "July 8, 2015", "chrisandun", "Wichita, Kansas", 124, 67, "There are a number of Au Bon Pain eating establishments throughout the area and all seemed to be clean and offered a good selection of salads, sandwiches soups and beverages."], ["Visiting Washington", 1.0, "June 11, 2015", "Keturah D", "Seminole, Oklahoma", 38, 7, "Walked in and place was dirty and needed to be cleaned up - then we go to order and the young man had no ideal how to make the sandwiches - he burned the bread complete up on the lady in front of us - then The whole place smelled of burned toast. Next I go to get soup and...\n\n\nMore"], ["Great for breakfast and lunch", 4.0, "June 3, 2015", "Emma P", null, 13, 5, "Just round the corner from our hotel so was a perfect choice for breakfast. Great choice of sandwiches for lunch"], ["Very Good Sandwich Lunch", 5.0, "April 24, 2015", "JimMillar", "Chester, United Kingdom", 196, 248, "Excellent Chicken Salad Sandwich with Avocado made to order and served with a smile and reasonably priced - worth the walk from the Smithsonian museums ."], ["Ok for something quick", 3.0, "January 31, 2015", "Shane R", "Richmond, Virginia", 5, 2, "If you're looking for something quick this is a fine choice. The selection was limiting and redundant."], ["Good food - super nice staff", 5.0, "December 3, 2014", "TravelingBeaner", "MN", 15, 8, "Ate breakfast here for a couple of days when in town for work. Good food, quick service. And the staff were so friendly!"], ["Good food, fast service.", 4.0, "November 3, 2014", "Tom F", "Philadelphia, Pennsylvania, United States", 15, 7, "I ate there 2 times for lunch. Both days were in the middle of the lunch rush. The food was good and the service was fast. I was really appreciative of that."], ["first time visit", 4.0, "September 15, 2014", "aphdover123", "Dover, United Kingdom", 27, 14, "this was the first time for us at this establishment, but we would not hesitate returning, the service, food, and staff were very good"], ["The usual Au Bon Pain menu, slow service", 2.0, "September 2, 2014", "David K", "Lyme, New Hampshire", 136, 57, "I had a quick lunch here. The menu is the same as anywhere. I wasn't thrilled with the service, but maybe that's because it was Labor Day."], ["Breakfast", 5.0, "September 1, 2014", "margaretpat", "Stockport, UK", 74, 17, "What a super little place this is. We walded 1 block to get breakfast there in the mornings as it is quite cheap and has a very good variety of food. nice coffee."], ["Change the Menu Format", 3.0, "August 27, 2014", "MsGodmother", "The Colony", 49, 25, "The food is good, but the menu has #'s. So you order the # and addons. Then the checkout person deconstructs your order piece my piece to put into the computer, so if you order #35 with bacon, she then breaks down the bread, the egg, the bacon, etc. very time consuming and frustrating."], ["Healthy but quick options", 4.0, "June 8, 2014", "Zmia", "Miami", 14, 2, "Another good & quick option when you don't have time for a \"formal\" lunch between meetings. Great healthy and quick options like fruit, yogurt, along with the salads and sandwiches. In & out fairly quick but satisfied."], ["Go to Starbucks instead", 2.0, "April 12, 2014", "Christine R", "Hilton Head, South Carolina", 179, 73, "Dirty, oatmeal was dried out and ice tea was disgusting. I opened the lemon holder and bugs flew out...yuk!"], ["Quick breakfast on the go!", 4.0, "February 23, 2014", "C8rd1ff", "Cardiff, United Kingdom", 43, 17, "Good choice for breakfast, ideal for us as tourists who didn't have breakfast at our nearby hotel.\nGreat cinnamon bagels!!"], ["IBest for Bagel", 5.0, "December 24, 2013", "Ramesh P", "Princeton, New Jersey", 87, 35, "If you really want to try Bagel with Egg Cheese,Everything and if you can eat hot spicy than they also have jallepano with cheeseis also good in taste."]]], ["Bistro La Bonne", [["Outstanding food, but we miss the old location", 4.0, "August 9, 2015", "ibkund", "Washington DC, District of Columbia", 13, 20, "We adored la Bonne when it was located on U Street. Amazing food, great atmosphere, it was our go-to neighborhood place. The new location has the same great food (though some of our beloved dishes are not on the menu any longer). Unfortunately, the new space is simply lacking in ambience and in our opinion needs to be completely redecorated."], ["Best deal in Washington for French food. Note the new location.", 5.0, "July 26, 2015", "Barry17149021", "Chapel Hill, North Carolina", 136, 32, "I went to Bistro la Bonne again in its new location and if anything, it was even better than before. The Happy Hour special has got to be one of the best deals in the whole city. If you come between 5 and 7 pm, for $15 you can choose one of two moules (mussels) sauces, frites and a glass...\n\n\nMore"], ["Unexpectedly good!", 4.0, "April 11, 2015", "DHVPhiladelphia", "Philadelphia", 107, 58, "When we first walked in we weren't sure. But we sat down at the bar, ordered wine and beer and a plate of steak tartar and a salad to split. When it came, we loved it so much we ordered another plate of the steak tartar! It came with a nice side salad with a tangy dressing and a great...\n\n\nMore"], ["Late night drinks and appetizers...", 4.0, "January 11, 2015", "travelgirl20707", "dc metro area", 66, 25, "While looking for a place to go dancing we stopped at this charming little place, we ordered drinks and appetizers, the pate was very good, really like the music they were playing and the service was very good even though they were quite busy, awesome atmosphere!"], ["Disappointing", 2.0, "December 29, 2014", "Tim K", "Washington DC, District of Columbia", 15, 2, "Perhaps a Sunday evening dinner post-holidays is not a fair measure of the restaurant, but the food was unsatisfactory, the ambience uncomfortable and uninviting, and the overall experience poor. Diners' various steak dishes appeared unappetizing and were tough, and the cassoulet lacked any duck confit and lamb as advertised, but it did have some type of sausage to accompany the...\n\n\nMore"], ["Place to go for mussels and fries", 5.0, "October 18, 2014", "Dianne F", "Blacksburg, Virginia", 28, 5, "Charming small bistro with a bar right on busy U Street. Although it was a Sunday night, the restaurant was nearly full. We ordered two large pots of mussels which came with a generous serving of fries. There are several varieties of preparation for the mussels, and we had the classic moules mariniere, which had tons of garlic! And a...\n\n\nMore"], ["Nice Brunch", 4.0, "September 7, 2014", "MDTJ", "Frederick, Maryland", 151, 32, "We ate outside and had a lovely brunch. We shared onion soup, excellent escargot, and the 2 egg signature La Bonne breakfast which came with a nice salad, bacon, sausage, and we chose poached eggs. Everything was very good. Our server was nice and friendly and we had an enjoyable and relaxing time watching the people walk by while we...\n\n\nMore"], ["Great neighborhood bistro", 5.0, "February 16, 2014", "orangerook", "Bethesda, MD", 66, 41, "We dined at 6:15 pm Sunday before a 7:30 performance nearby. Perhaps because it was early, service was good. The food was very good, and the menu included booth full dinners and lighter fare."], ["Great French Comfort Food", 4.0, "January 20, 2014", "Brad O", "Washington DC, District of Columbia", 24, 10, "We've lived a block away from Bistro la Bonne for over two years, and finally decided to give it a try on a quiet Monday evening. We thoroughly enjoyed everything. We started with a drink at the bar. They were out of LIllet, unfortunately, and they did not have a cocktail menu - I'd recommend one - but the bar...\n\n\nMore"], ["Solid French Cuisine", 4.0, "October 13, 2013", "Randall K", "Washington DC, District of Columbia", 64, 27, "We discovered this place back when it was impossible to get into Marvin which is just around the corner on 14th Street.\nWhat a gem!\nI'm a creature of habit, and I tend to rate French restaurants based upon their steak frites. Bistro La Bonne does a fine job with this dish. The fries are particularly well executed.\nFriends of...\n\n\nMore"], ["Nice bistro -- happy hour is a great value -- but ask to be seated upstairs", 4.0, "August 4, 2013", "Splitchanka", "Arlington, Virginia", 35, 23, "So let me start off by saying I have eaten at Inn at Little Washington, Marcels and La Chaumeriere in DC. All of which is to say if you are looking for high end French food this is not it. That said, this place had good food and attentive, pleasant service.\nWe enjoyed dinner here before a show and liked...\n\n\nMore"], ["Worst Service Ever!!", 2.0, "June 8, 2013", "Sarah H", null, 1, 0, "Although our food was very good, I have never had worse service in my entire life. Our waiter barely acknowledged us. After being sat for nearly 10 minutes the manager/hostess took our drink and food order. Our waiter, whose name I don't know because he never introduced himself, brought our wine and then a steak knife and that was the...\n\n\nMore"], ["Not terribly impressed", 3.0, "June 6, 2013", "Kenny T", "Saint Louis, Missouri, United States", 2, 0, "I was staying in a B&B on U Street, so I found this on my way to the Metro. Although it's French, there was a sign outside touting Belgian beer, which is my favorite, so I stopped in. Unfortunately, the Belgian selection was small, and the waitress did not know the difference between Chimay white cap (which they had on...\n\n\nMore"], ["Great Value for Your Money", 3.0, "June 2, 2013", "hynesdd", "WASHINGTON", 47, 38, "Been awhile since I was last at Bistro la Bonne. While the food was very good and a great value, the service was a tad off...not that they were bad--everyone is very nice...just not polished...and they always seemed to be hovering and overly anxious to clear empty plates and glasses. Our waiter, Clement, was very sweet but three days into...\n\n\nMore"], ["Great U Street Neighborhood Bistro", 4.0, "May 24, 2013", "lshane68", "Rockville, MD", 78, 24, "We met friends for a Saturday night dinner at Bistro la Bonne and had a wonderful experience. This is a perfect neighborhood place. It's a little more than a block from the metro, has friendly and attentive staff, and the food is really good.\nWe were early, so started off with drinks at the bar. The bartender was very nice...\n\n\nMore"], ["As if you were in France", 5.0, "April 6, 2013", "boybanker", "Washington DC, District of Columbia", 141, 67, "We've been several times in the winter. This is just like going to a neighborhood bistro in a French city. More formal perhaps than a place in Lyon, but would fit in a well in one of the \"bobo\" quartiers of Paris. The steak-frites was authentic, beaten only by the moules frites. Ask you server to explain the difference between...\n\n\nMore"], ["Authentic French food", 4.0, "March 25, 2013", "Sharon D", "Alexandria, Virginia", 15, 12, "I've been to this restaurant twice now and have been pleasantly surprised with the food. This is actual authentic French food. They have mussles, but also steak and French fries and pate. The wines are reasonable in price and are very nice, especially the Sauvignon Blanc. The french seem to have very well developed taste buds! Price vs quality is...\n\n\nMore"], ["Needs a Service Overhaul", 2.0, "March 21, 2013", "brmusicman", "Chicago, Illinois", 916, 489, "We went out to dinner here with friends and had an average experience.\nThe place aims to be a classic French bistro. It needs to work on its decor if it wants to achieve that: most bistros I've been in either have white tablecloths or no tablecloths. This place had plastic Party City-like tablecloths. Sorry to be picky, but when...\n\n\nMore"], ["Mighty mussels!", 4.0, "February 14, 2013", "Barry17149021", "Chapel Hill, North Carolina", 136, 32, "We took advantage of the Happy Hour special which is really remarkable. For $15 you get a choice of mussels in a variety of excellent sauces, frites and beer or a glass of wine. We had two different mussel dishes and we both were impressed with the freshness, size and quality of the mussels. The frites are also great and...\n\n\nMore"], ["Classic French Bistro", 4.0, "February 13, 2013", "MysteryGuestRochdale", "Rochdale", 235, 106, "Enjoyed lovely fresh mussels followed by great steak washed down with a fantastic Malbec.\nHighly recommend as just down the street from great live music at Twins Jazz."], ["Favorite spot in DC at the moment.", 5.0, "January 20, 2013", "Guest072", "USA", 2, 0, "Great food and atmosphere, best steak frites in the city, delicious beef tartar, great beer list, reasonable prices. Good spot for brunch or dinner. YUM!"], ["Bistro La Bonne", 5.0, "December 12, 2012", "CityGirl614", "washington, dc", 32, 20, "Upon my return to the states after traveling to Paris, I had a strong desire for French cuisine and Bistro La Bonne is the place to go. You can’t go wrong with just about everything on the menu, as their food is consistently delicious. My favorite meal is a pot of mussels and frites and you can add shrimp for...\n\n\nMore"], ["Super French food in trendy spot!", 5.0, "October 6, 2012", "TolerantTraveler", "Washington DC, District of Columbia", 349, 98, "For $60 early one Saturday evening we had a side of ratatouiile, curried chicken with rice and onion pie with mesclun salad with a great vinaigrette, glass of Reisling (dry) and a beer, and chocolate cake with ice cream and expresso and decaf coffee, all served well. It was an excellent surprise to eat so well here and we will...\n\n\nMore"], ["Very French", 4.0, "September 25, 2012", "gstape", "Atlanta GA", 57, 18, "I read a review of this restaurant and since it was in walking distance of my hotel I decided to try it. The atmosphere lived up to its name.It is in fact a bistro; very casual. The service was very good. The chef is from Martinique so he has a background for french food. He evidently learned well because we...\n\n\nMore"], ["French in u street", 4.0, "May 28, 2012", "ThijsMalmberg", "Voorschoten, The Netherlands", 468, 77, "We ordered four different menus all of them were very good. The mussels are great. Very friendly people."], ["A rat ran across the floor!", 1.0, "February 26, 2012", "berg3", "washington, dc", 24, 9, "I had a birthday dinner with some friends last week in this restaurant on U Street. The food was fine -- not especially good, but fine and there was a nice selection of French fare. However, toward the end of our meal a RAT ran across the floor. The staff was very nonchalant about this. They said that the kitchen...\n\n\nMore"], ["I'll be going back!", 5.0, "February 20, 2012", "megwalker87", "Washington DC, District of Columbia", 46, 18, "We just got back from Paris, so I excepted to be disappointed, but I wasn’t. The best part is the food. The duck is beautiful, the mussels are delicious and the goat is absolutely superb! ..and I love the way the French fries are served.\nSo while the main courses are excellent, the dessert is average - I found the...\n\n\nMore"], ["Great french bistro in U street area", 5.0, "September 17, 2011", "DCalexandre", "Washington DC, District of Columbia", 118, 37, "Stumble on this little restaurant while walking around the U street area.\nHad a great brunch. The best joules frites I had in DC sofa (and I have tried many places).\nNice selection on belgian draft beers and wine prices are reasonable.\nDefinably a place I'll go back to."], ["One of the BEST french restaurants in DC", 4.0, "September 15, 2011", "GregRich", "Washington DC, District of Columbia", 50, 20, "As a lover of all things french (food/wine), I was thoroughly impressed with Bistro la Bonne. The patio provided a perfect setting for a glass of champagne, a charcuterie plate and the best people watching on U Street. I had the steak and frites and my guest had the Moules Provencales. Both dishes were great representations of classic french dishes....\n\n\nMore"], ["Good food and nice atmosphere", 4.0, "July 23, 2011", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "I've been there for dinner. I had the Assiette de Fromages, an assortment of French cheeses. I really enjoyed.\nAnd for main dish I had a goat cheese salad with pecan nuts (in fact is an appetizer) and was delicious!\nI also tasted the Magret de Cannard and was magnificent.\nThe desert was amazing: wild berry strudel with vanilla ice...\n\n\nMore"], ["Excellent food!", 4.0, "May 6, 2011", "nurcyn76", "Paradise Valley, Arizona", 9, 9, "My husband and I, traveling from Arizona, had our anniversary dinner here. We chose it as we walked down U-Street. I had the Blanquette (a stew with mussels, scallop, shrimp and salmon in a delicious cream broth) and it was excellent. I also tried the pate, which was also very good. We were pleased. Our waiter was French and we...\n\n\nMore"], ["Classic French food, stale atmosphere", 4.0, "February 23, 2011", "MikeMfromWashDC", "Washington, DC", 148, 89, "French food classics with cute waiters from France. The layout and decor are both a little drab, but overall a good experience."], ["Our New Favorite!", 5.0, "January 26, 2011", "GiancarloBuonarroti", "Washington DC", 130, 83, "I was taken here by a friend from Dallas who had heard about it from another friend who loved it! I sure can understand why. This nice little bistro is is not only very nice the food is delicious! i love the onion soup and the steak and frittes, salads are exceptional with plentiful greens and elegant dressings. The Casoulet...\n\n\nMore"]]], ["California Tortilla", [["Not bad...", 3.0, "July 23, 2015", "Travis H", "Shreveport, Louisiana", 10, 4, "...but not great. It's pretty much exactly what you'd think and nothing more. It was fine and was more than enough food, but I would be just fine never eating here again. I got the steak quesadillas. My wife had fajitas."], ["Great and Fresh Salads", 5.0, "July 5, 2015", "Ahren07", "Leavenworth", 1, 0, "Had a great dinner tonight, everyone had amazing food. Highly recommend it to anyone. Great burritos aswell, you are able to make your own custom burrito to your liking."], ["Good alternative to Moe's and Chipotle with more interesting hot sauces", 4.0, "June 30, 2015", "Kat0425", "Raleigh, North Carolina", 548, 293, "The food at California Tortilla is comparable to standard Mexican fast food. The difference comes from the variety of hot sauces. You can order some sauces to go with your customizable burritos or burrito bowls. Additionally, you can also take samples of their numerous flavored hot sauces, which vary in spice level."], ["Nothing special", 3.0, "May 13, 2015", "NCurl", "Norwich", 51, 29, "When the tortilla chips are the star you've got issues. Although an afterthought the chips were tasty and fresh. The food was just average. Lots of nondescript rice in the burrito's and some heat. We should have tried District Taco."], ["Surprisingly great food", 4.0, "May 4, 2015", "vandpstewart", "Columbia, Maryland", 98, 27, "I had the southwest salad, and I've had the quesadilla before, at the Bolling AFB California Tortilla restaurant in the food court. Very fresh food, great taste, good value, and very quick service. Especially for as many customers as they have, and so few employees."], ["Yummy burritos and salads!", 4.0, "April 20, 2015", "Bob T", "Boston, Massachusetts", 324, 90, "For a quick, casual lunch or dinner I think they are as good as Chipotle. Excellent burritos and salads. Wish there were more of these around the northeast."], ["Good Salad", 3.0, "March 29, 2015", "Casper H", "Phoenix, Arizona, United States", 180, 57, "Had the grilled steak salad and it was pretty good. The staff were friendly and the food was delivered fast. I'd get the same salad again."], ["Great tortilla's", 5.0, "November 24, 2014", "KinkyNoodle", "Oxford, United Kingdom", 134, 59, "We popped in to the California Tortilla as a quick lunch. It was fantastic. Would definitely go again. Wish there were outlets in the UK. Very good."], ["Pretty good food", 4.0, "September 1, 2014", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "I like it ok. Food is good, the place is relatively clean, and it's in a great location if you're on the go!"], ["Would eat at CHIPOTLE any day", 3.0, "August 31, 2014", "darshita", "Mumbai (Bombay), India", 113, 57, "Being a big fan of mexican cuisine, each time i'm travelling i try to grab a bite at some of these chains as many times as possible. I have been to California tortilla 3 or 4 times only if the chipotle is too crowded or shut or if i want to try something new.\nIts like any other chain, loud,...\n\n\nMore"], ["Good chicken fahitas", 3.0, "August 26, 2014", "ROM550", "DC", 71, 12, "Like California Tortilla for lunch. Usually order: \"to go\" and enjoy at my desk while working....def. spices up my lunch time and helps my cravings."], ["Good burrito, Good price, No stupid mascot", 4.0, "July 8, 2014", "DaveB_Jax", "Jacksonville, Florida", 30, 21, "My son and I ate here on our way to a movie across the street.\nMy burrito was large enough that I didn't need chips or whatever. It was served hot, and was flavorful despite my usual rice-beans-cheese-only order. (If the beans and rice are good, it's good... If not, it's terrible.)\nThe service isn't quite as fast as that...\n\n\nMore"], ["Poor food quality", 1.0, "April 20, 2014", "Hannah_Travis", "Salt Lake City, Utah", 1, 1, "A waste of money. The salad was sub-par with less than fresh lettuce. Taco beef was dry and stale. Not a good experience. It would be much more worth your time to cross the street and go to Chipotle."], ["great brunch", 5.0, "April 7, 2014", "LynnMedina", "Medina, OH", 56, 14, "My husband and i had time to kill waiting for the National Portrait Gallery to open so we grabbed fish tacos and beer. We sat and watched traffic go by at the window. Got guac and chips with the meal, picked out a great hot sauce from the variety offered, sat back and enjoyed.\nWell priced, too. I recommend!"], ["Good quick meal with the kids after the Zoo", 4.0, "December 27, 2013", "b25pilot", "DeLand, Florida", 46, 34, "If your taking the Metro home (or to your hotel) this restaurant is right next to the Cleveland Park Metro stop. My wife enjoyed her Mango Salad, me the Specialldila and the kids had a Burrito and Taco. The kids meals come with chips, soda and half a cookie or brownie. They have many hot sauces to choose from, as...\n\n\nMore"], ["Breakfast Burrito!", 5.0, "December 15, 2013", "David A", "Washington DC, District of Columbia", 44, 18, "Great breakfast burrito! Southwest burrito with sausage-- totally filling. Staff was great, not expensive and was really good. I'll definitely go back."], ["Great Food and Prices", 5.0, "August 21, 2013", "andrealea", "Fort Lauderdale, FL", 82, 51, "Family of 4 - we all enjoyed the variety and taste of the food here. Would definitely come back. This was right by Verizon Center and shopping. We walked from our hotel. Very convenient"], ["Best fresh fast food!!!", 5.0, "August 16, 2013", "LalithaJay", "Orlando, Florida", 22, 14, "Actually we wanted to eat at a different restaurant. But with no reservation, we couldn't get in. With 2 kids, who were very tired and hungry, we decided to eat in California tortilla. Man, the food was delicious. So fresh and the best taco we every had. They had so many choices, both vegetarian and non vegetarian. Lot of items...\n\n\nMore"], ["GREATNESS in a tortilla", 4.0, "July 30, 2013", "Prince_Oochie", "Downingtown, Pennsylvania", 102, 33, "I am absolutely in love with this place. The food here is so fresh. We accidentally came across it. We were looking around for somewhere to eat and we were headed to china town and this was on 7th. I am kind of glad they don’t have these where I live because I would eat here every day! The food...\n\n\nMore"], ["More than a stomach full", 4.0, "July 12, 2013", "Tamieko B", "Kingwood", 95, 38, "Good place to eat. The cashier lets you know the approximate amount of time your order will be ready so if need be you can order something quicker. I got a chicken burrito.. It was so big my partner & I earned full bellies. You definitely get your money's worth."], ["Delicious", 5.0, "May 14, 2013", "RoxieF72", "Gray, Maine", 54, 25, "We ate at the one in the Dulles airport (couldn't find a separate restaurant to review so adding it here). I was shocked how good it was for airport food. We both got bowls. The meat was very tender and flavorful. The guacamole was fresh and VERY good. Good portion sizes."], ["Super fast food", 5.0, "April 21, 2013", "NCGatorGirl", "North Carolina", 31, 10, "We were trying to find something quick and inexpensive during the Cherry Blossom/NCAA Basketball Tournament weekend. Loved the variety of food and felt that we were served quickly and enjoyed the burritos. We even returned a few days later when we were in the area and were given a $1 off coupon as we walked in the door. So often,...\n\n\nMore"], ["Nice Menu with Good Variety", 4.0, "February 18, 2013", "Backstreets1250", "Minneapolis", 116, 94, "I had never eaten here before and thought I was in for a \"Chipotle Wanna be.\" I was nicely surprised.\nWhat intrigued me the most about this restaurant was the variety of the menu and how they offered each one of the dishes. All were on the menu board, had great descriptions and even were recommended as \"favorites.\" That really...\n\n\nMore"], ["Handled a large crowd with ease", 4.0, "January 30, 2013", "islandmarsh", "Minneapolis, Minnesota", 139, 33, "I brought 42 people here and they got us through quickly. I thoroughly enjoyed my steak burrito, it was fresh. They also have an amazing collection of hot sauces. Great place!"], ["Good tortillas & soup", 4.0, "January 28, 2013", "ezholidays", "Singapore, Singapore", 28, 14, "I am personally not a fan of tacos and tortillas but my husband loves them. He enjoys ALL the tortillas here, hard/ soft, fish/ chicken. I love the tortilla soup and would take 1 to go.\nThe food he is flavorful and price is good. A good place for a quick bite. Beats Taco Bell, anytime."], ["Handled a large group with ease!!!", 4.0, "January 26, 2013", "islandmarsh", "Minneapolis, Minnesota", 139, 33, "I brought 42 people here and they got us through quickly. I thoroughly enjoyed my steak burrito, it was fresh. They also have an amazing collection of hot sauces. Great place!"], ["Pretty good Mexican fast food...", 4.0, "January 20, 2013", "momof4inmd", "Salisbury, Maryland", 108, 57, "Visited here for the first time when we came to DC to visit the Crime and Punishment Museum. Great for fast and quickly prepared meals. Vegetarian options. Indoor seating is limited. For almost the same price visit Chipotle instead. Cheese on nachos was not great and daughter's taco was very small. One step up from Taco Bell."], ["Good Eats", 4.0, "November 15, 2012", "snowfaerie11", "Virginia", 23, 17, "Great place, friendly staff. Met the manager for the Crystal City branch when it opened - friendly fellow! The chain makes delicious made-to-order mexican-american fare and has a wall of hot sauces for the more adventurous eaters."], ["Great Local Alternative to Chipolte", 5.0, "October 6, 2012", "mrdcs1", "Washington DC, District of Columbia", 155, 75, "California Tortilla is my favorite fast food in DC. Fresh ingredients, made to order make this a great, delicious place to grab tex-mex food on the go."], ["Decent", 4.0, "August 18, 2012", "Sickofit28970", "Washington DC, District of Columbia", 5, 0, "You don't have to wait forever to receive your order. There is, however, entirely too much salt. The chips and salsa are wonderful. The burrito bowls are the best, however, the chicken is bland and burnt."], ["Spectacular Burritos", 5.0, "August 17, 2012", "traveltravel011", "Washington DC, District of Columbia", 5, 2, "The burritos here are great for a low-cost quick visit. I also love the wall of flame, a wall with about 50 different hot sauces."], ["Quick Mex in Chinatown", 4.0, "April 22, 2012", "KThrasher", null, 7, 3, "After biking all day in DC this was a great stop for quick, cheap food. There was also a Capitals game the night we went by and it was super busy - but we enjoyed the crowd.\nBlackened chicken tacos were excellent as well as the steak quesadilla. Variety of hot sauces available for use.\nDifferent than a Chipotle, but...\n\n\nMore"], ["a good, inexpensive meal in the heart of DC's Chinatown", 4.0, "February 20, 2012", "Kathryn R", "New Castle, PA", 30, 19, "Mex food in Chinatown? Yep and it was great. I don't like what I call \"Microwave Mexican\" and I feared the worst but we were looking for something kid friendly and inexpensive to fill us up. I had a Pork Carnita Burrito which was one of the best that I had ever eaten. My vegetarian granddaughter loved her black bean...\n\n\nMore"], ["Great spot for Cheap, fast eats.", 4.0, "February 6, 2012", "AuntieAnne22", "Tallahassee, Florida", 98, 64, "We had a burritto and a quesadilla. Both tasted very good. As an added perk, they had a good selection of beers for $3 each. I am not from the DC area and I'll be honest... We only stopped here because the Chipotle line was out the door and we didn't feel like waiting. This spot was cheaper, it appeared...\n\n\nMore"], ["Great food for a fast food place", 4.0, "November 15, 2011", "tbm0", "Oklahoma City, Oklahoma", 32, 16, "I had the fish tacos -the fish was tender and had good flavor. They have what seems like an infinite number of salsas and hot sauces. Although they were very busy, the service was fast. The staff was pleasant and kept the place as clean as a very busy fast food restaurant can be."], ["Fresh Mexican at its best!", 4.0, "October 31, 2011", "goneyisback", "Kansas", 2, 0, "Lunchtime is a zoo because the food is so good! Even though we had to wait for a place to sit, it was very worth it. The food is made fresh as you order it in your favorite style and spice level. We enjoyed it so much that we returned another day. The servings were plentiful and in fact, I...\n\n\nMore"], ["Great tasting Mexican Food at a reasonable cost", 4.0, "September 9, 2011", "TryitYoullLikeIt", "Birmingham", 193, 86, "Our group of four each had different entrees. They were all well seasoned and prepared fresh and fast. Even though we were there at the end of the evening, everything was still crisp and fresh."], ["Great food at reasonable prices", 5.0, "June 14, 2011", "MichiganduoKazoo", "Kalamazoo", 1, 0, "We've been to CT several times and enjoy both the burritos and the chili. We've found the service good--quite quick--and helpful. Living Social did a special here in April and the place was mobbed--we saw it on the evening news.\nGreat location too.\nTwosome from west Michigan"], ["Chain restaurant convenience with sit-down quality.", 5.0, "July 14, 2010", "ketabby", "Washington, DC", 3, 0, "California Tortilla is a step above other burrito joints like Chipotle in terms of quality and convenience. I've been to their 7th St (Chinatown) and Court House (Arlington) locations multiple times, and have come away satisfied every time.\nService\nSparse- but it's not the kind of restaurant where you'd want or need more service you get. You stand in line,...\n\n\nMore"], ["OK Spot--I expected better Mexican, burrito was mainly rice", 3.0, "July 1, 2010", "Pnemiller", "Kutztown, Pennsylvania", 1738, 1728, "I had read the reviews and was looking forward to this place, but was fairly disappointed. The southwestern burrito bowl (without a tortilla) was tasty, but the carne asada burrito hardly had any meat and was filled with too much rice. There are better burritos places, especially across the street at Chipolte."], ["Great variety of burritos. Clearly superior to Chipolte or Taco Bell.", 4.0, "April 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great variety of burritos. Clearly superior to Chipolte or Taco Bell."], ["This is a better option...", 4.0, "April 7, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is a better option than Qdoba, Chipotle, or Moes. Great selection of hot sauces! They offer discount movie tickets for the Regal across the street if you buy a combo."]]], ["Ping Pong Dim Sum", [["Great dim sums in a modern setting", 4.0, "September 3, 2015", "Avijit R", "Gurgaon, India", 71, 32, "\"Ping Pong? What kind of a name is that? They mustn't be serious!\" Thoughts that plagued as we sauntered in for lunch on a weekday. The charcoal and oak interiors don't give you the traditional ambience you associate with Chinese restaurants, but then, this place is not your usual eatery.\nWe started with a glass each of their special teas....\n\n\nMore"], ["High-end dim sum", 4.0, "August 16, 2015", "Eunice L", "Allentown, Pennsylvania", 15, 1, "Excellent cocktails, good drinks, and tasty dim sum. This restaurant makes dim sum accessible to the masses, particularly those people who would normally feel uncomfortable walking into a traditional dim sum place (i.e. where they speak limited English). My only criticism is that this place is a bit pricey for dim sum (because you can get cheap, excellent tasty dim...\n\n\nMore"], ["Great Asian Food", 5.0, "August 12, 2015", "GrandPoohbaH", "Dunfermline, United Kingdom", 132, 283, "We ate here and found the food to be plentiful. Dumplings were very good, steamed were better than the grilled. Good portion sizes and food was authentic"], ["Poor service", 1.0, "July 27, 2015", "Steve B", "Cheltenham, United Kingdom", 6, 1, "Although some of our food arrived relatively quickly, the waitress had to check twice to see what we had off our order. Then a few more dishes arrived. I waited approximately one hour for my sliders to arrive. The waitress were friendly but not apologetic for their lack of service. Although some dishes were lovely overall the sliders were disappointing...\n\n\nMore"], ["Modern Fusion Dim Sum", 4.0, "July 12, 2015", "LivingLife808", "Kihei, Hawaii", 91, 52, "I love eating dim sum so I was very happy to find this place near my hotel on DuPont Circle. You can either order individual dim sum or they have created one for you. They also have a Happy Hour during the whole dinner hour so the price is reduced all night long on Sarurday! Thus allowed for more variety...\n\n\nMore"], ["Good Watering Hole", 4.0, "July 4, 2015", "TravelWell040", "Georgetown, Texas", 158, 43, "We sat outside on a nice June evening. The wait staff was attentive and the food was good. We ordered the Price Prix for 1 which was adequate for a light supper. I'd say the menu is somewhat fusion and not strictly Asian.\nThe place is more of an after work rest stop for the trendy young crowd especially the...\n\n\nMore"], ["Pricey", 2.0, "July 1, 2015", "JandM_TheExplorers", "Saratoga Springs, New York", 10, 0, "This was our first time dining out at a dim sum restaurant. The menu was user friendly as we were able to order a variety of items. Unfortunately we only liked one dish out of the eight we ordered. We felt it was over priced for the portion sizes. The silver lining was the mimosa special with several different juice...\n\n\nMore"], ["Evening dinner", 1.0, "June 26, 2015", "Ian A", null, 4, 0, "We thought we would try something different and a little more expensive. Service was poor. Hostess was not very friendly and took her time to seat us even though there was at least 5 tables open in outside area. Food was not great (maybe because we were not familiar with the style of cooking.) Portion sizes were small and extremely...\n\n\nMore"], ["My first dim sum experience", 4.0, "June 10, 2015", "Barsha P", "Kathmandu Valley, Nepal", 52, 18, "This was my first dim sum experience and loved it. They have huge varieties of dimsums, I loved the garlic shrimp dim sums. Being a Nepali we are so used of wafting momo's, somewhat similar to dimsums, yet was amazed to see the variation you could bring to momo's. I particularly loved the cocktails there, the hibiscus drink was just...\n\n\nMore"], ["Masquerading As a Hipster", 4.0, "June 5, 2015", "SoozClues", "Tampa, Florida", 30, 6, "Unique dim sum dishes and delicious cocktails make this place very different than traditional dim sum restaurants but a fun experience. Recommend Pork shu mai, Duck and Hoisin Sliders, Crispy Beef with Citrus Soy, and Chicken and Nappa potstickers. Would love to return to try out the interesting brunch menu. Our server was quite distracted by other responsibilities since we...\n\n\nMore"], ["First time for dim sum.", 4.0, "May 30, 2015", "Bobby S", "Leitchfield, KY", 50, 30, "Loved this place. Visited on a Saturday night—before happy hour hit. Service was top notch and the six dishes we tried were excellent. The place was almost empty, but I don't know why."], ["Terrible service", 2.0, "May 20, 2015", "ansilva12", "North Little Rock", 15, 10, "New experience with very little help from the waiter. Tables were left unattended after people left. It took 10 minutes for the waiter to return with refills, after needing to be asked for a refill. The food was a fun experience, but the flavors are very different."], ["Not traditional dim sum", 2.0, "April 26, 2015", "CleoIsh", "McMinnville, Oregon", 80, 20, "We each had the prix fixe dinner, fair price of $25.00. The food was rather bizarre, not what we expected, it is an attempt to make dim sum American and sophisticated. Nothing is better than real dim sum!\nThe service was good. The restaurant is very sleek and modern. The music is electric Dane music and very loud.\nI would...\n\n\nMore"], ["Bait and Switch", 1.0, "April 21, 2015", "Kellye M", "Washington DC, District of Columbia", 6, 0, "I decided to try out the restaurant because of their partnership with Capitol Bike Share. At the time, there was a sign half a block away from the restaurant promoting a happy hour special. When I arrived to the restaurant, the staff told me it was no longer valid, even though the sign was still clearly posted just yards from...\n\n\nMore"], ["Great food - wish they weren't quite so trendy", 4.0, "April 12, 2015", "MrsRehoboth", "Washington DC", 231, 92, "The food is wonderful; especially the chive and shrimp dumplings. Excellent teas. Good brunch offer, if a bit expensive. However, the service can be slightly off hand; the pounding music can be a bit off putting. I love dim sum and ping pong is my only local option. I like it but I have to persuade my husband to go...\n\n\nMore"], ["Good time, good food with friends", 4.0, "April 3, 2015", "ericm66", null, 31, 11, "Ping Pong has a relaxed atmosphere and a wide variety to the menu. You have to adjust for the small portions that are served, you'll get 3-5 pieces or dumplings with each order...similar to sushi. But you get to try a variety of dishes in an unhurried manner. Saw a mix of families and young professionals. This restaurant is well...\n\n\nMore"], ["Good Dumplings, Below Average Service", 3.0, "January 31, 2015", "Mom45", "Hampton, Virginia", 134, 175, "We had lunch here on Saturday, January 31st. We had two waitresses, one of whom was in training. It was confusing until they explained what was going on. They tried to sell us on the $39 per person all you can drink all you can eat brunch option which we all found off putting. It was not easy to understand...\n\n\nMore"], ["Fancy but not your traditional dim sum", 3.0, "December 30, 2014", "Wendy H", "Independence, Virginia", 11, 5, "Upscale dim sum joint...I've had better in Chinatown though. The prices were not inflated which surprised me. Very chic...but I dig an old Chinese place over this."], ["where did you put your coat?", 3.0, "December 2, 2014", "slinde77", "Washington, D.C.", 27, 7, "this evening just started off on the wrong foot. First we sat at the \"uncrowded\" bar. We were served water and said we were waiting for the rest of our party. Then about five minutes later we were told we could not sit at the bar with a tween on Saturday night. So we went to a table. Where can...\n\n\nMore"], ["very enjoyable", 4.0, "November 25, 2014", "Matt_Sommer", "York", 1, 0, "We went with some old friends and two young children. Surprisingly kid friendly and great food. Dim sum purists might be disappointed but a fun and modern take on one of my favorite cuisines."], ["sad, sad place", 2.0, "November 22, 2014", "katensteve", "Forest Hills, New York", 52, 46, "This place was so empty and sad during dinner - which made their poor service even more confusing given there were about 3 tables full in the entire place!\nYou can just tell the place is trying really hard to be hip/trendy, but a lot of that gets taken away when the place is so sad looking inside. Go somewhere...\n\n\nMore"], ["One of our favorite meals in D.C.", 5.0, "November 18, 2014", "wanderlustfamily17", "Washington DC, District of Columbia", 167, 53, "It's really difficult to choose what to eat here. Everything looks and sounds delicious. We went for lunch one day, but we chose to have a late lunch which was perfect because we didn't have to fight with a busy lunch time crowd. Our server was very friendly and informative about the menu.\nThe braised pork belly sliders were awesome....\n\n\nMore"], ["One of my favorite cocktails", 4.0, "November 11, 2014", "Nicole R", "Philadelphia, Pennsylvania", 113, 40, "I went for cocktails around 6:30 pm on a Saturday and was pleasantly surprised to see the bar empty. (There were people at cocktail tables and dining tables.)\nThe service was professional and friendly and the Ping Pong Bubble is probably my second favorite cocktail ever. The lychee lemongrass cocktail was also great. I didn’t taste lemongrass, but no complaints!...\n\n\nMore"], ["Interesting bar crawl spot", 4.0, "November 4, 2014", "Aura C", "Virginia Beach, Virginia", 15, 6, "I visited ping pong on a halloween bar crawl. We stopped in because they had food deals available. The location is right on dupont circle and its modern and upscale inside. This is not the dim sum of any china town but it was relatively good. I had the chicken and black pepper spring rolls and the chive and shrimp...\n\n\nMore"], ["Can't really fault it", 4.0, "October 31, 2014", "Chris K", "Mudgee, Australia", 56, 27, "The food was great, we got a selection of dishes to share, and they were all very tasty. Worked out to be a tad pricey to leave with a full belly. But definitely worth it. Service was very good and friendly and it had a nice ambiance.\nOverall we were quite pleased"], ["Designer Dim Sum", 5.0, "October 21, 2014", "Gerson S", "Washington DC, District of Columbia", 74, 45, "We've gone twice to this restaurant in the past few months and have been pleasantly surprised. My wife generally does not like dim sum but Ping Pong's are different. When you think of dim sum, it's in a crowded restaurant on a Sunday morning, with the wait staff putting stuff on the table that you may never have seen before....\n\n\nMore"], ["Reasonably-priced, quality dim sum near Dupont Circle", 4.0, "September 29, 2014", "JT M", "Washington DC, District of Columbia", 158, 53, "Ping Pong is a great spot for reasonable priced, quality dim sum. The Dupont Circle location is very pretty. The restaurant offers a number of good prix-fixe lunch options and a $5 dim sum happy hour during the week from 4 to 7 pm. Many different/original drinks are served."], ["Good food but can be a bit pricy", 4.0, "September 21, 2014", "Josh305", "Miami Beach", 68, 31, "This place has good food and service was excellent. There are many choices for nearly any apatite. Especially liked the honey chicken puff."], ["Bad food. Terrible", 1.0, "September 4, 2014", "Cparedv", null, 14, 4, "Food is not good at all. Too many options. I ordered 4 dishes, only one was ok, the pork steamed dumpling."], ["Love this chain!", 4.0, "August 10, 2014", "tlhoooper", "Calgary, Canada", 126, 58, "I've been to Ping Pong in London so when I found one in DC, it was was a great surprise. We ate there and found it to be just as good as our first experience in London. Great dim sum!"], ["An Expensive Introduction to Dim Sum", 3.0, "August 6, 2014", "Graham C", "Washington DC, District of Columbia", 21, 8, "Looking for a different dim sum restaurant in the DC area, we decided to try Ping Pong for Sunday lunch. My wife is Chinese, and I am a Caucasian who enjoys dim sum. Ping Pong does not give you the real Chinese experience with carts being pushed around the restaurant. Instead, it is very quiet with modern decor. Too modern...\n\n\nMore"], ["Rating for Service & Beer only", 4.0, "July 17, 2014", "NORA K", "Shingle Springs, California", 99, 41, "Had an hour to kill before a tour at the Beer Museum. Since this was across the street we popped in to cool off on a hot day. We sat at the bar - a fairly decent beer selection, bar tender was friendly and kept our water glasses and beers full. Looking at some of the Dim Sum that walked...\n\n\nMore"], ["Dim Sum Fix on vacation", 5.0, "July 13, 2014", "Mike G", "Santa Rosa Beach, Florida", 63, 23, "Spending 3 nights in DC, we wanted to try food which we like and is not so readily available in our area and Dim Sum is one of them. We really enjoyed our meal here with a nice modern decor, unusual for the normal Chinese restaurant. There were some really interesting choices with a modern twist for Dim Sum explained...\n\n\nMore"], ["Surprisingly Good Food But Not True Dim Sum", 4.0, "July 10, 2014", "mitchrapp47", "Savannah, Georgia", 36, 17, "If you are looking for traditional dim sum with the service carts, this is not your place. This is more like Chinese small plates. Stay away from the Happy Hour offerings and just order off the menu and you won't be disappointed. But the Happy Hour cocktails were a great value!"], ["We love Ping Pong", 4.0, "July 7, 2014", "well-travelled_me", "Brussels", 23, 25, "We love ping pong and always eat here when in DC. There is outside seating and they are open until 11pm. They have a set menu for 1 or 2 people where you can try different dim sum (25$ pp) or you can order a la carte which works out slightly more expensive. To order you mark your choices on...\n\n\nMore"], ["Best dim sum place in dc", 4.0, "June 28, 2014", "DCalexandre", "Washington DC, District of Columbia", 118, 37, "Best and only hong kong style dim sum place in DC.\nA bit on the pricey side which is why I often go for the all you can eat dim sum brunch on the weekends. Can't beat that for $36, but be sure to be hungry. The service is always excellent.\nArea of improvement would be that the last time...\n\n\nMore"], ["An Enjoyable Experience", 4.0, "June 1, 2014", "Paul M", "Washington Dc, District Of Columbia", 1, 0, "We learned from a previous visit to order each dish only after a prior one is finished to space them out."], ["Exceptional food and service!", 5.0, "May 5, 2014", "Andrea S", null, 9, 1, "Enjoyed brunch at Ping Pong Dim Sum, did the special. The food was absolutely marvelous! and the service was exceptional. I very highly recommend this restaurant."], ["Fun bar and very good food", 5.0, "April 29, 2014", "MaryHogan", "Andover, Massachusetts", 89, 62, "We loved the bartender and people watching at this place. Funky, but great cocktails. Try the lemongrass vodka! The dim sum was fun and tasty. Loved the veggie sticky rice and the spicy veggie dumplings."], ["Our first Dim Sum", 4.0, "April 14, 2014", "JohninStPete", "St. Petersburg, Florida", 87, 25, "Neither of us had Dim Sum before so we gave it a whirl. Needed a little help to understand the ordering concept but staff was very helpful. Food was all great, very fresh & tasty. The only danger is that things taste so good that you would want to keep ordering more and that could run into some bucks. Still,...\n\n\nMore"], ["Great for a Party", 5.0, "April 5, 2014", "DrBB", "Newtown, Pennsylvania", 56, 74, "I co-sponsored a party for 45 at Ping Pong. The three-course dinner (each of which was almost a meal in itself) was quite tasty. Although the acoustics were not ideal for speeches and toasts, the divider between our room and the main restaurant muffled the crowd noise enough so that all could be heard.\nYou know when the staff does...\n\n\nMore"], ["ping pong makes for bouncy parties", 4.0, "March 22, 2014", "Lam N", "Singapore, Singapore", 758, 784, "This place is excellent for large events. Hip décor; unusual and very good drinks; the food is not bad and dim sum is most appropriate for sharing at big parties (like tapas). I wouldn't go here if I was craving for dim sum, as the dishes are not the most creative or flavorful, but for big parties it's a great...\n\n\nMore"], ["First stab at Dim Sum....", 5.0, "January 31, 2014", "Jlee73", "Atlanta", 47, 17, "Personally I have never had Dim Sum, but this was certainly the place to try. The menu was quite overwhelming for a newbie, but they do have a sampler meal that takes the guess work out. Now the friend I was with had eaten this style before, and he did help out, but the sampler lunch was the way to...\n\n\nMore"], ["Good Food, Uncomfortable Seats", 3.0, "January 17, 2014", "EuroHoneyMoon2010", "Nashville, Tennessee", 130, 114, "Trendy, easy to walk to, decent prices, very uncomfortable seats. This Dim Sum place is definitely fun and trendy, with a cool atmosphere and decent food, but has the most ridiculous seats.\nAtmosphere: Right off dupont circle, this place is easy to find and you can walk here, which is good because there is no parking anywhere near dupont circle...\n\n\nMore"], ["Try the lunch special's", 4.0, "December 10, 2013", "Donald P", "Pueblo West, Colorado", 84, 31, "If your up for something new and different try Dim Sum luncheon special. The cost is $15.00 per person, but well worth the adventure . The staff was more than friendly in explaining each item on the menu. The meal portions were small compared to other luncheon special but the food was outstanding. The resturant was clean and the atmosphere...\n\n\nMore"], ["Excellent Light Dinner", 4.0, "December 3, 2013", "SylvieR84", "Avignon, France", 97, 51, "We went there for a quick lunch and so it was. Dishes are very well prepared and presented, very tasty too. But, this remains very light no matter how many you choose and in the end on the expensive side depending on the number of dishes selected.\nYet a very satisfactory experience."], ["First time having dim sum", 5.0, "November 24, 2013", "behindeverycloud", "Pittsburgh, Pennsylvania", 54, 27, "So none of us had ever had dim sum before and we just told our waitress that and she was so helpful! She recommended some dishes and they were great. Everything was so tasty and the service was fast. The price was great, too! If this is what dim sum is like everywhere, then I love it!"], ["Creative twist on traditional dim sum", 4.0, "November 12, 2013", "Michele W", "Owings Mills, Maryland", 89, 35, "Ping pong has a hip Asian minimalist interior and a friendly staff. The drink menu takes typical Asian flavors like lychee and pear and pairs them with all types of sake vodka etc. definitely worth a try.\nThe dim is separated by type, ie, grilled, fried, etc. we really liked the beef and spinach and the Korean BBQ. The one...\n\n\nMore"], ["Satisfies the need for a dim sum fix.", 4.0, "October 10, 2013", "shindoni", "Virginia Beach, Virginia", 40, 25, "1 DuPont Circle is actually a very large building a couple of blocks away from DuPont Circle. Get advice on the actual location because you will not find it on DuPont Circle. The restaurant is on the first floor. Dining on the terrace is great in nice weather in the late afternoon. People watching and dog walking are entertaining while...\n\n\nMore"], ["Value and location", 4.0, "September 28, 2013", "TheDiningTraveler", "Washington DC, District of Columbia", 104, 33, "The food at ping pong is not the best dimsum there is, but it is really tasty and they also have a large selection of appetizers. Their cocktails are really yummy, especially the Rose Martini. The location is great, especially in the summertime where you can sit at the terrace."], ["good dim sum option with an impersonal touch", 4.0, "September 15, 2013", "jg325", "WashingtonDC", 489, 320, "Some friends and I went to Ping Pong Dim Sum in Dupont for brunch on Sunday, and overall we felt it was a solid brunch choice with varied dim sum and Asian options.\nWe had a LivingSocial deal for a \"feast,\" so there was plenty of food and we actually didn't look at the menu much since everything is pre-ordered....\n\n\nMore"], ["Very Far From Traditional Dim Sum", 1.0, "August 14, 2013", "Royersford", "Phila, PA", 15, 11, "If you have ever had authentic and love dim sum, this would not be a good choice. This would only be appropriate if you are looking for a fun place to have a drink with friends. Their decor is fun and trendy. We ordered 7-8 varieties to try, but bottom line all of their steamed dumplings were encased in a...\n\n\nMore"], ["Great!", 4.0, "August 6, 2013", "Viajeroconbuengusto", "Washington DC, District of Columbia", 163, 37, "This is a great and different chinese restaurant. Even though I couldn't understand the menu, I decided to try the Prix Fixe Menu and it was good. A little bit rare for me, but it was a good experience. Nice atmosphere and good service."], ["I love this place.", 5.0, "July 30, 2013", "Robert F", "Great Falls, Virginia", 137, 101, "I love Ping Pong Dim Sum. This had to be the third or fourth time this summer we have eaten here. The service is always great although eating inside of the restaurant (rather than on the sidewalk area) is a bit noisy on almost all nights until after 8 PM. We had Chicken and Black Pepper Spring Rolls (A+), Chili...\n\n\nMore"], ["Dim Sum Surprise", 5.0, "July 12, 2013", "AlfaGeek", "Golden, Colorado", 84, 32, "Right in the middle of Washington DC, on DuPont Circle is Ping Pong Dim Sum. Do not even try to park near here! Park elsewhere and come by metro.\nI have only read about Chinese tea houses - historic items I understand - but that tradition is alive and well here. With the tea comes many different snacks. You order...\n\n\nMore"], ["So much potential not enough effort", 3.0, "July 7, 2013", "betsey_MIA", "Chicago, Illinois", 93, 32, "This place Has all the right layout and contemporary design the food and drinks are great but the service sucks … our server looked like she didn't want to be there and the host just the same. ATTENTION management please train your staff. Lots of potential but not enough effort here."], ["good food but not enough of it!", 3.0, "June 17, 2013", "Lynn S", "Cirencester, England", 77, 41, "Food here is very good, but portions are small - had to have a sandwich on the way home! Waiting staff are brilliant, very helpful and really friendly, definitely worth a visit for the drinks and service alone"], ["a fun place to eat", 4.0, "May 28, 2013", "STB424", "Toledo, Ohio", 157, 37, "It's very noisy and crazy in this place, but the food is good. I found the menu confusing and the waitress drowned out by the noise, but the food we had was very good. It's a fun place to go with a group of people if you can handle the atmosphere."], ["Tasty dimsum, great drinks", 5.0, "May 26, 2013", "IshDewyn", "KL, Malaysia", 382, 260, "Ping Pong Dim Sum was me & my colleague's favourite place to unwind after a day at work over a recent business trip. The tiny parcels of pure deliciousness were great as a teatime treat, especially paired with their extremely tasty drinks. Not many dimsum places have good options for vegetarians, but Ping Pong does.\nThe service was pretty excellent...\n\n\nMore"], ["New experience", 4.0, "April 21, 2013", "David E", "New York City, New York", 13, 4, "If you want something different this is the place. They do not rush you. Service is great and all food is cooked immediately and served quickly. We sat, drank,ate, drank again then ate more. Little plates allow you to experiment and if you want more, you order more. If you expect to sit down and have a standard meal of...\n\n\nMore"], ["Not your traditional dim sum place, but interesting.", 3.0, "April 8, 2013", "yyasianguy", "Washington DC, District of Columbia", 30, 15, "This would not be good place if you want to eat real dim sum, but might be interesting if you wanted to experience a different twist on this traditional Chinese cuisine. Please be forewarned because the prices are higher than the traditional Chinese dim sum places, this is not a place that you would go family style… it would cost...\n\n\nMore"], ["Unique place with great Asian \"tapas\"", 4.0, "April 8, 2013", "Laraine322", "Saint Charles, Illinois", 51, 25, "We visited on a Saturday night and were seated immediately. We had our 7 year old son with us and figured we could find some things that he would eat. We were right! After reviewing the menu, I can confidently say that I wanted one of each offering listed. If you are super hungry and a \"meat & potatoes\" type...\n\n\nMore"], ["Just Average...not worth seeking out", 3.0, "October 20, 2012", "brozier", "baltimore", 65, 28, "If you're use to loud clanging steam carts in endless procession, this is not the Dim Sum for you. All food is off the menu. In total, it was about a \"7\", but nothing special. The restaurant has no real spark as an tnterior goes. We did love the seating.\nHowever, the fact they said they would validate parking and...\n\n\nMore"], ["Decent Happy Hour", 3.0, "September 4, 2012", "kljohnston2", "kljohnston2", 7, 3, "This place makes for a great happy hour. Cocktails are $6 and appetizers are $3. Only problem is that the appetizers are small so you have to order about 3 of them just for yourself and there are only 5 options on the Happy Hour menu. Service was decent, but our waiter go annoyed at us after a while. Can't...\n\n\nMore"], ["spin on the dum sum I grew up on", 3.0, "August 28, 2012", "tcgje", "Waterford, VA", 18, 21, "Not your typical dim sum place with carts. Upscale with a creative spin to dim sum. I enjoyed what we ordered. Definitely pricier than what you would spend at an Asian dim sum place. Great for a date night. Would not recommend for kids at all...I have 3 and they wouldn't try very much."], ["Fusion dimsum", 3.0, "August 8, 2012", "OrpheusTexas", "Texas", 153, 100, "This is not your classic crowded Chinatown dimsum place with carts of steaming dumplings and chicken feet being pushed around. It is an upscale fusion (West meets East) interpretation of dimsum catering to a younger trendy crowd. Service is more refined than in your Chinatown version and prices are definitely higher. They have an unlimited dimsum deal for Sunday brunch...\n\n\nMore"], ["Slick interior, expensive", 3.0, "August 6, 2012", "kellyenz", "Washington DC, District of Columbia", 213, 45, "The decor is very slick - the bar area looked nice. Drinks list was good although we just had lemonade. The food was good until the end when our scallops turned up very late and frozen in the middle. It's really pricy for Chinese dim sum - 50$ for 2 for a light lunch. I think I'll try somewhere else."], ["Chinese reboot", 4.0, "July 26, 2012", "Reena B", "Gurnee, Illinois", 19, 6, "The decor is super stylish, very trendy. The atmosphere was young and hip. They had outside dining as well. The waitress was attentive and explained the system of ordering well. The drinks were nice, I had a lychee/ginger drink and my husband had a pineapple/coconut/lime cooler which was yummy. We ordered conservatively as we were not too hungry, which made...\n\n\nMore"], ["New, trendy, but slow food service", 4.0, "June 30, 2012", "johnny3_16", "Australia", 29, 24, "I came here a couple of times - one for dinner and one for drinks. Ping Pong has a wide variety of drinks including a mix of unique cocktails. The black mirror features gave it a cold ambience. The selection of dim sum was comprehensive, tasty and delicately cooked and presented. The prices were high considering they were dim sum,...\n\n\nMore"], ["Decent food but expensive for what you get", 3.0, "June 17, 2012", "katie3182", "katie3182", 20, 26, "We ate at this restaurant with a group of 7. The service was fast and wait staff attentive. The food comes on small plates within minutes of ordering. Some dishes were better than others-- we really liked the chicken puffs and spicy pork dumplings. The food was good, but overpriced. Our bill came to over $500 for a decent but...\n\n\nMore"], ["Ho Hum fusion", 3.0, "May 29, 2012", "Ben T", "Annapolis, Maryland", 8, 2, "I was relatively unimpressed by the pot-stickers, malaysian peanut sauce skewers and lychee cocktail that I had there. They were open around 12:30 am on a Saturday, which was nice.\nFor all the hype, glossy fancy ultra-modern exterior, and pretension; the restaurant fails to deliver. The food doesn't merit the fancy trappings. While adequate I would hardly insist that this...\n\n\nMore"], ["Just weird", 2.0, "April 20, 2012", "honeyclk", "atlanta", 14, 7, "Who operates a chinese, japanese or whatever kind of restaurant this is in America and cant even describe the kind of food on their menu?? The menu is confusing! You dont know what youre ordering, no pictures of how it looks or anything. Then you only get a bite size of whatever random selection you pick. If youre used to...\n\n\nMore"], ["Pleasant experience", 4.0, "March 31, 2012", "jnha", "Sao Paulo", 139, 61, "I found the same kind of exotic and funny place I had found in São Paulo, Brazil. Very reasonably priced menu, with the offering of a an interesting \"healthy\" option, with no fat or fried stuff and excellent savors. The staff was smiling and helpful.\nHighly recommendable."], ["A fun and interesting meal", 4.0, "March 17, 2012", "BethAnnSH123", null, 100, 55, "Six of us shared a whole bunch of dim sum. Everything was unique and we just told the waiter to keep bringing stuff untl we couldn't eat any more. The portions were small and my husband left hungry It was a little loud for my dad and for catching up with old friends but overall we had fun. The lemongrass...\n\n\nMore"], ["Nice setting - interesting dishes - good food presentation", 4.0, "October 30, 2011", "paxa", "Washington DC, District of Columbia", 370, 207, "First thing I want to say about Ping Pong is it’s not much of a Chinese restaurant (which is not necessarily a bad thing since most of the Chinese restaurants in DC are pretty disappointing), and certainly not a traditional Chinese dim sum restaurant, which must be packed, noisy with lots and lots of exotic dishes that you can preview...\n\n\nMore"], ["Yuppified dim sum", 3.0, "October 29, 2011", "Tampann", null, 192, 84, "I know \"yuppy\" is no longer a vogue term but that is what I thought when I stepped into the restaurant. They have taken dim sum and made it rather bland, put excessive \"modern chic\" to it and created Ping Pong. The service was great but the food is disappointing and the prices are even more outrageous. I certainly do...\n\n\nMore"]]], ["Lime Fresh Grill", [["Very good lunch", 4.0, "September 2, 2015", "dsullivan615", "Muldraugh, Kentucky", 65, 29, "My family and I stopped in here while visiting D.C. We were very pleased with the portions and quality of the food. The fresh salsa bar is also a nice touch. This is a solid choice for you if you are in the mood for some Mexican while in the nation's capital."], ["Really Good food", 5.0, "August 20, 2015", "Joe S", "Folsom, NJ", 45, 22, "Reasonably priced and very tasty in a high priced area of DC, salsa bar is fun to try the different taste so. Had the steak and cheese taco they were so good"], ["Good food and price!", 4.0, "May 14, 2015", "Voortmen", "Lelystad, The Netherlands", 118, 37, "Good Mexican food for a reasonable price. Tasty tacos and great quesadillas. Food was great and off course a great atmosphere in the restaurant. Fresh food for a nice price."], ["Poor service and food", 1.0, "March 28, 2015", "Laith Q", null, 2, 0, "Ordered a bacon and avocado quesadilla that had neither bacon not avocado. When I showed the food runner, he insisted that the avocado was already there and finally went back to put on a couple bacon bits that were so black and charred they were unrecognizable as bacon. This is the second time something like this has happened to me."], ["Quick, Tasty TexMex", 4.0, "March 22, 2015", "John C", "Washington DC, District of Columbia", 97, 36, "Great place to stop with you are in chinatown/gallery place. The taco's are great, lots of salsa and their sopapilla's are always fresh.\nIts nice that you can have margarita's and been with your quick meal. If you want a quick mean, try it... you can get chipotle anywhere."], ["Low priced good quality", 4.0, "December 28, 2014", "imdarkside", "Greenville, South Carolina", 265, 130, "Burritos and tacos where rally tasty and not the same old boring Mexican food. Prices about $7. Fish tacos where really tasty. Would return here."], ["Buzzing on hockey nights", 4.0, "November 25, 2014", "Bearsm53", "Umeå", 192, 47, "I came here with a friend to eat and have a few drinks before watching a hockey game at Verizon Center. It's ideally located just a block away from the arena. We arrived around 5 and as the game didn't start until 7 we had plenty of time at our hands.\nThere were a few guests waiting in line to...\n\n\nMore"], ["Fresh, Quick, QIuality, and Well Managed", 5.0, "October 9, 2014", "dsheon", "Washington, DC", 27, 30, "I eat here once a week because it's right next to my office. I'd normally not review a quick serve restaurant, but today something happened that helped me realize why I like this place.\nThe rice in my veggie tacos was not cooked right. I'm not sure if it was hard because it was still partially raw, or because it...\n\n\nMore"], ["Way better than Moe's and Qdoba", 5.0, "October 5, 2014", "Danield528", "Italy", 292, 136, "Same sort of formula as Moe's, Chipotle, Qdoba, Baja Fresh, but they bring the food to your table. Most importantly, though, is that everything tastes fresh and the quality of the ingredients seems to be better than Moe's and Qdoba, for sure. Prices are on par with the others. Portions are generous. The salsa bar has at least 5-6 options...\n\n\nMore"], ["Excellent fast, fresh Mexican", 5.0, "July 28, 2014", "Andrea_P_N", "Chicago suburbs", 27, 19, "We had never heard of Lime Fresh Grill (there are none in Chicago to my knowledge) and we thought we'd give it a try since we love Chipotle and it seemed similar. We thought it was great!!! A little pricier than Chipotle, but chips come with the entrees and there is an amazing fresh salsa bar. I had fish tacos...\n\n\nMore"]]], ["Wisey's", [["A Healthy Place", 4.0, "September 19, 2015", "KBPO", "Plantation", 15, 5, "While visiting DC, we drove to Georgetown looking for lunch, and found the spot.\nGreat for health conscious customers, we are vegetarians, and the menu had salads, smoothies, paninis, natural drinks and juices.\nThey also serve breakfast! We had a Jericho Wrap which was delicious, hummus, veggies, and fetta.\nGreat service, a cafe style with seating by a bay window...\n\n\nMore"], ["Wish I would have known about this place sooner", 4.0, "July 5, 2015", "SophieTheExplorer", "Philadelphia", 41, 43, "Stumbled across this place on Grubhub this morning, and it's a good thing I did. I ordered the steak, egg, and cheese on a bagel, my girlfriend ordered a Caesar salad. Prices were reasonable, no minimum order for delivery, food was fresh and good. Only thing I didn't like is how the delivery driver insisted he didn't have change, guess...\n\n\nMore"], ["Awesome Smoothies", 5.0, "July 3, 2015", "Meghaj17", "Mumbai (Bombay), India", 41, 15, "I had their Oasis smoothie which has bananas, dates and honey -and god was I in heaven! Its supremely creamy and heavenly! Its got the perfect amount of sweetness!\nBest of all the smoothie is sooo filling that I had this around 11:30 and did not feel like eating lunch at all!\nBy DC standards, $5 for a smoothie thats...\n\n\nMore"], ["Never order through a different website like EAT24! The order gets screwed up!!", 5.0, "April 12, 2015", "Jersey D", "Washington DC, District of Columbia", 28, 13, "Order DIRECTLY from Wisey's!\nIf you are trying to get a filling and fulfilling meal here in DC, good luck. But Wisey's never disappoints with respect to the amount of tasty, creative meals and a great price! The only times I have been disappointed, I had used a service like EAT24 who overcharge for delivery and somehow let sharp, tough...\n\n\nMore"], ["good food, great upstairs", 3.0, "February 13, 2015", "localsurf", "Washington DC, District of Columbia", 81, 39, "You go to wisey's if you (a) go to Georgetown University (b) you're walking down the street and you decide to get in anywhere because you are hungry for a quick bite. Wisey's is a low key place. It doesn't really qualify as a restaurant. But they did something good: they opened up a second floor with nice furniture. As...\n\n\nMore"], ["Love Wisey's!", 5.0, "February 9, 2015", "Eas_Bandung", "Jakarta, Indonesia", 83, 46, "Healthy and yet delicious food. I love going to this place whenever I am in DC\nA must try -- Chicken mango salad. Yummy!!"], ["Affordable and Delicious Food", 3.0, "October 29, 2014", "Emanuel C", "Washington DC, District of Columbia", 51, 22, "Considering Wiseys isn't as expensive as some of the other places, they sell food that is really delicious and of high quality. Unfortunately some of the staff there need to learn manners on the telephone and the importance of not double charging a customer who paid online. I still recommend going there to eat but I do not like dealing...\n\n\nMore"], ["A hair in my wrap", 2.0, "August 19, 2014", "MerryDevil", "Washington DC, District of Columbia", 163, 107, "Service was friendly enough, but we ordered before two people who were getting takeout, yet they both got their orders before we got ours for eating in. The food tasted OK, nothing special good or bad. However, when I was about to start eating the second half of my wrap, I discovered a long, light-colored (which is how I could...\n\n\nMore"], ["Not excited", 3.0, "June 18, 2014", "MotorhomingForLife", "Las Vegas, Nevada", 15, 10, "Floor was overly sticky throughout. Hard to eat the Great Date salad with a plastic fork. The crutons on salad are great. Tuna sandwich was okay and filling. Loved that a can of soda was just a dollar. Needed a key for the bathroom just like a big city gas station, gross! I'm sure they never clean the key so...\n\n\nMore"], ["Threatened - never going back", 1.0, "February 16, 2014", "Isaac2014", "Washington DC, District of Columbia", 2, 1, "Had one of the worst experiences I've ever at a restaurant/food establishment of my life, not even joking. I was about 3 seconds from calling the police and charging one of the employees in there with assault & battery.\nI am a Senior at Georgetown who has always ordered from here. I love their food and their timely delivery. Never...\n\n\nMore"], ["First class delly", 4.0, "January 28, 2014", "CharlesSteele28970", "Washington DC, District of Columbia", 31, 15, "This small delly on Wisconsin Avenue offers sandwichees about as good as you can get in a delly. It is very popular and can get quite crowdd at lunch time. Does a big take out service for Georgetowners."], ["Always a great sandwich", 5.0, "December 29, 2013", "HotelDeal", "Washington DC, District of Columbia", 76, 18, "Frequent Wisey's for lunch and it is great! Wide selection of sandwiches and pannini's, etc. Excellent service and value."], ["Best Brunch ever", 5.0, "December 17, 2013", "Delboy118", "Brisbane, Australia", 1, 0, "This is a small unassuming cafe. My family dropped in hoping for a nice sandwich. The prices were great so we ordered omelette, bagels, wraps and pancakes with our coffees. This is the best breakfast I have in had in four weeks tripping around the USA. thanks for a great meal."], ["Best Lunch I've had in a while", 5.0, "June 26, 2013", "SharieN_13", "DeWitt, Michigan", 537, 154, "Small place, I stopped in because I noticed the large amount of people coming in and out of the place. They had a very busy delivery of lunches going on. I had the tuna pannini and it was fantastic, I couldn't finish it as it was a little to big, definitely someplace I could return to."], ["Great little spot for sandwiches & salads in Georgetown", 4.0, "March 16, 2013", "Lolaz007", "Washington, DC", 54, 59, "Wisey's is a great little spot for lunch or a quick bite while visiting Georgetown. Their sandwiches and salads are always fresh and include ingredients like avocado, sprouts, mandarin oranges, etc. Considering Georgetown's prices, the price-quality ratio is pretty good.\nI believe that Wisey's is family run, and I've always had great service. Highly recommend."], ["Fresh and healthy", 5.0, "January 26, 2013", "RKL1", "Washington DC, District of Columbia", 16, 15, "I love this place they deliver and the food is always hot and fresh. They have plenty of fresh and healthy options. The Oreo cookie is the BEST"], ["Tasry wraps, crisp salads, fast service", 4.0, "December 11, 2012", "Henry T", "Washington, DC", 150, 63, "and sandwiches and light drinks. Inventive combinations make for repeat visits that don't disappoint."]]], ["Biergartenhaus", [["Eh...", 3.0, "August 14, 2015", "Rachel L", null, 9, 1, "Not the best place I've ever been.\nPrices are very high for the food you get. The schnitzel was bland & dry. The beer is warm.\nThe outside is awesome though & anyone who goes should absolutely check out the patios & roof! It can get a little loud out there, but it's fun."], ["Great Food and Friendly Staff", 4.0, "July 16, 2015", "RLJ1223", "Raleigh, North Carolina", 4, 2, "My friends and I ended up visiting this spot after learning it was walking distance from our hotel. The bartender working that day, Ariel (sp?) was awesome. He suggested a great beer for me to try and later came back to chat with us about DC and gave us ideas of things to do while we were in town. As...\n\n\nMore"], ["It was okay.", 3.0, "July 5, 2015", "mrlralnc", null, 5, 10, "The beer selection was the saving grace. The establishment itself is dilapidated and looks grungy. I got the impression that they survive off of being the only German place in town. I'm not from DC though so not sure if this is true. The wurst platter was okay; kinda hard to mess up sausages though. The pretzel rolls were fine;...\n\n\nMore"], ["Good beer", 4.0, "July 5, 2015", "Nick C", null, 8, 5, "Good beer and atmosphere, but skip the food. I recommend going across the street for some quick eats, having a few beers here, and heading to dangerously delicious for desert."], ["Cool place to hang out and have a beer", 4.0, "June 10, 2015", "gerdag60", "Washington DC, District of Columbia", 23, 10, "Great atmosphere and awesome selection of German beers! The food is tolerable, but the reason to visit is definitely the selection of beers.Nice, rustic outdoor seating, very energetic crowd. Overall a fun place to hang out."], ["Enjoyable...", 4.0, "June 7, 2015", "Hoyabeth", "Washington, DC", 29, 18, "We've been going here for years and it it's always been a great place for German beer. Very much like a biergarten you'd find in Germany! Food is OK, less so if you're a veggie and/or trying to eat healthy. Overall, a great local place to catch up with friends."], ["Manfred", 5.0, "April 21, 2015", "Manfred E", "Grosse Ile, Michigan", 3, 0, "A little Bavaria away from home.\nGreat people and great atmosphere\nWarren is doing an a great job. the beer was good and the Schweinshaxen is always a treat. It is not as good as in Munich, but still very tasty."], ["Great German Beers on Tap", 3.0, "February 12, 2015", "Holokauahi", "Colorado Springs, Colorado", 213, 92, "Biergartenhaus offers up a \"skeller\" or \"stube\" kind of environment, with heavy wooden tables and benches, and, importantly, a great selection of very good German beers on tap. The food was good, not great, but this may have been due to a skeleton crew on the very, very cold night that I visited. I'd go again just for the beers,...\n\n\nMore"], ["Wide Selection of German Beers", 4.0, "February 10, 2015", "Ross T", "Brooklyn, New York", 82, 7, "Great selection of German beers! If you're a novice beer drinker, the menu will take you awhile to decipher. Ask your neighbor for a recommendation. Sit outside."], ["A Beer Lover's Paradise", 3.0, "November 21, 2014", "Morgan W", "Noblesville, Indiana", 149, 39, "Unfortunately, I'm not a beer lover. The people I was with informed me the beer was good, although overpriced. I had a sweet wine and wurst platter. There were no condiments on the table, including salt, pepper, ketchup. We were not offered water, but instead aske if we wanted more alcohol.\nThe food was bland, unremarkable. Even the hot mustard...\n\n\nMore"], ["What a nice place to fall into!", 4.0, "November 11, 2014", "TimmyOT", "Washington DC, District of Columbia", 67, 63, "I have been here perhaps ten or more times. No great expectations other than good food, great beer, and a really nice outdoor setting. Nothing fancy, just really comfortable. The pork shank is a must, the wursts are good, and everything else is just pleasantly pleasing. Come here - you won't be disappointed and you too shall return. Prosit!"], ["Great atmosphere, food could be better", 3.0, "September 28, 2014", "Ryan1887", null, 34, 11, "This should really be two reviews one for the atmosphere and beer and the other for the food. I have been to the Biergartenhaus many times and I like the atmosphere and their beer selections.\nThe food has been hit and miss for some time now. When I started going here several years ago the food was great but the...\n\n\nMore"], ["Great Atmosphere", 4.0, "September 8, 2014", "makurcz", null, 5, 2, "My friends and I had a very good time here last month. We sat outside, listened to a couple play German music, and enjoyed some good food and beer. I had a wurst platter and some pretzel rolls which was very good as well as the service. I recommend getting a taxi to and from here."], ["Fun and different place to have a beer or two", 4.0, "August 28, 2014", "Decoamie", "Washington, DC", 282, 136, "DC is getting more into beer and places to taste and drink it. This place specializes in, as you might imagine, German beers and food. I was there with a friend for beers and evening snacks. We arrived at happy hour (4-7) so there was a decent selection of $5 brews (half liter.) The music was kitschy German and the...\n\n\nMore"], ["Overpriced. $10 beer.", 2.0, "August 1, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "Nice patio. Very large seating area, good for groups. Although is overpriced, we paid almost $10 for one beer that was just a beer.\nWelcoming staff.\nIt's hard to find parking in this area."], ["Great spot for beer and food with friends!", 4.0, "May 31, 2014", "donnabaru", "Indialantic, FL", 57, 40, "We had a great time at the Biergartenhaus on a recent \"girls weekend\" to DC. Casual, outdoor seating, good beer. We had dinner reservations down the road so decided to have a couple beers and apps before heading out. Had the \"loaded fries\" (goat cheese, green onion, bacon and curry ketchup) they were sinfully good! The spatzle wth goat cheese...\n\n\nMore"], ["Great food!! WOW!", 5.0, "April 14, 2014", "Rudyfs2", null, 138, 35, "Found this place online and being German we gave it a try. The Pork Shank was incredible. The glaze and gravy were delicious and the meat fell off the bone. We also had the Jaeger Schnitzel and while the schnitzel itself was very-very good, the toppings were sparse but flavorful. Nice atmosphere outside and very good bier! Needs some mood...\n\n\nMore"], ["Incredible beer and sausages.", 5.0, "December 19, 2013", "fenchurch128", "Boston, Massachusetts", 182, 83, "If you're a German beer fan, don't miss this place, one of the best places to drink on H Street-- and that's saying something! Terrific Germany potato salad and sausages too. We could have stayed all night, though we would have had to waddle out."], ["Where I start at on h st", 5.0, "October 30, 2013", "Max W", "Arlington, Virginia", 1, 0, "When ever I start a night out or have dinner on H st, my first stop is biergartenhaus. I love the outdoor seating even if it rains as they have huge covers. Little known secret is there amazing brunch."], ["Good Food, Great Beer, Great Atmosphere", 5.0, "September 3, 2013", "Greg L", "Gaithersburg, Maryland", 39, 14, "My wife and I have been to Munich and we loved the biergartens and wished that they had something similar back home.\nIn comes Biergartenhaus. This place is just like a biergarten in Munich. The beer is great, the food is good. We got the pretzel bun burger and it was very good. My wife was not much of a...\n\n\nMore"], ["Fun place for beer and food", 4.0, "August 20, 2013", "Saacha M", "Washington DC, District of Columbia", 19, 6, "Go during happy hour for the best deals. Nothing is better than enjoying a cold beer on a warm day and this place has a variety of German beers to satisfy any one."], ["Great Beer and Summertime Backyard Seating", 5.0, "June 13, 2013", "Travis B", "Washington, DC", 36, 22, "You'll be impressed by their beer selection. The outdoor seating in the back yard as well as on the roof is ideal for cool spring/summer evenings. Haven't eaten here, but I hear it's good."], ["brattingly good", 4.0, "June 1, 2013", "DCsunseeker", "Washington, DC", 91, 48, "Nice selection of German beers on tap. You can never go wrong with a Dunkl.\nFood was must higher quality than we expected, and the service was quick and attentive. Pretzel rolls with hot mustard could just be an entree...\nSeating in the second of four dining areas was not very comfortable, but the place is so popular we had...\n\n\nMore"], ["Delightful taste of Munich in revamped section of Northeast DC", 4.0, "May 28, 2013", "schobalt", "Washington DC, District of Columbia", 46, 26, "I'd recently returned from Munich and was in the mood for some Deutsch Küche, so I invited some friends to visit the place after browsing their website. After having some of their delicious schwienshanxn and a maß or two of Kostritzer schwarzbier under the trees of the outdoor courtyard patio while listening to oompa music, I was hooked. Now easily...\n\n\nMore"], ["European Flair with great service and food!", 5.0, "May 28, 2013", "akaroami", "Royal Oak, Michigan", 7, 0, "What a surprise after walking thru the bar and finding the huge outdoor patio with hand crafted Lithuanian picnic tables and a buzz of happy people with beers in their hands. Ordered the pork shank dinner and it was just like what I had in Lithuania some years back. The side dish of red cabbage and schnietzel was great as...\n\n\nMore"], ["great service, great beer", 5.0, "May 20, 2013", "JodieE3", "Fort Wayne, Indiana", 58, 20, "The outdoor patio is a must. The inside seems like a small typical, nothing special bar then you step outside and you realize why this place is amazing! We had the pretzels with cheese and spicy mustard and a few steins of beer and it was all delicious."], ["A cute little place", 4.0, "May 10, 2013", "Randi J", "Kennesaw, Georgia", 30, 4, "This was one of my favorite places we ate in DC. It had a real homey feel and you could tell that the people that were at the bar that night were regulars. I'm not a big beer drinker, so the waiter picked one out for me (which I didn't care for, but that's ok) but my boyfriend enjoyed trying...\n\n\nMore"], ["German beer - pleasant setting", 3.0, "April 9, 2013", "BlueHenLaxAlum", "New York City, New York", 18, 13, "If you want a German beer outside on a nice spring day, visit this place. The crowd is mostly early 20's professionals and no problem. My only complaint was that they micro manage the outside crowd and keep it limited to those with seats. It was a 45 minute wait to get outside, but the beer was just as tasty...\n\n\nMore"], ["Great times! Ziggy is hilarious.", 5.0, "February 22, 2013", "smurfette38105", "smurfette38105", 21, 6, "A good friend told me about this place, and I am so glad I checked it out. Bartender Ziggy had us cracking up with laughter while we had some tasty beers, pretzels, and dessert. I had two rounds of the Weihenstephaner Hefe-Weizen, and it was de-lish! Both desserts, Fresh Fruit Streusel and Schwarzwälder Kirschtorte were so good!"], ["Bavarian Disneyland on Capitol Hill", 3.0, "January 22, 2013", "plagist", "Washington DC", 50, 116, "This is an eclectic place with four distinct seating areas (old-fashioned bar on two levels, covered terrace with fire place, outside beer garden, wooden deck on top of the building), large TV screens showing random sports events, a bizarre selection of German-language music, and an idiosyncratic German-American menu. The food is a parody of German cuisine, but it can be...\n\n\nMore"], ["Pleasant Surprise", 4.0, "January 17, 2013", "1LarryFox", "Woodbridge, Virginia", 106, 30, "I visited this resturant because of a Groupon--truly it was a pleasant surprise. The neighborhood is attempting a comeback but is still a bit rundown. Inside, the bar is just a bar (nondescript but could eat there if you wanted), the dinning room is comfortable, and the outside does resemble the set-up of a beer garden. Our waitress was well...\n\n\nMore"], ["Nice German Bar, would like to visit in the Summer", 4.0, "January 3, 2013", "douglas r", "west newton", 53, 19, "We watched a couple football games this past sunday here. It has a bar in the front and then a part outside bar in the back. They had plastic down and heaters going. They had what you would expect for a German Beer Garden, plenty of german beers and many steins for the beer to go in. The menu was...\n\n\nMore"], ["As a bar, it's great. As a restaurant, it's acceptable.", 4.0, "December 17, 2012", "RichDC87", "Washington DC, District of Columbia", 95, 28, "Don't go for the food, as someone who likes central European fare I would say that most options are fairly mediocre. That said, this is a very fun bar; they have a great selection of beers and pretty cool atmosphere. I love sitting outside under the heatlamps when it's cold with a massive stein..."], ["Not fancy, but a German food is a great alternative to American Francise", 3.0, "October 21, 2012", "NoFranchisesAloud", "Dulles, Virginia", 93, 42, "I went here despite mixed reviews. I was looking for something close to the Pennsylvania German food I grew up with, and an Oktoberfest kind of day! I got what I was looking for! First the food, I had the Wienerschnitzel, it was basic, but classic and I liked it because it was not drowned in melted butter like some...\n\n\nMore"], ["Wunderbar!!", 4.0, "September 30, 2012", "Minutemen10", "Arlington, Virginia", 180, 55, "I went here the other night for oktoberfest and the place was really good. The beer selection was great plus you can get a liter of beer. The pretzels were good and the atmosphere was great."], ["Non Alcoholic Beer and its beer garden does it for me!", 3.0, "August 12, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "H Street is one of my favourite Friday night and Saturday hangout. Since the weather was rather mild by comparasion to most of the very hot night in DC, I ventured into this German beer garden and sit outside. The atmosphere is rather nice and lively. There is a big beer garden at the back, and there is a deck...\n\n\nMore"], ["Really a loud sports bar with German beers", 2.0, "May 2, 2012", "jdl50cc", "Huntington Woods, Michigan", 43, 37, "Of the half-dozen places beer-oriented restaurants we visited in DC this week, this was the least satisfying. one. We love German biergartens because of the conviviality. atmosphere, and lack of loud television sets. Germans are under this strange impression that people can actually talk to each other without the need for a television set to provide entertainment. This place was...\n\n\nMore"], ["It could be so good...", 2.0, "April 23, 2012", "Cirrus_Av8tor", "Washington, DC", 15, 11, "Unless you're a friend of the manager/owner, expect a 2hr wait on a nice day during the weekend. Once you're seated, you'll look around and see numerous tables open...which makes you wonder why they aren't using all available tables. This place is poorly managed and it shows immediately. People wonder in without waiting and just sit down, the wait staff...\n\n\nMore"], ["Borderline average - very unlikely to go back", 3.0, "April 1, 2012", "OrionSouthEngland", "Wiltshire, United Kingdom", 60, 55, "We popped in for lunch. There was a very restricted lunch menu and to cap it all, the waitress then went on to point out at least 2 options and some beers that weren't available! Overall, apart from the herring on the fish appetiser dish and the Laugenbrezen, the food was rather disappointing. Despite some beer options being unavailable, there...\n\n\nMore"], ["Big Disappointment", 2.0, "November 10, 2011", "Lynn60726", "McLean, Virginia", 105, 30, "This is really a bar. I brought my family, including preschool grandsons, because we were assured on the phone of oom pah pah music, Oktoberfest musicians and good German food. The food was actually good, but the atmosphere was young adult bar scene and the music was strictly top 40s. It was very, very crowded and very, very noisy. I...\n\n\nMore"]]], ["Subway", [["Fast and vegetarian option", 5.0, "September 20, 2015", "Islenrd", "Santo Domingo, Dominican Republic", 25, 1, "It was a quick stop and there it was Subway...cheap, clean and fast food. They have vegetarian options too."], ["Perfect for a quick lunch.", 5.0, "October 29, 2014", "juergfrombern", "Bern", 31, 24, "Awesome Philly cheese steak. Fast service. Free WiFi. Clean room with clean air. Perfect for a break while strolling through the city."]]], ["Redline Gastrolounge & Bar", [["Cool Sports Bar", 3.0, "September 29, 2015", "Live_your_experience", null, 168, 38, "Was surprised to see the place almost empty on Sunday night during an NFL game. The coolest thing were the \"Table Taps\". Wings were ok, and the chicken nachos were good. Might be funner if there was a game going on at the Verizon center."], ["Busy place to watch a game", 3.0, "September 18, 2015", "minesbigger", "California", 41, 11, "Sportsbar and pub, with hookahs on the patio! I stopped for a drink during happy hour. Very relaxed atmosphere and decent prices. I didn't get a chance to order any food, but the prices looked decent."], ["Great gastropub near Verizon!", 4.0, "September 2, 2015", "butta1898", "Richmond, Virginia", 43, 23, "Wandered into this place after a Mystics game and looking for a cold inexpensive beer and food. The sweet hookah aroma from the front patio kinda swoons you and pulls you in. Traveled up the steps to the bar (bouncers shouldn't assume that you know where you're going, help me out!). We pass all these tables with taps built into...\n\n\nMore"], ["Great Happy Hour", 5.0, "July 27, 2015", "Philip S", "Baltimore, Maryland", 12, 1, "We stopped in randomly for dinner. The atmosphere here is great. It's very clean and inviting.\nI ended up ordering from the happy hour menu that they have from 4-7 on weekdays. They have a great selection of appetizers for $5 and pizzas or a burger for $7.\nI went with the BBQ Wrings, and they have the option of...\n\n\nMore"], ["Pregame before caps", 3.0, "February 21, 2015", "Dana B", "Reston, Virginia", 44, 18, "We got lunch here before the caps game. We reserved one of the tables with the taps. It might make sense to just buy your own beer instead of the taps. But it is a fun concept. The food was okay, our serve seemed like he was hung over from the night before, moving really slow. The pizza was really...\n\n\nMore"], ["Great Food & Hockey", 4.0, "January 6, 2015", "djmattman", "Johnson City, Tennessee", 28, 8, "Steps from the Verizon Center, this is a great spot for food and drinks before or after A Capitals hockey game. TV's everywhere, and the staff is very accommodating for the views of it many patrons. We wen't there to watch the World Junior Hockey Championship between Canada and Russia; not many were too interested in DC, as you can...\n\n\nMore"], ["No hockey game", 3.0, "January 4, 2015", "Openfj0re", null, 150, 36, "We wanted to see the caps game being played across the street at the verizon centre, but they only had NFL playing. They changed one TV for us which was nice, but still not volume. Beer specials were okay, and food was okay, but there are better sports bars"], ["Great spot for a late night dinner or drinks", 5.0, "December 18, 2014", "Drew S", "Morgantown, West Virginia, United States", 24, 4, "We stopped here after a Wizards game since it is right across the street. There was a DJ playing great songs that got many people up from their tables to dance in the open areas, and the food was great. Highly recommend for the younger crowds."], ["Good not great", 4.0, "November 11, 2014", "CopleySteeler", null, 22, 5, "Maybe would hhave been better if my Steelers beat the lowly Jets. The lobster mac and cheese was delicious, the bruschetta was average, the guacamole was too lime-y, and my Steelers lost. So take my unbiased review for what it's worth."], ["Could take it or leave it.", 3.0, "October 29, 2014", "Alisia A", "Cleveland, Ohio", 92, 59, "A group of us stopped in for brunch on a Sunday and this place a take it or leave it kind of place. It's cute that you can sit outside but it was too chilly for that. The decor inside was really interesting, I really enjoyed the atmosphere and decor.\nAs far as the food, it was kind of bland....\n\n\nMore"], ["Good Food but Lousy Service", 3.0, "October 23, 2014", "Zebra11", "Whitehall, PA", 83, 47, "The food was really good and the atmosphere was lively. Great decor, but very loud and busy crowd. The service was very slow and one of orders was incorrect. As a result, one of us ate while the other watched. The table beside us had a similar problem. We most likely will not go back. Not worth the price for...\n\n\nMore"], ["Great find", 4.0, "October 21, 2014", "OldSalt2007", null, 18, 5, "Was staying at the Washington Hotel and asked staff for a good place to eat, have a beer and watch the game. They recommended this locale and I am very glad that I took their advice."], ["Nice Staff - Good Drinks - Feels like a bar", 3.0, "September 14, 2014", "Ratboy859", "Lowell, North Carolina", 130, 37, "Stopped by to catch up with a friend. The staff was very friendly and attentive to our requests. We sat, chatted and drank. I ordered up an appetizer of Salsa Chips and Guacamole. The 'guac' was a little too spicy for my friend. I didn't mind it. However, the chips seemed to come right out of the bag. Not a...\n\n\nMore"], ["Attention to raw food please!!!", 3.0, "August 22, 2014", "cecil t", "Frederick, Maryland", 107, 19, "The place had a feel of a bar and is very close to the Verizon Center. The food was okay but I felt that the chauffing dish they used was not very convenient. Although the service was good they need to pay attention to raw food that was unattended because i saw some flies around the food. They have a...\n\n\nMore"], ["Great people watching spot.", 4.0, "July 6, 2014", "EveryDaveDude", "Eureka Springs, Arkansas", 6, 0, "We stopped by early afternoon for a couple of beers and appetizers. Service was a little slow but we enjoyed it. A lot of people passing by and a great trio of musicians playing on the corner."], ["Great Stop - Reservations weren't needed for Saturday Lunch", 4.0, "June 6, 2014", "Mark Andy R", "Falling Waters, West Virginia, United States", 32, 9, "This was a great place that we discovered while trying to avoid Panera and Fuddruckers.\nIt was close to the Redline stop on Metro right by Verizon Center. The food was great and waiter was attentive. I would love to try and go back on an evening out so that I could try out the self serve beer taps. It...\n\n\nMore"], ["Dinner was oke", 3.0, "June 4, 2014", "Wim C", "Beilen, The Netherlands", 32, 12, "The quality of diner was ok with the redline. Although the french gries where to big to be complete done that\"s why They where parly raw. The pizza was nice. The atmosphere was nice And outsider was ok."], ["Good food - lots of it", 4.0, "May 9, 2014", "David L", "Austin, Texas, United States", 36, 17, "We ate here for a business lunch on a Thursday. We were seated immediately and the hostess and waitress were both very friendly. I had the Cajun macaroni and cheese which was AMAZING, followed by the pulled pork sandwich, which was very good. As I mentioned, the service was very good and the food was as well - one word...\n\n\nMore"], ["Go Upstairs for the game", 4.0, "May 7, 2014", "Coachlong2xaa", "Chicago, Illinois", 30, 16, "This place is great for a number of activities, you just need to know where to go. When I went online I found the place to be great for sports and grabbing a bite to eat. When we got there, I missed that it's a Hookah Lounge on the first level, and you have to know to go in and...\n\n\nMore"], ["Great Fun with Family", 5.0, "January 1, 2014", "Pamala H", "Knoxville, Tennessee", 107, 45, "We had a great time early New Year's Eve night at this spot next to the Verizon Center. We arrived at 6pm and there were very few people there but the staff was very busy setting up for the 9pm party. This was an upscale sports bar and was perfect for kids in the early evening. The tater tots with...\n\n\nMore"], ["Nice Sports Bar!", 5.0, "December 30, 2013", "Nakia J", "Philadelphia, Pennsylvania", 8, 12, "Though I am not a big sports fan, I loved the atmosphere here. My boyfriend wanted to watch the Eagles vs Cowboys game and I wanted to eat. This was a good compromise because the bar is somewhat upscale. Definitely a good choice in DC."], ["Not a sports restaurant fan, but the food was good", 4.0, "November 22, 2013", "higheredteach", "Arkansas", 57, 20, "We ended up in this restaurant because we were starving and it was late. We loved the look of the beer on tap on our table, but didn't use it. Everyone liked their food, it was better than I expected. I had the steak burrito and it was quite good. Very thick, spicy and satisfying. It was extremely loud so...\n\n\nMore"], ["Depends when you go", 4.0, "October 2, 2013", "saibot", "Mooresville, North Carolina", 173, 95, "I went here with a business associate for lunch, & really enjoyed it. Service was prompt, the atmosphere was nice & the food was good. So I decided to come back with family for dinner last Saturday, going early of course. Wow, what a difference. This place should have \"sports bar\" in the name, as that's what it definitely is....\n\n\nMore"], ["SLOW SLOW SLOW SLOW SLOW SERVICE!!!!!!", 4.0, "September 27, 2013", "Chris W", "Washington DC, District of Columbia", 76, 15, "Excellent happy hour specials, hot food, reasonable price, great atmosphere and seating!!! Slow Slow Slow Slow Slow Slow Service. They need to hire more experiences staff members to serve tables. I agree with another reviewer who said \"If this place were self-serve, it would be excellent!\"\nSitting outside for happy hour was great. The first waitress apologized for the slow...\n\n\nMore"], ["Ok if you're serving yourself", 2.0, "September 21, 2013", "Scott C", "Rockville, Maryland", 3, 0, "This bar was not prepared for several events going on today. There were a few football games, a bar crawl, and a Nationals game. They ran out of octoberfest beer, had extremely slow service, and failed to clean off tables. Good luck if you're coming to this business to get any kind of service."], ["good place with wrong service", 3.0, "August 9, 2013", "ctizzle88", null, 4, 3, "the place have a very hip and fun atmosphere!!! good happy hour menu. good food selection.\nservice wasnt bad. server is not educated about the menus and no knowledge of the food."], ["sports bar", 4.0, "June 24, 2013", "Ritacain", "Boston, Massachusetts", 53, 19, "What I disliked was the shoddy service. The waitress neglected taking away dirty plates and showing up with our drinks. What I liked: great TV viewing of the Stanley cup finals and the BEST burger I have ever had!"], ["Love the food at this place.", 5.0, "May 24, 2013", "MackFisher", null, 47, 16, "Stopped by to have dinner with friends yesterday. Tried the steak and peppers burrito and it was delicious. The Peruvian chicken skewers were a very tasty starter too. I have always enjoyed the food here includind the quesadillas, burgers, and wings. Might be a little pricy but has a nice atmosphere and the food is worth it in my opinion."], ["Patio dining is divine", 5.0, "May 7, 2013", "finestbob", "Minneapolis, Minnesota", 80, 22, "After a stop at the Spy Museum, we made the short walk to Redline. While the food was enticing, eating outside was divine. Service was slow, but the fish tacos were awesome. it's a great place to eat along the many restaurants on 7th street. Highly recommended."], ["After the Caps Game!", 4.0, "May 7, 2013", "DB2499", null, 21, 5, "A great spot across the street from the Verizon Center. Seating outdoors and upstairs provided different options. Good prices on food and drinks."], ["Great alternative to the \"other\" Penn Quarter sports bars", 5.0, "April 28, 2013", "HobieMeow", "Alexandria, Virginia", 28, 30, "This is a great pregame place to go that's right across the street from Verizon Center. We ate at the bar and the food and service were excellent. The tap tables look like they would be awesome for Sunday football fun. Lots of TVs and very nice decor. It is very dark in the bar area though, even during the...\n\n\nMore"], ["Not so good", 3.0, "April 16, 2013", "JuliaArenaMiller", "Tampa, Florida", 127, 24, "They may have the biggest TV screen in DC but it is old, and blurry. the place is dirty and probably best just for late night excursions with lots of fried foods. I would rather go to The President's Club at the Rennaisance downthe road if I want to watch any type of sports."], ["Awesome", 5.0, "April 11, 2013", "00dirtfan", null, 1, 0, "Ate here before a caps game. Was excellent all around. Would definitely come back.\nGreat sports bar only steps from the arena. Good value and portions for the price. Taps built into some tables with a meter, pay as you go, no waiting. Waitress friendly and attentive without being bothersome. Was noisy, but expected that an hour before an event...\n\n\nMore"], ["Make your reservation!", 4.0, "March 23, 2013", "Jayhawk17", "Northville, Michigan", 381, 111, "A fun place to join friends to watch your favorite teams play. Tap is built right into the table so you can enjoy as much of your favorite brew as you like at your own pace without having to wait for your server - which at times can be a verrryyyy lloooonnnngggg wait. Food was okay bar food, nothing spectacular...\n\n\nMore"], ["Late Night", 4.0, "January 21, 2013", "Shards", "Virginia", 42, 20, "We didn't go here for food, but had reserved a booth for a birthday party. The booths at Redline have beer taps built into the table, so you can pour your own beers - one of the reasons we chose this place for my birthday. Sadly, one of our taps was broken, and the manager immediately gave us a complimentary...\n\n\nMore"], ["Cool ambiance, average everything else.", 3.0, "January 11, 2013", "ashbarlen", "Baton Rouge, Louisiana", 32, 14, "Visited this place on the recommendation of friends. It's really striking both inside and out, but crazy loud inside. Food was good, just not great, and a little random (everything from Peruvian chicken skewers to tater tots). All in all, a fun place to have a drink with a big group, but I don't know that I'd come back."], ["Great place for weekday lunch", 4.0, "September 25, 2012", "JennaW703", "Burke, Virginia", 80, 7, "My coworkers have gone there twice for lunch. The food is good and good service. The price for the portion size is excellent. It is not very well-known so it is easy to get into at lunch (or currently is until people read this review)."], ["Great for Private Party", 5.0, "August 24, 2012", "jasonpic", "Washington DC, District of Columbia", 52, 13, "Some friends and I attended a going away. Not bad private party area. Reasonable drinks. I recommend for groups. Food looked good (didn't try it though)."], ["Redline is great !!", 4.0, "July 30, 2012", "AlohaTraveler17", "Orlando, Florida", 137, 70, "This place was recommended by an Airline Pilot -said 'you can't go wrong.\" The place is upstairs - open, comfortable, plenty of big screen TV's for whatever your sport. Some tables have table taps - great for beers with the guys. The menu has a wide variety of food -- what I had was great! Staff was friendly, efficient and...\n\n\nMore"]]]]