[["The Supreme Court Cafeteria", [["Quick Service -- OK Food!!", 4.0, "October 11, 2015", "Dr Tim T", "Sarasota, Florida", 134, 44, "Good place for a quick sandwich and chips!! Also offered a few select desserts!! We had a turkey sandwich on jalapeño bread -- large enough to share!!"], ["GREAT place for lunch!", 4.0, "October 10, 2015", "Cara W", "Minneapolis, Minnesota", 27, 6, "I can't believe I'm giving a Cafeteria a 4 star rating, but to be honest, my meal here of rotisserie chicken was one of my favorite during my visit to the DC area. The chicken was moist, the mashed potatoes and gravy tasty, and the Mac and Cheese, had a nice toasted covering of melted cheese. The lemon cake was...\n\n\nMore"], ["Good lunch spot!", 4.0, "October 8, 2015", "Ruth S", "Bellevue, Washington", 130, 24, "While touring the Supreme Court, we followed the good smells into the cafeteria and decided to have lunch there. Probably a good day to do it since court wasn't in session. We were pleased with their menu choices and enjoyed it very much."], ["Get off the mall and try it.", 4.0, "September 20, 2015", "TsaLaGi", "Tulsa, Oklahoma", 25, 6, "An unexpected treat while in DC. I was there in Mid September, and even at noon, it was not busy. As a matter of fact, it was me, a guard, and a staff member. The food was great and affordable. Do yourself a favor and try it."], ["Must See Building with Great Cafeteria", 5.0, "September 2, 2015", "bagnato1", "Olney, Maryland", 431, 115, "One of the best government cafeteria experiences in DC. In a very fascinating building. There are a lot of food choices, including custom-made deli sandwiches and a very good hot food line with a constantly changing menu. The salad bar is fresh. The seating area is ample. And quite a mix of people, especially on argument days. Can't miss."], ["Pleasant Surprise", 4.0, "August 14, 2015", "Mathyew", "Madison, Wisconsin", 140, 122, "I just happened to be at the Supreme Court around lunch and was hungry. I decided to eat there and was pleasantly surprised by how good the food was and also how nice the cafeteria is. I'd certainly eat there again."], ["Slightly off the beaten track for food", 3.0, "August 4, 2015", "LEPCT", "Washington DC, District of Columbia", 38, 6, "Fun for the novelty, but the food was so-so. It's a relatively small facility, but not as busy as some of the other Capitol Hill cafeterias"], ["Where's my grilled cheese", 2.0, "June 3, 2015", "MFred", "Washington DC, District of Columbia", 41, 27, "It took 25 minutes to get a hot dog. I should've just got one off the street. There was only 1 guy working the cafeteria which was unfair for him since more staff were in the back within view not helping him during lunch hour."], ["Not as good as expected", 3.0, "April 18, 2015", "Jerrie B", null, 19, 3, "So, it is a cafeteria.\nI had hoped for more as I generally agree with the reviews of restaurants that we select based on past reviews.\nThe reviews that caused us to visit were definitely over hyped!\nThe food wasn't bad at all. The price was good for Washington DC but just a little high for a cafeteria.\nI won't...\n\n\nMore"], ["Good food", 4.0, "April 13, 2015", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "This cafeteria has lots of good options, especially for a government building. Since you can't take food or drink into government buildings, it's important to know where you can get food!"], ["Awful awful awful", 1.0, "April 10, 2015", "UK_Lab_5105", "London, UK", 21, 18, "Queued for ages behind three guys just wanting a sandwich each. Eventually asked for a burger and was directed by a very sullen woman, to a keep-warm thing, where one, sad-looking, pathetic burger sat. Picked up some other things too. All really unpleasant and quite expensive. Avoid."], ["Intimate institutional food but you never know who will be sitting next to you", 3.0, "February 20, 2015", "legaleagledc", "DC", 42, 5, "The charm of this cafeteria is not the food, which is adequate institutional food, but the chance to be sitting next to a Justice or a famous lawyer."], ["Not supreme food!", 3.0, "January 23, 2015", "Andy R", "Chicago, Illinois", 50, 19, "This was basic and limited cafeteria food at best. I was very impressed with the building itself and the gift shop (located immediately across from the cafeteria) was lovely as well but the cafeteria was just OK. Considering the grand surroundings and the historical nature of the location I was a bit surprised that this wasn't a bit more elegant...\n\n\nMore"], ["A SUPRISING TREAT!", 5.0, "December 2, 2014", "ewhite0640", "Oak Park, Illinois", 77, 35, "A rather unknown smallish but wonderful in prices and foods. This is a place to rest after the the heaviness of the building above. It has the soup to nuts completeness that is very unexpected in this corner of the Mall. Lower prices than the Capitol. Note it!"], ["Nice place to relax", 4.0, "September 29, 2014", "BlueAsh1956", "Cincinnati, Ohio", 8, 3, "This was a nice place to relax after our tour of the Supreme Court. The coffee and food is good, but the atmosphere is the best. We've been there twice and are still hoping to see one of the Justices."], ["Quiet break during busy day", 4.0, "July 29, 2014", "Alicia L", "St. Johns, Florida", 5, 3, "For our family, just having a quiet, uncrowded, cool spot to sit and regroup was worth so much. (In the museum cafes we found wall to wall people.) We combined the Supreme Court with a tour of the Capital. Wasn't sure of what we would find at the court, but so glad we stopped in. Don't skip the banana bread...\n\n\nMore"], ["Lovely, especially for Supreme Court fans like us", 5.0, "June 23, 2014", "StellaPilar", "Buenos Aires, Argentina", 247, 120, "To have the chance to eat just a few feet from law clerks, and surrounded by Supreme Court litigating lawyers is not something you may experience every day. The food is good, the variety, large, and the prices are more than reasonable. The place is quiet, and the personnel is well mannered. We have been coming here once or twice...\n\n\nMore"], ["Hidden gem", 4.0, "June 1, 2014", "StLouisMom3", "St. Louis", 109, 71, "I stumbled on reviews of this cafeteria while looking for reviews of the Supreme Court as an attraction and immediately made plans to have lunch here the following day while we were visiting Capitol Hill. After having lunch at one of the Smithsonians the previous day, the Supreme Court cafeteria was a welcome find. The food was more reasonably priced,...\n\n\nMore"], ["Best food option in the area for tourists", 4.0, "May 15, 2014", "Bradley_T9L", "Vail, AZ", 23, 9, "Like any DC location you have to go through security to get there. But the cafeteria at the Supreme Court is open later in the afternoon. They have the usual burgers but they also offer entrees and vegetable options once you get past the burger area. Food has been good whenever I have been here and it is a great...\n\n\nMore"], ["Very Good Value", 5.0, "April 14, 2014", "West90", null, 18, 6, "No crowds, good basic food and less than $20 for a family of four breakfast. We were the only people in the cafeteria. Great stop for a quick breakfast."], ["wide selection", 5.0, "August 19, 2013", "citytiger98", "Orange County", 16, 19, "I picked a sandwich. My daughter chose rice, chicken and green beans while my son tried pho. We had bought hot dog and sandwiches from the food stand in the National Mall area. We like the supreme court cafe a lot better."], ["Perfect lunch stop during tour of Capital area", 4.0, "July 28, 2013", "PsychMike71", null, 50, 14, "Cafeteria with a non traditional cafeteria menu. Good soups, salads, sandwiches, entrees including Thai stir fry, and sides. Prices were affordable. Dining room was clean."], ["Nice place, not crowded..", 4.0, "July 25, 2013", "creeker000", "Scottsdale, Arizona", 130, 105, "I knew about this from looking online and had planned for our group to have lunch here. It worked, there is a great selection for everyone. Pizza, hot foods, and a salad bar are the norms but, as you walk in there will be a huge line at the deli sandwich counter. Why is that you asked? I will tell...\n\n\nMore"], ["We stumbled on this and glad we did", 4.0, "July 22, 2013", "Vacationnthree", null, 77, 44, "After our tour we went to the gift shop and noticed the café... We thought it may have been just for people that work there but it is open to the public. The food is good and VERY reasonably priced. It was nice to be able to sit and relax on a very hot day."], ["Best place to eat", 5.0, "May 9, 2013", "werehappytotravel", "chester", 15, 14, "The Supreme Court Cafeteria is a great place to eat. We live in DC and frequent the museums and attractions several times a week. We have found the best food at the most reasonable prices can be found at this intimate, clean, well-appointed cafe. The chefs work very hard to create flavorful dishes. The salad are complex, the hot meals...\n\n\nMore"], ["Quick Place to Eat", 4.0, "May 2, 2013", "Minnpink", "Maplewood, Minnesota", 100, 45, "This is a nice place to eat that was a little less crowded than some of the other cafeterias in the mall area. The food was much the same as the other cafeterias on the mall. It was a little expensive but good."], ["A wonderful experience!", 5.0, "January 23, 2013", "Kolman879", null, 6, 2, "I went to supreme court for visiting. I was about to leave when I found this cafe, the staff were friendly, food was good and price was unbeatable.... I definitely recommend this!"], ["A hidden gem", 5.0, "December 11, 2012", "Dedede", "NY", 14, 12, "After hours of walking and museuming, this cafeteria in the basement of the Supreme Cout is the place to stop, have lunch and recharge. There is a self seve salad bar. The chicken rice bowl is delicious with bourbon sauce. You can order any hot or cold sandwich which is expertly made before you. The staff is competent and welcoming....\n\n\nMore"], ["Normal nothing great", 3.0, "August 31, 2012", "lyttle6", "Lancaster, Pennsylvania", 45, 32, "Just a regular cafeteria....I suggest going to Georgetown to eat. But is is nice for a quick bite. Prices are okay. It is clean."], ["Fair prices great location", 4.0, "December 19, 2011", "NawlinsGuy", "Louisiana", 61, 31, "I did not expect to find the federal cages so nice. Very clean, food selections were nicer than anticipated. Lots of fresh fruit, some veggies and less fast-foolish than anticipated. These were welcome breaks in our day."], ["Food with appeal", 4.0, "October 24, 2005", "GustafClark_SD", "Clark, SD", 31, 24, "Cafeteria is small, but food was tasty, and prices comparable to Russell Office Building cafeteria. Less crowded (when court is not in session) than other better known venues."], ["Off the beaten track", 5.0, "August 17, 2005", "A TripAdvisor Member", null, 1, 0, "Hidden, in the heart of Capitol Hill, is the Supreme Court cafe--a small, intimate, use-friendly place to eat. Everything is ala carte and you can order hot foods, prepare your own salad or just go for light sandwiches.\nI'm a seventh generation Washingtonian and recommend the Supreme Court cafe hands down"]]], ["Jetties", [["Excellent find!", 4.0, "September 17, 2015", "luv2eat2261", "Culpeper, Virginia", 8, 2, "In the mood for new and different quick food in the District, I came across this spot. Good all around. Food was great. Service was relatively fast (during the lunch hour). I had the Tom Nevers (Roasted turkey, shaved ham, bacon, lettuce, tomato and mayo on triple-decker toasted sourdough), which was absolutely superb. A bit expensive at $11.95, but, what...\n\n\nMore"], ["Nice for Lunch", 4.0, "June 26, 2015", "Ava S", "Greenbelt, Maryland", 25, 20, "Went based on a recommendation from someone who loves and frequents the Georgetown location. This location is relatively new. They make really \"good\" sandwiches. I had the tuna, which was just the way I like it, and the freshly made lemonade. The atmosphere is clean, simple, with outdoor seating. Will put this on my list for good lunch spots."], ["Great Sandwiches!", 5.0, "December 8, 2014", "Manray1230", "Tustin, California", 54, 15, "My older kids and I went to Jetties for a weekday lunch on the recommendation of our Segway guide and it did not disappoint. The sandwiches were some of the best we've had and that's counting a lot of sandwiches! The bread was fresh, the turkey was carved off the bird in front of you, and the choices were many....\n\n\nMore"], ["Good food but expensive for a sandwich", 3.0, "November 12, 2014", "Eric_W844", "Washington, District of Columbia, United States", 69, 14, "Went to their new location in Chevy chase DC. Interesting menu but 11-15$ for a sandwich seems a bit much. May return but not often. Also no convenient parking."], ["Very Filling", 4.0, "August 26, 2014", "Matt P", "Lutherville, Maryland", 98, 36, "I ordered a Sconset (vegetarian - hummus, avocado, cukes, carrots, thick slice of fresh tomato - and maybe something else - on bread with sesame seeds) and it was very filling. The hummus tasted homemade - unlikely that it was off the shelf. The sandwich was almost overstuffed, which made it a little sloppy to eat. My friend had turkey...\n\n\nMore"], ["Great Sandwich Place!", 4.0, "August 12, 2014", "AJP57", "Washington, DC", 158, 46, "A former coworker suggested this place for great/hearty sandwiches. I tried them yesterday for the first time. I had the Surfside sandwich. It was large and had fresh carved turkey not the thin sliced stuff. Great flavor/taste. I'll be back! The address above is incorrect, per their website it's 1921 I (Eye) St. NW near Baja Fresh. The closest Metro...\n\n\nMore"], ["Great soup and sandwiches", 5.0, "April 16, 2013", "RICHnCALongBeach_CA", "Long Beach, CA", 32, 25, "My wife and I stopped here on our way back to our hotel for a bite to eat and a place to sit since we were walking back from the Capitol to 20th and I (Eye) street. We were easily the oldest people in the place, by 40 years and yet were warmly welcomed in, assisted with recommendations and had...\n\n\nMore"], ["So happy we stumbled on this place for lunch", 5.0, "March 4, 2013", "Tara S", "Appleton, Wisconsin", 14, 11, "My husband and I stayed at the Hotel Lombardy and on our walk back from sightseeing near the whitehouse we stopped here for lunch. I am sure it is newly opened as I saw Grand Opening signs on their doors. It was very clean and newly remodeled looking. We were happy to find a sandwich place open for lunch on...\n\n\nMore"]]], ["Micho's Lebanese Grill", [["Delicious shawarma!!", 5.0, "August 14, 2015", "Alia P", "Washington DC, District of Columbia", 15, 11, "I've been to this place several times in the few months they've been open.\nI've only had the lamb and beef shawarma and the kafta and they were both delicious. They were full of meat, unlike other places that give you more extras than meat.\nThey do not make a fuss when you ask for extra hot peppers or other...\n\n\nMore"], ["Chicken schawarma bowl over burrito bowl any day", 4.0, "June 25, 2015", "Erin S", "Washington DC, District of Columbia", 91, 15, "I had a delicious chicken schawarma bowl with hummus the other day and it was glorious. Generous servings of chicken and hummus with tomatoes and lettuce and rice and pickled cucumbers. I was in heaven! It came quick and everything was fresh. It was great!"], ["Not bad", 3.0, "June 15, 2015", "theplumbingmedi... .", "Fairfax, Virginia", 158, 42, "I was in the area and stopped in for lunch the staff were nice and informative. I ordered a wheat pita with kafta , pickled this and that, onions and garlic paste. It tasted very average and i wish i had ordered a platter as i was still hungry when i finished.I would go back and give it another shot...\n\n\nMore"], ["Worth a try!", 4.0, "May 28, 2015", "Shakblak", null, 4, 0, "As a vegan, it can be hard to find places that affordable, this is one of those places. Good food, great service... It also happened to be maybe three doors down from where my sister and I were staying. Great atmosphere, I'll be stopping by the next time I'm in town!"], ["I'd totally do it again.", 5.0, "May 26, 2015", "RizeNshine", "Plainfield", 11, 1, "The service was fast, friendly and the food was good and cheap. My sister who is a vegan found something to each which was really important and a main factor in choosing Micho's. We were staying at the hostel nearby and were hoping to find something local we could both eat. Turns out, I loved it!"], ["Great Affordable food on H St", 4.0, "October 8, 2014", "Ant1007", "Hyattsville, Maryland", 116, 38, "Stopped in late night after hang on H St stopped in and grab a quick bite to eat. The staff was super nice and friendly. I ordered Micho's Wrap (roasted chicken, lamb, beef, lettuce, pickles, fries and michos sauce) the flavor was explosive and addictive. My friend ordered a lamb and beef shawarma (lamb, beef, parsley, tomato, mint, and tahini...\n\n\nMore"]]], ["Breadsoda", [["Cool Bar", 4.0, "September 28, 2015", "iKaren24", "Aldie, Virginia", 20, 1, "Came here for some drinks and was very happy! They had a good happy hour and free and paid games to play. We spent most of our time playing shuffleboard."], ["Nice spot for an afternoon drink", 4.0, "July 24, 2015", "charleybea", "Roanoke, Virginia", 4, 0, "I stopped in here for a drink while waiting for a reservation to the Escape Room DC nearby. It wasn't busy at all - which I was more than happy about. Great place to sit, relax and unwind from an otherwise busy weekend getaway. Waitstaff was very friendly and drinks were good. I'd love to come back next time we're...\n\n\nMore"], ["Monday night trivia", 3.0, "June 24, 2015", "John M", "Pittsburgh, Pennsylvania", 47, 13, "Good beer selection, friendly neighborhood bar feel, and free Monday night trivia.\nThey could work on their food selection as it was somewhat lacking, but overall a pretty chill location I would visit again."], ["Nice local bar", 4.0, "February 19, 2015", "JMSAvery", "Ann Arbor, Michigan", 25, 15, "My husband and I were in DC a couple of years ago and stumbled upon Breadsoda. Its a nice, quaint bar hidden outside of \"touristy\" DC. They have a nice selection of cocktails and beers. Unique menu items and friendly staff. I had a bloody mary and the chili mac. It was good, but not the best I've ever had....\n\n\nMore"], ["Great Food and Drinks", 5.0, "February 12, 2015", "Robert T", "Arcadia, California", 2, 1, "I liked the hip environment and music. I also liked the bloody mary's. The staff were very helpful and friendly"], ["Great trendy bar", 5.0, "December 9, 2014", "acroglia", "Washington DC, District of Columbia", 34, 9, "Lot's of annoying Glover Park bars there are, but this stands alone. Great pool tables and beer selection. Good, cheap sandwiches and not preppy."], ["Hidden Gem!", 5.0, "November 2, 2014", "Randall S", null, 93, 15, "This place is awesome! A little hidden, as its downstairs and might be difficult to find when driving by, this place is worth finding! It has darts, pool, shuffleboard, and good beer. Really thats all you need! Great place to hang out with friends all day when it's dead in there or at night when im sure it gets packed."], ["Great Sandwiches on the Walk to National Cathedral", 3.0, "June 14, 2014", "3barblues", "Reno Nevada", 25, 15, "Walking the mile-and-a-half from Georgetown to the National Cathedral we found this cool place which is down stairs from the main street. Inside are pool tables and a small bar which was nice and cool inside but there is outside seating as well. No it is not a pool hall. Not at lunch. Don't know about any other time. I...\n\n\nMore"], ["Some solid vegan & beer options, indoor dark & cozy, outdoor seating also.", 4.0, "March 13, 2013", "Birdy509", "Arlington, Virginia", 29, 12, "Located below street level and I would not have noticed it except for a Weihenstephan umbrella upstairs from the entrance. I came inside just to check what promised to be an atypical beer selection and discovered a number of my favorites. Then I discovered their vegan food options, and, right now, I'm enjoying a decent vegan chili and green salad."]]], ["18th Street Lounge", [["Cool Laid Back Lounge", 5.0, "August 19, 2015", "OnlyNYCTravelDiva", "New York City", 28, 17, "Was in DC for one night, and googled what there was for nightlife. I am so happy that I came across this gem! Visited on a Wednesday night, and it was reggae night. The place was packed, the vibe was chill, the drinks were reasonably priced. We paid $10 for the cover charge. You could grab a seat on a...\n\n\nMore"], ["Great live music", 4.0, "July 23, 2015", "Nadeem N", "Nairobi, Kenya", 96, 24, "Amazing live music in a venue that is a little cramped but that is what makes the atmosphere special. The night we went there was a reggae jazz band that absolutely amazing."], ["Rude and Boardline Unprofessional Staff", 1.0, "June 29, 2015", "Capt V", "Los Angeles, California", 84, 22, "Visited for the first time and found the place charming but the staff was horribly rude and host borderline combative. I get the speak easy vibe but it's DC not NYC or LA where much nicer venues like this run wild lines/are hard pressed to get in here. We were treated like second class citizens and these people almost ruined...\n\n\nMore"], ["Great lounge", 4.0, "May 7, 2015", "KLDollar", "Nashville, Tennessee", 14, 8, "The atmosphere was wonderful and very relaxing. Eclectic crowd. Mostly 21-35. Live music at 10pm. When walking you will pass the entrance so ask the bouncers on the street."], ["Cool, clean, fun spot", 4.0, "April 5, 2015", "Doll33", "Dallas, Texas", 46, 33, "The crowd is young professionals. The first floor has a DJ and a dance floor with a bunch of day bed, settees and couches that one can sit one without having made a reservation, which is nice when you need to take a break from shaking it on a dance floor.\nThe second floor has a live band and, again,...\n\n\nMore"], ["Awesome night out", 5.0, "December 17, 2014", "estrelitzinha", "Brasilia, DF", 9, 2, "I went there with some friends. I wasn't expecting much because I arrived there and place was kind of empty. However, as time passed, it started to get packed! they have a lot of different areas I it was probably the most fun night i had in Washington!\nThey also have some night specials. The day I went they had...\n\n\nMore"], ["Great spot for entertainment", 5.0, "November 6, 2014", "JGSanDiego", "San Diego, CA", 18, 12, "It was great to see all of the folks perform that are in thievery Corporation at 18th St. lounge. This place is unlike any other bar/nightclub/lounge you will ever go to in your entire life. some of the entertainment that performs there is absolutely ridiculously good."], ["Live music at its best", 4.0, "September 12, 2014", "Upperdysart", "Montrose, United Kingdom", 62, 26, "Loved the reggae jamming session on Wednesday night , a lot of talented people . The place was bouncing and a must if you like live music close up ."], ["the place to go", 4.0, "July 30, 2014", "Mandukhai E", "Ulaanbaatar, Mongolia", 9, 9, "I loved it. the different music on the floors, especially the Reggae Band!! Wednesday Night is a must! drinks of the night were great. friendly staff. smoking allowed on the open deck. nice interior. what else u need?!"], ["Threatening staff", 1.0, "July 18, 2013", "Celine B", "Washington DC, District of Columbia", 1, 4, "I have been going to this place for the last 5 years. It has its ups and downs, but nothing compares to today's experience. A pregnant friend of mine, her husband, and I were about to join an happy hour after work. The weather outside was above 90 degrees so my friend, who is pregnant, had a bottle of water...\n\n\nMore"], ["Loved the variety, all in one place!", 5.0, "May 26, 2013", "IshDewyn", "KL, Malaysia", 382, 260, "Was taken to 18th Street Lounge by local friends on a Friday night.. have got to say, I loved the variety of different music themes all found in the same place! We moved from the first room at the top of the stairs playing 80s remixes to the more R&B-style lounge in the back.. reggae playing on the open deck,...\n\n\nMore"], ["Great place", 5.0, "May 9, 2013", "Ange516", "Rome, Italy", 206, 87, "Great place with a very unique atmosphere, different to most other places I have seen in D.C., nice decor and a wonderful waitress who was not one of those typical \"hi, I am x and I am your waiter for tonight\" types but just an authentic, easy going and unique personality we could connect to. You can smoke inside, it...\n\n\nMore"], ["Very cool.", 5.0, "January 27, 2013", "Frank W", "Atlanta, Georgia, United States", 4, 3, "Great music, friendly staff, cool atmosphere, very fun crowd. I've been a couple of times, both during the week. I do hear it gets crowded on the weekends."], ["Cool bar w/ different music on each floor", 5.0, "August 18, 2012", "alexios88", "New York City, New York", 16, 29, "18 Street Lounge is more like a small club with different stages. There are different levels, rooms, a terrace where you can smoke and an area that is more like a club. It was cool just walking around in the beginning exploring the place. All the different rooms where playing great music the night I was there, but I mostly...\n\n\nMore"], ["Needs a few improvements", 4.0, "June 12, 2012", "MildaPDX", "Portland, Oregon", 88, 38, "Came here an hour before closing on Sunday and we headed straight to the balcony. Fun atmosphere but the heat was unbearable. I would really expect a place like this to have outside fans for nights like that. We barely danced because we were too hot from just sitting in place already. Bought a bottle of beer to cool off...\n\n\nMore"], ["Great vibe, different music on each floor", 4.0, "May 18, 2012", "Kristin L", "Seattle, Washington", 14, 10, "Owned by the guys from Thievery Corporation the ESL grooves, has lots of niches for chatter and some making out I have seen... dancing, grooving and the outdoor bar at back is great and usually packed. DJ nights are sweet. Try Marvin, their restaurant as well. Awesome Onion soup and Chicken and Waffles."], ["Good music, ok atmosphere", 3.0, "May 12, 2012", "Stacy2300", "Washington DC, District of Columbia", 18, 2, "Good music, ok atmosphere, do they serve food at all? Drinks are good. It gets packed on Thursday Friday and Saturday."], ["Good for HH", 3.0, "August 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good for HH"], ["not a bad place for an after work HH. I have only gone here 1-2 times on a weekend and it's not worth it in my opinion.", 3.0, "June 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "not a bad place for an after work HH. I have only gone here 1-2 times on a weekend and it's not worth it in my opinion."], ["good lounge for drinks with friends", 4.0, "April 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good lounge for drinks with friends"], ["Average food", 2.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Average food"], ["Best lounge in town.", 5.0, "January 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best lounge in town."], ["Great place to meet w/ friends + have drinks.", 3.0, "January 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great place to meet w/ friends + have drinks."], ["Great bar...reminds me of New York.", 5.0, "January 27, 2008", "dmlover76", "Washington DC, District of Columbia", 29, 22, "Great bar...reminds me of New York."], ["The Lounge - night spot...", 4.0, "January 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The Lounge - night spot extraordinaire for the ESL - Thievery vibe."], ["More of a Lounge than a...", 2.0, "January 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "More of a Lounge than a good restaurant."], ["Didn't know this was a restaurant..thought it was just a lounge with cool house and jazz music.", 4.0, "January 19, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Didn't know this was a restaurant..thought it was just a lounge with cool house and jazz music."], ["favorite place to hang out", 5.0, "January 9, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "favorite place to hang out"], ["I've only had drinks. Love the atmosphere.", 3.0, "December 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I've only had drinks. Love the atmosphere."], ["I had drinks here on Christmas evening. I just don't know how hip DC will ever be.", 2.0, "December 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I had drinks here on Christmas evening. I just don't know how hip DC will ever be."], ["Nice -place for drinks after work.. Avoid the weekend crowds though.", 3.0, "December 10, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice -place for drinks after work.. Avoid the weekend crowds though."], ["Great atmosphere, great...", 4.0, "December 6, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great atmosphere, great music, has the best house night in DC (Sunday with Sam the Man) but the pretentiousness at the door is probably the worst in DC. It's a small place and worth the wait but prepare to witness incredible snobbery for your intro."]]], ["Bistro 525", [["Great food and service!", 4.0, "October 5, 2015", "KNTMN", "New Brighton, Minnesota", 1, 0, "Good food recommendations, beautiful courtyard with free wireless, and kind staff. Loved the clams and the most delicious chicken dumpling soup I have ever had (gnocchi and mushrooms)."], ["Not bad but slow service", 3.0, "July 24, 2015", "Ellen M", null, 10, 2, "Had breakfast once and dinner once and both times I had to eventually have it to go. Poached eggs were nice and not at all runny. Didn't like cinnamon taste of breakfast sausages. Burgers were good. Fries too tiny."], ["Five star experience!", 5.0, "May 14, 2015", "D B", "Culver City, California", 48, 13, "Thank you to the fabulous staff at Bistro 525 for a truly wonderful experience. I enjoyed lunch and so appreciated the attentiveness and advice of my server, Roberto (or is it Ricardo?). The staff were warm, professional and knowledgeable. I found the service to be impeccable and the prices reasonable. I needed to make a small subsitution with my order...\n\n\nMore"], ["Washington Court Hotel restaurant", 4.0, "April 24, 2015", "Steve D", "Stockton, California, United States", 12, 0, "Good solid menu breakfast, lunch and dinner. Good wine list. For DC, reasonable prices for the food."], ["Great Breakfast", 5.0, "April 8, 2015", "JBMcCinROA", "Roanoke, Virginia", 20, 10, "In the Washington Court Hotel, Bistro 525 appears to be an excellent choice for dinner but our experience was limited to breakfast (we both had pancakes from the menu.\nIf we were bigger eaters, the buffet looks to be among the best I've seen. In addition to the usual, there is a bagel station with fresh lox and smoked trout...\n\n\nMore"], ["U get what u pay for.", 3.0, "November 17, 2014", "Bernard A", "Kingston, Jamaica", 1, 1, "One bad apple.......u know the rest.\nSo apart from the slow/poor drainage in the bathrooms, there is also poor custom service at the breakfast table in terms of waiters and how the speak to guests! Our waiter this morning shouted at us that we cannot! draw a line through the space on our bill that says TOTAL (even though the...\n\n\nMore"], ["Great service, average food", 3.0, "September 17, 2014", "chrisk1970a", "Toronto", 31, 10, "Service was excellent, and if you sit in the courtyard the setting is beautiful, but to be honest the food is only fair... overpriced relative to quality."], ["Not over Salted!!", 5.0, "September 2, 2014", "vicki j", "Florence, Alabama", 8, 2, "So many places \"over season\" per my taste buds. I had two meals that were very good and I would recommend giving 525 a try."], ["Disappointing", 2.0, "May 9, 2014", "60750WorldTraveler", "San Diego, California", 32, 13, "Our food was not tasty and the service was terrible. We asked for something and the server disappeared and never brought it. We asked her again and again...when we saw her, which was rare. She never brought it. Finally we grabbed a busboy and asked him. We didn't eat there again and it did not look busy. What a shame....\n\n\nMore"], ["Great Wait Staff", 5.0, "April 29, 2014", "Janet G", "Eureka, Kansas, United States", 29, 5, "Good restaurant in the Washington Court Hotel! My sister and I ate breakfasts and one evening meal during our stay. The wait staff were very kind and the food was very good. The portions were large enough to share and the menu is affordable."], ["Great to have a good in hotel restaurant", 4.0, "January 23, 2014", "DPM67", "Philadelphia, PA", 85, 40, "This restaurant is actually located inside the Washington Court Hotel. All the way in back of the lobby, it is tucked away in the corner but is easy to find once inside the hotel lobby. We stayed at the hotel and it was a nice bonus to have a good on site restaurant. I typically don't expect much from hotel...\n\n\nMore"], ["Awesome", 5.0, "December 12, 2013", "mark s", "Staunton, Virginia", 2, 0, "Try the Salmon!! Amazing!! The atmosphere was quiet and romantic. Wine was great. Staff was nice. Fairly inexpensive for the area!! Definitely will be back."], ["i thought it would be a bust but it was great.", 5.0, "November 20, 2013", "averageguy_10", "punxsutawney pa", 21, 10, "i loved my entree and the whole experience.... this place doesnt have any hype, but I thogut it was great and I am accused of beeing a bit of a food snob."], ["Nice ambiance but the food doesn't match it", 3.0, "October 12, 2013", "Deborah G", "Omaha, Nebraska", 113, 31, "Very courteous wait staff but unfortunately the food wasn't all that good. The tomato and olive salad had a few slices of anemic-looking tomato coupled with a few olives. For $12, I would expect more of an effort. The Maryland crab cake sandwich was good but the texture was especially mushy. Outstanding fries. Reasonably priced wine selection."], ["Warmed over cafeteria food at premium prices", 1.0, "October 10, 2013", "Arguendo A", "Washington DC, District of Columbia", 2, 2, "Menu selection looked appetizing, but food was literally warmed over cafeteria servicing (think Costco entrees) at premium prices. No value at all, and food was mainstream bland.."], ["good breakfast buffet", 3.0, "September 30, 2013", "tgd721", "Fredericksburg, Virginia", 99, 38, "I stayed at the Washington Court Hotel and went to this restaurant to have breakfast the day of my departure. The quality selection of food are good; no complaints at all."], ["Offensively unaccomodating", 1.0, "August 25, 2013", "LGBTtraveler", "Bethlehem, Pennsylvania", 217, 73, "We were surprised by our experience because the restaurant seemed to have a number of good reviews, but after driving many hours and checking into the hotel, we attempted to eat here and were really put off by the manager who told us (in a rather rude way) why they couldn't accommodate vegetarians. They couldn't even offer to put together...\n\n\nMore"], ["Good food, great service", 4.0, "August 22, 2013", "Michaelene N", "Yardley, Pennsylvania, United States", 17, 8, "Our family enjoyed a lovely meal here during the week. The staff is very attentive; we were definitely impressed by their service. Our meals were quite good and the menu has many choices to offer, especially for a picky child!"], ["Relaxed breakfast, rather disappointing dinner", 4.0, "April 10, 2013", "Torontotraveller2", "Toronto, Canada", 193, 216, "The bar and dining \"areas\" in the vast lobby of our Washington hotel, Hyatt Regency Capitol Hill, were far too tumultuous for us to enjoy a relaxed meal, so we retreated up the street a bit to the much more sedate Washington Court Hotel and its Bistro 525. We really liked the looks of the bar area here, as well,...\n\n\nMore"], ["No need to eat outside of Hotel", 4.0, "April 1, 2013", "Rogie L", "Dundas, Canada", 10, 14, "The lamb leg and ploughboy sandwich were both excellent and filling. Service can be a bit slow but wasn't a major concern."], ["Convenient in the Washington Court Hotel", 4.0, "March 26, 2013", "Glenn J", "Pullman, Washington", 50, 35, "Service was good and the food was tasty. Wasn't really typical bar food, although served there. it came from the hotel's kitchen. A friend said the fries were great."], ["Innovative and delicious", 5.0, "February 25, 2013", "Steve S", "Richmond, Virginia", 22, 5, "The menu offerings were fresh and interesting, meals were well prepared and full of flavor. Prices were very reasonable considering the DC location....and the portions were generous as well (my daughter had the lemon basted chicken and it was a true half chicken). Nice wine selection with a variety of price points....attractive decor and good service.\nAll around a very...\n\n\nMore"], ["Bistro 525, Healthy and Good", 4.0, "December 7, 2012", "D S", "Marina del Rey, California", 33, 42, "The food here is tasty and well prepared with many healthy options for those who are heart-conscious, and enjoy fresh, low fat and low-cholesterol diets, but who don't want to give up on taste."], ["AMAZING!!", 5.0, "November 27, 2012", "Alicia G", "Virginia Beach, Virginia", 41, 15, "Great food and wonderful service! I stayed in hotel and had dinner here once. Very quiet and private feel. Great for a romantic dinner for two."], ["Not bad", 3.0, "October 12, 2012", "Rob_Gillis", "Washington DC, District of Columbia", 102, 64, "Ate here one nigth during our stay. Restaurant was empty. Service was ok, food was ok too. The crab soup was very good however. The rest of the meal was ok, steak was a little over cooked. Wine was good. They were out of a dessert, so they tried to emprovise, I give them credit for trying, but the dessert...\n\n\nMore"], ["Good hotel restaurant", 4.0, "September 26, 2012", "CathyLen", "South Puget Sound", 65, 28, "I ate here while staying at the Washington Court Hotel. Very good breakfast buffet and very friendly staff. I would definitely eat here again."], ["Surprisingly good for a hotel restaurant", 5.0, "September 26, 2012", "DrMcinBKK", "Bangkok", 135, 58, "I dined here on four occasions during my stay at the Washington Court Hotel. Breakfast was not included with the room, and I wanted to eat relatively healthy so I ate at the hotel rather than go across the street to Starbucks.\nI didn't want to eat the buffet so ordered a la carte. There were many interesting choices on...\n\n\nMore"], ["A pleasant surprise", 4.0, "September 5, 2012", "nigel'smom", "Richmond, Virginia", 89, 26, "Located in the Washington Court Hotel, we can recommend Bistro 525 to folks looking for a good meal in DC.\nWe are usually snobs and eschew restaurants located in hotels, but we made an exception because there was a nasty storm brewing and we had been out \"sightshopping\" all day and were tired and foot weary.\nGlad we did. The...\n\n\nMore"]]], ["Zoo Bar Cafe", [["Pleasant surprise", 5.0, "October 7, 2015", "EmilAlex", "Abu Dhabi, United Arab Emirates", 102, 83, "We came here yesterday after zoo visit for lunch. We first thought it's a bar and there won't be any regular food but surprisingly they even had a kids menu ! We ordered a burger and chicken tenders for the toddler. The food was actually quite good and the guy who runs the place was quite friendly and nice ....\n\n\nMore"], ["Place to relax after the zoo", 4.0, "October 1, 2015", "Prawet J", "Washington DC, District of Columbia", 238, 73, "The Zoo bar is right across to the main gate of the zoo (Connecticut Ave.) A very nice place to have cold beer or a glass of wine after the zoo, The place looks nice and clean with a nice old wooden bar. The menu is simple. I was there late afternoon for lunch on week day. I sat at...\n\n\nMore"], ["Does the job nicely", 4.0, "September 30, 2015", "99TedP61", null, 129, 38, "Adjacent to Washington Zoo - good place to try after a long walk around the zoo. No pretentious stuff here. Bar with standard eating options - pleasant service. Good burgers, salads etc. Enjoyable lunch."], ["Ok but slow service", 3.0, "August 8, 2015", "adam_nwuk", "England", 347, 145, "Food was quite good but slow service at the till. Some items need to wait to be made but others ready to eat."], ["adequate", 3.0, "July 19, 2015", "Islandgirlislandgirl", null, 25, 9, "Had a salad was fresh nothing special but was nice and cool and the staff were friendly. Ate salad because they had quite few typical American unhealthy choices and I needed to eat and didn't want to keep looking."], ["What a nice stop", 4.0, "June 14, 2015", "lexigirl99", "Salt Lake City", 24, 5, "We stopped by here for lunch after a hot and crowded visit to the zoo. It was a normal bar restaurant atmosphere but the sunshine was beaming in the windows and it was friendly. We were greeted by \"the guy\" who might have been the owner. Our expectations of the food were not high. But when the food came, we...\n\n\nMore"], ["Pleasantly surprised", 4.0, "June 10, 2015", "nolazarn", "Raleigh, North Carolina", 1, 0, "Typical bar setting but food was delicious. Chef salad was fresh with real turkey and ham instead of deli meat. Burger was favorable and cooked to order. Fresh cut fries were very good."], ["Very Tasty", 5.0, "June 2, 2015", "Stargazerlily411", null, 38, 21, "After a morning at the zoo my family was hot and hungry. The cafe was conveniently located at the entrance of the zoo. We entered the cafe and were greeted and seated. The waiter was very nice and accommodating. The cafe is a very small hometown atmosphere in a huge city,very quaint! The food was outstanding with large portions."], ["It was OK", 3.0, "March 28, 2015", "fishheadflorida", "florida", 61, 38, "The ladies in the ZOO welcome center recommended this place. It was a slightly late lunch. It was not crowded. Only one man taking orders. We were a little sketched, but starving. The food was good. They didn't get our order completely right, but we ate what they brought because we were in a hurry. He realized the order was...\n\n\nMore"], ["Convienent Location & Friendly Service", 3.0, "March 27, 2015", "budget_travel_buff", "Minneapolis", 51, 37, "This is a little pub across from the zoo entrance. It looks like the kind of place that would have terrific soups/sandwiches a burgers served by a great character. Well they've got the great character server/bartender but the food was so so. large portions but nothing to write home about. If you're hungry and don't want zoo fast food this...\n\n\nMore"], ["Handy and delicious!", 5.0, "October 17, 2014", "123carolyn123", "Harpers Ferry, West Virginia", 45, 28, "We were famished after wandering the national zoo, and wanted to eat before going back to hotel. Walk out zoo gate on Connecticut Ave, and there's the Zoo Bar and Cafe. We wound up in a DC institution. Who knew? Hamburger was the right size, juicy, flavorful. Handcut fries were fresh and cooked to just a slight crispness. The beer...\n\n\nMore"], ["Great Food!", 4.0, "October 5, 2014", "Charlie W", null, 17, 11, "We visit this restaurant every time we visit the zoo. Its right across the road from the zoos front entrance and has reasonable prices. I've never been disappointed in the food quality and I always enjoy my time there."], ["Just Fine for a Quick Bite Before the Zoo", 3.0, "September 30, 2014", "Marcy D", "Columbia, Maryland", 73, 35, "We stopped into the Zoo Bar Cafe before going into the zoo, as it is directly across from the entrance. There are a few outdoor tables, a bar, and about a dozen tables inside. They have about 5 craft beers on tap, and about 8-10 more in bottles. The menu is typical pub fare. Our party had sandwiches, burgers, and...\n\n\nMore"], ["Look somewhere else.", 2.0, "April 13, 2014", "Shasti19", null, 3, 1, "We had 3 adults, 2 children, and a baby and They added a high group gratuity to our bill. Food was not fresh, bread and chips were stale. Took too long to bring out food. Do not map quest for directions, it will take you to a dead end alley!"], ["Never Did Figure Out the Smell", 3.0, "March 13, 2014", "VEC24", "Virginia", 295, 97, "When you come out of the zoo at Connecticut Ave, the Zoo Bar Cafe is your first choice of places to eat. It's a very small narrow place and on the day we went it seemed to be doing mostly take-out for lunch. There was a stale odor to the place that I just couldn't identify and it looked like...\n\n\nMore"], ["Better than expected and reasonable price", 4.0, "March 12, 2014", "B B", "Dallas, Texas", 47, 19, "We dreaded eating at the zoo, so decided to wait. Glad we did! Great service, good food. Very reasonable prices. A win in our book."], ["It is convenient for adults visiting National Zoo", 4.0, "November 1, 2013", "nancypants911", "Bakersfield, California", 108, 85, "We ate at the national zoo on the first visit, and food was terrible, and over priced. Second trip to the zoo we saw this little bar with outside seating just across from the main entrance. It isn't appropriate for children. Funky interior, and the man doing the bar came over to greet us as soon as we entered. Place...\n\n\nMore"], ["Blues & Jazz from Thursday through Sunday", 5.0, "September 28, 2013", "beverlyroberts", "Washington, United Kingdom", 3, 0, "Thursday is jam session. They have a house band & then others sit in & play their instruments or sing. Friday & Saturday nights, starting around 10 or 10:00 there are blues & jazz bands that play there once a month. No cover, but tips are encouraged. Fun!"], ["Just don't do it", 1.0, "August 24, 2013", "Terri C", "Boston, Massachusetts", 15, 8, "Very disappointing lunch here on a Friday in August. Right across from the zoo and conveniently located. It was actually the first place we saw when we exited the zoo, and the outside looked cute. Service was beyond horrible. Took forever to even be acknowledged or get drinks. After a very long wait, our food was delivered minus one person's...\n\n\nMore"]]], ["Red Apron Butcher Penn Quarter", [["Hip decor - nice burger", 4.0, "October 3, 2015", "99TedP61", null, 129, 38, "Stumbled into this place on a rainy afternoon looking for a quick lunch. Escorted inside to a trendily decorated restaurant - pleasant service. Enjoyed good burger with flavousome fries - not a bad coffee either."], ["Amazing! !!", 5.0, "September 30, 2015", "Love2Go80", "Jacksonville", 34, 16, "It is always difficult to find a place to eat with my daughter who has Celiac. We were starving and stopped here for lunch.\nI had the burger, it was amazing! The fries were also great and because it was a clean froer my daughter could also have them.\nWe started referring to the burger as unicorn meat. It was...\n\n\nMore"], ["Hip place to have drinks and nibbles with friends", 4.0, "September 15, 2015", "couplessPS", "Snoqualmie, Washington", 134, 77, "a hip place for an after work drink and snack ( you need to have something to eat if you want to have a table with your friends). Good wine selections and very good cocktails. Liked the atmosphere a lot- very stylish. If you want, you can get very good meat to take home for dinner at the butcher part...\n\n\nMore"], ["Best steak I've had in years was purchased here!", 4.0, "July 24, 2015", "Manningjen", "Columbia, Maryland", 158, 70, "Quality of the meat is excellent. We also like to pick up a charcuterie selection for parties at our home nearby. Sandwiches are a good choice for a picnic on the Mall. There are also a few outside tables in warm weather."], ["Great meats and accoutrements", 4.0, "July 14, 2015", "CaptainAwethume", "Hyattsville, Maryland", 262, 85, "I think it's hilarious when people complain about the price of something when they clearly saw the menu, ordered the food, went home, turned it into poo and got on with their lives. If you know that you're going to have a problem with the price regardless, then just don't order it because there are people working very passionately to...\n\n\nMore"], ["Good food, but guard your drink", 3.0, "June 25, 2015", "Chris F", null, 4, 3, "The food was good, but the bartender confiscated my drink before I was finished. I tried to flag her down, but I was late for a Nationals' game. The menu is a little confusing, too."], ["Great location, good cold beers, fine brunch", 4.0, "June 23, 2015", "Nicholas G", "Chicago, IL", 11, 10, "I came by for brunch on Sunday after visiting museums in the area. Nicely located, great beer selection, top notch service at the bar. The plate was a bit underwhelming in portion size for a midwesterner — I had the hash and eggs. Flavor was great. I came here because I saw their sandwiches at Union Station, but they don't serve...\n\n\nMore"], ["Yummy breakfast sandwich, amazing barista!", 5.0, "June 11, 2015", "MarySL00", "Washington DC, District of Columbia", 295, 151, "Went for breakfast sandwiches after hearing all the hype about them. Excellent stuff. The charcuterie and cheese display is impressive. A sure value to go back to!\nLovely and courteous staff extending your dining experience to a new level. The barista served lovely coffee with a smile."], ["Limited menu and poor customer service", 2.0, "April 16, 2015", "tikidream", "bethesda, md", 388, 110, "I've attempted to get sandwiches from Red Apron three different times - and each time the counter staff were unhelpful and I left empty handed. On my most recent visit, I discovered that despite what the web page states, they don't offer sandwiches at dinner - that their kitchen focuses strictly on food for the Partisan. This would have been...\n\n\nMore"], ["Fresh, Beautiful Deli Sandwiches", 4.0, "March 17, 2015", "spka", "Maryland", 63, 30, "Fantastic deli meats made into interesting and tasty deli sandwiches. Order at the counter and have it delivered to your table. Not a cheap lunch - $9 average sandwich without any sides, but really yummy."], ["Great hidden away gem", 4.0, "February 20, 2015", "HeidiandJohn", "Washington DC", 28, 10, "Was looking for a quick meal before a play - and stumbled upon Red Apron. Just a block from Woolly Mammoth. My husband liked the charcuterie and the truffle mashed potatoes were awesome. The bartender was a true mixologist and the ambience was perfect."], ["Rich but Not Satisfying", 3.0, "January 25, 2015", "WFleet", "Washington DC, District of Columbia", 136, 54, "I went for drinks and dinner with friends. We ordered the fries (cooked in duck fat) and a bunch of other appetizers. I've got to say that I can only eat so many fried items and cured meats before it begins to blend together into a fatty haze. I'd have liked to have more variety in the menu, with something...\n\n\nMore"], ["Over priced for very small portions", 3.0, "January 9, 2015", "Ashley R", "Buford, Georgia, United States", 10, 3, "We got lunch here one day and felt it was over priced for small portions. I will say though, it seems like they used hormone free beef and good for you meats so the price may have been justified but I live in Atlanta and the same sandwich would have been at least 3 dollars less. We ended up eating...\n\n\nMore"], ["Lovely breakfast spot", 5.0, "December 28, 2014", "ilovegelato82", "Canberra, Australia", 42, 36, "We found this place by chance and stopped for breakfast. They do lovely breakfast bacon & egg muffins but the muffin is thin, it was so yummy. They also had a good variety of fillings for the muffins. The coffee was a little bitter but still nice. It was quiet, funky & we'll be checking out their dinner menu"], ["Came highly recommended by sandwich very salty!", 3.0, "December 10, 2014", "Kokiaabq", "Oahu, Hawaii", 51, 20, "I liked the setting and quick service. Sandwich was tasty but very salty.... Best part was eavesdropping on all the interesting conversations of other diners! Interesting crowd. Bar looks like it could be fun."], ["Lively After work bar scene; creative meats", 3.0, "December 6, 2014", "kimmisk", "Raleigh, North Carolina", 79, 25, "We stopped in the Red Apron on a wing as we were walking around one evening after work. We were visiting the area and looking for a quick bite at a non-chain, unique restaurant.\nThe Red Apron fit the bill perfectly.\nWhen we first walked in we saw a deli-meat counter on one side of the restaurant and tables and...\n\n\nMore"], ["Burger not that impressive", 3.0, "November 22, 2014", "neur14", "New York City, New York", 286, 81, "Considering that the place features burgers I was not that impressed -- barely thick enough to be rare and not as juicy as I would have liked. French fries were fun crunchy fried in fat. The place gets very crowded at lunch hour since down by the gov buildings. Good wines available. Other sandwiches/meats are available which I haven't tried."], ["Lots of Hype-Minimum Vale", 3.0, "October 24, 2014", "cajungene", "Fairfax, VA", 53, 29, "Had lunch there today with the wife. Ordered the Mufaletta and Cuban along with fries. We were both under-whelmed. I was comparing the Mufaletta to Central Grocery in NOLA and it was not even close. It was more like a panini, the bread was toasted and olive spread was all wrong. The Cuban was slightly better, but using 'pineapple mustard'...\n\n\nMore"], ["Red Apron Appetizing Num Num", 4.0, "October 24, 2014", "Charlotte H", "Washington DC, District of Columbia", 78, 18, "Near great 7th street area and my office. Check. I don't eat sandwiches and these are great. Check. Pastrami in pump with red cabbage slaw. Num. Very Fresh beef Burger with great special sauce. Num. Meat ball with great seasoning in the beef. Num num. The staff was great at the order counter. The young woman at the other door...\n\n\nMore"], ["Great breakfast sandwich!", 4.0, "September 26, 2014", "rcln76", "San German, Puerto Rico", 22, 7, "Was looking for a place for breakfast in dowtown DC and found this place through a google search for best breakfast places. The place seems to be more cater for lunch and dinner since it was empty at 8:00am... But boy... Their Buenoa dias sandwich was just to good... Full of flavors... Their lunch sandwiches menu looks delicious!"], ["Higher end sandwich burger salad shop", 4.0, "July 26, 2014", "jxx9595", "Washington, DC", 488, 163, "The menu isn't long, and the portions aren't big. But we found the food mostly creative and tasty. Maybe a bit too greasy on the Muffaletta. Red Apron is a bit unusual in that it offers standard fare at the higher end of the scale. Prices to match. We will return someday, but we're not in a rush."], ["Too much salt", 3.0, "July 21, 2014", "YankeeFan42", "Washington DC, District of Columbia", 81, 28, "I ordered a cheese burger and a side salad. It was good quality meat that was cooked as requested. Unfortunately, too much salt was added to the burger AND the salad. I asked the other parties at our table if there meal was salty and it was. I would try the restaurant again and ask that they not put salt...\n\n\nMore"], ["Amazing sandwiches/Great Bar", 5.0, "May 31, 2014", "TurdFerguson13", "Alexandria, Virginia", 37, 19, "Red Apron, tucked away on a side street behind the Navy Memorial, has a great selection of craft sandwiches, a full-service butcher, and quick service. There is also an attached bar \"The Partisan\" which has great cocktails and craft beers. Although there is limited seating space, there are plenty of great places to eat outside nearby - including the National...\n\n\nMore"], ["Great Cheeseburger", 3.0, "May 30, 2014", "PatrickM745", "Washington DC, District of Columbia", 21, 8, "The restaurant is very dark and loud (we were seated in the bar area). The menus is unique with different types of meats, however the cheeseburger is simply delicious! It is very rich and probably not low calorie, but boy is it good. The only downside was the price, $14.00 for just the burger. Service was very good."], ["Love meat? Eat here!", 4.0, "May 13, 2014", "VanNessVoyager", "Washington DC, District of Columbia", 105, 88, "Having opened a few months ago, Red Apron is a relatively new restaurant to the Penn Quarter/Gallery Place neighborhood. My friend and I visited the restaurant mid-day on a Saturday for a brunch/lunch meal, and we were very pleased.\nThe restaurant is a short, couple block walk from the metro, going south toward downtown. The decor of the restaurant is...\n\n\nMore"]]], ["Stanton and Greene", [["Amazing gourmet burger", 4.0, "September 15, 2015", "rickymiabeach", null, 24, 16, "The double decker burger is made with ground meat, short ribs and ground up bacon and topped with onion rings. What's not to love??? Sure, it's a heart attack on a bun, but you'll die happy. Cute place. Efficient if not friendly staff. And three lucky tables get to sit outside and watch the world go by in this funky...\n\n\nMore"], ["Great new place on Capitol Hill", 4.0, "September 9, 2015", "JED333", "Washington, DC", 24, 3, "From three of the owners of Capitol Hill's Beuchert’s Saloon and Sonoma, comes a very well done space where the dive Pour House used to be. The weekend brunch menu is excellent and eclectic, especially the Red Velvet pancakes, which are incredible. The deviled eggs and smoked trout benedict are also worth the trip. I also really like that they...\n\n\nMore"], ["Good Pub Food", 3.0, "August 11, 2015", "DCtravler244", "Washington DC, District of Columbia", 142, 78, "This is a relatively new casual dining restaurant that's a short walk from the Capitol, Library of Congress, and House offices."], ["Fantastic!", 5.0, "July 26, 2015", "justatraveler926", "Chicago, Illinois", 23, 9, "Looks like an upscale pub, with a few tables outside. The food is wonderful! Had the Stanton Burger, a generous and flavorful beef patty with lettuce and roasted tomatoes. Really one of the best burgers I have had in recent memory. Service was fast and courteous. Well done!"], ["Whoa! Just whoa!", 5.0, "May 8, 2015", "mattk83", "Melbourne, Australia", 39, 12, "The food here is good. Really good. No expense is spared with high quality ingredients and there is LOTS of food. The portion sizes are very generous. I had mac and cheese as a side and it could have been a meal by itself. Also, the cheeses they used were just outstanding. They managed to turn mac and cheese into...\n\n\nMore"], ["Good food and creative drinks", 4.0, "April 25, 2015", "jxx9595", "Washington, DC", 488, 163, "The Washington Post gave this restaurant a poor review, but the Post was Wrong! We had a lovely meal with two interesting specials not on the regular menu. The Post said that the menu was boring, and there is some truth in that, burgers, sandwiches, and salads. We had a nice pork chop and a tuna dish, and either was...\n\n\nMore"]]], ["PAUL Georgetown", [["Love it", 4.0, "October 6, 2015", "Lina K", null, 15, 4, "PAUL Georgetown is a great place for breakfast! I like everything; croissant of cheese or chocolate even of almond, a cosy place and a friendly staff. Table and seats are well designed!"], ["Good, quick, convenient.", 3.0, "September 28, 2015", "MarkWorld", "Laurel, Maryland", 150, 64, "As a quick stop, for something decent to eat, Paul is a good choice. It is also convenient to the cross-roads of M St and Wisconsin Ave. We sat upstairs and ordered sandwiches and salads. it was served quickly and everything was tasty and fresh. The waiter was very nice and he had a huge smile for all who entered...\n\n\nMore"], ["Beautiful little place.", 5.0, "July 19, 2015", "JOBright", "Newcastle, Australia", 57, 27, "Enjoyed breakfast and lunch here a couple of times doing our Washington visit. Staff are lovely and the food worth the visit but it also has the best coffee we found in Washington. During our six day visit Paul was a daily visit. The pastries are a special take home treat."], ["what we wanted", 5.0, "July 5, 2015", "John O", "melbourne, Australia", 21, 6, "early morning in Georgetown has precious few eateries. Paul on Wisconsin Ave was perfect. You enter to wonderful baking smells and we climbed a narrow staircase to a simple room staffed by a friendly and efficient waiter. The Coffee and egg based breakfast a treat"], ["Pastries, yumy", 5.0, "July 1, 2015", "Iris R", "Bayamon, null, Puerto Rico", 30, 5, "Very nice quaint french bistro, the pastries are the best, they feel very fresh and the breads very good too."], ["Lovely Breakfast", 4.0, "June 27, 2015", "marlewrhy", "Dumfries, United Kingdom", 39, 21, "Colleagues and I stumbled across this lovely little French bakery and decided to have breakfast. The bread and fruit juice were as fresh as you could possibly hope for and both were equally delicious. I had the eggs and ham on bread and it was superb. Perhaps quite cosmopolitan but what you would expect in Georgetown. The selection of beautifully...\n\n\nMore"], ["Horrible service", 1.0, "May 22, 2015", "Carol C", null, 2, 2, "This was our third visit to the Paul's in Georgetown, and it was God awful. We normally use to select our food downstairs, pay it and eat it upstairs in the seating area. I went up to select a table while my family ordered their food, and someone came and said that in order to eat upstairs, we needed to...\n\n\nMore"], ["No service with s smile", 3.0, "April 28, 2015", "emh107", "Woodbridge, CT", 9, 9, "I stopped in twice during my recent stay on DC. The people behind the counter did not smile and z red as if they were doing me a favor. The chocolate croissant was not as good as Starbucks and the Quiche Lorraine was delicious. When I asked for a fork for my to go order the server just ignored me....\n\n\nMore"], ["Top notch French Bakery", 5.0, "April 26, 2015", "mkj30", "Queenstown, NZ", 52, 62, "Stopped in for a coffee. The flaky, crunchy almond croissant was excellent. So we couldn't resist returning for more later, and tried the mille feuille. Wow. Best ever. Really crispy base and creamy not-too-sweet custard filling. The coffee was good as well."], ["Excellent dessert", 4.0, "April 12, 2015", "rrkr13", "Columbus, Ohio", 76, 21, "Ordered an almond croissant, cafe creme, and another dessert whose name I wish could remember but can't! For what it is worth, it looked like a tiny pineapple upside-down cake and was purple. And it was so good!\nService is, 'ow shall I say,monsieur, a trifle languid, perhaps as befits a restaurant with French aspirations. But hey, we were not...\n\n\nMore"], ["Breakfast", 5.0, "February 26, 2015", "loopylou100", "Chester", 34, 14, "Croquet monster was lovely and took away delicious sandwiches and pastries, lovely atmosphere, quaint and very clean."], ["Delicious pastries", 5.0, "February 15, 2015", "FuzzBall25", "Houston, Texas", 82, 34, "I stopped by and bought a croissant and apple pastry. Both were very rich, warm, and absolutely delicious. Since my order was to-go and there wasn't much of a line, I did not experience any of the bad service or long waits other reviewers have mentioned. The cafe itself is very small and even a few people in the main...\n\n\nMore"], ["Not impressed", 2.0, "December 7, 2014", "aWashingtonian", "Washington DC, District of Columbia", 37, 28, "All the people working at this location should be trained at paul 2000 and penn to learn how to behave in a professional manner. The staff was rude and unwelcoming. Nothing like paul 2000 and penn (i.e my second home!). Stay away from paul georgetown"], ["Delicious breakfast", 4.0, "November 3, 2014", "dmzMichigan", "Michigan", 4, 2, "Our hotel recommended Paul's for breakfast and we were pleasantly surprised. We felt like we were in Paris. Delicious Madame Croque! The macaroons purchased at the bakery were very good as well. It is a very small cafe, so you must be patient, but well worth it."], ["Waiting waiting waiting!", 2.0, "November 1, 2014", "Sanem H", null, 5, 1, "Downstairs desserts look amazing, upstairs waiting for the desserts terrible. Even giving an order took like 45 minutes!!! There was only one waiter!"], ["French Bakery", 4.0, "October 15, 2014", "Lori E", "Falls Church, Virginia", 13, 4, "The pastries are amazing. The sandwiches and salads are pretty good. I eat there at least once a month for lunch."], ["So Good, We Went Twice", 5.0, "October 12, 2014", "Kim H", "Pittsburgh, Pennsylvania", 30, 10, "We stumbled into Paul early on a Sunday morning, It must have been the early morning hour because the restaurant was filled, and we were fortunate to get the last table. I had a wonderful cafe au lait and a sugar brioche. My dining companions had the breakfast sandwiches, which were very substantial. In fact, Paul was so good, we...\n\n\nMore"], ["Can't I just buy a baguette?", 2.0, "September 27, 2014", "DC196", "Washington DC, District of Columbia", 95, 49, "Long slow line; manager gave us a french loaf but wouldn't. ring it up at the empty cash register. Had to go back in line for the single slow cashier. After ten minutes gave him the bread back.\nMiss madelaine but will just have to make do with whole food.\nMay be french quality but also french (in) efficiency."], ["Thrilled to see Paul in Georgetown!", 3.0, "August 27, 2014", "Barbara S", null, 17, 11, "I stumbled upon this wonderful French bakery while looking for a place to get a cup of tea and something for breakfast. Having been to Paris twice I was thrilled to find a Paul in Georgetown. The tea and croissant were delicious. I took my daughter the next morning for a sit down meal and it was incredibly disappointing. The...\n\n\nMore"], ["45 minutes waiting!", 1.0, "August 2, 2014", "Zaher G", null, 1, 1, "Cold espresso. We waited 45 minutes for food. The service team had no idea. They walked arroud with no plan. Too pricy for the quality. Never again!!"], ["Listen to the dude behind the counter", 5.0, "May 29, 2014", "JanetMcE", "Washington DC, District of Columbia", 80, 29, "I entered only wanting to pick up a croissant for tomorrow 's breakfast since it was close to closing time. But they have pretty hip young guys working there and he suggested I try the chocolate creme croissant. I am not a pudding fan and he assured me it wasn't the jello pudding stuff inside, so I took a chance....\n\n\nMore"], ["Great French bakery cafe", 4.0, "May 16, 2014", "Joan C", "Boston, Massachusetts", 130, 71, "We had found several Paul's during trips to France and enjoyed their food so we very pleased to find one in Georgetown, DC during a hop on hop off bus trip around the city\nWe had intended to just buy a sandwich from the shop but found that they had a small restaurant upstairs. We were lucky to be seated...\n\n\nMore"], ["Afternoon tea.", 4.0, "March 19, 2014", "creamybeamy", "Carlow, Ireland", 73, 43, "Called in out of the rain. Beautiful little tea rooms where its easy to while the time away over a pastry and coffee. Two coffees and 2 tarts came to 22$. Lovely treat."], ["Great patisserie", 4.0, "February 15, 2014", "DW1499", "Westchester County, New York", 78, 58, "These must be the best croissants in D.C. The coffee is great too. This is why I am giving this cafe such a high rating. There are not many tables, and service is not great. Things seem to work best here if you order the coffee and croissant at the counter and then try to find a table."], ["Quaint french bistro setting, but inattentive, inaccurate staff", 4.0, "December 23, 2013", "CMMinPhila", "Philadelphia, Pennsylvania", 9, 6, "Cool french bistro setting with patisserie downstairs and small dining room upstairs. Decor mixes french rustic and mismatched traditional. Sunday Brunch was a little crowded but not packed. Waiter made mistakes with order and had to asked for some things repeatedly. Service was too slow for the moderate volume of people. Food was good and not hugely overpriced as you...\n\n\nMore"], ["Nah!", 2.0, "December 8, 2013", "Nicky025", "Dubai, United Arab Emirates", 68, 31, "Not to be compared with Paul in Beirut, dubai or Paris ,,,, the food was ok, the table dirty even after the waiter cleaned .... My table was opposite to their kitchen window, the cook was mixing the spinach and salmon with their bare hands: no gloves, nothing !!! Nooooo minimum hygiene !!!"], ["NO tea in this tea shop!", 3.0, "November 23, 2013", "Alison F", "lewes", 32, 21, "Dying for a cup of tea and French fancy we chose Paul as I knew they were good from their cafés in Paris and London. Oh dear they'd run out of normal tea....!! Perhaps the manager could have shown a little initiative and gone around the corner to buy some supplies but no, they were 'waiting for a delivery' ...as...\n\n\nMore"], ["They forgot my order completely!!!", 1.0, "November 21, 2013", "PrettyEastSussex", "London, United Kingdom", 42, 23, "After we heard so much good about this place for breakfast. So we decided to go there to try on our last day in Washington. But we were very disappointed, first they delivered my husband's but completely forgotten mine till I asked then the food didn't even live up to its so called reputation. We left most of it and...\n\n\nMore"]]], ["The Saloon", [["Great Bar!!!", 5.0, "February 20, 2015", "Tonywbushwacker", "Vincennes, Indiana", 2, 0, "Great Bar!! Wonderful choice of good beers, and good place to drink with friends.\nJust a few blocks north of the hustle and bustle of the sites and trendy big city bars.\nHighly recommend!"], ["cool bar", 4.0, "November 16, 2014", "mark10Ohio", "Ohio", 10, 5, "comfy bar with good selection of beer. A no nonsense attitude which is cool but also a bit ridiculous. \"We don't serve martinis\" ?!"], ["A reprieve from the bustle of U", 4.0, "November 13, 2014", "nderiley", "Washington DC, District of Columbia", 86, 35, "The Saloon is a non-profit bar that uses it's money to build food and homes in third world countries. Because of this rocking philanthropy, they close for a month or so every year - but the rest of the time it's a great, relatively quiet place to grab quality beer.\nThe bar has lots of quirky fun rules, no standing...\n\n\nMore"], ["Beer menu gets 5 stars, food was average", 3.0, "March 5, 2014", "merideen", "Charleston, West Virginia", 22, 9, "We ended up stopping here because of how crowded Ben's Chili Bowl was that night. This bar was on the hipster/pretentious side (who makes rules for a bar!), however the beer was worthy of some pretension. There was a wide selection of German and American beers and they pulled full pints which is nice. The food was average, it tasted...\n\n\nMore"], ["Come Again", 5.0, "November 7, 2013", "TTommy69", "Kennewick, Washington", 30, 8, "I passed by on the way to Ben's Chili Bowl, a \"DC landmark.\" Since Ben's is cash only, and I carry no cash, the couldn't, wouldn't, serve me. Fortunately the Saloon is next door. I do not think I have ever been into a more accommodating establishment.\nNote the rules and realize that your patronage is helping establish schools in...\n\n\nMore"], ["Fun and great bar food!", 4.0, "November 2, 2013", "TheByrdsTheWord", "Providence, Rhode Island", 34, 13, "Great German bar with surprisingly good food. Overall, another fun experience on U Street. Our bartender was extremely friendly and helpful."], ["Great beer!", 4.0, "July 31, 2013", "WendieW10", "Arlington, Virginia", 11, 0, "The Saloon is a cozy little bar down a couple steps off U Street. They have very strict rules :-), so read the menu & walls so you don't get harangued by everyone - i.e. you HAVE to order drinks & wait for them to come before ordering food; no talking on cell phones; split checks get charged an extra...\n\n\nMore"], ["4th of July at the National Mall", 4.0, "July 22, 2013", "ehhviino", "Philadelphia, Pennsylvania", 34, 6, "I visited the Saloon with my parents, sister and good friend (I was visiting the latter two who live in DC but hadn't been to the bar before) to have a drink on our way out of Ben's Chili Bowl (supposedly a DC landmark that sadly does not offer alcoholic beverages). While the bartender (he seemed to have an accent...\n\n\nMore"], ["A menu for Beer...top marks from me", 5.0, "June 14, 2013", "iwficon", "England", 87, 49, "Looking for somewhere to have a quick drink before attending a gig at the U Street Music Hall, we found ourselves in The Saloon.\nIt has a quirky feel, with funny slogans on the wall, as well as information on the schools in third world and impoverished nations that your money is helping to pay for.\nThere was a very...\n\n\nMore"], ["GREAT BEER & BAR FOOD!", 5.0, "April 16, 2013", "gatormomlaura", "largo, fl", 15, 7, "We stopped in the Saloon for some libations after a busy day of sightseeing. The beer selection was excellent. We sat and relaxed and were never rushed. We order some wings, onion rings and hummus. The wings were delicious and had a tangy spicy sauce. The onion rings were absolutely delicious. I'd pass on the hummus.\nA great place to...\n\n\nMore"], ["unique", 5.0, "September 29, 2012", "realist1Montana", "montana", 74, 43, "The place does not open until about 4:00/ 5:00 pm, but was worth waiting for after traveling all day to DC.\nIt has the most incredible beer selections from all over the world I personally have ever experienced. They tell you right up front in the menu they don't ask for your food order right away, so that you take...\n\n\nMore"], ["Friendly and quirky!", 4.0, "May 11, 2012", "Diana5101", "Ventura, California", 87, 47, "Stopped by for a drink after dinner so we didn't eat. We tried some new beers and enjoyed the quirky atmosphere. Our waiter was welcoming and friendly. We were quite impressed with their pet project for building schools in third world countries. Nobody could argue with that!"], ["great place to meet friends and talk", 4.0, "April 5, 2012", "scrappy56", "Greensboro, North Carolina", 64, 59, "Stopped in while waiting to meet friends and sat at the bar. They have a great beer selection and serve drafts in true half-liter glasses. There are no American bottles here, but plenty of good beers from other countries. I did not try the food. It has the feeling on a well traveled neighborhood bar and I would definitely return....\n\n\nMore"], ["great beer-adequate food", 4.0, "November 19, 2011", "EmptyNesterMom", "Northwestern New Jersey", 93, 52, "I love the warm cozy atmosphere of this casual downstairs bar, and the spirit which motivates the staff to close up once a year to go build schools in Afghanistan, devoting a percentage of revenue to support the costs of this good deed.\nThe beer selection is very special. The specialty is a one-year brewed strong beer, almost a liqueur,...\n\n\nMore"]]], ["M Cafe Bar", [["Bolognaise - Ragu Ragu Ragu", 5.0, "November 13, 2014", "slinde77", "Washington, D.C.", 27, 7, "I went to this restaurant initially to see my friend Smitty, the new bartender. But I was so surprised by the food. The pasta is all homemade, the risotto delicious, but the bolognaise was superb. Nice pour for the drinks and great conversation and quite neighborly. Its a cozy place where the manager is there to welcome you and so...\n\n\nMore"], ["Great food! Went in just by chance", 5.0, "November 12, 2014", "thealinda", "media, pa", 35, 19, "It was a Saturday night and we were walking up and down 14th street trying to decide on a restaurant. We happened to choose M and we were not disappointed. The service was very good and the food was excellent. I had Tortellacci with butternut squash & pumpkin seeds and ate every bit of it. I highly recommend this restaurant."], ["Brunch, no waiting", 5.0, "November 2, 2014", "NDubu", "Pittsburgh, Pennsylvania", 13, 7, "We were in DC for a wedding and walked from our hotel at Thomas Circle. A friend had recommended at French place further up 14th but the wait was over an hour. We started walking back, having passed many other restaurants on our way, when we noticed the M Cafe Bar. It was not crowded, the menu out front was...\n\n\nMore"], ["Very good Italian food!", 5.0, "October 25, 2014", "Catinca C", "Bucharest", 21, 3, "I loved the food, very close to an Italian experience! The lemon sorbet was just as I remember it in Positano this summer; the fish was very tasty, the vegetable accompanying it also. Good wine also, as recommended by the waiter. Overall good experience, would go again on a next trip to Washington, sincerely I don't understand why this restaurant...\n\n\nMore"], ["Great meal", 5.0, "October 7, 2014", "HorraP", "Panania, Australia", 30, 21, "Our first night in Washington\nAnd we stumbled across this well presented eatery. What a bonus! We had the house special osso bucco with risotto and the risotto funghi. It was delicious! The new manager Luis was welcoming and engaging and we were well looked after by the wait staff. We might try and get back there again if our...\n\n\nMore"], ["delightful meal on muggy evening", 4.0, "July 28, 2014", "sfgardener", "SF, CA", 204, 75, "We chose an outside table on a warm night.\nI enjoyed a salad and out-of-this-world duck. The recommended wine not only went well with the meals, but was not the most expensive one on the menu.\nOur waiter was very attentive, but didn't intrude. His descriptions of food choices were very accurate.\nThe staff kept our water glasses replenished --...\n\n\nMore"], ["Very bad", 1.0, "June 14, 2014", "Zach R", "Paris, France", 24, 14, "We decided to try as it seems to be like a nice place. The service was slow and bad. For the price i would go somewhere else and it seems like a kid's meal hahaha. We tried the salmon and the chefs special. Dont waste your money here"], ["Good and Reliable", 4.0, "May 14, 2014", "DCNike", "Washington, DC", 60, 23, "Been there twice already, once for brunch (good) and once for dinner (also good). Not spectacular but consistently good with decent choices and a good serving staff. The outside seating allows us to being our dog which makes this more attractive. A good addition to the up and coming 14th street."], ["Cute place", 3.0, "April 27, 2014", "Ricardo V", "Washington, District of Columbia, United States", 2, 1, "Service was awesome. The ambiance is beautiful. I ordered the Risotto and it was undercooked. The wine pours are very small. Too pricey for undercooked Risotto. Might give them a 2nd chance..."], ["Good Food, Great Service", 4.0, "January 28, 2014", "WashingtonJonDC", "Washington DC", 248, 109, "Dined here with a group to celebrate a friend's birthday and we all enjoyed our time here. As one of the newer restaurants on 14th street, we (all DC residents) wanted to try this place. We came later in the night so they weren't so busy anymore. We ordered appetizers for the table: cheese plate, salumi plate, fried calamari and...\n\n\nMore"], ["service left much to be desired, but the foundation is there", 3.0, "September 27, 2013", "jg325", "WashingtonDC", 489, 320, "My partner and I ate at M Cafe Bar for a Friday night date, and overall I felt it was a pretty good addition to the hip 14th Street restaurants, but it is clearly still working out the kinks.\nFirst of all, it was packed when we arrived, so that's a good sign that there's buzz surrounding a new restaurant....\n\n\nMore"], ["New, Growing Pains but EXCELLENT Food", 4.0, "September 3, 2013", "HillTraveller", "Washington, DC", 124, 56, "Open only 10 days, this is going to be one of THE spots on 14th Street! The best pasta we've had in years!\nThe octopus is to die for!\nThe staff is great! The management is matches the staff. They are also attentive and excellent.\nNice outside seating!\nNice private room for parties\nWELL worth the reservation"], ["Splendid modern Italian addition to the 14th and U neighborhood", 4.0, "September 2, 2013", "boybanker", "Washington DC, District of Columbia", 141, 67, "We decided to try something different for our weekly 'night out' and were very impressed with this restaurant, open only since August 22. 14th Street has an embarrassing surplus of new places--all full almost from when they open--M Cafe/Bar is a worthy addition.\nWe were greeted warmly, and decided to sit inside near one of the big windows overlooking the...\n\n\nMore"]]], ["The Black Squirrel", [["Good beers and burgers", 5.0, "September 13, 2015", "J J A", "Washington DC", 134, 62, "Four of us had beers and burgers at The Black Squirrel. The beers were great and they had a good variety. We were able try ten plus different beers and they were all pretty solid. The burgers were great and I am picky about burgers. Plus the sweet potato fries were good too. Our service was decent. I highly recommend...\n\n\nMore"], ["great hamburger", 4.0, "July 23, 2015", "danc25", "Munroe Falls, Ohio", 43, 7, "Went to Dc 19th-21 of July. My wife and I had dinner at the Black Squirrel It was worth it . We stayed close to here so we walked . I had the hamburger And my wife had the fish and chips, both were excellent. We also had craft beer which they have a good selection"], ["Great beers", 5.0, "April 9, 2015", "Barbara C", "New York City, New York", 30, 6, "Great variety of beers, great location, fun atmosphere, fun croud. Food is a bar food, but very nice."], ["very disappointing", 2.0, "March 21, 2015", "James E", "Washington DC, District of Columbia", 1, 1, "After reading all the positives reviews here, I had dinner at the Black Squirrel tonight and was very disappointed. My order of chicken wings was undercooked and had to be sent back to the kitchen, the veggie burger was super plain, no flavor whatsoever. And the worst part: a side order of fries costs 11 $ at this place. The...\n\n\nMore"], ["Only so-so I'm afraid", 3.0, "November 15, 2014", "LondonPhilC", "London", 101, 46, "We popped into the Black Squirrel to kill some time on a night our in Adams Morgan and to be honest it was only a so-so experience. The atmosphere in this below stairs bar is a little edgy but not unwelcoming, but service wasn't great - after a great deal of searching (upstairs and downstairs) the wine my wife ordered...\n\n\nMore"], ["Great Hamburger", 5.0, "November 13, 2014", "WuSongLong", "East Central Indiana", 57, 31, "Had a good hamburger here. They had a large selection of specialty burgers, and I was able to enjoy the experience."], ["Great neighborhood bar", 5.0, "October 30, 2014", "Douglas W", "Lake Bluff, Illinois", 23, 3, "Very good beer selection. I would have liked to see more beers from the DC area but overall very good. Four ounce tastings give you a chance to try a lot of different beers."], ["In praise of a great burger place", 4.0, "September 20, 2014", "Jean A", "Bethesda, MD", 141, 29, "Okay, so the kitchen forgot the grilled onions and the goat cheese, but remembered the fried egg and the side salad. Kate, the server, was very good despite having quite a few tables to take care off. She made it all right with a great smile and conversation. Went on the 1/2 price Thursday night but didn't have any problems...\n\n\nMore"], ["great gourmet burgers", 4.0, "June 29, 2014", "Zack958", "USA", 18, 15, "Went on a weekday evening in June 2013. Upstairs restaurant was a tight fit and crowded, but downstairs bar was oddly empty (although you can order from the menu there as well). One of my co-workers said it was the best burger he'd ever eaten; don't know if I'd go that far, but it was definitely a high-quality burger with...\n\n\nMore"], ["Best Burger? DEFINITELY Not...and Far From It", 2.0, "March 18, 2014", "BlondBlzr", "Chicago, IL", 27, 32, "If you are as high as the bartender, the burgers might actually taste good.\nWe stopped by to check out the menu as I had read things about this being one of the top places for burgers. The bartender spent 5 minutes telling us all about the burgers. Totally sold us on how the burgers are made with duck fat,...\n\n\nMore"], ["Sorry... we're out...", 2.0, "November 23, 2013", "ECfromTA", "Champaign, Illinois", 142, 77, "We met a large group of friends at the squirrel during our recent visit on a Friday night. Though the atmosphere was nice the service wasn't the best and they were out of most of their beer menu (on a Firday night?!)\nWe really enjoyed the company of our friends but the place itself is not at the top of...\n\n\nMore"], ["Great burger and draft beer selection ...", 4.0, "June 17, 2013", "whollows", "Naples, Florida", 129, 29, "I dropped in for quick bite and to sample some great beers. It's multilevel so don't just stop when you first walked in.\nI sat at the bar and got very good service from Morgan. She really new her beers. Even though there was no beer sampler/fight - I had Morgan pick a few to surprise me. All great beers....\n\n\nMore"], ["most unique veggie burger", 3.0, "April 29, 2013", "waverider681", "Detroit, Michigan", 283, 96, "This establishment certainly wins the award for the most different veggie burger I have ever eaten. It was more of a veggie pouch consisting of a mixture of mushrooms, quinoa, and other veggies all wrapped up in thin slices of eggplant. I must admit, I admire the creativity, but it certainly did not have the satisfying texture or mouthfeel I...\n\n\nMore"], ["Nice beers; perfunctory service", 4.0, "April 26, 2013", "BoCoMoTiger", "Columbia, Missouri", 249, 75, "We went as a group of 8 to the Black Squirrel on a Tuesday evening after dinner for a few beers. The place was largely empty and we were able to get a seat immediately. The beer selection is pretty good, although not everything listed on the website was available as each floor seems to have different beer selections. The...\n\n\nMore"], ["Cool bar, beer selection interesting but small", 3.0, "April 16, 2013", "Annawaltzerpose", "Manchester", 63, 51, "Attended early evening on a Saturday night. The venue was surprisingly quiet so seating was no problem. The bar staff were attentive and efficient.\nThe beer selection offered some variety, but was not huge. The prices were standard for DC, and we enjoyed the option to try the beers in small 4oz tasters.\nIf you're in the area, certainly a...\n\n\nMore"], ["Ridiculously Disappointed", 2.0, "April 1, 2013", "Wendy F", "Yonkers, New York, United States", 69, 18, "Really disappointed with our experience at this bar. My fiancee and I are from out of town, so we did a fair amount of research on various restaurants and bars in each of the different neighborhoods that we wanted to check out. We went to The Black Squirrel on a Saturday night, around 7:30 or so. Seating was no issue,...\n\n\nMore"], ["cool bar", 4.0, "March 31, 2013", "6stringer00", "Hagerstown, md", 88, 26, "never been to Adams Morgan before, stopped by on a friday evening, and couldnt believe how packed the Squirrel was, but was able to get two drafts at the bar and went outside to enjoy the sights. The bar is 3 floors, but only went to the basement, which was really neat. will go back again."], ["Fantastic value", 5.0, "March 25, 2013", "David_from_Glendale", "Glendale, California", 66, 36, "Had one of the best steaks ever, a nice sized 8-oz filet mignon, for $19 including wonderful mash potato and spinach. Menu overall looked very enticing with a design-your-own burger. The decor is funky and odd, but worth putting up with for this fantastic steak! It's a tiny place so you have to search for it."], ["Best Cheeseburger in Washington, DC", 4.0, "December 28, 2012", "iStefPayne", "Washington DC", 126, 58, "Right in the heart of the madness of 18th street there is a place dedicated to more mature bar-goers (27+). This relaxed atmosphere has a bar and tables, plays games on tv's throughout, and has a thoughtful beer selection. Sometimes, they are understaffed and it shows in the service, but all in all, this is a great neighborhood joint."], ["Lack of personality", 2.0, "December 17, 2012", "Wendy C", null, 3, 0, "The beer selection was great, the atmosphere trendy and fun, the bartender was so bored and grumpy that it made it a struggle to enjoy even one tasty beverage. Disappointing since we looked forward to an evening here on our travels from New England."], ["Above Average Bar /Restaurant in Adams Morgan", 4.0, "November 8, 2012", "Ant1007", "Hyattsville, Maryland", 116, 38, "So on election night a group of friends and stop by The Black Squirrel had a couple of pints and a few apps and burgers. The service was good especially considering how crowd the place was for a Tuesday the wings were good the burgers were flavorful and not cooked to death. Black Squirrel has a nice selection of premium...\n\n\nMore"], ["Great Beer, great prices", 5.0, "October 13, 2012", "JENNMCC", "Wellington, OH", 120, 63, "Excellent craft beer selection with many pumpkin choices! Loved that they had 4oz pours too, sometimes you just don't need another pint. Was totally shocked they had the elusive DFH 120, my husband was thrilled, only his second time finding it. We enjoyed the bar on the lower level and had a wonderful bartender who made even us tourist feel...\n\n\nMore"], ["Fun place for a burger and a brew", 4.0, "August 31, 2012", "1982PandB", "Jackson, Michigan", 40, 13, "We were looking for a place to enjoy a nice cold beer. The Black Squirrel had a great selection. Lots of craft beers to choose from. The service was great."], ["It's the beer stupid!", 5.0, "July 15, 2012", "Craftbeerlovers", null, 1, 0, "Wandered into this fabled craft beer centric saloon in the heart of Adams Morgan looking for some serious stouts to sample and left 3 hours later with mission accomplished plus! We drank our way to the stouts sampling a variety of pilsners, ales, porters and IPA's on the way. With 57 amazing craft beers on tap over 3 floors we...\n\n\nMore"], ["Excellent bar", 5.0, "July 9, 2012", "Cuddlydodo", "Leeds, United Kingdom", 6, 26, "We visited in April, early evening when only the 'middle' bar was open. We're big fans of US brewing, and the Black Squirrel had an excellent selection, plus a couple of their own beers. Fantastic veggie burgers, a real cut above the usual. A special word for our barman - I think his name was Ray? - who was knowledgeable...\n\n\nMore"], ["Great beer selection and burgers!", 5.0, "March 27, 2012", "BBasil", "Milwaukee, Wisconsin", 30, 17, "We loved this little neighborhood pub. One of the best beer selections around. Tons of seasonal and unique brews. Best burger Ive had in awhile. Will go back next time I'm in DC."], ["Stouts!", 5.0, "February 24, 2012", "September123", "Lake Ridge, Virginia", 14, 5, "Wonderful stouts! I highly reccomend their Breckenridge Oatmeal Stout\nand their New Holland Night Tripper Stout. Both incredible. We ate before we went, but wanted something to munch on. We ordered their macaroni and cheese from their starters menu because it was award winning, it was good but not in my book worth an award. But the service, stouts, and...\n\n\nMore"], ["Over priced bar food and excellent but expensive beer selection", 2.0, "March 1, 2011", "RHamilton22", "Miami, FL", 18, 10, "I ordered food here and it just wasn't worth half the price I paid, the quality and flavor was very poor. I love bar food but this place just didn't cut it. I went because of the beer selection and it did meet my expectations but it is over priced, you can find much better."], ["Large Beer Selection, Unique Setting, Don't Order Calamari", 3.0, "January 12, 2011", "jmalt12", "Washington DC, District of Columbia", 14, 2, "We went to The Black Squirrel to meet some friends early evening on a Saturday. We thankfully got a large enough table for the 6 of us and all the guys were able to watch the football playoffs. Our waitress was really good, despite of the bar being very busy. Beer selection is huge, and on the pricey side with...\n\n\nMore"], ["Great beer selection, delicious mussels. Frites were pretty good, but definitely not the best in town. A nice change of...", 4.0, "April 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great beer selection, delicious mussels. Frites were pretty good, but definitely not the best in town. A nice change of pace from the average Adams Morgan drinking hole, too."]]], ["California Grill", [["Great food and service", 5.0, "September 13, 2014", "AFVeterantravelers", null, 8, 3, "This place is a hidden gem! It's clean, fast, inexpensive and serves great food. The staff was very friendly and squared away! We had breakfast and lunch there several times during our stay in DC and was never disappointed. One of my friends left his cap there and I called from across town, they found it and gladly held it...\n\n\nMore"]]], ["Sodexo Catering at National Geographic Society", [["Fresh, delicious, and affordable breakfast!", 4.0, "August 9, 2015", "Karen S", null, 11, 6, "Sodexo opens at 7:30 for breakfast. There is an amazing juicing bar, fresh fruit, oatmeal bar, and fresh hot food and savory pastries. Wonderful bargain in a nice setting. Closed weekends."], ["Unique lunch cuisine, excellent prices, large sunny dining room", 4.0, "May 20, 2015", "ZukiMini", "Arlington, Virginia", 28, 15, "Rub elbows with National Geographic staff and explorers while dining on delicious world cuisine for extremely reasonable prices in a beautiful, large, sunny dining room. This is the best kept secret in DC lunch establishments. In addition to a rotating selection of hot entrees ( Moroccan chicken, roasted eggplant, basted turkey, jerk chicken, and sauteed kale, just to name a...\n\n\nMore"], ["Could kick myself", 5.0, "December 19, 2014", "Jessicac0716", "Washington DC, District of Columbia", 12, 56, "I really could kick myself for not going here sooner at the recommendation of a friend.\nThis place has several fresh reasonably priced options from fresh steamed in your face veggies, to a salad bar, sammies, specials, and even ice cream. They have the best prices in this area too. By far.\nThe dining area allows for diners to enjoy...\n\n\nMore"], ["Fantastic and inexpensive lunch", 5.0, "November 3, 2014", "NCR_Flyer", "N. Virginia", 116, 53, "On the business side of the National Geographic Society headquarters building is their café. They have a great selection of hot meals, grill, sandwich bar, salad bar, soups, drinks and other specialty things. It is less expensive than most of the other options in the area and the quality is great.\nNote: Mondays are meatless."], ["Bargain DC Museum Food", 4.0, "September 19, 2014", "TreyMcC", "Reston, Virginia", 24, 15, "I met someone who works at National Geographic for lunch and was very impressed with their cafeteria. They have several stations, including a grill (burgers), sandwich, sushi, soups, salads, world cuisine, and live action cooking. I opted for a chicken tikka curry wrap while my friend bought a salad. Her decent sized salad came to about $4 which is an...\n\n\nMore"], ["Cheap & Tasty Lunch Spot", 4.0, "July 24, 2014", "Darrell6t", "Washington DC, District of Columbia", 45, 15, "The cafe at the National Geographic is now open to the public and has good food at very reasonable prices. They serve everything from sandwiches to a salad bar (by the oz.) and entrees that vary every day. It has a number of stations, some self-serve and others with someone to make your food. We have been three times and...\n\n\nMore"]]], ["Haydee's", [["Good food, great service plus 80s music!", 4.0, "September 12, 2015", "Maureen R", null, 14, 2, "My husband and I were pleasantly surprised by this colorful restaurant. We chose Haydees because we were looking for Latin American food and this restaurant had decent ratings. The decor is a bit funky but fun, and the soundtrack of 80s music had us reminiscing about the good ole days! We were quickly seated and helped by a very friendly...\n\n\nMore"], ["Neighborhood restaurant with a vibe", 5.0, "March 25, 2015", "christianefrischmuth", "washington", 12, 4, "I have always had a good time at Haydee's. The food is consistently good and plentyful. The margaritas are very good and the staff is friendly and upbeat. I particularly like the easy going atmosphere and the music. Neighborhood bands play, young musicians get a chance to show their talent, people drop by for a few guest appearances. The owners...\n\n\nMore"], ["Fun and funky neighborhood bar with Salvadoran flavor", 4.0, "February 21, 2015", "AdventurousTraveler6", "Laramie, Wyoming", 97, 77, "This bar has the atmosphere of a fun and funky DC neighborhood dive, with an overtone of Central American that stretches from the decor to the music on the jukebox. I had the ceviche, which was authentic and tasty. If the weather's cold, it can be chilly near the windows."], ["Salvadorian Food at the heart of Mt. Pleasant", 4.0, "November 12, 2014", "Prawet J", "Washington DC, District of Columbia", 238, 73, "One has to know and get beyond the outside look and the funky decor of the restaurant. Once you settle in, the staff is attentive serving you with big smile. You can also practice your Spanish with the staff and the other patrons at the bar. Margarita is very popular here (don't expect fancy bartender mixed). Most dishes are good....\n\n\nMore"], ["Why not have good music and fun Mexican food?", 4.0, "August 14, 2014", "Jean A", "Bethesda, MD", 141, 29, "Had heard of Haydee's long before I ventured into Mt. Pleasant to check it out. A friend plays in Rock Creek Jazz which performs twice a month and there's some kind of entertainment four night a week, maybe more. The food is better than the regular Mexican familiar to most Americans and the audience is a lot of fun, oftentimes...\n\n\nMore"], ["Go!", 5.0, "October 29, 2013", "SRK1111", "East Windsor, New Jersey", 9, 1, "Nice atmosphere. Very cool building inside, and huge. Two levels with several bars, and a balcony. DJ was good. Bartenders were cool. The drinks with fresh squeezed oranges and grapefruits are awesome."], ["Fun Greasy Hispanic Food", 3.0, "October 28, 2013", "Jess M", "Washington DC, District of Columbia", 25, 23, "This place is (from my experience) your typical casual Hispanic food restaurant. I ordered the veggy quesadilla ($8.25) and cheese pupusas ($4.99 for 2). Both were tasty and the veggy quesadilla was particularly great because they used whole fresh vegetables instead of a few slivers of frozen onions/peppers like some places make. The bartender told me that the margaritas are...\n\n\nMore"], ["What a gem!", 5.0, "September 30, 2013", "Linney78", "Maryland", 8, 1, "Hubby and I had a great time at Haydee's. We had a Groupon for our visit. The steak fajitas and beef enchiladas are excellent! We also had the Fiesta Margaritas and they were also yummy!"], ["The Fajita Steak... so good!", 4.0, "August 9, 2013", "Erin M", "College Park, Maryland", 83, 63, "I went here with friends with a groupon deal. I had absolutely zero expectations for how good the food would be, but I was so pleasantly surprised. I had the fajita steak taco salad, and the steak was sooooo delicious. (And the taco shell was different from others I've had. I don't know what made it different, but I liked...\n\n\nMore"], ["Fun atmosphere and great service", 4.0, "June 22, 2013", "Peter V", "Boulder, Colorado", 304, 132, "What distinguished this restaurant from hundreds of other Tex Mex variations is that this is not a chain and has an ever present and very friendly owner whose enthusiasm is shared by the entire staff. Fun atmosphere and good food."], ["Good Latin food but Ercilia's is better", 3.0, "June 13, 2013", "OldBarnacleJaffee", "Washington DC, District of Columbia", 39, 14, "I like this place a lot. The food is great. Beans are fantastic. Salvadoran tacos are great. Decent tequila selection. On a street with several latin places, this is the second best. I thought it was the best until I tried Ercilia's. Haydee's is the best place that serves booze. But if you just want a decent pupusa go to...\n\n\nMore"], ["Very good service!", 4.0, "February 22, 2013", "TinkWDC", "Washington DC", 68, 16, "The service here is great! The food and alcoholic beverages are good and priced right. Although the restaurant doesnt open until after 4pm it is a joy that it stays open late into the night when most other restaurants have closed. After certain hours and on certain days the upstairs becomes a \"nightclub\". Im not a big fan of having...\n\n\nMore"], ["Just OK.", 3.0, "February 4, 2013", "Jontae1", "Washington DC, District of Columbia", 99, 187, "I purchased a Living Social coupon for $20 off at Haydees and just visited there recently. We arrived a few minutes before 5PM on a Sunday and the place was near empty, with only two tables occupied. We ordered veggie fajitas, soft chicken tacos, a house margarita and a Cuervo margarita.\nThe Good: The vegetables that came with the fajita...\n\n\nMore"], ["Tons of good reasons to love this place", 5.0, "August 2, 2012", "zellywelly", "Virginia", 118, 37, "The food here is really good. I've often gotten lucky to come here when there is live music too. The place is large so I've never had issues with getting a table ever and I've been here a lot. The best part though is that they are open incredibly late. I can't even tell you when they close because I've...\n\n\nMore"], ["Great local spot", 4.0, "May 27, 2012", "Josh N", null, 7, 0, "Haydees is my local go-to Mexican restaurant. It's worth pointing out that Mexican in DC is just not the same as in The southwestern United States. However, the food is tasty and the service is excellent. The margaritas are good, I would recommend sticking with the inexpensive ones as the do the job very well.\nOverall, this is a solid...\n\n\nMore"], ["Meh...I've had better", 3.0, "September 25, 2011", "athena381", "Washington, DC", 132, 68, "Tried this place after buying a Groupon. In a nutshell, the food was good but there were other things that really annoyed me.\nFirst the food. Remember this is a Groupon deal....it was for dinner for tow - two margaritas with Chicken and Steak Fajitas for two. The food was good....very tasty. We also ordered the guacamole....meh. It had sour...\n\n\nMore"], ["Fun place for local fare, margaritas, and mariachi!", 3.0, "March 27, 2010", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fun place for local fare, margaritas, and mariachi!"]]], ["Poppabox", [["College Hangout", 5.0, "September 24, 2015", "Lexi S", "Washington DC, District of Columbia", 21, 2, "I love this place! Very good food, but a little bit pricey for what you get. However, not many places in DC get rice right and Poppabox does. The cute building and style of the whole place are a major plus. Perfect for college students."], ["Quick and tasty", 4.0, "September 12, 2015", "Millie22_12", "Bloomfield Hills, Michigan", 25, 6, "While walking down Pennsylvania Ave. on the way to the White House with my daughter, we wanted a quick, substantial, but healthy lunch. We decided to try this cute little restaurant. Several doors were open on this beautiful Fall day and there were a limited number of tables. Went up to the counter and I ordered the mini bulgogi and...\n\n\nMore"], ["Quick smoothie/boba!", 4.0, "July 6, 2015", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "This was a great first experience! My friend told me I had to try a boba drink, so I got the honeydew, and it was pretty good! The restaurant itself was nice, too, in that there was plenty of seating, it was cool on a hot day, and the doors were open, so it was pleasant even on a hot...\n\n\nMore"], ["Poppabox", 4.0, "March 1, 2015", "Jody A", "Auburn Hills, Michigan", 7, 2, "A quick and reasonably priced breakfast. Close to Hotel Lombardy. Only a handful of tables, but lots of people were doing takeout."], ["Don't just walk by at lunchtime", 4.0, "November 7, 2014", "SeatOfMyPntsTravelr", "Washington DC, District of Columbia", 492, 148, "Located near GWU and the IMF this place is great for both student and businessperson. The options are fast Korean, Japanese, wraps or waffle sandwiches. You can even get fried chicken and waffles here! What I really like is that they have a \"Mini-bowl\" option which is the perfect amount if you have limited time and/or don't typically stuff yourself."], ["Tasty fusion \"fast food\"", 5.0, "August 19, 2014", "lynn k", "Edmond, Oklahoma", 11, 0, "Easy to grab a healthy, tasty lunch with lots of veggies and if no tables, eat in the park across the street. Wraps, bowls, and boxes featuring seafood, pork and chicken with an Asian flare."], ["Good for a Quick Bite", 3.0, "August 1, 2014", "Robert L", "North Hills", 424, 203, "Poppabox is an interesting little place on the corner. I decided on the waffles and eggs with ham. Everything was served in a “to-go” box even if you want to “eat-in.” Here’s what I got: Two mini-waffles (cut in half), 3 paper-thin slices of ham, and two eggs. It was all good but different. Sort of a mini-breakfast-in-a-box and a...\n\n\nMore"], ["Bubble tea", 3.0, "May 20, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "It's a small Asian inspired place located b/t N 19th St & N 20th St (close to Georgetown). It's good for a quick lunch or just to grab a bubble tea or ice cream.\nI had a mango bubble tea. It was a little too sweet for my taste and also a bit expensive ($6).\nNice staff."]]], ["Bistro Italiano", [["Delightful, cozy and delicious", 5.0, "October 5, 2015", "Melissa C", null, 25, 4, "We chose this restaurant based on proximity to the Russell Senate bldg and wanted Italian. The food was great! The neighborhood that it's in is very quaint. So glad that we found it!"], ["Nice escape from DC hustle and bustle", 4.0, "August 24, 2015", "1L0ve2Trave1", "Utica, New York", 6, 12, "This was a quaint, quiet, home cooked, quality, tasty, appropriately portioned, reasonably priced meal served without hustle and bustle like many other high priced DC restaurants. A hidden treasure. Glad to have found it!"], ["Nice broad menu. Lots of choices", 4.0, "August 10, 2015", "GCK", "wyoming", 11, 8, "Had a lovely spicy diabolo red sauce with scallops. Clean, neat, good service. Nice to have lots of choices in noodles, meats, and sauces in a small restaurant. Also priced very well, less than many in this area"], ["Average", 3.0, "May 28, 2015", "Doyle C", null, 16, 6, "We had read reviews and so we were a bit disappointed. The salad was very basic and the red sauce on the spaghetti was a bit runny and had a smokey bbq flavor. The server was pleasant put quite tentative; probably just lacking experience."], ["Quaint place with good food", 4.0, "April 4, 2015", "ShanersD", "Salt Lake City, Utah", 50, 14, "Found this place by walking through the neighborhood. It's small but has good food and the service was decent even though our server seemed to be the only one working the tables. She was very cheerful and attentive. The food portions were large and hearty. I would definitely come back when I visit again."], ["Red sauce Italian with tablecloth", 5.0, "March 23, 2015", "Robert Y", "Millburn, NJ", 30, 9, "This was my first chance to eat in my daughter and son-in-law's favorite neighborhood Italian restaurant. I am looking forward to going back. My calamari fra diabolo was the best I've ever had. The squid was tender and briny, and the red sauce was rich. My wife's shrimp (wild I think) and eggplant with linguini and marinara was equally good....\n\n\nMore"], ["Quaint", 4.0, "February 27, 2015", "i911", "Otis, CO", 41, 17, "Very small little joint that accommodated our large group happily then supplied us with a free round of champagne to thank us for our often thankless jobs (9-1-1 dispatchers). The pasta dishes were fantastic and the portions were plentiful."], ["It was ok...", 3.0, "February 7, 2015", "Tiffany H", "Purcellville, Virginia", 13, 6, "The food was really good but I wouldn't describe everything as Italian food and they had some mistakes on the menu. Our waitress was very friendly and attentive."], ["It was okay", 3.0, "February 3, 2015", "DanielUnterrainer", "Nals, Italy", 1, 0, "The food was good, but as Italian restaurant the desserts should be real Italian and not kind of. Especially the \"tiramisu\" was nothing to be called Italian tiramisu. And even the manager didn't know, why the \"Italian rum cake\" is called Italian. Btw the Tullamore Dew whiskey is from Ireland and not scotch whisky. The waitress was really friendly and...\n\n\nMore"], ["Nice lunch close to friends", 3.0, "December 6, 2014", "Tom P", "Washington DC, District of Columbia", 108, 46, "I've only been here for lunch several times. The pizzas are very large for a single. The veal parmagean is good, nothing special but good. The Lasagne is also good."], ["Neighborhood small restaurant. Nice staff.", 4.0, "November 8, 2014", "MCNICE9", "Long Valley, New Jersey", 176, 110, "Reservation accepted in this small italian restaurant. Not so busy but sll tables taken at some point. Menu has the essential italiam dishes. I found portions relatively small vs what we get in our neighborhood restaurants in nj. Staff was corteous and helpful selecting menu items. The sponge chocolate mousse cake was one of the best i ever had. Really...\n\n\nMore"], ["Neighborhood Italian Restaurant", 5.0, "November 5, 2014", "Traveler10531558", "Jacksonville, Florida", 78, 24, "Came in with a large group. Very small restaurant with great service and wonderful food. We appreciated the service and the food was good."], ["OK but not more", 3.0, "October 2, 2014", "Neville H", "Perth, Australia", 28, 7, "food was good but not outstanding (in particular the garden salad with one slice of cucumber and two cherry tomatoes was very average), no stars in the American wine selection and service was just OK (had to remind them that we had ordered some wine)"], ["Little neighborhood Italian place on Senate side", 5.0, "September 19, 2014", "MODSquadT4", "Alexandria, Virginia", 65, 31, "I've eaten at Bistro Italiano for years and owe them this review. It's small and has a fairly basic Italian menu, but they consistently provide a good meal with kind, understated service. I refer friends there often and they always fall in love with it. Many DC folks don't know it's there because it's tucked in a row of houses....\n\n\nMore"], ["Very good and great value!", 5.0, "July 5, 2014", "etzv", "South Carolina", 63, 26, "This is a great place to eat while in DC. In a quiet area. Great Italian food. Loved the antipasto salad. Family had spaghetti and chicken parmesan."], ["Pizza Delivery No-Show!", 1.0, "July 3, 2014", "TapleyJordanwood", "Woodland Park, Colorado", 4, 3, "Ordered a pizza at 9:30 pm, called back at 10:20 -- no answer, no pizza. Why take an order if you don't intend to deliver?"], ["Nice place off of the beaten path.", 4.0, "March 28, 2014", "Brian C", "Rome, New York", 139, 78, "We came across this place on the internet and decided to give it a shot as it got good reviews. It is built in to the end of a row house and could easily missed, so keep your eyes open when searching for it. The place is very cozy and well decorated and makes you feel like you are eating...\n\n\nMore"], ["Simple and affordable", 4.0, "February 28, 2014", "DJTOBY", "Imperial Valley, CA", 51, 27, "This place has a simple menu that offers great selections of Italian dish's.\nLocated about 5 minutes East of the Washington, D.C. Metro, you might miss this place if no one recommends it for you. It is hidden in the middle of some homes. In fact, it appears to have been a home at one point or another since the...\n\n\nMore"], ["Friday Dinner", 4.0, "October 26, 2013", "Invinoveritas79", null, 45, 18, "Found the restaurant while close to Union Station. Very cozy, reminding me of a restaurant in a small town of Italy.\nWonderful smells of food hit you as you are seated and ready to order. Very good menu selections and price.\nEnjoyed spaghetti and meatballs along with chicken castellana.\nWould not suggest large parties but more 2-4."], ["Quaint restautant with fair prices is a great find near the capitol", 5.0, "August 5, 2013", "gnagy5", "Columbus, Ohio", 7, 1, "This small restautant (I counted 32 seats) had great food for dinner and was a terrific value. My family and I went with traditional Italian food which was excellent, but I did notice that quite a few pizzas were sold while we were there. Finally, we had great service and experienced a lovely atmosphere."], ["Nice having an American-Italian joint in the 'hood", 3.0, "July 21, 2013", "uhang", "Washington, DC", 10, 2, "No, it's not high-end, but if you're craving a plate of spaghetti and meatballs, or a simple pizza, and you don't want to break the bank, this is your place. DC doesn't have nearly enough red-check table-cloth Italian places like this one."], ["Nice little hidden gem", 4.0, "May 17, 2013", "Jude J", "Tucson", 10, 2, "This is a small place, twelve to fifteen tables at most, tucked amid brownstones with a single front pane window. We stopped by late of an evening, about nine o'clock and were pleasantly surprised. The baked ziti was rich with melted cheese and a sweet sort of marinara sauce and generously portioned enough to take home for next day lunch....\n\n\nMore"], ["Not that good food", 2.0, "May 10, 2013", "Lundepyg", null, 16, 1, "We have found the restaurant via TripAdvisor and we thought that we would give it a try even if it had received some mixed reviews.\nWe both got spaghetti with tomato sauce and meatballs together with a ceasar salad. The dish was very boring as it was as if they did not use any herbs and spices in either the...\n\n\nMore"], ["very good tomato sauce", 4.0, "April 24, 2013", "GwenM100", "Haverhill, Massachusetts, United States", 107, 34, "Six of us ate here in April 2013. They are family friendly.\nWe had mussels and several entree dishes. Most had a delicious, thick red tomato sauce. Service was excellent, atmosphere was excellent.\nThe only disappointment was the tiramisu, which was really a tiramisu layer cake."], ["Got better when I wasn't paying attention!", 4.0, "March 22, 2013", "Kim T", "Washington DC, District of Columbia", 126, 33, "My visit to this lovely tucked-away-just-off-Massachusetts Capitol Hill restaurant surprised me in a good way. A friend and I chose it mainly because a private party closed our intended restaurant; an earlier visit there had been light on ambiance and over-heavy on garlic.\nSome renovations, perhaps not so recently, have changed things. We found attentive service, improved surroundings, and tasty...\n\n\nMore"], ["Real Old Time Italian", 4.0, "March 6, 2013", "HillTraveller", "Washington, DC", 124, 56, "Bistro Italiano is old time Italian done right. Cute little restaurant in the Capitol Hill neighborhood - 3 long blks from Union Station - an easy walk and well worth it!\nNice wine list and reasonably priced\nThe food is classic old Italian comfort food\nVery reasonably priced"], ["Nice neighborhood cafe", 4.0, "December 27, 2012", "OleManRiver", "Oxford, Mississippi", 76, 37, "Food is very good and priced reasonably. Service is friendly and prompt. Great place to meet friends for good food and a glass of wine on Capitol hill just a block and a half from Union Station and a few blocks from the Capitol. Only seats around 25, so call ahead for dinner."], ["YUM!!", 5.0, "November 8, 2012", "wandererWisconsin", "Wisconsin", 34, 20, "Three of us were in town for the Marine Corps Marathon and were in search of pasta 2 days before the race. We stumbled on this gem, complete with marathon alums. The food was exactly what we were looking for and the service friendly and attentive."], ["Very good, convenient little place", 4.0, "August 7, 2012", "No_GPS_", "United States", 70, 28, "Ate here when we unexpectedly had out-of-town guests come to Washington. They were able to take a reservation for 10 on the same day (a slow Monday) and handled it with aplomb when some of our guests got a bit lost and were late.\nThe restaurant is very small--we took up a large portion of their tables--but its interior is...\n\n\nMore"], ["Just ok but decent with price", 3.0, "July 19, 2012", "roobrian", "Gainesville, Virginia", 107, 54, "Went here this past week with my wife and we both ordered the tortellini. It wasn't awful but it wasn't great either. It came out piping hot and everything was good very well. The sauce was a bit bland and frankly a bit to \"clumpy.\" But it was the regular tomato sauce and they had two other sauces to choose...\n\n\nMore"], ["Little Italian place - a gem!", 5.0, "May 17, 2012", "ArnzT100", "Baltimore, Maryland", 28, 21, "This tiny place consistently creates some of the tastiest Italian food in town. Everything is fresh and authentic - try the lasagne if you miss Northern Italy - it won't be the towering casserole you've had everywhere else. Anything on the menu is fantastic, including the carryout pizza. The dining space is utilitarian and seating limited but the place fills...\n\n\nMore"], ["Old Time Italian in DC", 5.0, "April 23, 2012", "HillTraveller", "Washington, DC", 124, 56, "Not fancy, just good\nreal itallan, hard to find in DC\nNo negatives"], ["Some good, some bad", 3.0, "April 23, 2012", "SpartanJoe", "Columbus, Ohio", 24, 24, "Excellent lasagna.\nDecent pizza.\nTerrible chicken dishes. Literally barely edible.\nIt's a neighborhood institution. In a townhouse midblock in a residential surrounding.\nGood service. Very friendly.\nBut honestly some of the dishes just aren't great. Particularly pretty much anything made with chicken. Bland, dry, tough.\nBut the lasagna is pretty good. And most of the pizzas are better than average....\n\n\nMore"], ["I love this place!", 4.0, "March 26, 2012", "loveshak22", "Washington DC, District of Columbia", 151, 116, "This place is a quaint, little neighborhood restaurant! There are lots of great menu choices and the price isn't too bad. I had the baked cheese tortelleni with the pink sauce and it was delicious! The only minor complaint I had was that the termperature on the tortellleni was inconsistent on one side. This is usually a sign of microwaved...\n\n\nMore"], ["Reasonable hidden gem--tasty pasta", 5.0, "September 19, 2011", "Pnemiller", "Kutztown, Pennsylvania", 1738, 1728, "We were staying in the area and walked by to see this small, intimate Italian place. Tables were available so we went in. It was a real find in an area with few restaurants around. Very pleasant atmosphere, a small bar area in the back. Prices were very reasonable--we had platters of delicious pasta, spaghetti and meatballs only $8.95 and...\n\n\nMore"], ["A neighborhood favorite!", 5.0, "August 21, 2011", "bobbykay86", "Washington DC, District of Columbia", 7, 1, "A quaint little Italian restaurant on Capitol Hill, this is one of my favorites. They have all the standard Italian dishes, served in huge portions, and they have excellent pizza. It's also very affordable. It is quite small, so it's not good for large groups, but it's a great place for dinner with a couple of friends."], ["It's not bad", 3.0, "February 25, 2010", "sreanname", "georgia", 1, 0, "If you're taking a taxi, be sure you know the WHOLE (280 D st. SOUTHEAST dangit)address or they might get lost. The food was ok. I guess you get what you pay for. I do wonder why everyone else got bread except for us though. If you're nearby, take a gander, but don't waste your money on a taxi tour...\n\n\nMore"], ["Best pizza in the world", 5.0, "December 1, 2009", "Je_est_un_autre", "Washington, DC", 8, 13, "Best pizza I have ever had, including pizza in Italy. Also superb service."], ["Great little Italian Restaurant", 5.0, "April 20, 2009", "TinaGr", "Eddington, Maine", 6, 0, "We went right as they opened at 5 on a Monday - we were second in line. Great service, great food, nice ambiance - would certainly go again. Very limited seating so if you have a large party - make reservations!!"], ["I love this little Italian place in Capitol Hill. Always felt like it was my little secret. Everything is tasty.", 5.0, "February 11, 2009", "Adam R", "Boston, Massachusetts", 332, 126, "I love this little Italian place in Capitol Hill. Always felt like it was my little secret. Everything is tasty."], ["A real neighborhood gem...", 5.0, "January 23, 2009", "Otabenga", "Washington DC, District of Columbia", 13, 4, "A real neighborhood gem for red sauce Italian and pizza! And one of those restaurants that I will leave my own neighborhood for on a Saturday night. First, it's an incredible bargain. Second, the food is fantastic. And third, the staff is extremely friendly. After not visiting for years, I had to ask if the restaurant was under the same...\n\n\nMore"], ["Tiny, tucked away gem. Great prices, fresh tasty entrees and pizza. Romantic spot - kinda crowded, but you feel like...", 4.0, "February 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Tiny, tucked away gem. Great prices, fresh tasty entrees and pizza. Romantic spot - kinda crowded, but you feel like you're in an Italian family home for dinner."], ["mmmm pizza.", 3.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "mmmm pizza."], ["If you want true Italian...", 3.0, "December 15, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "If you want true Italian - and nothing stuffy - this is the place to go. I hate to tell you about it because it's a well kept secret on the Hill."], ["Dirty, little Capitol Hill restaurant; AMAZING food!", 4.0, "November 30, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Dirty, little Capitol Hill restaurant; AMAZING food!"], ["This isn't the best Italian place in the city, its a hole in the wall with maybe 12 tables. The pizza is good, the...", 5.0, "November 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This isn't the best Italian place in the city, its a hole in the wall with maybe 12 tables. The pizza is good, the pasta is good and everything is dirt cheap, can't complain."], ["Nice single room restaurant. Good cheap sandwiches, like Meatball Sub. My personal favorite is the Seafood Al Diablo.", 3.0, "November 24, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice single room restaurant. Good cheap sandwiches, like Meatball Sub. My personal favorite is the Seafood Al Diablo."], ["Nice little neighborhood...", 4.0, "November 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice little neighborhood restaurant, good food and very good service!"], ["Great Neighborhood Restaurant", 5.0, "April 10, 2007", "Mom45", "Hampton, Virginia", 134, 175, "We ate at Bistro Italiano on a family trip to DC on April 10, 2007. It is not fancy or high Italian food, but it is wonderful nonetheless. There are only 10 or 15 tables and on a Monday night it was packed. We had the baked brie and roasted garlic appetizer and it was absolutely lovely. The roasted garlic...\n\n\nMore"]]], ["Bambu", [["Love Bambu!", 5.0, "August 26, 2015", "Ganney", "Washington DC, District of Columbia", 5, 1, "Bambu has excellent Thai, Chinese and sushi. Geographically desirable with parking, Great service, reasonably priced and they deliver."], ["Really good neighborhood Asian fare", 4.0, "June 30, 2015", "CarterDC", "Washington DC, District of Columbia", 30, 10, "We live up the street from this very reliable source for Asian cuisine. Bambu does Japanese, Thai and some Chinese; for those of us who live in the Palisades, it is the \"go to\" delivery option when you don't feel like cooking. The sushi is fresh, the Thai curries are spicy and filling, and the Peking Duck is really nice...\n\n\nMore"], ["Good Asian Food at a reasonable price.....", 3.0, "April 7, 2015", "Mark H", "Winston Salem, North Carolina", 80, 35, "We had good food (3 stars) and great service (4 stars), at a reasonable price. I recommend sticking to the Chinese menu, but I don't like food to be too spicy. My friend who likes spicy order the Thai and liked it. Nice atmosphere."], ["Good service good food", 3.0, "March 28, 2015", "Peter K", "Mountain Home, Arkansas", 10, 1, "We had dinner there and I had the orange beef. it was flavorful but a little tough. I asked for a sharper knife and they did not have one.\nMy wife had chicken pad thai and it was good."], ["Cheap, fun, cool", 4.0, "February 2, 2015", "Amadeus20007", "Washington DC, District of Columbia", 12, 4, "I often eat at Bambu on MacArthur at lunchtime, along with many other regulars. Their bento boxes are very satisfying and the services is fast, friendly and efficient.\nNot haute cuisine, but then again, a nice place for a relaxed lunch."], ["Very good choice for a Palisades (DC) Asian meal", 4.0, "January 16, 2015", "Decoamie", "Washington, DC", 282, 136, "Bambu has a bit of Thai and Chinese, plus sushi on the menu, which is fairly extensive. There are a few free parking spaces out front and street parking available. The dining room is bright and clean and uncluttered. This is a very popular neighborhood place and great also for take out. For my most recent visit, I had very...\n\n\nMore"], ["A Nice Neighborhood Pan-Asian Choice", 4.0, "October 5, 2014", "cranberries0928", "Washington DC, District of Columbia", 53, 30, "This is a go-to place for our family and we always have a good meal with good service for a reasonable price. The Chinese and sushi dishes are a bit stronger than the Thai dishes, in my experience, and the lunchtime Bento boxes are the best value. They do a nice job with miso soup and the steamed vegetables are...\n\n\nMore"], ["I Love this Place- Sometimes Being Consistent is Perfect", 4.0, "August 21, 2014", "RangerDanS", "United States", 108, 82, "I get tired of reviewers saying they want a restaurant to change the menu up a lot. Sometimes, I go to a place because know they do things well. Bambu is one of those places and when I want something new- there is always something on het menu I have not tried. I went here frequently with colleagues when I...\n\n\nMore"], ["Great lunch spot in the Palisades.", 4.0, "July 17, 2014", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "I love this restaurant because there is a nice modern inviting atmosphere here. The menu has a nice variety of Chinese and Japanese items. The sushi is delicious, well presented and fresh. The hot and sour soup is deliciously flavorful. The service is efficient and attentive and the prices are very reasonable. We had a nice long lunch and we...\n\n\nMore"], ["Wonderful Lunch!", 5.0, "July 10, 2014", "bubbysmom77", "Sacramento, CA", 48, 41, "While visiting DC, my husband and I stayed in a small apartment near this wonderful restaurant. We had lunch there on our last day in town. Wish we'd gone in sooner as we probably would've gone more than just once. We both had the sushi Bento Box lunch. It was fresh and delicious. The service was excellent too!"], ["Neighborhood Sushi", 4.0, "May 28, 2014", "TinaBOrion123", "Washington DC, District of Columbia", 10, 4, "Informal, family restaurant. Tables a bit tight. Food is good; the service is good and friendly; the bar is well-stocked."], ["Great asian food", 5.0, "March 31, 2014", "BeatrizM1", "Washington DC, District of Columbia", 9, 5, "Awesome variety of Asian Chinese, Thai food and sushi. Nice bar with a big selection. Happy Hour available."], ["A chance encounter!", 4.0, "January 25, 2014", "StLawrencelover", "Washington, DC", 189, 76, "We were driving home from DC on MacArthur Blvd when we spotted a place we could stop and have lunch. What a find! We both had the Bento Box for $11 at lunch. Soup was included, I had sweet and sour, he had Miso. Both excellent! I had penang chicken curry which was excellent-a good size serving, spicy and hot...\n\n\nMore"], ["My favourite!", 5.0, "August 19, 2013", "Kristinanar", "London, England, United Kingdom", 2, 2, "Simply my favourite food place in DC!\nVisited for the first time last year during Xmas.\nNothing changed since ... still wonderful and delicious !yumm!!!!"], ["Secod time, same sense", 3.0, "August 7, 2013", "Lord H", "Florida", 108, 62, "Its a nice neighborhood place with touch-and-go parking that offers a favorably-priced, larger-than-expected meal. 3 of us, after tip and no booze, came in at $50. Not a place to drive out of the way for, but if you find yourself there, it fits the Thai bill."], ["Disappointing Tom Yum", 2.0, "May 29, 2013", "RetiredDude", "various", 160, 53, "Tom Yum soup is a Thai hot and sour soup with fragrant herbs and fresh ingredients such as lemongrass, kaffir lime leaves, cilantro, galangal (a kind of ginger), lime juice, fish sauce, and crushed chili peppers. I've had it in Southeast Asia and I was pleased to find it on the lunch menu. Ordered it with a side of steamed...\n\n\nMore"], ["Maybe a bad day?", 2.0, "May 23, 2013", "enviro123", "St. Michaels", 6, 1, "Our group was very disappointed with our lunch the other day. My broccoli had an acrid taste as if it had been burned -even the waitress admitted that it did not taste right, yet she did not offer to take it back. Plus she gave us the check in the middle of the meal. Three of the five of us...\n\n\nMore"], ["Very good, but tough parking", 4.0, "March 20, 2013", "rossvesq", "Washington DC, District of Columbia", 198, 89, "My wife and I drop in on this place quite often, although we live across the bridge in NoVa. The menu is an Asian fusion style, so you have a lot of choices. And for an Asian fusion place the sushi isn't bad. Not great mind you, but certainly passable. The make a good Pad Thai, the tom ka soup...\n\n\nMore"], ["Very good option for neighborhood restaurant in DC", 3.0, "December 31, 2012", "darwinsail", "Washington DC, District of Columbia", 379, 305, "They serve your choice of japanese, chinese and thai. At lunch they have a option of bento box. They have few parking spaces available."], ["Simply solid", 3.0, "December 6, 2012", "Lord H", "Florida", 108, 62, "I enjoyed the green curry with chicken served as a bento box value lunch. Decent portion size, quick service and very functional meal, quite suitable for a business lunch."], ["Average, nothing more", 3.0, "November 10, 2012", "JackDmv", "DMV", 9, 3, "First time to the restaurant in November 2012. While seated at the table, Although there were several staff milling around, I had to go over to the bar twice to get the attention of staff. Entrees arrived before appetizers. Chicken and shrimp in entrees were not as fresh as I expected. On the plus size, portions are fairly large. Overall,...\n\n\nMore"], ["Perennial Local Favorite", 5.0, "October 14, 2012", "whitechalk", "Washington DC, District of Columbia", 29, 44, "We always turn to Bambu as our local favorite sushi spot. Their broad selection of Japanese, Chinese and Thai gives us room to try new dishes while always being recognized by the friendly staff for our traditional orders. We always know the California, yellowfin and lasagna rolls will be just right here. There can be some unevenness in quality with...\n\n\nMore"], ["Place to get take out and have lunch", 3.0, "April 28, 2012", "bumper1965", "Washington DC", 151, 98, "I can walk to Bambu..and sometime do. If you're in the area and wanting Thai/Chinese, please visit them. They're a solid choice for dinner on the go or those nights where \"I don't feel like cooking.\""], ["Very nice neighborhood restaurant..", 5.0, "April 26, 2012", "Travelr101", "Maryland", 92, 52, "Bambu is a local MacArthur Blvd favorite restaurant. It has very good service, speedy seating and excellent sushi and Asian foods. Casual enough you can just walk in as you are, so I wouldn't pick this place for a romantic Anniversary dinner, but perfect for a mid-week break from cooking or a last minute decision to take the family out....\n\n\nMore"], ["Quality dropped significantly!", 2.0, "February 20, 2012", "TravelerViajante", "Washington DC", 36, 27, "My husband and I used to like this place, but in the past few months the quality of the food has gone down significantly! I am a semi-vegetarian and ordered noodles that usually come with meat/chicken and ask for tofu instead. I return the dish immediately. The dish come out socked with some tasteless sauce and the tofu seemed liked...\n\n\nMore"], ["Have loved this place for years", 5.0, "February 9, 2012", "BarbaraEK", "Bethesda", 84, 48, "My son was returning from London, and his first request was dinner at Bambu. Through the years, we have eaten here countless times, and ordered take out even more times. The food is delicious and consistent. We find the sushi to be excellent. It's well run, efficient and just a great local restaurant. It's not inexpensive, but it's worth it."], ["Lost in Quality over past 6 months", 3.0, "January 7, 2012", "TooFrequentTraveller", "Washington D.C.", 125, 44, "We have been taking out food from Bambu for the past 3 years (our containers pile up!). We always liked it, except the Sushi (too bland, not distinguishable). But the Thai dishes used to be excellent.\nThe past 6 months, I'm unhappy to say, the quality dropped - dishes became less distinguishable, Pad See Yew greasy with less and less...\n\n\nMore"], ["Is also good for takeout/delivery.", 4.0, "May 30, 2009", "eventsdc", "washington, dc", 170, 88, "Is also good for takeout/delivery."], ["Great dumplings, combo of Chinese, Thai and also sushi. But they do it all pretty well, and it's a fun place with good...", 4.0, "August 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great dumplings, combo of Chinese, Thai and also sushi. But they do it all pretty well, and it's a fun place with good service."], ["Good sushi, decent service, pricier than Kotobuki but better atmosphere (minus the screaming soccer team who was...", 3.0, "July 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good sushi, decent service, pricier than Kotobuki but better atmosphere (minus the screaming soccer team who was completely uncontrolled by the soccer mom who sat across the room). My rating may go up if I return and am pleased."], ["One of my favorite asian...", 4.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of my favorite asian restaurants. The food is amazing (eggplant is great, sushi is insanely fresh), and the atmostphere is lively yet intimate..."]]], ["Cafe Ole", [["Gotta go there to believe it...seriously", 5.0, "September 11, 2015", "kathy41003", "Bethesda, Maryland", 11, 2, "Excellent food for excellent value! Too many great dishes to mention. Wish we would have discovered this place years ago. Very quick service. Good Happy Hour...it's all good."], ["Amazing! A Delicious Meal with Good Service at a Great Price!", 5.0, "July 13, 2015", "WFleet", "Washington DC, District of Columbia", 136, 54, "I feel like I hit the lottery when I ate at Cafe' Ole because I had the best meal in a VERY long time at a good price and the service was great, too! It was a trifecta of goodness! Three of us collectively ordered the pizetta, the beet salad, eggplant terrine, dolmas, and schawarma and it was more than...\n\n\nMore"], ["Hidden gem from a random search", 5.0, "June 26, 2015", "Lena_989", "Sydney, Australia", 18, 6, "I loved the thought to Tennleytown own since it sounded like something from Enid Blyton novel so we randomly took the metro there for dinner. I'd had a quick look online for recommendations and thought Cafe Ole's menu sounded interesting. I'm glad we went there. The meals are Mediterranean inspired and provided some much needed variety from burgers and fries!...\n\n\nMore"], ["Surprisingly Good", 4.0, "March 14, 2015", "WHFT", "Bethesda, Maryland, United States", 39, 19, "Cafe Ole sounds like a Tex-Mex joint-- but it's actually an informal mediterranean mezze (small plate) restaurant with very very good food. Everything from the basics (hummus, babaghanouj) to inventive chicken and lamb stews are fresh and tasty. Prices are reasonable in this brightly lit, busy restaurant-- and the food is so good, that the value is even better. Service...\n\n\nMore"], ["Dog friendly even during winter", 5.0, "March 4, 2015", "Didi P", "Plano, Texas", 37, 29, "We were traveling with our baby dog in the middle of a winter storm and stopped by DC to catch some zzzs and meet friends for brunch. It was important that the restaurant be dog friendly as we could not leave the dog in the car in the horrible weather.\nI was afraid that we would not be able to...\n\n\nMore"], ["A nice little café with Mediterranean food", 4.0, "January 7, 2015", "Catullus", "California", 37, 16, "Café Ole is a favorite of a local friend, and we liked it too. The Mediterranean offerings were delicious, accompanied by very good pita bread. The glassed-in outdoor area would, I think, be very pleasant in warmer weather. Service by the owner and his staff was excellent."], ["Cafe only ok", 3.0, "December 5, 2014", "Primomeatball", "Washington DC, District of Columbia", 34, 20, "I was hopeful this was going to be another gem. I was left pretty dissapointed. The food was average to below average and the prices pretty high for mediocre fare. The crispy seasoned bread was good but the pita was pretty terrible-dry, hard and cardboard like. If you have the option of driving another 2 miles down Wisconsin to cafe...\n\n\nMore"], ["Loved their Hummus", 4.0, "November 10, 2014", "NickMiller_Clarity", "Concord ma", 58, 22, "A family dinner before a show at a nearby theater. We were greeted very warmly. Service to the table was quick. Every dish we ordered was tasty. We particularly enjoyed the Lebanese sampler of hummus, baba ghanouj, feta cheese spread, and tabouli.The eggplant stew was terrific! Lamb tagine also very good. Prices for value, just great. If you like Middle...\n\n\nMore"], ["A Gem in Tenleytown", 5.0, "September 30, 2014", "Donnar4108", "Washington DC, District of Columbia", 37, 9, "Cafe Ole is a little known gem on Wisconsin Ave, but somewhat obscure (not near other restaurants). Outdoor seating is a great place to eat. The food is excellent, mostly small plates of mezze or mediteranean cuisine. If you like beets, the beet salad is a winner. Dishes with calamari, shrimp and wild mushrooms are also favorites. But the most...\n\n\nMore"], ["DC with doggie", 4.0, "September 29, 2014", "beachlovers5357", null, 14, 10, "Found Cafe Ole while searching for a dog-friendly restaurant. We sat outside in the enclosed patio. The name doesn't really indicate the cuisine; it is sort of Mediterranean-Middle Eastern fusion. We had a delicious grilled calamari, a hummus/babaganoush/etc combo platter, and a grilled shrimp. Husband loved the house-made pita chips; the server was kind enough to bring a plate of...\n\n\nMore"], ["Great Mediterranean Fare!", 4.0, "August 3, 2014", "TravelerMan62", "Washington DC", 23, 14, "I love this place. The quality of the food is matched by the great low prices. Its sort of in a bit of a no-man's land for food on Wisconsin Ave, so just give it a shot.. you won't be disappointed. I love the lamb shawarma."], ["Very good Mediterranean food at a good price", 4.0, "April 24, 2014", "daxenpax", "Washington, DC", 38, 20, "Cafe Ole has a rather unusual location (on Wisconsin Ave across from the post office) with difficult parking, but it's a great little restaurant and bar. The cuisine is Mediterranean, but not what I expected; it's not one Mediterranean country's cuisine. The food runs the gamut from Greek and Turkish to Lebanese and Syrian, and many others thrown in for...\n\n\nMore"], ["Great and reliable choice for a quick Mediterranean bite to eat!", 4.0, "April 2, 2014", "Decoamie", "Washington, DC", 282, 136, "I had not been here in years until I recently found myself back the AU neighborhood for a class and needed a quick bite for lunch. Boy, was I happy I did. This place is packed with workers from nearby office buildings, all enjoying reasonably priced lunches in a boisterous atmosphere. At lunch, the orders are taken at the counter...\n\n\nMore"], ["Palate pleaser every single time!", 5.0, "April 1, 2014", "Marale2014", "Washington DC, District of Columbia", 14, 12, "Cafe Ole is always a delight! I have been coming here for about 3 years for special occasions or just because. My parents invited my husband and I and some friends here the day of the wedding ceremony. Luckily, my husband and I live 5 minutes walking distance away :) Great Mediterranean food and the owner is from Lebanon. The...\n\n\nMore"], ["Awesome food and excellent service", 5.0, "March 12, 2014", "Sarah O", "Red Lion, Pennsylvania", 8, 2, "My fiancé and I drove to DC for the day with our dog and picked this place because they allowed dogs on their patio. The manager immediately brought out a bowl of water for our dog and the waiter took our drink order. The food was AMAZING! We had the appetizer sampler and it was delicious. A nice change from...\n\n\nMore"], ["Old standby with a great patio dining area", 5.0, "February 13, 2014", "BlueNWashington", "Washington DC", 340, 121, "Cafe Ole specializes in small dishes with Middle East style food. Always well-prepared. Great place to go if you're not craving a major meal. Lots of vegetarian choices. We've been eating at the place for more than 10 years and always look forward to going back, especially during the summer."], ["An affordable spot with surprisingly good Mediterranean food", 4.0, "January 19, 2014", "GravityFails1", "Charlotte, North Carolina", 86, 30, "I visited Cafe Ole when I was last in DC for a business trip. I was shocked when I arrived by the mass of human flesh packed into the modest space of the cafe. Every table was full and after ordering at the register we took a position on a wall and stared at any diner dull enough to make...\n\n\nMore"], ["Good value; open Sunday lunch", 5.0, "August 11, 2013", "pmr2", "Washington DC, District of Columbia", 145, 51, "I have frequented this place since it opened 15 years ago. They specialize in Mediterranean mezze, including a fair selection of vegetarian ones. My favorites include the shawarma, the Lebanese celebration, the lamb tagine and the Marrakesh panini. There are daily specials and, right now, since they're celebrating their 15th anniversary, these are only $5, along with wine at $15/bottle....\n\n\nMore"], ["Excellent, consistent, good value", 4.0, "June 17, 2013", "stumack", "Washingtoin DC", 127, 50, "Cafe ole delivers for a neighborhood eatery. Attentive staff. Good selection of Meze. Reasonable prices. I recommend the lamb sliders, hummus, fatoosh salad, and baba ghanouj, I have eaten there many times and never been disappointed."], ["Very tasty food at reasonable prices", 5.0, "May 7, 2013", "Michael C", "Chevy Chase, Maryland", 56, 27, "My wife and I have eaten here several times, often bringing out of town guests. The food (tapas or mezze) is quite varied and includes both meat and vegetarian dishes. Almost every dish we've ordered has been very tasty. Service is excellent, and the prices are quite reasonable. My favorite dish is the lamb tagine though the chicken provencal is...\n\n\nMore"], ["Hidden Gem", 5.0, "January 24, 2013", "Donnar4108", "Washington DC, District of Columbia", 37, 9, "Cafe Ole is located away from other restaurants and often is unknown to food lovers. The food is creative and fit for any foodie. Great value here."], ["Outstanding neighborhood restaurant", 5.0, "November 16, 2012", "kaydc", "Washington DC, District of Columbia", 96, 65, "We have been eating at Cafe Ole for many years and have always had a good experience. The Middle Eastern tapas are excellent and prices are reasonable. While we are omnivores, we often take friends and relatives there since the extensive menu has good choices for eaters of all types and persuasions. The staff members are friendly and service is...\n\n\nMore"], ["Lovely outdoor patio and fabulous food!", 5.0, "October 20, 2012", "ChristineR955", "Washington, District of Columbia, United States", 78, 29, "We tried this place while visiting a friend who is a student at American University, which is right next door. The service was friendly and fast and the food was fabulous! I had a chicken and goat cheese salad, which was one of the best I've ever had, with pine nuts, figs, tomatoes, and arugula. Yum! My husband had the...\n\n\nMore"], ["An Ace in the Neighborhood.", 4.0, "October 15, 2012", "dvding", "Washington DC, District of Columbia", 34, 15, "The area from National Cathedral to Tenelytown is mix of family dinning to burger havens and quick food as you approach the Metro and Tenelytown. Right in the middle of the two neighborhoods is this gem \"Cafe Ole.\" IT's a mix of middle eastern Tapas with a good bar to boot. When the weather is warm some of the tables...\n\n\nMore"], ["Superb Food, Erratic Service", 4.0, "June 3, 2012", "ruralartist", "Cheraw, SC", 241, 80, "We thoroughly enjoyed dining outside under an umbrella with the breezes blowing by. This is a perfect place for a leisurely - emphasis on leisurely - meal! Superb Mediterranean food, beautifully presented in more than generous quantities. NOT a good place if you are in a hurry! You can also dine inside, and there is an outside area that is...\n\n\nMore"], ["Tasty Self-Service Middle Eastern Food", 4.0, "May 29, 2012", "BBS-FGS", "Washington DC, District of Columbia", 54, 14, "Friendly counter people, prompt service. Nice food."], ["Continued Good Food and Good Value", 4.0, "May 7, 2012", "Snidudad", "Chambersburg, Pennsylvania", 126, 41, "We tried Cafe Ole again on a whim the other night. We decided to pass up the outdoor seating because of the dubious weather and sat inside; fortunately, the inside of the restaurant was not crowded, so we could converse in a normal voice. The service was better than usual, although it is still slightly off-putting for the wait staff...\n\n\nMore"], ["Quick and good", 4.0, "April 24, 2012", "Patrick S", "Chicago, Illinois", 7, 0, "I work nearby and it's quick and beats most alternatives in the area. Friendly unless you go near closing. Then it seems like they're shut down for the day"], ["This is a must stop!!", 4.0, "December 30, 2011", "Urbanfarmgrl", null, 128, 26, "We had the hot sampler and Lebanese celebration....everything was bursting with flavor and served fast. It was reasonable with portions bigger than you can eat. The only draw back was that you had to order at the counter. The servers drop off the food and flip the tables. You really must check this p"], ["Love Cafe Ole'!!", 5.0, "December 20, 2011", "reachteresa", "washington dc", 55, 40, "This place is so delicious. I have been there a bunch of times over the years. It is a simple setting with outside patio when weather is suitable. The owners are really hand on and almost always there. They have the best Baba Ganoosh I have had in my life and the owner makes the best homemade brownies. Sometimes they...\n\n\nMore"], ["Good food and ambience and also inexpensive.", 4.0, "October 31, 2011", "Carlupi", "Washington, DC", 41, 12, "I have always eaten very well on my numerous visits to Cafe Ole over the past few years. Their Mediterranean small plates are very varied and consistently good. Several excellent homemade soups are available every day, and the staff is very friendly. Finally, it is inexpensive, a great value for the money. Overall, it is just what you want in...\n\n\nMore"], ["Ole to Ole!", 5.0, "September 15, 2011", "PeggyWashBangkok", "Washington, DC", 31, 9, "Cafe Ole is truly a delightful place to meet up with friends for a happy of drinks and snacks, or a full meal. September and October are beautiful in Washington so guests can sit outside and enjoy the change of seasons. It's in a quieter part of town -- nice walkability and it's near the Tenley Town Metro. ENJOY\nPS:...\n\n\nMore"], ["Middle Eastern tapas with some inventive dishes & great desserts", 5.0, "July 4, 2011", "dcbird", "Washington, DC", 82, 31, "Cafe Ole is consistently good, reasonably priced, with attentive but not overbearing service. If the weather's nice or even not so great, there's a partially covered/partially open brick patio area for dining outside. (On a crowded Friday or Saturday night, the indoor seating can feel a bit cramped.) A few favorite dishes: Tel Aviv nachos, black bean soup (great on...\n\n\nMore"], ["Why you should eat dinner across the street from the awful post office.", 5.0, "July 1, 2011", "Jean-Marie S", "Washington DC", 107, 112, "Our family has lived in DC for 14 years. We're pretty xenophobic, at least within the confines of DC -- mostly because I keep comparing DC to NYC and husband keeps comparing it to CA, both no-brainers -- but Café Olé is near our house and has great, affordable food with a FANTASTIC waiter whose name I have never learned....\n\n\nMore"], ["Some of the best food for the price in the area", 5.0, "December 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Some of the best food for the price in the area"]]]]