[["Malmaison", [["Cute Setting with Average Food & Below Average Service", 3.0, "September 8, 2015", "Meredith S", "Raleigh, North Carolina", 43, 14, "MalMaison is beautifully decorated and had live music for Sunday brunch, but the charm stopped there. The service was spotty and our waiter seemed distracted the entire time. We ordered a pastry basket to start, which was never brought out. Our waiter also got our side orders wrong and we didn't have silverware when the food was brought out. We...\n\n\nMore"], ["Trendy and relaxed place. Great pressed juices!", 5.0, "August 13, 2015", "Soraya47", "Washington DC, District of Columbia", 25, 2, "This space is very trendy and tucked-away. I haven't tried much of their foods but their pressed juices are great. They press the juice fresh right in front of you. This is a great place if you've just finished boating at key bridge boat house. Or if you just want a relaxed place off the busy Georgetown streets."], ["Neat building and location, Terrible service, OK Food", 3.0, "July 13, 2015", "Jacqueline M", "Washington DC", 6, 2, "Malmaison is in a converted icehouse near the river and the canal, under the Whitehurst Freeway, in Georgetown. The space is quite neat with glass-paneled garage doors as windows, two levels for seating (a lounge space below where one can dine as well as a more normal dining room space above), and a take-out section that was flooded with light....\n\n\nMore"], ["Very biker friendly, with a bit of attitude", 5.0, "July 11, 2015", "finestbob", "Minneapolis, Minnesota", 80, 22, "Stopped by for mid-afternoon coffee break from the hustle of M Street. When you need a break from the crowds, or just need better quality coffee, take the walk down to Malmaison. It's a little hard to find, but a much better alternative than the craziness on M Street.\nWe were sent to Malmaison from the great guys at Revolution...\n\n\nMore"], ["Best Brunch in DC hands down !!", 5.0, "June 29, 2015", "Bornabrit", "Richmond, Virginia", 745, 427, "My husband and I have tried many places to eat \"brunch\" in the DC area and while many are very good we have yet to find a brunch that equals the one served at \"Malmaison\"\nAs an added treat, a jazz band performs every other Sunday alternating with a Violin and Cellist. This past Sunday we were entertained by The...\n\n\nMore"], ["Lovely, peaceful place for lunch or discreet meeting", 5.0, "June 15, 2015", "Toby H", null, 15, 6, "Malmaison is a hidden gem tucked away between M Street and the waterfront. It's quiet and laid back but your also almost underneath the Whitehurst freeway and the planes flying along the Potomac as they descend into National airport give you a sense of being close to the bustle. I've used this place for lunch after a run and for...\n\n\nMore"], ["Wedding Reception", 5.0, "May 12, 2015", "Lois F", "Georgia", 7, 0, "Delightful venue! An old gas station along Georgetown's Waterfront has been transformed into an elegant venue for special events. The food prepared by the Malmaison Chef was wonderful with special attention to detail and garnish. Perfect evening!"], ["Truly a 'hidden gem'", 5.0, "April 16, 2015", "BOBCOO7", "Washington DC, District of Columbia", 32, 32, "If this restaurant were on M street instead of hidden at the end of K street (the Water St. extension) it would be incredibly popular- as it is there was a lively crowd when we got there. My wife and I love this place. We went for Sun Brunch and started with a bread basket which had delicious muffins and...\n\n\nMore"], ["Fantastic place for Brunch...its a must!", 5.0, "March 31, 2015", "Bornabrit", "Richmond, Virginia", 745, 427, "My husband and I love this restaurant, the atmosphere ,décor, nice energy of its customers, the service ,but most of all the brunch at Malmaison is outstanding.With a huge variety of Brunch items on their menu its pretty hard to make a choice. For example:Crepes, eggs, salads, Fruit plates, smoked salmon, jumbo lump crab cakes, pancakes build your own omelet...\n\n\nMore"], ["Excellent place, delicious French Food", 5.0, "October 18, 2014", "picalexandre", "Washington DC, District of Columbia", 57, 55, "A little gem in the middle of nowhere ( in Georgetown, off M Street by the water) ! Definitely on my list. The chef used to work for French heads of State and President Reagan and you can taste it ... The food is just delicious. So sad they won't be open for dinner anymore. I'll try the brunch on...\n\n\nMore"], ["Superb brunch!", 5.0, "October 13, 2014", "Omillett", "El Quisco, Chile", 149, 72, "Quaint spot, with carefully prepared meals. Clearly a popular choice as we faced a bit of a wait. If their brunches are anything to go by, their dinners must be incredible."], ["Good food and atmosphere, struggling with service!", 4.0, "September 29, 2014", "T B", "Tampa", 17, 15, "We are torn about this place because of excellent food and really good atmosphere including live cello and violin performances during brunch on the one hand, and servers who are either inexperienced or bad on the other. Although the place seemed to have lots of free tables, our host took a really long time to seat us. She also forgot...\n\n\nMore"], ["In a Word, Seinfeldian", 2.0, "July 28, 2014", "DCMomX", "Washington DC, District of Columbia", 32, 4, "having patronized Malmaison on a semi-monthly basis in the morning for the last 13 months, I can say the following without reservation:\n1. The coffee and tea prices are comically high. When I asked about the $4.75 iced tea tag (no refills), the counter server said, \"well, our tea is very high quality.\" No tea is of such quality that...\n\n\nMore"], ["you need a lot of patience", 1.0, "July 27, 2014", "gmeewaa", "New Delhi, India", 2, 3, "there's hardly any place in DC serving food after 10pm. At Malmaison, you'll be lucky when you get food BEFORE 10pm! the food is good, but the service is so bad, it can actually be amusing, if you go in the right state of mind."], ["Loved this Place..A must for brunch!", 5.0, "June 25, 2014", "Bornabrit", "Richmond, Virginia", 745, 427, "A friend suggested we try \"Malmaison\" which is located down by the harbor where water meets K st,its the black and white building that is almost to the k bridge. Easy to find. We went for Sunday brunch, We started with the bottomless champagne and the \" build your own juice\" ,what a great concept. You simply ask the server...\n\n\nMore"], ["My Experience at Malmaison", 1.0, "January 12, 2014", "Johnny L", "Bethesda, Maryland", 1, 1, "Just beware of Felipe. He tries to rip everybody off, selling fake tickets and discriminating against specific people. It's really difficult to fathom why he behaves in this manner, but there isn't anything genuinely positive I can say. Quite simply, the Malmaison in DC is terrible. It isn't worth the time for the millions of people in the DMV to...\n\n\nMore"], ["Great", 5.0, "December 1, 2013", "Tiffany L", null, 20, 1, "Loved the atmospher here and the open garge concept. The food was delicious and the dessert even better. I know I will be going back again and again."], ["Malmaison is now on our short list of DC restaurant favorites", 5.0, "November 22, 2013", "LynneMH_3818", "Washington DC, District of Columbia", 38, 18, "I've lived in DC for 35+ years, so have seen restaurants come and go. I hope that Malmaison is supported by foodies like us for the long-term. Here's why:\nA dear friend and I were celebrating 30 years of friendship (sans husbands) on Nov 20, 2013. We found Malmaison on a restaurant web search, checked the menu; it fit our...\n\n\nMore"], ["Nice but pretentious - small - expensive and lot's of hype.", 3.0, "September 23, 2013", "REVIEWGURUTODAY", "Washington DC, District of Columbia", 33, 11, "If you're looking for a place off the beaten path, but has that same (if not more) pretentious feel like other Georgetown places than this maybe your place. Nice atmosphere, but the concept seems a bit off. Some weekends it's a club, some it's just a lounge. The DJ's aren't good at keeping a crowd so it dies off early....\n\n\nMore"], ["Worth a visit!", 4.0, "September 7, 2013", "Weymouthk", null, 6, 1, "Out of the way gem. Great halibut, beet salad, foie gras and lamb shank. Good service. Cool atmosphere."], ["Inspired French Cuisine Avec Panache Sans Attitude", 4.0, "September 4, 2013", "constanttraveller100", "Toronto, Canada", 22, 29, "Just 8 weeks into operation when we visited, this new establishment impressed us with its sleek design, unpretentious atmosphere and at the same time, delivering one of the best meals we have had in Georgetown in recent memory. French cuisine, limited but entirely adequate wine selections and on both occasions, truly delightful staff. Our choice both nights was the halibut...\n\n\nMore"], ["An Intriquing Off-the-Path Great Meal (With Parking) in the Heart of Georgetown", 4.0, "September 4, 2013", "DCflyboy", "Washington, DC", 36, 21, "This restaurant/coffee shop's location -- at the end of \"K\" or Water Street in a refurbished old commercial/factory building -- and practically under the entrance to the Key Bridge (far above) --makes for a fascinating setting. One feels like they discovered something secret, and special. It opened recently, and in three different visits for lunch, the food was very good,...\n\n\nMore"]]], ["Neopol Savory Smokery", [["This sandwich is a boss", 5.0, "August 18, 2015", "Tiffany D", null, 17, 10, "I debated long and hard about whether or not to rate this place 5 stars. Like someone else mentioned, how can a sandwich be worth 5 stars? But I have to share that the smoked salmon sandwich with apple, avocado, AND bacon on the sunflower bread is, in a word, amazing. I even had the salad and it was pretty...\n\n\nMore"], ["Avocado BLT? Yes please!", 5.0, "July 8, 2015", "ErinMLB", null, 43, 24, "Union Market. Front of the entrance. There's your Neopol shop. Even more fitting since their sandwiches are good.\nWhen I'm in the mood for meat- it's avocado BLT. When I'm in the mood for meatless- it's smoked egg salad.\n(Reminder: I do not eat sea food. Of. Any. Sort.) and because of that, I'll speak on the behalf of friends...\n\n\nMore"], ["Good Food but a little pricey", 4.0, "October 30, 2014", "Warren P", "Toronto, Canada", 44, 7, "This place, in a market area, has a good selection of foods to \"take away\" and find your place to eat it-there are tables available nearby unless the place is crowded. The food is good but a little pricey. I will return-right across the road from Gallaudet University!"], ["Wonderful Find!", 5.0, "July 15, 2014", "TinkWDC", "Washington DC", 68, 16, "I actually decided to try Neopal after reading the reviews in the Washington Post Newspaper and boy oh boy am I glad I did! I'm one who's always trying new, exciting and different restaurants ESPECIALLY new guys. I've been excited about the Union Market renovation and wanted to see if it was in fact a place I would frequent. To...\n\n\nMore"], ["Deelicious Smoked Trout Salad", 4.0, "May 3, 2014", "rose4718", "Washington DC, District of Columbia", 40, 10, "On a diet and I didn't have to do a thing to this salad to adhere to my diet…its delicious and they put the dressing on the side. Generous amount of smoked trout..wonderful taste."]]], ["The Coupe", [["Summer dinning at its best - love the outdoor patio", 4.0, "August 23, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Love this place for breakfast, normally I have my Two Eggs any style, but today I had the Buttermilk Pancake, there is a whole stack of 4 inches pancake (5 of them), just don't count the calories. It was great, I don't need lunch afterwards.\nService is always great with Stacie and another guy, great - my dog gets dog...\n\n\nMore"], ["Great local spot", 4.0, "July 27, 2015", "Ant1007", "Hyattsville, Maryland", 116, 38, "Had a business lunch here with 3 of my associates. You can get breakfast until 6pm or order off the lunch menu. I had the Moroccan Scamble with Grits it was very tasty. The location plenty of room for hookup a laptop and leisurely enjoying meal while working remotely. Outdoor seating is available"], ["nothing special", 3.0, "July 20, 2015", "Alexander B", "Washington", 13, 0, "The food was OK, not great. They had to redo my order because it was not prepared the way I requested. My friend who suggested the place says their breakfasts are better."], ["My favorite DC spot", 5.0, "July 14, 2015", "Pamela A", "New York City, New York", 52, 24, "I recently visited and had a lovely meal as usual. I always visit the Coupe when I'm in town. I had delicious wings, fries and they were amazing. i took my mother and friend this trip and they loved their brunch and burgers. If you get Amani as your server, you're in luck! She was a fabulous sever and all...\n\n\nMore"], ["Good food, good service", 4.0, "June 29, 2015", "Evilmisspolite", null, 188, 55, "Like the other locations, The Coupe is no exception. The food is fresh and homemade. Everything was good. There are so many options to choose from on the menu. There's something for everyone. The waiter was nice and attentive. I'd say that the pricing is on the higher end compared to typical \"diners.\"\nI recommend the hashbrowns and veggie burger....\n\n\nMore"], ["Grab a bite, late night", 5.0, "May 16, 2015", "Ife S", null, 47, 6, "Around 1am my friends and I are hungry. What is open? These guys! Pretty empty, quick service, calm atmosphere, tasty food. I ordered the Fried Chicken sandwich and really felt that I got my money's worth in food. They split out check for us and we're super pleasant. Thanks Sara (h) and Farren."], ["Breakfast on Mother's Day", 5.0, "May 10, 2015", "Greg T", "Stafford, Virginia, United States", 22, 9, "Great food, great service, great vibe. Bloody Mary and coffee were excellent. Took away an order of their fresh bagels."], ["Love the vibes here", 4.0, "May 10, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I have been here 11 times so far....\nThis is one of my breakfast joint in this hood. Love the patio outside in the summer. Mind you for whatever reason, Sunday morning this place becomes babyland-babies and young kids everywhere. I am not discriminating children, but sometimes the scream is too much for me to bear....... Weekday is much better....\n\n\nMore"], ["Lively atmosphere excellent food", 4.0, "March 8, 2015", "Brando62", "Saint Paul, Minnesota", 140, 25, "I came here for breakfast with my son while visiting for the weekend. I read the reviews and was worried we would have a hard time getting a table on late Sunday morning. We got in and perused the menu. I ordered the Moroccan scramble my son got the florentine omelet. Both were good. The bonus for me was that...\n\n\nMore"], ["Funky, Eclectic Vibe..Well Prepared Food..But A Bit Pricey", 4.0, "February 3, 2015", "Donn D", "Washington DC, District of Columbia", 98, 64, "Let me start by saying I like the combination lounge, restaurant concept. A very cool place to hang out and to eat. We sat in the lounge area, which required us to go to the counter to order. That was akward but our server took over from there. Staff was quite professional and continued to check in to insure we...\n\n\nMore"], ["Rockstar Quality", 5.0, "January 28, 2015", "Brian S", "Lost River, WV", 88, 46, "From the décor to the management this place is amazing. Even the President of the US has loved it here. The atmosphere is cool but very friendly and inviting. The staff are top notch and make the experience a pleasure. The food...well, it was one of the best meals I have ever had in DC. We had such a good...\n\n\nMore"], ["Both service and food has improved.", 4.0, "January 12, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I have not been here since 2012 since it first opened. I was not too impressed last time. None the less, since Obama's visit, the place seems to be always full in the evening and Sunday brunch. It has a steady clientele during the day too.\nI decided to go back for a quick lunch before my drive off. Got...\n\n\nMore"], ["Great brunch place", 5.0, "December 8, 2014", "cujas", "Cambridge, MA, USA", 48, 18, "Full of young people, trendy brunch place. The Belgian waffle was excellent. A bit of a wait for a table, because this place is hot."], ["Great", 4.0, "November 12, 2014", "ElleEye", "Washington DC, District of Columbia", 34, 15, "Great food! Great service! The grits are absolutely amazing! I've gone before when it was 24 hours and am disappointed in the time change but will return again."], ["Take it or leave it", 3.0, "October 29, 2014", "Alisia A", "Cleveland, Ohio", 92, 59, "A group of us stopped in for brunch on a Sunday and this place a take it or leave it kind of place. It's cute that you can sit outside but it was too chilly for that. The decor inside was really interesting, I really enjoyed the atmosphere and decor.\nAs far as the food, it was kind of bland....\n\n\nMore"], ["Super delicious Brunch on a Sunday Morning", 4.0, "October 20, 2014", "JPSaleebyMD", "Murrells Inlet, South Carolina", 816, 355, "A local neighborhood eatery. Open all the time it seems. Attentive waitstaff and friendly too. Very family oriented. Get there early or you may have to wait. Several seating options... main dining-room or coffee bar area or cop a seat in the \"sitting area\" with comfy couches. A real walk to neighborhood gem.\nTry their Gluten-Free muffins... large enough to...\n\n\nMore"], ["Poor service, mediocre food", 2.0, "August 26, 2014", "Itz M", "Washington DC, District of Columbia", 30, 27, "I really wanted to like this place, it's beautiful and has a great vibe right in my neighborhood, but that's where the positive ends. Got a very chilly reception from the bartender who seemed to be bothered by basic questions such as \"what are the happy hour specials\" or after 10 minutes of waiting for 2 glasses of wine \"were...\n\n\nMore"], ["Fantastic vegetarian breakfast", 5.0, "August 11, 2014", "rolo54", "England", 58, 52, "If you are looking for awesome buttermilk pancakes and great veg breakfast options, come to this place. The service was fantastic, they were very attentive and willing to substitute veg options. Its a little further a field from main monument area, but easily accessible by taxi or bus.\nThe restaurant is modern, free wifi, outdoor seating."], ["I now want to try almost everything on their menu!", 4.0, "August 4, 2014", "Michelle P", "New York City, New York", 5, 1, "Well priced , funky and very cool as well as comfortable spot to get a drink but also have ANY kind of food and served 24 hours a day. This place rocked and I got to try everyone's food and wish I could sit there for another week trying some more."], ["A good breakfast place", 4.0, "July 19, 2014", "Roger C", null, 186, 80, "A Sat am about 10 - all the locals were out, some w/dogs - Coupe has a spot for them - good. Inside was full so they opened more tables closer to the bar area. Only downside, concrete floors and bar staff's loud talking with no bar customers. Asked waiter and they toned down. Good, attentive service, and had a...\n\n\nMore"], ["Good tasty fresh food!", 4.0, "July 12, 2014", "John F", "Skanderborg", 16, 12, "Ate here twice and both times food was tasty, fresh and came within 10 mins. Clean place, staff quick to attend to you (straight forward and down to earth, not falsely over doing it).\nRecommendations - burgers are good, Mac & cheese and kale salad all good!\nImprovement - can be a bit noisy when full so something on the...\n\n\nMore"], ["This is the breakfast spot", 4.0, "July 7, 2014", "ShayPro", "Columbia, South Carolina", 43, 12, "This place is so popular because the great menu options. It appeals to the vegan, the health conteous and the all - around foodie. It does get busy but the tables moves quickly. We love the outdoor dinning. The service staff are courteous and the food is always served hot. Yummy Belgium Waffles or try the Spinach Floretine Omelet."], ["Great for breakfast and for an evening meal with drinks", 5.0, "July 2, 2014", "Keith1664", "Dubai, United Arab Emirates", 26, 27, "I've visit The Coupe frequently and have never been disappointed.\nThe breakfast/brunch menu is great - the quality of the food and the ingredients really are head and shoulders ahead of the traditional 'diner' alternatives.\nHigh quality, locally sourced, free range and well prepared. The hash browns are great too - I've tried most items on the menu and they're...\n\n\nMore"], ["Very Good-Average-Depending On What You Ordered", 4.0, "June 30, 2014", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Tried the Coupe upon recommendation of a friend. Located in what used to be a tough area of DC, the Coupe draws an eclectic mix of customers. Service staff were uniformly professional and enthusiastic. The restaurant set up is intriguing with a loooong dining room and extensive numbers of outdoor tables as well. A coffee bar is the center-piece of...\n\n\nMore"], ["Great liquor selection", 3.0, "April 19, 2014", "Linda T", null, 2, 0, "Great liquor selection at the bar, and that was the only highlight. The bartender was not very attentive, and the restaurant/bar was less than crowded. It seemed as if we caught him at the end of shift, seemed to have other things than service on his mind. Nice food selection, my friend had the grilled cheese which she seemed to...\n\n\nMore"], ["Best Mojitos Around", 3.0, "November 7, 2013", "KishaMonique", "Guangzhou, China", 30, 34, "This was an interesting restaurant...the set up was really cool and wasn't too crowded. I sat at the bar and our server Oliver took really good care of us. I ordered the chicken and waffles and was hoping it would have made my SUNDAY awesome, but alas it was an epic fail. The waffles and hash browns were very good,...\n\n\nMore"], ["Try the Cheesy Grits!", 5.0, "October 15, 2013", "rubybouvier", "Denver, Colorado", 257, 140, "I was recently at The Coupe for brunch. We sat at the bar. The bartenders were helpful and friendly, directing us to trying the brunch burger. It was great! I also had the cheesy grits, which were wonderful. Bloodly Mary- also excellent. The coffee was also very good. It is a warm, friendly environment. I would definitely recommend this restaurant...\n\n\nMore"], ["Very good food; poor service", 4.0, "September 29, 2013", "Mike G", "East Marion, New York", 52, 39, "Went for dinner with my son and daughter-in-law and 2 1/2 year old grand daughter. The food was excellent; the waitress was terrible. All the other waitresses seemed to be working hard. Other people came in after us and were served faster. Bottom line: avoid the waitress with the tattoo of Saturn on her chest.\nI ordered pork shank and...\n\n\nMore"], ["Quite and Pricey!", 3.0, "August 22, 2013", "Jabu M", "Pretoria, Gauteng, South Africa", 26, 8, "I had an informal dinner at \"The Coupe\" whilst on my short stay in DC. The restaurant is located in a nice spot (quite and good background music). The place is also very welcoming with friendly waiters.\nThe menu is rather limited and a bit expensive compared to other restaurants nearby. The service was pretty good. It is also a...\n\n\nMore"], ["Good Late-Night-Option", 4.0, "August 18, 2013", "CaptainAwethume", "Hyattsville, Maryland", 262, 85, "I came here some months ago and had no problems. I had the vegetarian reuben and it was great. Well done. And it's great to have a 24 hour place in a city that is run by grandparents/where everything closes early. The staff were friendly and pleasant. I'd definitely come back sometime."], ["Disaster!", 1.0, "June 26, 2013", "Neil S", "Washing", 1, 0, "I totally agree with the other reviewer. The Coupe is a disaster. The waiters are extremely unprofessional and incompetent. No greetings and no common sense. The gentleman who was serving us has a bad attitude with no smile or greeting. He pulled my plate even before we finished without asking anything.\nIt put me in a very bad mood. It...\n\n\nMore"], ["The Coupe Continues to Fail", 2.0, "May 24, 2013", "Randall K", "Washington DC, District of Columbia", 64, 27, "Last night marked my final visit to The Coupe – a restaurant located in a beautiful space in a neighborhood that very much needs a 24-hour diner. However, I can no longer ignore the fact that this restaurant has serious problems, and management appears to have no plan in place to address any of them.\nI’ve now visited The Coupe...\n\n\nMore"], ["Incredible Breakfast", 5.0, "April 22, 2013", "John R", "Roseland, New Jersey", 8, 2, "While in Laurel MD for the DCFD Hockey Tournament, we had a break in the schedule and went to DC. While at BestBuy in DC for camera issues, we asked where to go for a good breakfast. Carlton, a supervisor at BestBuy recommended The Coupe for an upscale meal and he was dead on!!!!\nThey had multiple styles of seating....\n\n\nMore"], ["GREAT venue, good service, pedestrian fare", 3.0, "April 21, 2013", "stonewithnomoss", "USA", 476, 368, "First and foremost...wow, what a great space! Lovely to eat there, very well designed.\nOur server was super helpful and attentive. High marks for that. We arrived at 9:40am for Sunday Brunch and were told DC alcohol sales start at 10am. So we had coffees and waited. At the moment 10 struck, our drinks were were ordered!\nThe drinks. The...\n\n\nMore"], ["Great addition to the neighborhood", 3.0, "April 7, 2013", "JoyceInDC", "Washington DC, District of Columbia", 196, 54, "I had 'great expectations' for The Coupe, but.....all is not well. Beautiful warm Sunday morning after church. We decide to go to The Coupe for a late breakfast. After finding a parking space (another warning....it's tough to find in this neighborhood!), we took seats at the breakfast bar (ALL tables were taken...and this is a pretty nice-sized place). Our waiter...\n\n\nMore"], ["What A Shame! Could Be So Much Better.", 2.0, "March 24, 2013", "SanMN", "Edina, Minnesota", 65, 32, "Truly disappointing. The venue is great; located a friendly neighborhood, bright and friendly interior and atmosphere. Espresso based coffees are good and presented nicely. Regular coffee is good but acidic. On my first and only visit, I had one of their breakfast specialty, Corned Beef Hash. If breakfast establishments offer Corned Beef Hash, I order it without fail. Here, I...\n\n\nMore"], ["Fantastic Potential...", 3.0, "March 21, 2013", "brmusicman", "Chicago, Illinois", 916, 489, "I want this place to do well! It's a great and much-needed addition to the neighborhood.\nThe space is fantastic. Really well-done--good design. Inviting, neighborhood-like.\nWe went for breakfast with a friend. The breakfast menu had lots of appealing options, ranging from classics to a few more creative things. Everyone was pleased with their food; I had a toad-in-the-hold with...\n\n\nMore"], ["Best of All Worlds", 5.0, "March 17, 2013", "Khyati D", "Washington DC, District of Columbia", 74, 30, "There were four of us who went to the Coupe on a Friday evening and stayed for several hours and all of us could attest to a fantastic all around experience.\nThe ambiance was something to note because they really have provided the best of all atmospheres. You can choose restaurant style, lounge style or bar style and the space...\n\n\nMore"], ["Great early morning", 4.0, "March 13, 2013", "txprthead", "little rock", 22, 6, "I had to submit The Coupe to TA but there are reviews out there. Good breakfast stop but needs to work on consistant portions. chorrizo eggs great but need a good salsa. Service great both 5am visits I made. I love all the choices in Columbia Heights area. The Pinch is great at night."], ["Patience is still a virtue", 4.0, "January 16, 2013", "Simi984", "Washington DC, District of Columbia", 37, 24, "And while The Coup may take a little longer to satisfy your hunger, it's worth the wait! I went here for Sunday brunch on a drizzly day. It was warm and cozy and very inviting. The great thing about this place is there is a restaurant, cafe and bar all in one. Also, their mobile reservations are so quick and...\n\n\nMore"], ["Still needing some kinks worked out", 3.0, "November 6, 2012", "Sacred-Valley-Girl", "Washington DC, District of Columbia", 62, 25, "We are delighted to have The Coup in Columbia Heights' special 11th St. corridor and their 24-hours open means one can stumble over from any of the great pubs after closing without having to drive. However, they still need a few months to train their staff and get it right. The horror stories are endless from swapped bills to LONG...\n\n\nMore"]]], ["Z-Burger", [["Best burger since Five Guys!", 5.0, "September 25, 2015", "Gl_Trekr", "Berlin, Germany", 7, 2, "Juicy, dripping burgers with a choice of toppings. Portions were large too. I had a veggie burger with provolone cheese and onion rings and my husband had a cheese burger with French fries! The burger patties was fresh and juicy and everything was hot as should be! Restaurant was very clean, well lit and service was fast too. We can...\n\n\nMore"], ["Delicious burger", 5.0, "September 2, 2015", "Petar D", "Belgrade, Serbia", 29, 19, "I can't remember which exact burger I bought but it was really really tasty! Fries are also great, and there is big variety of sodas on the machine. Definitely worth visiting, when you are hungry at Washington DC :)"], ["Awesome burgers", 5.0, "August 19, 2015", "Barnaby T", "Royal Tunbridge Wells, United Kingdom", 15, 2, "Just the most tasty delicious burgers ever.\nWish we had Z burger in the UK, I'd be there all the time. Just go for anything on menu."], ["Not as good as 5 Guys, but good fries", 3.0, "August 7, 2015", "lisalou216", "boston, ma", 72, 50, "Average burger joint. Lots of toppings to choose from but just an average tasting hamburger. Order ahead to save time as it gets busy. Not very smoothly run- I stood for 5 minutes at the counter in front of an employee before she acknowledged me."], ["5 guys with milkshakes and onion rings", 4.0, "July 14, 2015", "TheGardners_11", "Atlanta, GA", 165, 43, "If you didn't tell me I was in a z burger I would think I was at 5 guys. The burgers are almost identical. They are equally as good. The fries are thin cut and good. You can get onion rings here but they are a bit greasy. I would equate them to the varsity in Atlanta. They do have...\n\n\nMore"], ["Great burgers", 4.0, "June 21, 2015", "Barb L", "Sullivan, Indiana", 16, 2, "Burger was delish! French fries were also wonderful! Did not get seasoning because I was sharing with my husband. Great feel, used to be an old movie theatre."], ["Why Bother?", 3.0, "May 30, 2015", "sewcraz4361", "Mount Airy, Maryland", 77, 16, "Hubby and I love burgers and Z-Burger was rated pretty high and Groupon had coupons. We live in Maryland and take Metro into the city. It was a long ride for very average food. We went to the waterfront location. First of all, the place was not very clean. The kid who waited on us was very good and patient...\n\n\nMore"], ["Great burger and way cheaper than room service", 5.0, "May 10, 2015", "Todd E", "Highland, Illinois", 12, 77, "Great burger and fries...a list of milkshakes a mile long. We opted for Z-Burger instead of room service and glad I did. 3 burgers, a drink and milkshake for 25 dollars."], ["Great!", 4.0, "April 12, 2015", "i_love_totravel_412", "Pittsburgh, Pennsylvania", 42, 12, "This place was great! In my opinion it is way better then other places such as five guys. They also have really good milkshakes!"], [":D", 4.0, "April 5, 2015", "Austin H", "Missouri City, Texas, United States", 76, 16, "Only got the half fries/half onion rings, but they were really good. I got more than I expected; it was well worth what I paid for. No matter what you order, you should get it in no more than ten or fifteen minutes."], ["Wasn't to impressed", 3.0, "March 31, 2015", "degodeb", null, 8, 9, "Burgers were average. I hated the z sauce they served with the average fries. We went because we had a group on."], ["Fries aplenty", 4.0, "March 28, 2015", "Fallser", null, 35, 9, "Located an easy shuttle ride from the American University campus, Z-Burger provides a very good burger experience. Burgers are cooked to order with a wide variety of toppings available. I ordered the smallest portion of fries available and was amazed by the quantity that they gave me. The fries are thin and flavorful. Prices seem high if you are not...\n\n\nMore"], ["Amazing shakes!", 5.0, "March 20, 2015", "Leah D", "Krum, Texas", 47, 30, "We loved the fresh burgers, hand formed, not frozen! The food was fresh and good, the milkshakes amazing, loved this place."], ["Potato milkshake?", 1.0, "December 20, 2014", "Paula G", "Washington, District of Columbia, United States", 1, 1, "The burgers are ok, the fries are average. I like the variety of 75 flavors. However, I wasn't aware potato was a flavor. After ordering a milkshake recently, I found chunks of raw potato in my milkshake."], ["Amazing burgers and shakes", 5.0, "November 12, 2014", "Jamie B", "Edmonton, Canada", 110, 54, "Used a groupon here to try it out. There are so many burger joints, its hard to find a really good one. This is it!! Awesome fresh made burgers and fries. Shakes were also very good and had a tonne of flavours. Totally recommend this place for a good burger!!"], ["Five Guys Plus", 4.0, "October 27, 2014", "Godguy", "Reston VA", 283, 201, "I agree with an earlier reviewer, Five guys with an expanded menu. Overall really good fast food. But they are a tad slow and for one person in our group who ordered an Italian sub from the sandwich side (which appeared unstaffed) the sub was dripping with oil. They did handle our group of 20 well. Kids were happy because...\n\n\nMore"], ["Great burgers", 4.0, "October 8, 2014", "The_Long_Carbine", "Baltimore, Maryland", 46, 4, "Great burgers, also some good sandwich options. If math this with guys for sure. The onion rings were huge and awesome!!!!!!"], ["Burgers, Shakes and Fries.... Yummy good Subs Too!", 4.0, "May 11, 2014", "barymad", "bethesda, md.", 262, 65, "When I get a craving for a really good burger or sub...I am hard pressed to find better than Z Burger. Several locations around the DC area. All burgers are cooked to order. A medium French fries feeds 3 and are fantastic. Well worth the extra treadmill time."], ["Where's the beef?", 3.0, "September 16, 2013", "Foodie G", "North Pole, Alaska", 4, 2, "I had to check out this place the burger was not great, no juicy flavor or beefy flavor. The fries were limp not crisp but the milkshake was very good. In my humble opinion 5 Guys is much better if you are looking for a good thick burger and salty crispy fries."], ["Decent food", 3.0, "August 21, 2013", "Gmann6699", null, 36, 7, "The food was pretty good I had the veggie burger it was a little spicy but was tasty the French fries was good but a little salty I would reccomend this place"], ["Very good burger, seems familier", 4.0, "August 2, 2013", "GoodFood88", "Washington DC, District of Columbia", 594, 253, "Z Burger seems to be the next step up from 5 Guys. The fries come in a bag, overflowing from a cup with a special seasoning. The burgers are grilled the same. Biggest difference arer topping, the many different shakes and the mega-Coke machine. A little pricey, but overall a good burger."], ["Good burger", 4.0, "July 28, 2013", "jimjr264", null, 21, 5, "Great burger and pretty good shakes. Definitely on par with five guys and reminds me a little of in and out burger in decor, etc. Pricier though."], ["Great onion rings", 3.0, "July 6, 2013", "lovelylanna", "Washington DC, District of Columbia", 55, 15, "The burger was average but the onion rings are delicious. One order is an extremely generous portion that can be shared by three people!"], ["Good Shakes", 4.0, "June 24, 2013", "BonsterMC", null, 73, 31, "Good shakes, good rings, ok everything else. Totally fine. I like those shakes... I think those are their strong suit. Mmmm. Not mind-blowing, but totally fine on the whole."], ["Overpriced & overhip", 2.0, "May 16, 2013", "ScrawnyPackrat", "Gary, Indiana, USA", 7, 5, "Meat was tasteless, like rewarmed. This is not a burger you'd get from Five Guys or In-N-Out. Apparently you're paying for the trendy colors, not for better food."], ["Messy, Juicy Burger", 3.0, "May 15, 2013", "BigDogWillie", "Fort Worth", 192, 79, "The burger was good but juicy and messy and feel apart. Hard to eat a hamburger that falls apart. The large order of fries was huge & feed three people. All you can drink beverages from a hi tech dispenser. Not in my Top 5 Burger Joints, but price was fair and I rate this a good solid B or...\n\n\nMore"], ["Amazing onion rings", 4.0, "May 14, 2013", "Lynn P", "Ohio", 89, 29, "We were looking for a place for dessert and my husband and son love milk shakes so this fit the bill. It's a burger, fries and shake place in a refurbished movie theater, a beautiful building. The prices are reasonable considering the size of the items and they apparently have 75 different flavors of milk shakes. The onion rings, which...\n\n\nMore"], ["Great burger & fries", 4.0, "March 14, 2013", "ClassyJetsetter", "DC Metro Area", 117, 55, "I took advantage of a Capitol Deal to try them out. There are a myriad of burger and fries toppings, so that was interesting! Food was cooked to order making the temperature & taste were very good! Oh, the Coke soda machine has equal amounts of flavor options. Kind of fun experimenting with that too! (Metered) parking is limited at...\n\n\nMore"], ["So in love with Zburger", 5.0, "February 1, 2013", "Tamaria", null, 57, 61, "Went a couple of months ago for the first time. I had never heard of this place prior to passing it and deciding to stop in. I purchased a chicken cheese steak and fries. OMGGGGGG.....it was the best. The toppings are free for the most part, there are a couple they do charge for, but the ones I ordered are...\n\n\nMore"], ["First timer...will return.", 4.0, "January 2, 2013", "Mark G", "Goochland, Virginia, United States", 359, 61, "First time trying a Z-Burger..Very good. Nice to have a real hamburger for a change loaded with lettuce, tomato, onion and mustard....Not a healthy choice but who cares....Can't be good all the time."], ["Two and a Half Guys", 4.0, "December 9, 2012", "Mark K", "Richmond, Virginia", 40, 16, "Similar to Five Guys except some locations have milkshakes. Fries not in the same league. Burgers at Five Guys usually arrive very hot and cooked to a slight crisp. Best eaten immediately. Not so a Z-Burger. This means Z-Burger is a good imitator, but Five Guys retains the throne at this level. Try Timothy Dean burger for a higher level."], ["Great Burger Good Price", 4.0, "November 13, 2012", "Sunnysided305", "Miami, Florida", 48, 24, "The food was fresh. Made to order. Huge portion. Good to share especially with kids. The onion rings are enormous! My kids loved it and for the price, it was well worth it."], ["Just another burger joint", 3.0, "November 10, 2012", "khoward67", null, 108, 58, "It was a no frills, average burger place. Better than McDonald's but not worth $5.79 for a cheeseburger."], ["Be sure to get the right Z-Burger", 2.0, "October 3, 2012", "kmaFL", "Bratt, Florida", 111, 48, "Based on reviews, ads and their website, we walked a mile to the Z-Burger at 2414 Wisconsin NW. Despite having the same website and same online menu (with 75 flavors of shakes) this location had no (zero) milkshakes. We were very disappointed."], ["A 'Five Guys' impersonator with a little extra", 4.0, "September 30, 2012", "JoyceInDC", "Washington DC, District of Columbia", 196, 54, "Been wondering about this place for a while now. Finally, decided to stop by and try it. The burgers are very good - and remind me VERY MUCH of what Five Guys offers (single vs. double burgers/cheeseburgers) with lots of topping options. Oh yeah. Also wrapped in foil (just like Five Guys). Then, there's the fries...just like 'Five Guys' More...\n\n\nMore"], ["Black bean burger worth the drive!!", 4.0, "September 27, 2012", "Urbanfarmgrl", null, 128, 25, "Close to work but inconvenient to park during the lunch hour so take metro if that is an option. The veggie black bean burger is exceptional and huge! If you like fries and onion rings make sure you have someone to share with bc the servings are very generous. If not concoct a shake---with 20+ options you get great real...\n\n\nMore"], ["Much More than just Burgers (which are great)!", 5.0, "September 25, 2012", "JoeTraveler_TN", "Nashville, Tennessee", 21, 22, "If you like Five Guys but always thought something was missing....well, you will love the Z Burger!\nIt's like Five Guys - great burgers prepared with super fresh beef and veggies. But what sets the\nZ burger apart from the other \"Guys\" is their Milk Shakes. 75 flavors! Wonderful milk shakes!\nGreat service and close to the Metro station at...\n\n\nMore"], ["Yum", 4.0, "August 18, 2012", "Leblancfamily", null, 50, 19, "Name your flavor because they offer up 75 types of milkshakes. Their burgers, fries and dogs are great too! We ate outside and had a great time. We'll be back for more!"], ["Good buger and great shakes", 5.0, "August 4, 2012", "mct911", null, 44, 15, "Wanted an easy dinner while in DC for the weekend. We went to the Z-Burger on 4th ST SW on the recommendation of the concierge at our hotel. The burgers are all freshly made and the array of toppings was fantastic, so you could get the size burger you wanted with almost anything on it with no real up charges...\n\n\nMore"], ["Z Burger at the SW Waterfront....does shakes right!", 5.0, "July 26, 2012", "Just_Me_Bernie", "Bowie, Maryland", 185, 52, "I've been there 4 times and have never been disappointed! The service is great, the food is always hot, fresh and delicious. The shakes are amazingly thick with so many different flavors."], ["Best burgers and onion rings - hands down", 5.0, "June 17, 2012", "deadhead_attorney", "Silver Spring, Maryland", 27, 8, "What more can I say? This place has the best burgers and onion rings around. The onion rings are dipped in waffle batter and are very filling. I always pound my chest and feel gross after 4 or 5 of them. Burgers come with all the toppings. If you really want to die, order a thick shake on top of...\n\n\nMore"], ["z burger at glover park is a delight", 5.0, "May 26, 2012", "Pliz", "Washington DC, District of Columbia", 34, 17, "I adore this unpretentious burger place at glover park near georgetown. juicy tasty burger. and i can't believe the super low price... (do you guys still get any profit?!!!) the staff are always nice esp the manager. they NEVER scrimp on things here. and my husband is always amazed how i manage to find great little gems (big on quality,...\n\n\nMore"], ["Always hot and tasty", 4.0, "April 14, 2012", "vafedtraveller", "Williamsburg, Virginia", 49, 15, "Can't go to DC without having a hot and tasty ZBurger and pile of seasoned fries. My doctor would have a fit if he knew about my addiction- but you just can't beat these things.\nNice clean place, fast service, and plenty of room to sit and watch the folks on the street."], ["It's Five Guys with milkshakes", 5.0, "March 29, 2012", "Pkp122", null, 11, 3, "If you're in the DC area, chances are you've been to a \"Five Guys\". Z-Burger is exactly the same except for two major things. Firstly, the fries are much better. Secondly, and most importantly, they have over a hundred choices of flavones for milkshakes, floats an so on. This for me is what separates Z Burger from the rest. It's...\n\n\nMore"], ["great shakes and fries", 4.0, "March 27, 2012", "jrankw", "Washington DC, District of Columbia", 72, 57, "Must get a milk shake (over 100 flavors) and the fries are good too."], ["Best non-Five-Guys in town", 4.0, "February 29, 2012", "tigertracks", "Washington DC, District of Columbia", 8, 6, "If you need a break from Five Guys and want a different flavor to your burger, get it here. Z-sauce is zesty and good, burgers are tasty and fixin' options are a-plenty. Especially glad they finally added Iced Tea to the Fountian Drinks area.\nOh, and grab a chocolate shake. You won't be disappointed."], ["soo delicious - will be back soon!", 5.0, "November 18, 2011", "mdubbwashdc", "Washington DC, District of Columbia", 6, 0, "my car still smells like Z burger and I like it!\nmy boyfriend and I went to the tenleytown location on a weekday night (thanks, scoutmob!) and we were shocked by how good these burgers were.\nthe veggie burger was probably the best I've EVER tried. I was sort of expecting a thawed Boca-style disc.. and was amazed by the...\n\n\nMore"], ["Great shakes", 4.0, "April 18, 2010", "miles202", "Washington DC", 3, 0, "Great shakes"], ["Z-Burger DC", 4.0, "July 6, 2009", "JKGF2", "Washington, DC", 1, 1, "Z Burger DC should be added to the list of Cheap, Good Eats in the District. Some say it resembles the concept of Five Guys but we think this spot has way more to offer than Five Guys. 1. The menu is more extensive with everything from Bacon Double Cheeseburgers to Philly Cheesesteaks and 2. the milkshakes add just the...\n\n\nMore"]]], ["Kotobuki Japanese Restaurant", [["Excellent", 5.0, "October 4, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "This is one of my favorite Japanese restaurants in DC. Food is fresh and delicious. And staff is friendly.\nWe always order the chirashi or chirashi deluxe (only available on the dinner menu) and the unadon set.\nThe Ankimo (appetizer) is also excellent.\nGood value for money."], ["Wonderful neighbourhood Japanese restaurant", 5.0, "July 8, 2015", "MJS1944", null, 94, 55, "Excellent quality fish. Their special dish is eel done hot in a pot, but I would definitely recommend their sushi - at $10.95 for the Sushi Special at lunch time, complete with miso soup thrown in, it is wonderful value. Relaxed 'neighbourhood' atmosphere, pretty different from Makoto next door, which some might regard as pretentious. Service very OK.\nAnytime you...\n\n\nMore"], ["Chef Should Observe work of his staff", 3.0, "May 7, 2015", "Yori O", "The Villages, Florida", 509, 143, "If it is only for what I ordered and received, I would give it a two star but since saba(mackerel)sushi my wife ordered was not bad, giving it three star. I ordered Unadon(eel donburi). The sauce was just too much getting all the way into the rice under. I had to order bowl of rice separately so I could eat....\n\n\nMore"], ["Gone downhill.", 3.0, "February 18, 2015", "hisakyuu", "Washington DC, District of Columbia", 82, 44, "This used to be her favorite sushi go to place in DC. I personally always loved Unadon, with a single large piece of grilled eel on top of a bowl of rice and lots of condiments to go with it. We went again in early February. Instead of a single large piece of grilled eel on top of the rice,...\n\n\nMore"], ["Budget-friendly delicious sushi", 4.0, "February 15, 2015", "duke_katie", "Washington DC, District of Columbia", 28, 11, "When my family first came to visit DC, we visited this restaurant upwards of 5 times in the first week. The sushi quality is consistent, the prices amazingly affordable (for DC) and the setting (while not upscale) is comfortable enough.\nThe salmon quality is hit or miss - I usually stick to tuna, shrimp, anything else besides salmon. The space...\n\n\nMore"], ["Service was slow and not attentive,chirashi was so so.", 3.0, "December 9, 2014", "YM443", "Tokyo, Japan", 187, 46, "We had late lunch around 14:00.\nThough the lunch time was almost over there were many customers.\nWhen we came inside,waitress did not mention/say anything ,they just busily walkes around to serve or check out.\nSo we were. It sure how long we were supposed to wait.\nOther customers who came just after us seemed annoyed because no staff cared...\n\n\nMore"], ["Unadon or Kamameshi - hard to choose!", 4.0, "October 24, 2014", "Gregory F", "Arlington, Virginia", 117, 35, "I love this restaurant. It's just up stairs in a DC brown stone and above it's more expensive sister restaurant. The menu is simple. Order the eel Kamameshi for your first visit. Order the unadon for your second visit. Order the one you liked the best for third visit. Add in some sake, and keep coming back."], ["Wonderful Sushi", 5.0, "August 22, 2014", "RetiredinDC", "Washington, DC", 16, 6, "For some of the best sushi, at very reasonable prices come to Kotobuki. The shrimp shumai are fabulous. Sushi is always fresh.and flavorful. It is a small place, up a flight of stairs. Very popular with locals, so there may be a wait. Also good for take-out."], ["Yummy and fresh sushi", 4.0, "July 9, 2014", "Natthaphon K", "Chiang Mai, Chiang Mai, Thailand", 56, 29, "I love this restaurant from food and nice services. Although the restaurant is quite small and not fancy, food is very nice. There are many sushi styles and also have other kinds of menu too. So you can enjoy eating Japanese food here and feel the atmosphere of Japan from the restaurant's decoration :) let's try it !"], ["Simply tasty sushi and chirashi", 5.0, "June 19, 2014", "Nina R", "Tacoma", 33, 15, "This tiny upstairs restaurant saw a stream of contented lunch customers. Four cooks working flat out; menu of standards and rarities; food fresh Fresh FRESH and delicious, prices very reasonable. Palisades is tough as a destination, but if you are in the area it's a must."], ["Kotobuki (寿 - longevity) is forever!", 3.0, "March 15, 2014", "Lam N", "Singapore, Singapore", 757, 784, "The sushi and sashimi here are not the best or very creative, and it's pricey if you go for the rarer stuff like otoro or uni. However, we've been going here for over 10 years, because the food is pretty good, service is friendly, and it's very homey here - Beatles music, simple decor. Great neighbourhood restaurant!"], ["Authentic, best sushi place in DC", 5.0, "January 25, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "It's really hard to find a good Japanese restaurant in DC. The quality is normally low.\nI found this restaurant through yelp and the pics looked very legitimate, so we decided to give it a try. It's kind of far from DC by public transportation. There is a bus stop next door (D5 and D6 at night they are not...\n\n\nMore"], ["Great fish", 5.0, "December 23, 2013", "Kadie123", "Irvine, California", 76, 10, "We were looking for great sushi in DC and found it. Started with the clam miso on offer, and our table had rolls, chirashi, and the hot pot. Everything was great, the servers were kind and charming, and the mochi were delish."], ["Nice Chirashi in an authentic setting", 4.0, "October 8, 2013", "grungtheep", "Vienna", 60, 50, "Just had dinner at Kotobuki since I was craving for Japanese food. Gosh, good sushi is a hard find in Washington DC? With Kotobuki, however, I was able to find an authentic and reliable place to satisfy my desire. :-)\nI had the Chirashi Special (USD 25.00) which comes with a bowl of miso soup. The fish was fresh and...\n\n\nMore"], ["FRESH Sushi for an Even FRESHER Price!", 5.0, "May 4, 2013", "ElGringoAlto", "Rincon", 7, 11, "The first time I went to this quaint little Japanese restaurant I could tell it was going to be great. Not only is it incredibly fresh and delicious, its suuuper authentic. After I went there I was raving about it with my friends and they all told me they have heard of it before and that it was rated the...\n\n\nMore"], ["two new chefs? double drop??", 3.0, "May 1, 2013", "takashi H", "Fairfax, Virginia", 1, 1, "there are two new sushi chef and the quality started going down. the fish is thinner, and sometimes the chef with mustache serves as if I was dining in tokyo subway vento vending machine. It is becoming apparent that these two chefs, not only can't, but rather are very different style and mentality what Kotobuki has been put up over...\n\n\nMore"], ["Still waiting to discover them...", 3.0, "September 28, 2012", "Stefanek", "Washington DC, District of Columbia", 80, 38, "Because we moved to this neighborhood, and friends recommended this place to us, we tried their sushi/sashimi two times, so far (to go). It's a small place, upstairs, very much like any traditional Japanese sushi houses. So far, I am not overly impressed - the shrimps (which I ordered the first time, and avoided the second) were \"very dead\" by...\n\n\nMore"], ["Great little place", 4.0, "September 12, 2012", "Jillnt6772", "Bethesda, Maryland, United States", 115, 50, "Very fresh and authentic japanese food. Nothing fancy, no waiting area, no bar and only a few tables. But if you can get it, its worth it!"], ["Best sushi in town", 4.0, "July 5, 2012", "PaiMeiLi", "Washington DC, District of Columbia", 54, 17, "The resto is as small as a 1 bedroom apartment, not too much seats.\nI love kamameshi, and they make kamameshi so good it reminds me of home. Their sushi's are pretty reasonable. We had half a dozen of lobster roll sushi and half tuna sashimi. Shumai is ok, and the mochi is something that I can get from the...\n\n\nMore"], ["It's just for the locals!!", 3.0, "March 6, 2012", "exposingthetruth", "Charleston, SC", 21, 11, "I think anybody writing a wonderful review for this place are from DC and the surrounding areas because the sushi is \"lack luster\" around these parts and this place must be the lesser of a lot of evil. First, the entire restaurant only seats about 20 and that's packing you all in so tight that my purse knocked over the...\n\n\nMore"], ["Everyone knows it's great ... and it is!", 5.0, "January 7, 2012", "TooFrequentTraveller", "Washington D.C.", 125, 44, "We are typically ordering out from Kotobuki - there's simply not enough space. The sushi is reliably good, and well prices.\nWe'll be back for more!"], ["best kept secret", 4.0, "December 29, 2011", "melhoff25", "Chicago, Illinois", 7, 9, "i dont even want to write a review because i dont want kotobuki to get crowded. this is one of those places that is so good you just want to keep it to yourself.\nthe best sushi you will find in DC, and definitely the best prices. The entire places has like 8 tables so dont expect to sit down...\n\n\nMore"], ["Best sushi in town and only one kamameshi", 4.0, "October 8, 2011", "darwinsail", "Washington DC, District of Columbia", 379, 305, "It is excellent in sushi and unique hamameshi. The problem is it is small and you may need to wait if you can not carry it out."], ["Best Bargain Sushi Restaurant", 4.0, "October 1, 2011", "Norihoshi", null, 12, 5, "This is the best bargain sushi restaurant in DC. It is worth taking a taxi from your hotel if you are a party of 3 or 4 people. My recommendation here is Chirashi ($10.95 for lunch) but everything is good here including Kamameshi set. Owned by the Japanese and Sushi chefs are all native Japanese too."], ["yes, it's cheap & delicious, but...", 4.0, "July 31, 2010", "a9zn", "NY", 121, 80, "My brother didn't want to drive, so we took the bus here on a Sat.\nOnce we got there, the place got crowded quickly.\nFood was good & fresh. Staff was friendly & efficient. Price very reasonable.\nThat being said, nothing really wow'd me.\nSo if price & freshness are your only two criteria, then eat here. Otherwise, you may...\n\n\nMore"], ["A perfect casual sushi place", 5.0, "March 3, 2010", "youngnan", "DC", 21, 8, "Just about the best sushi I ever have and I go here and other sushi restaurants again and again. This is the one place that I eat at in DC that I really didn't want to share in Tripadvisor because it is that good, cheap, but lacking lots of chairs. However, I want places like this to do well and...\n\n\nMore"], ["Unfriendly, Curt Waitresses", 1.0, "August 18, 2009", "TravelerusInterpidus", "Washington, DC area", 26, 34, "Went in for pick up. Was treated like dirt for asking for extra wasabi and chopstix. Was told they were already in the bag and they refused to give me more. Our order for 6 was mixed together.\nRidiculous. Do not waste your money or time."], ["Great tiny sushi bar. Mostly sushi (though also serves kamameshi). Sometimes a long wait in the evenings because of...", 5.0, "June 6, 2009", "eventsdc", "washington, dc", 170, 88, "Great tiny sushi bar. Mostly sushi (though also serves kamameshi). Sometimes a long wait in the evenings because of limited seating. Upstairs from the expensive fixed price Makoto."], ["good sushi for good price! can't get any better than that!", 4.0, "March 4, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good sushi for good price! can't get any better than that!"], ["best kept sushi secret in DC", 5.0, "January 25, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "best kept sushi secret in DC"], ["Very good for the price.", 3.0, "January 1, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Very good for the price."], ["Great sushi. As cheap as good sushi can get. Beatles music in the background. Japanese chefs. Just wish it was...", 5.0, "September 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi. As cheap as good sushi can get. Beatles music in the background. Japanese chefs. Just wish it was closer to my house."], ["Great value. Minus points for using all imitation crab.", 4.0, "August 16, 2008", "TofuNinja", "San Francisco, California", 112, 40, "Great value. Minus points for using all imitation crab."], ["Great Sushi. Amazing Prices. Beatles CD playing over & over. A really find.", 5.0, "August 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great Sushi. Amazing Prices. Beatles CD playing over & over. A really find."], ["Best sushi at the best price in DC", 4.0, "August 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best sushi at the best price in DC"], ["The menu is small but well-composed, striking a balance of traditional hot dishes like kamameshi and unadon, and...", 3.0, "June 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The menu is small but well-composed, striking a balance of traditional hot dishes like kamameshi and unadon, and smallish, classical sushi selection that relies on freshness and good cuts of the fish - not silly-daft nonsense of wrapping gorgonzola, Cheetos, bread crumbs and anchovies in seaweed and peddling it to the gullible as, say, a 10.95 \"College Park Roll.\"\nMy...\n\n\nMore"], ["Great sushi, great prices. I discovered Kamameshi here.", 5.0, "May 19, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi, great prices. I discovered Kamameshi here."], ["Not bad. Cheap sushi. There Kamemushi is good.", 3.0, "April 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Not bad. Cheap sushi. There Kamemushi is good."], ["Decent sushi, very cheap, very small dining room. Service is a little too attentive, but there are Free refills on...", 3.0, "March 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Decent sushi, very cheap, very small dining room. Service is a little too attentive, but there are Free refills on Green Tea"], ["Low on atmosphere but you get some really fresh sushi for your buck. It is only sushi and very little cooked food for...", 4.0, "March 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Low on atmosphere but you get some really fresh sushi for your buck. It is only sushi and very little cooked food for those not inspired by raw."], ["inexpensive and also authentic ..great selections of sushi\na rare find in DC", 5.0, "February 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "inexpensive and also authentic ..great selections of sushi\na rare find in DC"], ["Good sushi for reasonable prices. Not many seats in the dining room so long waits on weekends, but also has takeout...", 3.0, "February 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good sushi for reasonable prices. Not many seats in the dining room so long waits on weekends, but also has takeout service."], ["Try their \"Kama-meshi\". This is the only place in town it's offered.", 4.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Try their \"Kama-meshi\". This is the only place in town it's offered."], ["Great sushi that is dirt...", 4.0, "February 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi that is dirt cheap. Out of the way, but well worth it"], ["Real Japanese", 3.0, "January 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Real Japanese"], ["Great sushi, great prices.", 5.0, "January 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi, great prices."], ["Great sushi, great price!", 4.0, "January 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi, great price!"], ["Best japanese in dc. And...", 5.0, "January 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best japanese in dc. And not too expensive."], ["Great sushi for cheap cheap price!! Highly recommended", 5.0, "January 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great sushi for cheap cheap price!! Highly recommended"], ["Fantastic value for sushi in the city - fairly fresh too.", 5.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fantastic value for sushi in the city - fairly fresh too."], ["Best bang for the bucks.", 4.0, "January 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best bang for the bucks."], ["Great value for fresh sushi. The choices are a bit limited, but you won't be disappointed.", 4.0, "December 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great value for fresh sushi. The choices are a bit limited, but you won't be disappointed."]]], ["The Bistro", [["nice place with open air seating", 3.0, "September 3, 2015", "robert w", null, 6, 1, "Stopped for a few drinks and appetizers before heading to an evening tour. Table by the open air street front were nice, and apps and drinks were nothing special, but reasonably priced. OK place to stop in nice area of Dupont Circle."], ["Ok", 3.0, "June 17, 2015", "Lisa L", "Charleston, West Virginia", 74, 32, "My husband and I had lunch here and I ordered a hamburger well done and when I cut into it, it was quite pink in the middle. We were pressed for time so I did not send it back. I proceeded to scoop the middle out of the burger and eat the edges. The server never came back to ask...\n\n\nMore"], ["Our Favorite Spot", 5.0, "June 16, 2015", "tch469", "Stokesdale, NC", 34, 7, "Last year when we were in DC, we fell in love with The Bistro. On our recent trip of four nights, we had dinner there FOUR times! Their menu offers a great variety, the service, top-notch, and they make you feel like family. Also we were able to get our favorite table in the front window ....excellent for people-watching."], ["Popular, pleasant, and overpriced", 3.0, "March 17, 2015", "AlexaD", "Paris, France", 70, 29, "French food, pleasant enough service but nothing to write home about. House wine was excellent, mussels nice, fries soggy. $40 per person for a simple meal with one bottle of wine and two beers for six."], ["Great soup on a cold night", 4.0, "February 20, 2015", "Jeniheifer", "Santa Margarita, California", 22, 12, "At our recent trip to DC they had the coldest weather since 1936 and this was a great place to get wonderful soup with hot rolls their salads refresh the waitstaff was great and they always made us feel welcome"], ["Nice lunch", 3.0, "December 4, 2014", "Angel H", "San Juan", 15, 1, "Nearness to the hotel, good food at reasonable prices. Decor not very attractive, regular service.\nGood location"], ["Come for the rolls stay for the food", 5.0, "October 27, 2014", "JCRainbow", "Whitmore Lake, Michigan", 13, 0, "Had a fun evening with old friends here at the Bistro. Nice atmosphere. The brioche rolls were awesome! The entrees were also excellent. I had the shrimps with crab which were very good."], ["Great Late Dinner location", 5.0, "October 23, 2014", "mjb19532014", "Corpus Christi, Texas", 89, 50, "We had just arrived in DC and wanted a light meal as it was fairly late. There were many options on Connecticut Ave. near Dupont Circle. As we were checking the posted menu for The Bistro a small party exited and encouraged us to eat there. The service was impeccable even though it was late and we were sharing a...\n\n\nMore"], ["Fabulous friendly service", 5.0, "September 20, 2014", "StillinLOVEsince84", "Dallas, Texas", 102, 43, "Rarely do I eat with 15 women and feel so welcomed by a restaurant. The made us feel at home. Asked about separate checks as if it was their favorite thing to do!\nWe challenged them by asking for their favorites and throwing in a surprise birthday.\nThey were attentive and everyone left with full bellys!\nI highly recommend this...\n\n\nMore"], ["Great food & service", 5.0, "September 12, 2014", "LAT2014", "Los Angeles, California", 5, 2, "Bistro Bistro is what they call it. Such a comfortable restaurant! I loved the (modern jazz) music playing in the background. Give great service without hovering."], ["Perfect spot for a casual meal and for people watching", 5.0, "September 11, 2014", "KEWLBEANS", "Tennessee", 263, 216, "Stopped by for a lite bite. Sat at one of the tables where the doors are open to the sidewalk. A great place to relax, people watch, enjoy some good food and a glass of wine. Great service, too."], ["Great breakfast and lunch/dinner!", 4.0, "September 2, 2014", "Leonard2013", "Houston, Texas", 55, 19, "I love the food here! The Bistro is located in the Courtyard Marriott but the food is pretty good and not like regular hotel food! I love the breakfast here and the sandwiches! My second year eating here on my annual trips to DC and I really like it!"], ["Great Brunch", 5.0, "August 12, 2014", "jbw4us", "West Tennessee", 10, 4, "This is a really great, little restaurant I tried during my last trip to D.C. I would suggest the Quiche Lorraine."], ["Perfect buffet", 5.0, "May 28, 2014", "464Melva464", "Pickering, Canada", 15, 2, "Food and service was very good. Pricing was awesome also. Location was ideal and convenient on the main road, with many other shops to visit around it."], ["Nice Place", 5.0, "January 23, 2014", "julianneaugust", "Raleigh, North Carolina", 14, 3, "This was inside our hotel when we stayed. They don't have an expansive menu but the things they do have are delicious. I only had breakfast there (which was included in our hotel cost) and it was a lot of food and an excellent way to start off our busy days."]]], ["McDonald's", [["Friendly", 5.0, "May 18, 2015", "Ahmed S", null, 14, 11, "Better than MAC back in qatar xD it taste better Than in qatar and japan. The have free WiFi too. Try sirloin with lettuce and tomato"], ["Excellent value in an expensive city!", 5.0, "March 7, 2015", "laycockmel", "Kaiserslautern, Germany", 50, 28, "Food that everyone knows and loves, the around the world. It's always a comfort to see the Golden Arches when you are traveling. I appreciated the value and the great customer service."], ["Daily Breakfast Routine", 5.0, "December 30, 2014", "Zack K", "Silver Spring, Maryland", 2, 1, "The staff at this McDonald's is extremely friendly and courteous to all patrons. They put a smile on my face every morning when I visit for my daily routine of breakfast before work. The staff are always repeating your order to confirm they got it correct the first time, and always ask how your day is going.\nThe restaurant is...\n\n\nMore"], ["mediocre as mc donald's go", 2.0, "December 31, 2013", "zizland", "Bellevue, Washington", 31, 19, "given this place's location, one would have expected a bit more. but the service in this place is the worst. it's unclear to most how the lines work - so it feels like a random group of people just standing around. the cashiers aren't the most comfortable in english, but don't seem to realize it - and orders often end...\n\n\nMore"], ["Normal", 3.0, "July 6, 2013", "KAG724", "Indiana, Pennsylvania", 39, 12, "Nothing to say - Just like any McDonald's - not as clean as we are use to, but it was McDonald's. Also everything you may be use to getting like ketchup and soda - are kept behind the counter."]]], ["Eat DC-3", [["What's Not to Love?", 5.0, "September 8, 2015", "SydinDC", null, 13, 3, "Very informal, you go to the counter and order. Quite a hot dog selection. Best corn dogs in town. Say no more."], ["Great concept, average execution", 3.0, "August 24, 2015", "JTimes2DC", "Washington DC, District of Columbia", 16, 7, "It can be hard to find a decent place to grab a quick bite in this area on a weekday afternoon, so I was pretty happy about discovering this place. The concept is cool: made-to-order hot dogs representing different US cities, as well as fries, cotton candy, and other fun sides and snacks. The service is not the friendliest, and...\n\n\nMore"], ["I go there but it always seems dirty", 3.0, "August 14, 2015", "ihatehaggis", "washington, dc", 38, 8, "Sometimes after the gym, I go in. They have a veggie dog. I just have a feeling the toppings are cross contaminated or old. It needs some good cleaning and maybe some more managerial oversight to get it on track."], ["One of my favorite local places!", 4.0, "June 20, 2015", "Lori B", "Knoxville, Tennessee, United States", 89, 28, "This is a fun place to eat. It's good for couples or families with children! I always go here when I'm in town.\nIt's just hot dogs but there are a ton of different types to try! My favorite is the West Virginia dog. You definitely want the fried pickles, which are big enough to share!\nThis place is close...\n\n\nMore"], ["Great hot dogs", 5.0, "May 30, 2015", "Peacefulhearts", "Spokane, Washington", 60, 19, "This is a hot dog restaurant so if you don't like hot dogs don't bother going here. If you do like hot dogs then come and enjoy the experience. They have a pretty wide variety of choices and their hot dogs are great."], ["Over rated", 3.0, "May 5, 2015", "Steelcityguy", "Pittsburgh", 108, 77, "During a recent visit to DC I found this place on Trip advisor and thought I would give it a shot. I ordered the Coney Dog and to be perfectly frank (no pun intended) it took awhile to finish it off. Most hot dog people know on that type of dog the condiments are mustard first, chili, then the onion....\n\n\nMore"], ["Historic and tastey", 4.0, "May 3, 2015", "AshleyE3447", "Richmond, Virginia", 10, 3, "I was looking for a quick cheap lunch and found this little gem. Walk inside for a little bit of history of the DC-3 airplanes. I like that they offered staple hotdogs from around the country like a Chicago dog and Cincinnati chili dog, etc. where else can you go to one place and order a dog from New Mexico?...\n\n\nMore"], ["Kids", 5.0, "March 25, 2015", "ruckerat", "Washington DC, District of Columbia", 29, 5, "i have 8 grandkids aged 3-21 so when i have them all together we go to dc-3 and there is a corndog, halfsmoke and/or hotdog for everyones taste,,,they allways want to go when the visist me"], ["Must Try!!!", 5.0, "March 22, 2015", "abbeysmom18", "Mt. Carmel, TN", 8, 7, "I can't say anything bad about this place. The service was great and the staff very friendly. The hot dogs some of the best we have ever ate. The fries were also delicious. I recommend everyone give it a try!!!"], ["Good Dog", 4.0, "December 14, 2014", "CSSFood", null, 22, 8, "Good, friendly, fast service with a smile and a hello and goodbye. Got a couple dogs and a couple beers and was very satisfied!"], ["My kinda dog", 4.0, "October 5, 2014", "Tim M", null, 47, 6, "With so many places on the Hill.. This was change, back to old school food. Friendly stop for a family meal. Slaw dog was named West Virginia was all beef home made fries. Fountain drink are open for you refills. Service was fast with little to no wait. I liked!"], ["If you love a good dog, eat here", 5.0, "August 26, 2014", "bookerRochesterMN", "Rochester MN", 105, 46, "We were visiting my niece who lives in DC and ate at DC-3 on our way to a Nationals game. I love a good hot dog, and this was the best I've had. Several creative varieties, such as the one with Korean spiced toppings. Staff is happy, ambience is fun. Will definitely return."], ["Quick (dog)bite", 3.0, "August 17, 2014", "NCurl", "Norwich", 51, 29, "Chicago dog was best dog my son said he ever had. Other types average. 1order of fries were enough for 2-4. Quick service, sweet cashier- cleaned our plates too!"], ["The hottest dogs", 5.0, "August 16, 2014", "bucksbee", "Beaconsfield, United Kingdom", 61, 67, "As a visitor to Washington DC from England, drawn to DC-3 by its favourable reviews, I have to say that the regional speciality hot dogs here were just sensational. The staff were great too, once they'd got to grips with our accents."], ["Great little place on Barracks Row", 4.0, "August 9, 2014", "Debbie C", "Atlanta, Georgia, United States", 36, 21, "Across from the Marine Barracks is Eat DC-3....a great place to eat anytime, but we ate there last night before the Marine Parade. It's all about hot dogs....my husband had the Chicago dog and it was just like being back in Chicago. Our friend had the Philly dog and it was very good, according to him. I snacked on the...\n\n\nMore"], ["Delightful service & delicious veggie dogs @ DC-3", 5.0, "August 4, 2014", "sweetestbaboon", "Princeton Jct.", 7, 11, "Just had to write to let all good folks what an absolutely delightful time my lovely bride & I had at DC-3.\nWe make an annual pilgrimage into DC from New Jersey to celebrate our anniversary (this year it was 18!), & last year, we added DC-3 to our trip due to the availability of veggie dogs on the menu....\n\n\nMore"], ["Cute 8th Street Hot Dog Joint", 4.0, "March 22, 2014", "Rahdim M", null, 97, 24, "If hot dogs are your thing, you'll really enjoy this nostalgic DC-3 airplane themed hot dog joint. The narrow, casual restaurant is decked out in TWA-esque retro decor, complete with a giant airplane propellor and airline route map on the wall.\nThe dogs are really good, and of course, being a DC hot dog store, they offer a half-smoke. The...\n\n\nMore"], ["Hot dog heaven", 3.0, "September 16, 2013", "tikidream", "bethesda, md", 388, 110, "This place is all about hot dogs! The names are fun and the decor is cute. There was only one veggie/falafel hot dog available and it wasn't so good. My husband loved his bacon wrapped hot dog and for a pleasant lunch with drinks, for two it was around $15, not too bad for that neighborhood, especially if you think...\n\n\nMore"], ["all kinds of hot dogs", 4.0, "July 22, 2013", "mad155", "DC", 278, 75, "this place does not just have your typical hot dogs. they have multiple types and styles. you can pick any on the board or they will make one however you like it. the corn dogs are out of this world and the fries in the basket is a very good portion. free refills on drinks as well. great place to...\n\n\nMore"], ["Over priced subpar hot dogs...", 2.0, "April 28, 2013", "HSKraus", "Washington DC, District of Columbia", 26, 12, "I've eaten at DC-3 several times and I keep hoping it will get better but it hasn't. The corn dog tasted like grease but at least it wasn't frozen in the middle this time. I also tried the DC Hot Half Smoke...took one bite and threw it away...truly awful! Same goes for the Special Sausage. The only redeeming hot dog...\n\n\nMore"], ["Great Hotdos!!!", 4.0, "January 23, 2013", "truth8", "Gainesville, Florida", 51, 9, "When you are in the area you've got to try this place. The hotdogs are really inventive and all the flavors work well together. I tried the sonoran-a bacon wrapped dog,the cincinnati coney, and the seoul bulgogi with kim chi .The place is quite cozy and the DC- 3 theme is held throughout. I highly recommend this DC-3!"], ["Good Dogs", 4.0, "January 23, 2013", "gatorj", "Tallahassee,FL", 93, 37, "Their hot dog variety is great. I especially enjoyed the bulgogi and kimchi dog. Its a large portion of food and my husband and I were filled for under $20"], ["A tad expensive, but simply divine", 5.0, "September 8, 2012", "TNmilt", "Germantown, Maryland", 123, 40, "I went looking for this place, which was NOT easy to find, but I persevered and was glad I did. They had an eclectic offering of hot dogs, so I ordered, ate, and enjoyed it. I was able to wash it down with a beer at Ted's Bulletin just down the street."], ["Excellent but overpriced", 3.0, "August 9, 2012", "GD77", "WDC", 93, 58, "So - the actual hot dogs are A++. The fried pickles are awesome and the fries are great, too. The \"beef\" I have is the price. You're paying $10 for a dog, fries, and drink (non-alcoholic to boot). For that price, I expect it to come with a baseball game. For the price you're paying, you'd expect a little more...\n\n\nMore"], ["Fried Heaven", 4.0, "July 21, 2012", "Lynn R", "Ellicott City, Maryland, United States", 78, 40, "Fried pickles, fried Oreos, french fries, corn dogs, a hot dog wrapped in bacon and served with jalapeno relish, PBR in a can...need I say more? We came with our two sons, 6 and 7, and enjoyed a tasty, authentic meal in the middle of Barracks Row. The food isn't cheap but you don't care after you take the first...\n\n\nMore"], ["A guilty pleasure", 4.0, "June 30, 2012", "BeakerSan", "Washington DC", 51, 39, "Okay, a hot dog wrapped in bacon, plopped in the deep fryer, covered with sauerkraut and cheese whiz, and served with a heap of chili fries will probably make your cardiologist roll her eyes and order more stents. But hey, life is short.\nThis is a small, hole-in-the-wall place on north Barracks Row near Eastern Market and Pennsylvania Ave. The...\n\n\nMore"], ["Best dogs in DC!!!", 5.0, "April 9, 2012", "PaigetJones", null, 2, 1, "Took the recommendation of Philipp, to have the kimchi dog and was not disappointed. Super hot and delicious with the skirt steak. We also had the Cinncinati, Bacon wrap, and DC half smoke. No one was disappointed. The fries were thin, hot, & crisp. Perfect. We actually ordered another half smoke, fried pickes and finished our meal with the over...\n\n\nMore"], ["Barracks Row Bargain! Awesome Hot Dogs from all over... so good!", 5.0, "January 21, 2012", "tlhjar", "Bowie, MD", 361, 167, "Had walked by here lots of times. Tried it when I found out that Food Network was doing a segment on them. They picked a great one! Hot dogs how cities all over fix them. Two NY dogs (Coney & Street Vendor), Chicago, Jersey, Philly, DC Half Smoke, Korean Bulgogi Steak & Kimchi (on a hot dog), Little Rock Razorback,...\n\n\nMore"]]], ["Best Sandwich Place", [["Poorly organized okay food", 2.0, "September 13, 2015", "Eric S", "Branson, Missouri", 320, 158, "It seemed to be a really popular lunch stop as their were at least 25 people in line. When you walk in you have to pass all of them to go to the very back to order what you want. Some people were nice and let you pass while others were not! Once we finally got to order we told...\n\n\nMore"], ["My Oversight", 5.0, "August 16, 2015", "sculler-in-charge", "Washington DC, District of Columbia", 41, 27, "I feel terrible about not writing a review sooner of the Best Sandwich Place. When it opened, it was the only one around. Now, there are some others. Regardless of the type of ownership, this spot is fantastic. First, the food is first rate. Second, it is a great location, with both inside and outside dining possible. Third, the staff...\n\n\nMore"], ["Great sandwich.....quick lunch", 4.0, "May 5, 2015", "Biblib3", "Greenfield, Massachusetts", 102, 22, "Needed a quick lunch and stopped in by chance. Delicious large turkey sandwich on rye. Turkey was freshly sliced and still warm from roasting. Tables outside for open air lunch."], ["Fast,Tasty and Filling", 5.0, "March 31, 2015", "Maricel W", null, 11, 4, "Stopped in on a timed tour lunch break. Very large menu for a \"order and move down the line place\". Hard to choose but picked the melted Reuben. Really great tasting and big enough to be full with one half and save the other for later.\nIf in Georgetown by the Potomac area worth stopping off whether you have to...\n\n\nMore"], ["sandwiches were HUGE", 5.0, "March 29, 2015", "AmandaWms", "Norton, Ohio", 4, 2, "the name says it all. I just wish I would have shared my sandwich, it was almost too big for one person."], ["Good sandwhiches", 4.0, "March 17, 2015", "ghibesan", "Washington DC, District of Columbia", 111, 28, "Good sandwiches, decent soup, ok salads. A bit pricey for a sandwich shop, but they are quite good. There are tables to eat inside or outside."], ["Holy Sandwich!", 5.0, "August 8, 2014", "Maureen1771", "Crete, Illinois", 113, 38, "Popped in on whim as I was walking through the area while visiting the area for work.\nGot the sliced turkey sandwich special (cranberry sauce, cucumbers, carrots, a pile of freshly sliced turkey, and dijon mustard) - oh my Lord was it DELICIOUS!!! Value was also amazing - sandwich chips and a can of soda for less than $10. Can't...\n\n\nMore"], ["One of the best sandwich places in the area!", 5.0, "April 25, 2014", "desinez41", "Washington DC, District of Columbia", 99, 34, "If you are looking for fresh made hot or cold sandwiches made to order at a reasonable price, then this is the place to go. Tried the Rib-Eye sandwich one day and it was so good that I had to go back the next day to try another sandwich. This time I tried the Chipotle Grilled Chicken Sandwich and it...\n\n\nMore"], ["good salad at Best", 4.0, "January 25, 2013", "denis c", "Houston, Texas", 3, 3, "good value for lunch, I had the greek salad and it was very good. I would recommend it to other travelers"], ["This is one of my favorite work day lunch time spots. The sandwiches are great and the salads are even better -- the...", 4.0, "August 27, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is one of my favorite work day lunch time spots. The sandwiches are great and the salads are even better -- the super lite is the best. And, there's never a long wait since a lot of people work there."]]], ["Bistro Francais", [["Way too salty!", 1.0, "October 10, 2015", "Nguyen T", null, 52, 17, "We were let down by the dining experience with Bistro Francais. It looked like the chef didn't taste the food at all. Everything was very salty. I am a salty eater (coming from a guy who can drink pure fish sauce) but I couldn't even stand the food. Mussel soup, fish soup, beef tenderloin and lobster thermidor, all dishes were...\n\n\nMore"], ["Good lunch value", 4.0, "October 3, 2015", "JudeTheFoodie", "Youngstown, New York", 40, 7, "We stopped here on a rainy Friday and enjoyed the 2 course lunch. We both had the cream of spinach soup. It was fine. My friend enjoyed lamb sausage over a lentil salad. The sausage had a little kick to it and was presented beautifully. I had a cold salmon served with a watercress sauce (aioli) with a potato salad....\n\n\nMore"], ["Excellent luncheon spot.", 5.0, "August 29, 2015", "Carolyn C", "Williamsburg, Virginia", 26, 15, "My friend and I stopped today for a delicious lunchtime meal. I had the seafood mixed grill on a bed of rice. The salad was as fresh as could be and the dressing excellent. The sauce was delicious and all the seafood was perfectly done. My friend enjoyed her marinated meat brochette with french fries. All was delicious and very...\n\n\nMore"], ["Average French food", 3.0, "August 19, 2015", "39donna", "Boston, Massachusetts", 58, 27, "We recently returned from France and were hoping to relive our culinary experience. I guess that is a big task to lay on a restaurant but so be it. They did not stand up at all. My daughter enjoyed her onion soup and I enjoyed my onion tart. My husband did say that bouillabaisse was now his favorite dish. But...\n\n\nMore"], ["Nice setting", 4.0, "July 28, 2015", "fcbbhkg", "Cochabamba Department, Bolivia", 49, 15, "Good priced good quality lunch selection, nice tableware/tablecloths and service, cozzy seating, at a price you can really talk positively about!"], ["Real French cooking", 5.0, "July 11, 2015", "Blcheshire", null, 12, 6, "This was the nicest meal I have had in DC. I have spent many years touring in France and have had far worse meals there. Nice atmosphere, pleasant service, good grub at a reasonable price. I'm going back next week"], ["Ooh la la!", 5.0, "July 2, 2015", "jodagayton", "Oakland, California", 35, 15, "We walked from our hotel the Renaissance DuPont about a 15 minute walk into Georgetown where we found this great French restaurant. Tres bonne! The maitre d Chriss made us feel welcome. We sat near the open air window - very nice. They have a dinner special right now which was delicious - salad or soup or onion cake and...\n\n\nMore"], ["Very good French food, great service", 5.0, "June 17, 2015", "NoYips", "Milford, Delaware", 22, 12, "Had dinner special bouillabaisse and cassoulet. Both very fine, tasty and excellently served. Nice taste of Paris in Georgetown."], ["Bday dinner", 4.0, "June 8, 2015", "Celine_CT", "Hartford, Connecticut", 17, 9, "Went there for a bday dinner with family and friends. The staff was very attentive and made our dinner special. Being from Francs, I did not see typically bistro dishes on the menu (pave avec haricots verts) but they had duck dishes and I ended with a brochette of fruits de mer and it was delicious. I tried the foie...\n\n\nMore"], ["At least pretend to have French food if you are going to call yourself a French Bistro", 2.0, "June 7, 2015", "Chris C", "Washington DC, District of Columbia", 51, 14, "My wife and I had one of our first meals in DC in 2007 at this restaurant. The food and service was superb. I was raised in France and it was as close as you can get 3000 miles away. Not anymore. We had Sunday lunch there and the food, while not bad, was neither French nor appetizing. The service...\n\n\nMore"], ["Great location, good service", 3.0, "June 6, 2015", "Mameadwoa", null, 10, 5, "My boyfriend and I went there last night. The location is great, and the staff were friendly and attentive. We had the prix fixe menu, which was $28 for two courses. This sounded like a good deal. We also ordered a bottle of wine and one desert. The food was fine, but I honestly cannot say more than that. Total...\n\n\nMore"], ["Great food in a fab location", 4.0, "May 21, 2015", "archibald75", "Leicestershire, UK", 27, 16, "Great location in the middle of Georgetown, good food, excellent wine selection, very attentive service."], ["Moules Nicoise", 5.0, "May 6, 2015", "Eric H", "Oakland, California", 166, 89, "On your next trip to Georgetown, be sure to stop at Bistro Francois and have the Moules Nicoise. Very unusual preparation, almost like a clams casino. The St. Giles salad with spinach, tuna, onion and potato was also notable, washed down by a crisp Vouvray"], ["Great French Cuisine in Washington", 3.0, "May 5, 2015", "PeteCaerdydd", "Cardiff, Wales, United Kingdom", 24, 26, "Ate dinner here during a recent trip to the US. Nicest meal we had during the whole trip. Best French food I've tasted outside of France. Fixed Pris evening"], ["Quiche Lorraine", 5.0, "April 25, 2015", "Elizabeth M", null, 21, 7, "Honestly, I haven't tried a whole lot of the menu, but I've been here what feels like hundreds of times now, entirely because of one menu item: the Quiche Lorraine. The eggs Benedict and the oeufs norvegienne are also freakin' amazing, but the quiche Lorraine...oh my god. Best I've ever had, and it comes with these thin, perfectly crisp fries....\n\n\nMore"], ["Very nice, relaxed and reasonable lunch", 4.0, "April 15, 2015", "Eileen C", null, 5, 3, "The 2 course lunch deal is good value and was great, tasty food, though the wine is over priced - certainly by the glass...!"], ["Good food & great bargain before 7pm", 4.0, "April 8, 2015", "HoldenKathy", "Holden, Massachusetts", 215, 93, "The Bistro has a classic French bistro menu (note: not classic haute cuisine - a bistro) and is a pleasant spot for a good meal. It is a terrific place if you want a good meal at a great price if you order before 7:00 p.m. We had dinner here with a friend who works nearby and stops here often...\n\n\nMore"], ["Georgetown Gem", 5.0, "March 21, 2015", "Richard G", null, 4, 1, "I've read several reviews saying it is not 5-Star. Considering everything, it is. $17 two course lunch was phenomenal! The salad was artfully prepared and delicious. The bread drove me to seconds. The seafood plate was prepared and presented flawlessly. You can spend $17 at many chain restaurants on a burger and fries. No comparison. Yes they also have an...\n\n\nMore"], ["Quiet and Nice", 4.0, "March 20, 2015", "MacKenzie H", "Fredericksburg, Virginia", 15, 1, "Ate there with a group last weekend (bachelorette party) and the decor was nice and we were in a quiet corner which was good.\nThe food was good but not the best I have ever had - we did enjoy the warm bread and butter to start and everyone seemed to enjoy their entrees overall. The dinner special was a...\n\n\nMore"], ["Good. The best word to describe it.", 4.0, "March 17, 2015", "Victor B", "Sofia, Bulgaria", 25, 9, "I went there by recomendation. Maybe this is why my expectations were set high. Anyway we tried the Salmon and Steak. Both were delicious. Surprisinly, the french fries were like from fast food stile, just better prepared. All in all good food, but not a gourme, no wow efect or whatsoever. Just get me right nothing wrong with the place....\n\n\nMore"], ["Don't let the facade fool you....", 5.0, "March 4, 2015", "Squaremeal", "London, United Kingdom", 156, 102, "This is a real gem. Classic, beautifully executed French Bistro style cuisine awaits you. The value and quality is superb and this coupled with an entertaining, small wine list that really hits the spot makes this an establishment that deserves you your attention. Be it for an informal\nLunch or a an intimate dinner. Highly recommended."], ["Unique presentation of entrees", 4.0, "March 1, 2015", "randall1025", "Las Vegas, Nevada", 124, 22, "The atmosphere was definitely a star in our meal. The salmon was served on a bed of spinach puree which initially sounded a little strange. However, the combination was actually delicious! Service was slow - perhaps due to a larger group."], ["Good food, good prices", 4.0, "February 11, 2015", "nicole s", "Chino, California", 16, 14, "The staff was very friendly. The onion tart was delicious as was the cordon bleu. There is a lot to do around the restaurant."], ["Forgettable", 3.0, "January 27, 2015", "Jane C", "Atlanta", 55, 26, "I was hungry. It was sustenance. That's about all I can say. There was nothing wrong but it has only been a week and I have forgotten what we had. I do recall that my dinner companion never (after 3 requests) got his lemons for his drink. ."], ["Better than expected", 5.0, "January 8, 2015", "Longwood Traveler", "Longwood, Florida", 117, 192, "We dined at Bistro Francais early on New Year's Eve and were pleasantly surprised considering some of the previous reviews. We had made a reservation so we were happy when we were seated immediately. Our server was experienced and helpful pointing out dishes she didn't think were as tasteful as others and since we were ordering off the special Prix...\n\n\nMore"], ["Good food at a fair price", 3.0, "January 3, 2015", "tschauff", "Sao Paulo, SP", 69, 19, "Stop at Gerogetown for lunch at this place. Price is fair for the 2 course menu and there is variety. Weekend brunch is nice. The creme brûlée was very tasty."], ["Lazy, uninspired and far too expensive", 2.0, "December 21, 2014", "JAFCO", "Memphis, Tennessee", 43, 19, "The owners of Bistro Francais clearly count on their name and location in Georgetown to convey the idea that their restaurant offers a true fine-dining experience. They certainly don't put much effort into anything else. Ordinary, unimaginative fare offered in any number of other places for a lot less money. Presentation was uniformly uninspired, with the bland, third-rate French onion...\n\n\nMore"], ["Very pleasant place for lunch in Georgetown", 4.0, "December 5, 2014", "etm_10", "Bowie, Maryland", 40, 16, "This is a charming little bistro on M Street, right near boutiques on M and Wisconsin Avenues--a great place to stop for lunch. (The Circulator bus even lets you off right across the street from the restaurant.) The decor is very appealing, with oversize Art Deco posters on the brick walls. The small tables are very close together, but our...\n\n\nMore"], ["Don't bother, you can do better in the area...", 2.0, "November 12, 2014", "gogugigi", "earth", 26, 26, "The restaurant is fake French...the personel is Asian and the food was far from the sofisticated French cuisine. The atmosphere wants to be of old luxury European Bistro, but insted of the wood panels there are cheap brown plastic...they were not busy on a Friday night and after dinner we realized why..."], ["Hard to beat", 4.0, "November 9, 2014", "blaenboy1", "Clane, Ireland", 134, 90, "A long, late lunch here was a real treat and just very hard to beat. In fact at $16.95 it was unbelievable! We both had french onion soup followed by , in my case, by seafood brochette and for my wife tuna with white beans and both followed with Napoleon Millefeuille. For that price?! This was value- and in a...\n\n\nMore"], ["Bistro Francais", 3.0, "November 3, 2014", "Pittfan18", "Frederick, Maryland", 14, 7, "The place was really cute..we also noticed a lot of French speaking customers which was really cool to see. Made me feel like I stepped into a bistro in Paris. Food was ok....I won't be too harsh in my review since I just had lunch there. The service was fine...nothing spectacular. For the cost..I would give it average rating as...\n\n\nMore"], ["The best place Georgetown visitors seldom notice", 4.0, "October 26, 2014", "GRubinstein", "Washington, DC", 11, 5, "There is nothing outstanding about Bistro Francais. Despite its central location in Georgetown It is usually lost among the trendier places that draw foodies, the status-conscious and of course critics.\nBistro Francais does only what it has been doing for 35+ years -- serving well-prepared French bistro fare in a comfortably old-fashioned atmosphere. The small wine list appropriately complements the...\n\n\nMore"], ["Champagne Brunch", 4.0, "October 22, 2014", "Amall", "Washington DC, District of Columbia", 34, 17, "Enjoyed brunch here one Sunday. Lovely atmosphere. Had the roasted chicken and pea soup. Unlimited champagne. :) A good deal. Service could have been a little quicker but I suppose it made it more authentic as service in Europe is usually slow as well. A nice break from the more popular brunch spots in Georgetown that are overcrowded and noisy."], ["Overall Good", 4.0, "September 30, 2014", "b v", "Washington DC, District of Columbia", 18, 11, "Has late night hours. Food good but not great. Nice decor but crowded and one feels like part of a herd. But for late night good food its the best around."], ["A Disappointment!", 2.0, "September 20, 2014", "Rosemarie K", "Newport, Rhode Island", 14, 10, "We are here about 6 months ago and enjoyed the food. This visit was truly disappointing. Food was tasteless. Onion soup like dishwater; coq au vin dry and sauce had no flavor. New chef needed! Not worth your time or $$$$"], ["Expensive for the food you get", 3.0, "September 16, 2014", "ljlp55", "Victoria, BC Canada", 225, 112, "Great looking place inside but the menu prices were outrageous. I ordered a scallop plate and was told there were 10 scallops- but in fact they were 5 scallops sliced in half lengthwise. Desserts at $9.50 were a bit much. Good food but not worth the price."], ["Disappointing food, poor service, expensive", 2.0, "September 7, 2014", "Stephen B", "Welwyn, United Kingdom", 250, 132, "Passed by the window and were enticed to come in for lunch as it looked quite nice inside. Interior is indeed nicely appointed, although tables are very close to each other. Service was slow, not particularly friendly or helpful. Food was poor, my steak sandwich baguette was very dry, the thin steak was tough and expensive to boot. Not even...\n\n\nMore"], ["Great Lunch Choice", 4.0, "September 2, 2014", "LTGR429", "Washington DC, District of Columbia", 16, 4, "The food here is great and the windows are opened in nice weather. The best seat in the house is by the window, watching people walk by as you enjoy the delicious lunch offerings at Bistro Francais."], ["Can I take every point?", 1.0, "August 18, 2014", "pkatrin", null, 1, 0, "I don't know who is writhing the other reviews but this place is complete disappointment. From the staff, through the menu, through the rest room I hat that place. Dirty, smelly there is no surprise way this restaurant is always empty. If you want to have nice diner don't go there. And on top of this is expensive."], ["Good for the money", 4.0, "July 22, 2014", "VRSinSC", "Florence, South Carolina", 46, 9, "We went early and were pleasantly surprised to find an early menu. The selections were very good fir the money. Not the best French food I have had, but certainly worth the trip. Especially at a lower price than normal menu prices."], ["Even the negatives become positive here", 5.0, "July 18, 2014", "Hamad A", null, 16, 13, "Where do I start. OK I love this place. It's a restaurant with real character and a positive vibe. It's the sort of place where even if the soup is slightly over salted or the waiter not prompt you continue to have a smile on your face. Great food, excellent wine, defiantly worth visiting if you are in DC."], ["Nice French cafe in Georgetown", 4.0, "July 8, 2014", "Brendan S", "Arlington, Virginia", 365, 201, "Bistro Francais is well-situated right on M Street in Georgetown. Although it initially seems quite fancy, with heavy linen tablecloths and menu items in French, it has more of a casual feel. The windows actually open onto M Street, so it's nice to sit at the tables by the window on a warm, breezy day.\nThe menu is quite substantial,...\n\n\nMore"], ["Cozy french bistro", 5.0, "June 22, 2014", "AngieB234", null, 72, 27, "My sister in law was visiting us from Asia and wanted to revisit Georgetown we were so happy they were able to accommodate everyone in our party without waiting. The escargot was delicious, Foie grass was ok but the duck was fantastic.The restaurant had an old world feel. Recommend you try their apple martini and french apple tart."], ["Lovely for a Lunch/Brunch/Bridal Shower!", 4.0, "May 28, 2014", "JTfromSC", "Greer, South Carolina", 9, 11, "My daughter's friends gave her a Bridal Shower here and it was just lovely. The food was very good and the service was excellent. There was bottomless champagne for those who like that kind of thing (and this was that kind of crowd)!\nWe really enjoyed having a private room in the back, so that we didn't have to keep...\n\n\nMore"], ["Delicious food, attentive personnel", 5.0, "May 20, 2014", "Denis S", null, 3, 1, "This place offers calm atmosphere, great variety and quality of food for a decent price, great service and is conveniently located on the most scenic street of Georgetown - M Street. We really enjoyed our experience here."], ["Very Good Brunch", 4.0, "May 13, 2014", "VATravel36", "VATravel36", 157, 84, "This is an excellent authentic french bistro with excellent food and above average service. This is not a hoytie toytie high-end restaurant with pretentious atmosphere. It is a true bistro with high-class food.\nI highly recommend the Oeufs Bénédictine or Eggs Benedict for all of us that don't remember high school French.\nCertainly a place for a repeat brunch and...\n\n\nMore"], ["Good lunch spot", 3.0, "May 1, 2014", "willbikeforwine", "vancouver", 250, 76, "Good food, service, coffee, somewhat French. Nothing to complain about , we would stop by again, just nothing to knock your socks off."], ["Standard~go for the escargot & the fries", 3.0, "April 25, 2014", "Rose L", "Brooklyn, New York", 103, 33, "My friends ended up going to this place because cafe Bonaparte had an hour wait and we were leaving DC that day.We settled for bistro Francais,I was very excited to try their egg Benedict and I was not impressed.I went for egg Norwegian,nothing special,but my friend ordered the escargot,boy it was amazing.The french fries were really good too.I had a...\n\n\nMore"], ["Relaxed, good food and service", 4.0, "April 4, 2014", "LordH64", "London, United Kingdom", 100, 58, "just had a great evening at this restaurant. service pretty good by mostly knowledgeable staff. good quality international wine list and no problem sending back a bottle I just didn't like. the avocado with crab starter was really good as were the mains of tuna, duck and steak. desserts a bit limited but good coffee and no rush to push...\n\n\nMore"], ["A Georgetown Stalwart", 4.0, "January 20, 2014", "Rebecca D", "Hamilton, VA", 113, 62, "After having patronized Bistro Francais since the early l970's a recent brunch with my husband and daughter triggered my desire to give it a review--and strangely enough it would have been the same review as a visit in the l970's. Looking remarkably the same after all these years and continuing to offer simple bistro fare it is a bit like...\n\n\nMore"], ["Go to for eggs benedict", 3.0, "January 9, 2014", "cmlong67", "Washington DC, District of Columbia", 10, 5, "Have been coming here since I was in my 20's (I'm in my 40's). So cute 2 different dining rooms with different ambiances, both nice. Go after clubbing - great place to satisfy your munchies, it's open until 3am! Good service and reliable menu. Enjoy."], ["Good standard", 4.0, "November 29, 2013", "pmr2", "Washington DC, District of Columbia", 145, 51, "It must be over a decade since I've been to the Bistro Francais. On this occasion I went there for Thanksgiving Dinner with two friends. It wasn't crowded in the early afternoon, we had a scrumptious prix fixe turkey dinner with the delicious butternut squash soup as an appetizer accompanied by fresh French bread. For dessert, I had the apple...\n\n\nMore"], ["Pas très bon! Pas très français non plus...", 1.0, "November 24, 2013", "Dom V", "Middleburg, Virginia", 82, 128, "Le Bistro Français had been my favorite French hangout since as far as I could remember. But what the heck has happened to it lately? The décor is still the same, la carte for the most part remains the same, but the atmosphere and the food...Quelle horreur...I still haven't found the correct description to label this sloooowww decline...especially at lunch...\n\n\nMore"], ["Nothing to write home about", 3.0, "November 14, 2013", "Dorian D", "New Market, Maryland", 47, 19, "My wife and I stopped in on a Sunday evening as it looked like an interesting place. I had the mussels and the escargot. The mussels were O.K. nothing special and I did like the escargot a lot. My wife had a steak ceasar salad and she wasn't that impressed either. She also got a bowl of the French Onion...\n\n\nMore"], ["Great little restaurant", 5.0, "November 4, 2013", "emelian", "melbourne", 409, 190, "ate there with my wife for sunday lunch. Have a meal deal and you always wonder about the food. No worries lovely meal nice service, reasonably priced wine. Great street in Washington"], ["Excellent place", 4.0, "November 4, 2013", "Elie A", "Beirut, Lebanon", 65, 92, "Enjoyed the dinner so much. Excellent food quality, outstanding service and friendly staff. A very nice place to have a calm and nice dinner in DC."], ["Good food, a little pricey", 4.0, "October 19, 2013", "NP_01590", "Quezon City, Philippines", 37, 13, "My wife and I tried this restaurant just to have a different taste since we have been eating American food for most of our stay in DC. The taste of their food gave us back our memories of our stay in Paris. The food was good, it was almost the same taste as the restaurants we dine in Paris. The...\n\n\nMore"], ["A Quick Trip to Paris, in Georgetown!", 5.0, "October 1, 2013", "Hunter T", "Houston, Texas", 98, 58, "We have been enjoying Bistro Francais since 2007, and have dined there every year since. Our last visit was wonderful as usual. You walk in from the busy Georgetown street and suddenly you are back in France! We were greeted by the same charming Captain and shown to our table the moment we walked in the door for dinner! Within...\n\n\nMore"], ["Never diaspppointed!", 4.0, "September 24, 2013", "labelgeabigfork", "Bigfork", 28, 9, "We never visit DC without a meal at Bistro Francais. This time it was brunch.\nThe price/value cannot be beat in DC!"], ["Too Pricey", 3.0, "September 20, 2013", "Married40", "Indianapolis", 37, 18, "Not terribly impressed. Picked this restaurant out of our guide book at our hotel. Expected more from this restaurant. The exterior and interior were cute and looked like a great place for dinner. One person in our party of 4 has a Gluten allergey and the waiter was not very helpful in selecting options for him. He and I ended...\n\n\nMore"], ["Looks nice but tastes poorly", 2.0, "September 17, 2013", "Betsy X", null, 2, 0, "Place looks great and service is fine. Food is very poor though. Soup too salty, bread too hard, fish not fresh and overcooked, presentation poor. Me and my wife can cook better. Trout was not occompanied by patato/chips/rise. Not worth the visit."], ["Great lunch deal suprise", 4.0, "September 8, 2013", "emelian", "melbourne", 409, 190, "My wife and I had lunch there today. Looked nice place and lunch deal 2 courses for $16.95 seemed ok. Could not fault food or service. This was surprisingly good on a busy Sunday lunch time. Would highly recommend a try if you are in Washington Georgetown."], ["Food Great, Service Needs Attention!", 4.0, "August 31, 2013", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "We enjoy Bistro Francais because it is in our neighborhood. We decided to take advantage of summer Restaurant Week. There were some very good choices for a three course dinner for $35.00 per person. My husband tried the bouillabaisse which he really liked. I tried the sautéed ray fish which I have never had before and it was terrific. My...\n\n\nMore"], ["Best steak I've ever had", 5.0, "August 10, 2013", "shamwo", "Ashford, United Kingdom", 119, 80, "As part of a tour we stayed in Washington for two nights and were brought here for an inclusive meal. I was expecting to get the same pretty average quality and quantity we had received in most of the other included meals on the tour, standard fare for a large group who probably won't return so who cares how good...\n\n\nMore"], ["Great find, good value", 4.0, "August 5, 2013", "Pedroofpobla", "Ashford, United Kingdom", 325, 497, "Came here with a large group. Staff very friendly and helpful. Steak was out of this world, dessert absolutely brilliant. Comfortable and a good ambience. Excellent value. Central for all the action."], ["A Georgetown Gem", 5.0, "July 10, 2013", "bradleeflorist", "Washington DC, District of Columbia", 33, 18, "Right in the heart of Georgetown. Food is consistent and good value. Atmosphere is authentic and great place to people-watch. Service is always prompt and pleasant. Pon the manager, is always on top of everything with a ready smile."], ["Dinner for one-a pleasure", 4.0, "June 30, 2013", "Rollindowntheroad", null, 25, 9, "I dined alone and had the special, a chicken dish; it was good, not spectacular but enjoyable. It was a good value. The service and atmosphere were great, and it was a nice place to sit alone and people watch out the window. Overall, a pleasant meal."], ["Excellent food", 5.0, "June 23, 2013", "HMoo", "N Ireland", 327, 141, "Went here with a group and all were happy with the food. It is in Georgetown a lovely part of town. Could not fault taste or service."], ["Far from other places in D.C.", 2.0, "June 17, 2013", "frb2000", "København", 18, 8, "Bland food - far from what could be expected...Bland food - far from what could be expected...Bland food - far from what could be expected...Bland food - far from what could be expected..."], ["Long-time gem that retains its value", 5.0, "May 24, 2013", "kaffir1", "Washington DC, District of Columbia", 45, 20, "Food is authentic French. Staff is very accommodating and easy to speak to. The prices are reasonable and the food is excellent. I've been going there for 3 decades. It's always high value."], ["Nice", 3.0, "May 16, 2013", "Pipman1607", "East London, Eastern Cape, South Africa", 2, 0, "Well located in a happening part of Georgetown. I was drawn to the bistro as I was looking for a good, simple and well priced meal and noticed a Special' s Board on display as I was walking past. It has a warm and relatively friendly atmosphere with a few tables having a nice street view. Although not spectacular, I...\n\n\nMore"], ["Ok food and good service", 3.0, "May 12, 2013", "Eric T", "Montreal, Canada", 17, 7, "The bread we got was not very good for a french restaurant. The rest of the food was pretty good. Place was in renovation with wires and plastic bags on the ceiling. Service was friendly."], ["Good, but not great", 4.0, "May 10, 2013", "SilverBear303", "Longmont, Colorado", 122, 48, "A bit overrated in my book, but located in trendy Georgetown. We had a nice meal with a large party. The wine list is nice and quite impressive. The escargot app was a hit. Service was a bit spotty as the restaurant got a busier. The Coquilles St. Jacques was a surprise without the heavy cream sauce, but was delightful....\n\n\nMore"], ["good choice for a simple late lunch", 4.0, "April 23, 2013", "howho", "sherwood park, Alberta", 285, 96, "I had the champagne brunch ( i chose grilled fish and spinach florentine) and my other half had onion soup and a green salad. it is admittedly hard to go wrong with such simple choices, but this is where the ability of the kitchen shows through in my opinion. the onion soup was very good, with a wonderful sweet taste...\n\n\nMore"], ["average but sweet", 3.0, "April 15, 2013", "TWP64", "London, United Kingdom", 341, 191, "This is a sweet little place and the day I was there for lunch it was certainly popular. They seem to be doing some rennovation work, so I overlooked the exposed wiring above me head. The waiting staff were a mixed bunch, but mine couldn't have been more delightful. Food is decidedly average but it has a lovely and relaxing...\n\n\nMore"], ["Pricey food...", 3.0, "April 1, 2013", "Will L", "New York, New York, United States", 26, 23, "It's an average restaurant. Even though the food is not bad, it isn't that good either for the price they charge you. Basic things like presentation of the food are forgotten... they simply put a steak and the Mcdonalds-like fries in my plate and brought the sauce separately. Even though the food tasted good, there were some concerns about it,...\n\n\nMore"], ["Wrong choice", 2.0, "March 31, 2013", "LiudaK", null, 12, 11, "Dined there yesterday. Did not like the food at all: McDonald's type potato chips came with my tasteless chicken breast; my husband's fish was simply terrible. The quality and presentation of food reminds fast-food; prices are as of a decent restaurant.\nStaff is odd (which could be a good thing, especially for tourists).\nInterior is beautiful and creates the right...\n\n\nMore"], ["Almost as good as a trip to Paris", 5.0, "February 3, 2013", "Moonriser", "Massachusetts", 48, 31, "An absolutely wonderful little restaurant in Georgetown with a friendly staff and a masterful chef. A delicate salad, and garlic happy escargots were a great prelude to the duck and the steak - both of which were superb and just as rare we asked for. Not inexpensive, but fair value and well worth it. Atmosphere is authentic - not oppressive....\n\n\nMore"], ["Venison Loins found me...", 5.0, "January 27, 2013", "AleAliceNYC", "New York City, New York", 23, 12, "celebrating for new beginning for Gail, a family of 4 went to this amazing beautiful ambiance and food. We never been there before but took a chance. appetizer from avocado with crab meat to escargots and gazpacho soup was amazing! I had Venison Loins with butternut squash paste and beautiful sauce, enough for med rare meat. it was phenomenon! I...\n\n\nMore"], ["Ok for brunch if you are nearby", 3.0, "January 26, 2013", "AnnCederhall", "Zurich, Switzerland", 86, 27, "The eggs benedicte were excellent though service was painfully slow and not that great. Good atmosphere despite in Georgetown with so many tourists. Just really average, would only go back if happen to be nearby."], ["The kind of place I felt safe ordering steak tartare!", 5.0, "January 23, 2013", "kcoghlan", "Jacksonville, Florida", 52, 20, "My husband and I were in DC for our grandson's swimming meet and chose this restaurant for ourselves before we left. It is a physically lovely place, and the ambiance at dinner was very nice. I have to disagree with Daniel R, as our food was really very good. Steak tartare is among my all-time favorites but I am careful...\n\n\nMore"], ["Go for the early bird special!", 4.0, "January 9, 2013", "cedangeles", "Washington, DC", 69, 30, "Bistro Francais is an old reliable place you can come home to. The food is good but the service and ambiance are wonderful. We had the early bird special which is a very good deal. The wine we had, which was one of the cheapest in the wine list, was served in perfect temperature. We were talking about our friend's...\n\n\nMore"], ["Loved the Late Night Ambiance", 4.0, "January 5, 2013", "Daniel R", "Houston, Texas", 23, 15, "So this place won't be winning any awards for the food, but I have to give it the rating of Very Good since our overall experience here was quite lovely. We arrived around midnight or a bit later looking for a late night dinner in Georgetown. They gave us a window seat so we were able to people watch, which...\n\n\nMore"], ["The best onion soup in the town!", 4.0, "December 16, 2012", "sosyetik", null, 97, 34, "Well,I have been to this place more than 5 times and each time I order onion soup (it is $10) for sure!I am trying onion soups at every french restaurant in the town,and for now noone beats them. Try the caesar salad-i like it without chicken. I don't like the desserts here that much though. The atmosphere is romantic during...\n\n\nMore"], ["Old stand-by favorite...", 4.0, "December 11, 2012", "Gana B", "Washington DC, District of Columbia", 119, 101, "I have been dining here since they opened in 1975. Their Poulet Bistro is still the best roast chicken and french fries I have ever eaten. It's like a little slice of France."], ["Nice place for lunch", 4.0, "December 4, 2012", "DKP8888", "Chicago, Illinois", 49, 18, "Although our server was not great, the food was really enjoyable. We had pate, a soup and the smoked salmon eggs benedict. Everything was excellent. The hollandaise was home-made and perfect."], ["Perfect Omlet", 5.0, "November 24, 2012", "pinglet", "Los Angeles", 4, 2, "Popped in here for a quick breakfast and it was quick and tasty. Service excellent and the tastiest Omlet I've eaten in a long time and a delist onion soup too"], ["The Best Steak Frites in Town", 4.0, "November 21, 2012", "Las T", "Washington DC, District of Columbia", 18, 1, "I've been coming to eat Steak Frites at Bistro Francais for over 30 years. Although the restaurant has other classic dishes and daily Pre Fix specials (which I have tried), nothing satisfies more than their Steak Frites. Enjoy a nice raspberry tart and a specialty coffee and you've had a nice night."], ["I love it!", 5.0, "November 17, 2012", "Viajeroconbuengusto", "Washington DC, District of Columbia", 163, 37, "I used to come here for my birthday or my wedding anniversary. It's an authentic french restaurant with the typical tiny tables. The service is very good and the homemade pasta makes you feel like you are eating in Paris!\nImportant: This restaurant is very crowded, so I recommend with reservation."], ["Great Food", 5.0, "November 15, 2012", "gary r", "Schuylkill Haven, Pennsylvania", 169, 63, "This was our 3rd time dining here and probably the best. Our server, Thierry, was excellent. The restaurant was busy but he was very professional and was cool under fire. We noticed that many of the diners were speaking french which bodes well for the reputation of the restaurant. We had the ribeye steak w/wine sauce and coq st. jaques...\n\n\nMore"], ["Old world charm and an excellent menu", 4.0, "October 28, 2012", "jax848", "Jacksonville Beach, Florida", 75, 39, "Walking through Georgetown we settled on this spot for wine and a late light lunch. They seated us at table next to two large opened windows that allowed us to take in the fall weather and people watch from the comfort of the interior. The wine list wasn't extensive but all of the choices were excellent and served promptly at...\n\n\nMore"], ["Great meal in Georgetown", 5.0, "October 22, 2012", "ChicagoTraveler633", "Chicago, Illinois", 4, 1, "Everything everyone had at our table was fantastic at this restaurant. Fabulous duck breast, incredibly tasty steak. The prix fixe 3 course dinner at $37 was a terrific value and the atmosphere was very charming to boot. They were crowded and service was a little slow, so don't go if you are in a hurry and it is a Saturday...\n\n\nMore"], ["John R.", 5.0, "October 16, 2012", "jreid348", null, 1, 0, "I have been a patron for more than 25 years. Birthdays, Sunday brunch, or a weekend treat I have never been disappointed. The food has always been delicious and the service excellent."], ["Great Bistro In The Heart of Georgetown", 5.0, "October 6, 2012", "James M", null, 25, 8, "Stumbled on this wonderful find. Typical French bistro atmosphere and food. They are celebrating their 37th anniversary and are offering a special for $37.00. This includes from appetizer to dessert. Great staff - very attentive. We were all very pleased."], ["Nice French food in the center of Georgetown", 5.0, "October 6, 2012", "flfama", "New Jersey", 20, 10, "A little bit of Paris in Georgetown. I always enjoy trying French restaurants whenever we travel and had dinner here on the last night of our trip to D.C. Well worth it as the food is delicious and the service was very friendly."], ["Authentic French Bistro", 5.0, "August 9, 2012", "Roberto87112", "Albuquerque, New Mexico", 53, 17, "Bistro Francais is a French Bistro in every way. Every time we come to DC we have lunch there. Food is always excellent and the service is without fault. The ambiance is superb. Get a table near the front window and look out onto people coming and going in Georgetown. There lunch special is wonderful for $19;95: glass of french...\n\n\nMore"], ["Disappointing meal, average food and below average service", 3.0, "July 24, 2012", "jwfromSF", "San Francisco, California", 31, 57, "The restaurant is conveniently located in the heart of Georgetown and we had no problem getting reservations on the same day. We chose the \"early bird\" 3 course fixed price dinner. The vichyssoise was advertised as being served cold but came out hot, and without much flavor. Mussels Nicoise were flavorful. A long period passed between our starters and the...\n\n\nMore"], ["a bit price for what it is", 3.0, "July 19, 2012", "FrequentTraveller400", "Washington DC, District of Columbia", 68, 45, "two persons - no starters - two main courses - two desserts - bottle of wine usd38 - 124usd.\nWe ordered the lamb shank with couscous however no shank and it was a mixture of different meats. Taste was weak.\nWould i go back ? maybe"], ["Great Spot", 5.0, "July 19, 2012", "IMF57", "Toronto, Canada", 19, 1, "The server was efficient and knowledgeable. Food was excellent, we arrived in time for the 3 course fixed price menu, good choices, and the food did not disappoint. Excellent wine list.\nWorth a stop."], ["Not as it was years ago--neither is Georgetown.", 3.0, "June 16, 2012", "yahootraveler64", "virginia", 352, 135, "Ate an early dinner this week for my BD. We sat at the open window hoping to see the passing crowds. Bus stop is directly in front and a bus stopped every 5 minutes or more. Not the crowd you want standing near your window, noisy bus, beeping, etc. Champagne was $15/glass, a bit steep for house champagne. Salad was...\n\n\nMore"], ["Late night treat!", 4.0, "June 11, 2012", "Hbone14", "Boston, Massachusetts", 12, 3, "One thing about DC all travelers should be aware of is that places close early! However, Bistro Francais is a great late night venue! Great food and great staff!!"], ["Unique ambience. Nice restaurant", 4.0, "May 23, 2012", "Eas_Bandung", "Jakarta, Indonesia", 83, 46, "I went there late evening and ordered cesar salad. It was very fresh and was very delicious. One the best salads I have had for a long time.\nIn the next visit, I ordered the menu with crushed lamb sausage but it was only ok :("], ["A cosy and happy place in Georgetown", 5.0, "May 14, 2012", "hakanakdag58", "istanbul", 50, 40, "Even thoug the chopped steak is not different from a meatball, Bistro Français offers a very cosy atmosphere with the happy crowd inside. You can try the meal of the day or just order seperately. I recommend the lamb steak."], ["Taste of France", 4.0, "May 9, 2012", "stir-gently", "New York City, New York", 23, 13, "The decor in this French bistro on M Street will make you feel as if you are in Paris. Although some of the selections are generously priced- such as a glass of wine for $11 and some of the main courses- you can eat exceptionally well by choosing from the prix fixe menu. From this menu I had a very...\n\n\nMore"], ["Cute restaurant with OK food", 4.0, "May 3, 2012", "susannTheGo", "Princeton, NJ", 122, 56, "Quaint restaurant, good service, nice wine list. The food was mediocre at best."], ["Still a great Restaurant", 4.0, "May 1, 2012", "jcmpisco", "nashville", 23, 9, "We went there for a late diner, overall it was excellent, our server was very nice and polite. The food was simple, delicious and well prepared. I have not been to this restaurant in years and was not dissapointed.\nThank you."], ["Georgetown Treasure", 5.0, "April 27, 2012", "Stewsview", "Toronto, Canada", 111, 85, "We dined here at lunch with family who are regular customers - no wonder. Traditional atmosphere with friendly service in a quiet setting. We hear chefs dine here after their own places are closed - no wonder. The food was fabulous. I had the trout in beurre blanc and it was fantastic - my companions all loved their choices as...\n\n\nMore"], ["Another decent 'local' GT bistro", 3.0, "April 20, 2012", "Jaaz182", "DC", 26, 4, "Good, simple, French fare. Decent adult resto. Not at all bad, I just don't like eating on the main street."], ["Great Value. Real French Food.", 5.0, "April 15, 2012", "annite57", "Vienna, Virginia", 55, 27, "What a surprise here. I thought this might have been a mediocre bistro, you know, overpriced in Georgetown for tourists... No. This was great french food, better than bistro du coin in dupont. Here is why.\nWe got everything. The onion tart was tasty like quiche and fresh. The spinach salad was dressed perfectly, with chunks of blue cheese and...\n\n\nMore"], ["So fab!", 5.0, "April 9, 2012", "Lawflake", "Okemos, Michigan", 158, 77, "Delicious and authentic French food in Georgetown served by a charming French speaking, multiple lingual waiters. The food was excellent and the wine list superb. I would highly recommend."], ["Went for an impromptu lunch", 5.0, "April 8, 2012", "Shellyduchsk8s", "Newark, Delaware", 112, 34, "We LOVE this restaurant, so while on a day trip down to Georgetown, we had to stop in. It actually became our sole reason for going down, after our original plans did not pan out. We of course ordered the escargot, and I ended up w/ a remarkable chicken sandwich. Sounds simple, yes, but it was delicious! We have previously...\n\n\nMore"], ["Great restaurant", 4.0, "March 27, 2012", "KFF77", "Winchester", 62, 16, "Nice looking restaurant. Serves good, tasty food and the staff were very friendly and helpful. Bit pricey but worth it."], ["Avoid this one.", 1.0, "March 25, 2012", "SFresh118", "Marseille, France", 59, 34, "Bad reception by an unpleasant french woman (and I am french!). Tables are just next to one another. We sat, looked around, and left."], ["Dont do the steak, presentation a bit strange", 3.0, "March 17, 2012", "Mattnott118", null, 42, 13, "My wife had the minute steak, which was very tough. I had the venison, which was great, but served with an unappetising looking chestnut puree. Good but expensive wine selection."], ["Underwhelming and a little tired", 3.0, "February 24, 2012", "jlle", "Rochester, NY", 153, 79, "Full disclosure: I was a sous-chef in a French restaurant in the US in the 1970s, and I lived in the south of France for 2 years. I groan whenever someone suggests a \"French\" restaurant in the US. This time, it was a old friends and I knew they wanted to dine there so I said sure. What a bore...\n\n\nMore"], ["True and Authentic Night at the Bistro", 5.0, "February 21, 2012", "carolynbs4", "Indianapolis, Indiana", 14, 6, "Bistro Francais was a great place for authentic French food. You have to start with the French Onion Soup. It was so super-tasty! The entrees were French comfort food. I felt like I was in a little place in Paris."], ["So noisy", 3.0, "February 19, 2012", "picalexandre", "Washington DC, District of Columbia", 57, 55, "Food is ok most of the time, not a dining experience but convenient and well located but Hell so noisy"], ["A Favorite.", 4.0, "February 11, 2012", "vdas", "EHT, NJ", 116, 64, "Bistro Francais is a must, whenever we go to DC. We have been going there for years. Love to sit at the little window tables, discuss the menu with the staff,order our meal, sit back relax and just enjoy the evening."], ["Best Eggs Benedict", 4.0, "January 30, 2012", "VirginiaFarmer", "Charlottesville, Virginia", 102, 22, "I have been going here for Eggs Benedict for more than 20 years. I am always tempted to get something else but I can't get past the eggs.\nThe eggs are perfectly cooked. The are served with McDonalds style french fries which are perfect with the hollandaise sauce. Just perfect. I"], ["Touristy but fun.", 3.0, "January 21, 2012", "DCLocal75", "Washington DC, District of Columbia", 10, 0, "The food was ok - but it's a great deal for a French restaurant in super touristy Georgetown, and one of the only places open late at night. They have an early bird special that begins at 11pm. With a cool international crowd and old parisian atmosphere, it's got a lot of character."], ["excellent early bird menu", 4.0, "January 19, 2012", "darwinsail", "Washington DC, District of Columbia", 379, 305, "it is a nece combination at lower price you can get before 7 pm."], ["The best French food you can find in DC", 5.0, "January 17, 2012", "globesurfer11", "Washington DC, District of Columbia", 20, 20, "I love to go this place for lunch as it has a three-course meal with glass of wine for only $19.95 and it feels just like you are in France! The bread is fresh, smooth and crusty and you have a choice of three starters, meat or fish typical French dishes for main and a tray of fresh delicious French...\n\n\nMore"], ["Delightful Dining in Georgetown", 5.0, "January 17, 2012", "hillbarb007", "Aldie, Virginia", 38, 10, "Lunch at Bistro is a real treat. The selection is excellent and the sauce on my beef kabob was delicious. The strawberry tart was delectable. What an excellent dining experience..."], ["Food is good , definitively pricy...", 3.0, "January 12, 2012", "Eric046", "Denver, Colorado", 38, 13, "Had dinner with my wife. We shared a starter made of 6 snails, then each of us had a main meal. I chose Espadon, slightly overcooked unfortunately, but equally as disturbing was the thickness of the fish filet\nWas still hungry, so had a creme brulee, just as thick as the fish...I know Georgetown is known to be expensive but...\n\n\nMore"], ["A Delight!", 4.0, "January 10, 2012", "rubyred582", "Philadelphia", 33, 14, "We stopped in this little gem as a last-ditch effort for a nice dinner after an unsuccessful dining experience at a different restaurant several neighborhoods away. We loved it! The food was authentic and we felt like we were transported to Paris. A great surprise!"], ["If You Love Old-School French Bistro--This Is Your Place!", 5.0, "January 8, 2012", "jarona", "Philadelphia, Pennsylvania", 91, 143, "After coming back from a nice after- Christmas weekend in DC, it occured to me that I had not written a review of this great place. We've been dining here for four years--since my daughter attended U of MD. We've always returned for a nice, relaxing, old-school, French Bistro meal here and have never been dissappointed.\nBistro Francais is situated...\n\n\nMore"], ["Excellent French Food", 4.0, "December 23, 2011", "johnsmith47", "Northern Virginia", 124, 95, "At one time, french food was all the rage in DC. Now, you don't see it as much. This place is the standard for bistro fare in DC. Well prepared good service. The only problem is that it's in Georgetown and parking is a hassle. Drive around north of M and you'll find a space on the street. Or better...\n\n\nMore"], ["Love their Menu and Prices", 4.0, "December 14, 2011", "TonyK300", "Berkeley Heights, New Jersey", 400, 178, "Great place right on 'M' Street if you want a great meal at a reasonable price. Their chicken dishes are especially appealing even if you don't normally go 'French'. Service is great and they have a \"huge\" menu!!! A definite \"go to\" for me anytime I'm in town."], ["Feels like you are in Paris", 4.0, "November 13, 2011", "robtlinda", "Frederick, Maryland", 55, 29, "I love to go here when I am in DC. While I've never had dinner here, I have been several times for lunch and always have enjoyed the food, the atmosphere and the service. They offer a wonderfully tasty and reasonably price lunch special with a number of choices off of the main menu. Great value!"], ["value", 5.0, "October 8, 2011", "redleader57", "doncaster", 51, 12, "Went at tea time special excllent food and value whilst on holiday in Georgetown"], ["Not very good", 2.0, "August 16, 2011", "kevinJ75", "Washington DC, District of Columbia", 29, 15, "I did not like my meal and had to send it back. As soon as the waiter brought me my plate of veal kidney I knew that it was not correct. The rest of my dinner was nothing to write about. Much better French food in DC."], ["They double charged the drinks and the dessert in the Early Bird Menu", 1.0, "August 14, 2011", "neslihank", "istanbul", 6, 2, "As a tourist family, after along museum day, we dined at Bistro Francais. The protions were small, the bench my husband sat was low and uncomfortable. It looked more like a church bench then a bistro bank. We oredered a vegetarian salad, a soda, a coffee, two Early bird Menus and a childrens menu. The bill was 130 $. They...\n\n\nMore"], ["Lovely Georgetown Bistro", 5.0, "July 30, 2011", "Azadia", "Washington", 101, 55, "We first tried this Bistro for lunch and very much enjoyed the food and ambiance. We've come back twice with a group and had the back room reserved. The food and service have been outstanding and if you take advantage of the fixed-price menu for dining before 7pm, it is an extremely good value - under $25 for three courses...\n\n\nMore"], ["Degoutant - 1st time I walked out of a restaurant", 1.0, "April 27, 2011", "bartinbxl", "bartinbxl", 15, 20, "Went in hungry - ordered the recommended wine, goat cheese salad and a nice fish for main course.\nThe wine's smell was suspicious - a strong acid smell - but I thought we would let it rest a bit.\nThen the goat cheese salad arrived. The goat cheese was spread as paste on some bread and it smelled awful. Had...\n\n\nMore"], ["Wonderful!", 5.0, "April 18, 2011", "CannonJ", "Washington DC, District of Columbia", 1, 0, "We had my sisters bridal shower at Bistro Francais. It was absolutely wonderful! The setting was perfect and elegant. Everyone enjoyed the food and drinks. I highly recommend the restaurant for an event like this."], ["Disappointing - expensive and underwhelming", 3.0, "April 10, 2011", "jonneyboy", "San Francisco, California", 17, 6, "Great atmosphere - but overpriced and just so-so food\nTables are jam -packed together\nCasseoulet was not very good - meat was very tough - same with the leg of lamb\nThe garden salad was the most bland I have ever had\nAlso fairly small selection of wines by the glass\nI am not sure where all the great reviews...\n\n\nMore"], ["Early Bird special is great value", 5.0, "March 28, 2011", "Izies", null, 1, 0, "We had wonderful meal at Bistro Francais 3 course with a glass of wine for $24.95. I had Mussles Nicoise and roasted leg of lamb my friend try the liver pate and grilled Salmon with spinach mousse they were excellent. For dessert Napoleon and apple tart were the best. We will definitely return."], ["Enjoyed the pastries!", 3.0, "March 19, 2011", "lab12345", null, 206, 87, "Slipped in here and got the $19.95 lunch special. It included a pastry, a glass of wine, a soup or salad and a choice of a selection of entrees. The sea bass and basmati was nice, we also tried the gazpacho, the sea trout, and the lamb couscous platter. While not spectacular it was certainly decent. The place had a...\n\n\nMore"], ["Good", 3.0, "July 18, 2010", "NYEm", "New York City, New York", 41, 93, "I went to Bistro Francais for lunch with friends. The lunch menu offers a wide range of dishes, and the seafood options are especially good. I had a seafood sandwich, and it was satisfying. It was generous with the seafood. I split the Avocat Farci (avocado and crab) meat appetizer, but it was a bit light on the crab meat...\n\n\nMore"], ["Fantastic spot in Georgetown", 4.0, "July 18, 2010", "ScottHayes", "Birmingham, England", 76, 35, "This restaurant is in a great location in Georgetown. The service was excellent, and the food was extremely tasty, and good value for money.\nWaiting staff were excellent - friendly and informative, without being pushy.\nThe decor could maybe do with updating, as it was very old fashioned. However, it was certainly clean and tidy."], ["Food was excellent, service was great! A...", 4.0, "May 30, 2010", "HeidiluvrTx", "TX", 23, 12, "Food was excellent, service was great! A bit pricey and the hours were very accomodating."], ["Great for a relaxing lunch", 4.0, "February 21, 2010", "daleindenver", "Denver", 3, 2, "As tourists, we were tired and wanted a nice lunch. We sure did not want to eat at a chain store. We glanced at the menu posted outside, and a leaving customer gave it a good recommendation. Enough for us. We enjoyed a very tasty and leisurly lunch. We had very good service and overall everything was great. We had...\n\n\nMore"], ["Worth it", 5.0, "December 17, 2009", "LJBVermont", "Vermont", 60, 19, "MY husband and 2 young children ate here in November. It was really excellent. They gave us a window seat. I liked the ambiance and French posters on the walls. It was very French but not fancy .. Our waitress was great-she is from Russia. I would definitely come again when in Georgetown."], ["The second star is for the service", 2.0, "October 29, 2009", "AOVirginia", "Virginia", 37, 44, "This place changed a lot. The food was goodd, now it is awful, and the recommended wines taste like the homemade kind. Pity, it used to be quite a nice place to eat late. We ate only appetizers, and these were beyond forgettable. The service is the only endearing part, very nice waitress and other staff. The bread is still...\n\n\nMore"], ["Romantic & quite good", 5.0, "September 22, 2009", "Shellyduchsk8s", "Newark, Delaware", 112, 34, "Duck pate - quite enjoyable. Escargot - served in the shell, as it should be. Perfect!\nDover sole - absolutely amazing.\nDesserts - ok, enjoyable coffee ice cream.\nAbsolutely outstanding wine selection!!\nCan't wait to return!"], ["Lovely", 5.0, "July 14, 2009", "supermellowman", "Lima, Peru", 90, 67, "Classic French restaurant. Delicious food. Gorgeous decoration. Excellent service. Just love it!!!!!!"], ["Best lamb chops ever", 5.0, "July 13, 2009", "Pinoy123", "Southern Cal", 57, 37, "Had the prix fixed dinner with lamb chops. Forget the mint jelly. The Rosemary sauce was a great complement to the chops. Daughter had the French Onion soup and said it was the best she's had."], ["A Georgetown institution...", 5.0, "May 30, 2009", "eventsdc", "washington, dc", 170, 88, "A Georgetown institution with a good pre/post theater special. Also open late with full-menu available."], ["Used to be our favorite", 2.0, "May 17, 2009", "chassen", "washington, DC", 4, 1, "Have been going to this place for over ten years. My husband and I considered it our favorite. We are \"regulars\" with this place. Unfortunately, we are losing our favorite restaurant. The Managers are rude. Tonight our manager claimed with annoyance \"that we always want the same waitress,\" that was so rude and this was before we sat down.\nWhen...\n\n\nMore"], ["Wonderful meal...service could be better", 4.0, "February 16, 2009", "jvo531", "Baltimore, Maryland", 4, 4, "One of the best meals I've had in a long time. The location and atmosphere helps to make it a memorable experience...the chefs know how to create classic, rich french dishes and everything is prepared perfectly!\nGreat french wine selection and reasonably priced bottles!\nMain reason it's not rated as perfect is the service could be better! Waiter was not...\n\n\nMore"], ["Charming spot in the heart of Georgetown. Can be pricey, depending on what you order, but usually has lunch specials...", 5.0, "October 21, 2008", "EvinOK", "Cork, Ireland", 307, 138, "Charming spot in the heart of Georgetown. Can be pricey, depending on what you order, but usually has lunch specials (eg, $13 for a sandwich, frites, and soup). Delicious French onion soup. Very romantic, but also great to go out with friends."], ["love you and your tartare", 4.0, "June 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "love you and your tartare"], ["This is definitely the place to go late-night! I ordered a full dinner/breakfast at 4 AM when staggering there after...", 3.0, "April 13, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is definitely the place to go late-night! I ordered a full dinner/breakfast at 4 AM when staggering there after last call."], ["The best in DC drunk food. Great brasserie vibe where DC's chefs go to unwind with french comfort food. The Steak...", 5.0, "February 14, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The best in DC drunk food. Great brasserie vibe where DC's chefs go to unwind with french comfort food. The Steak Tartare is peerless for D.C."], ["Order before 7 and you get a nice 3 course dinner and a glass of wine for a deacent amount. Bistroish and european.", 3.0, "February 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Order before 7 and you get a nice 3 course dinner and a glass of wine for a deacent amount. Bistroish and european."], ["eggs benedict", 5.0, "January 31, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "eggs benedict"], ["I don't even know why I...", 1.0, "January 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I don't even know why I gave this one a star. Maybe becasue they are one of the few palces that opens until late (for DC standards!)."], ["I liked it", 4.0, "January 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I liked it"], ["Come here when hungry late at night.", 4.0, "January 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Come here when hungry late at night."], ["Always open late, food is great and so is the service.", 4.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Always open late, food is great and so is the service."], ["great for late nights. typical bistro food.", 3.0, "November 12, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great for late nights. typical bistro food."], ["Some of the worst service I have ever had", 2.0, "November 8, 2007", "hokiefille", "Fairfax, Virginia", 7, 5, "My boyfriend and I went here last Monday on a whim. It was packed, which was fine, but the service was abominable at best. We were off to a bad start right away because the hostess was incredibly rude. I can understand the waitress might have been frazzled due to the crowd, but she made several pretty colossal mistakes. First,...\n\n\nMore"], ["Charming, Reasonably Priced and Wonderful Food", 5.0, "August 16, 2007", "cjennt", "La Jolla, CA", 118, 329, "I am a sticker for charm-filled French restaurants, especially in the\nequally charming ambiance of Georgetown. The food here is absolutely wonderful and the atmoshphere is reminiscent of a Frech country house\nin Provence. The Edith Piaf music also adds to the charming and quaint backdrop of the place. The people watching is wonderful too, if you get a seat...\n\n\nMore"], ["A little of France in the middle of Georgetown...", 5.0, "September 6, 2006", "angelface52786", "Miami", 101, 330, "We visited Washington D.C. during Labor Day weekend. Georgetown was, by far, our favorite area, and Bistro Francais is great for a late night dinner. The prices are affordable, the menu is simple, and the food is delicious. Their service was speedy and impecable...Our waitress even knew some French. The French onion soup was delicious...They are at a prime location:...\n\n\nMore"], ["Early Bird", 4.0, "May 7, 2006", "A TripAdvisor Member", null, 1, 0, "I had the early bird menu on a weekday evening. Of my four nights in Washington DC, this was by far the best value for money that I had encountered.\nI managed to eat three courses with a glass of wine and be out having spent just over $21\nThe waitress was attentive and service was very prompt. I am...\n\n\nMore"], ["Our favorite place in DC", 4.0, "June 12, 2005", "A TripAdvisor Member", null, 1, 0, "This is almost always the first place we eat when we come to Washington (which is a couple of times a year). It's consistently good - not quite as good as it was, say, 5-6 years ago - but very authentically French. I love the atmosphere, and they have a nice wine list. Great desserts, too!"], ["Very, Very Disappointed", 1.0, "May 31, 2005", "Kabecka", "Chicago, Illinois", 94, 126, "My husband and I enjoy fine dining, but are not extremely particular about food. We just enjoy a nice meal. We looked forward to having dinner here. We both ordered seafood. I had the halibut. I was shocked that it was so tasteless. They gave me two small boiled potatoes which were also tasteless. I realize that portion sizes at...\n\n\nMore"]]], ["Hillwood Cafe", [["Great outting with a good friend", 5.0, "September 29, 2015", "Rochelle P", "Hyattsville, Maryland", 3, 1, "The café, was a great addition to the awesome tour. Tasty bites with sparkling wine and tea overlooking the grand gardens"], ["DO NOT order the Sunday tea and definitely do NOT order the scones with cream.", 2.0, "September 24, 2015", "sister-cousins", "Onancock, Virginia", 109, 45, "After a wonderful visit and tour of Hillwood mansion and before we toured the gardens, we stopped at this café for Sunday \"tea\". Pathetic. Truly, this café needs a change of operator and staff. First, the good: we dined outside under cover, of course, and it was nice. Service was terrible. When our tea was served, it was only the...\n\n\nMore"], ["Nice food on a hot day.", 4.0, "August 26, 2015", "741lolo", "Gig Harbor, Washington", 77, 22, "We ordered food and took it to the covered patio. The fans were strategically placed and worked well. Portions were large and the food was freshly prepared. Reasonable prices."], ["Good food, lovely ambience", 5.0, "August 6, 2015", "Grandma41", "Washington", 18, 5, "The food served here is delicious. You have two choices of service. You can have a served lunch inside the café or buy a carryout lunch to eat at one of the tables set up outside. We chose the latter option and enjoyed relaxing and eating outside on a beautiful spring day."], ["Great place to take a break grab a quick lunch.", 5.0, "July 30, 2015", "R P", "Loudoun County, Virginia", 31, 12, "Excellent food at a very reasonable price. The fare is \"cafe style\" sandwiches and salads with great desserts! Prices are extremely reasonable especially considering there are no restaurants in the area."], ["Delicious Dining", 5.0, "July 26, 2015", "MK L", "Henderson, Nevada", 37, 16, "The menu is creative and clever and changes daily. The specials are excellent with fair prices. Terrific desserts, too. Great service and friendly staff. Dine inside or out!"], ["Basics to give you energy to carry on", 3.0, "July 11, 2015", "Olga C", "Greensboro, NC", 68, 28, "Basics: sandwiches (turkey or ham), vegetarian wrap, salad and soup. A selection of drinks including wine and deserts to wrap up a meal. Food is prepared in advanced, so the croutons in the Caesar salad were a bit soggy. But all together is a great stop to get some energy to continue touring this amazing estate. I hate marking average,...\n\n\nMore"], ["Enjoy the museum. Enjoy the cafe more!", 5.0, "July 10, 2015", "Empathy", "Fairfax County, Virginia", 86, 87, "A few of us went to the Hillwood Museum and Gardens yesterday. It is the estate of Ms. Post. It was beautiful, and well worth the visit. The cafe was the best part. I've never had a better quiche, even with all the times I've been to France. It was beautifully served with a salad and water. I had a...\n\n\nMore"], ["GOOD PRICE FOR EXCELLENT FOOD", 5.0, "June 15, 2015", "ewhite0640", "Oak Park, Illinois", 77, 35, "A charming setting at this incredible museum. I had the quiche and the cantaloupe soup, plus a glass of California pinot noir. Also had the strawberry tart. Great food and priced accordingly."], ["Hillwood Cafe", 5.0, "May 16, 2015", "Jim S", "Ellicott City, Maryland", 16, 10, "Surprisingly pleasant menu. I had the chicken salad sandwich with walnuts and cranberries on a multi grain bread. Others in my party had the mozzarella, basil, tomato sandwich, and also the veggie quiche. Fresh and tasty. Prices in the $8-10 range."], ["Great food. Great atmosphere.", 4.0, "May 3, 2015", "Doug848", "Fair Oaks", 12, 8, "This is a very cute restaurant on the grounds of the Hillwood Museum and Gardens. There were two of us and we both had different salads with large portions and very good. We had to take a"], ["A Bite to Eat", 4.0, "March 7, 2015", "Cherie F", "Lawrence, New York", 58, 35, "We needed something warm as it was a very cold day when we visited Hillwood. We all ordered the soup and it was delicious."], ["Terrific Food Great Service!", 5.0, "February 19, 2015", "suzzyf", "Dallas, Texas", 53, 9, "When visiting Hillwood make sure that you make a reservation at the intimate Hillwood Cafe! Comforting food and superb service distinguish the Cafe as a \"must imbibe\" if you are visiting the museum and grounds!"], ["Lovely Lunch!", 5.0, "January 28, 2015", "AnnieMadison_VA", "Madison, VA", 80, 46, "Enjoying lunch at the Hillwood Cafe is the perfect completion of your visit to the Hillwood Mansion. This is a step back in time to a gracious atmosphere and food that is elegantly served and delicious.\nWe enjoyed sandwiches and tea in lovely surroundings which, unbelievably enough, were originally horse stables! It's important to make reservations beforehand, and you can...\n\n\nMore"], ["Excellent lunch", 5.0, "January 7, 2015", "TWS500", "Alexandria, Virginia", 87, 29, "An excellent place to have lunch in visiting elegant Hillwood... Surprisingly wonderful, delicious salmon salad, with wine....perfect... Make a reservation."], ["Limited Menu - Delicious Food", 4.0, "January 6, 2015", "MegtheHealer", "Maryland", 102, 43, "During a recent visit to the Hillwood Museum and Gardens, we enjoyed a warm and tasty lunch. We made reservations in advance, but had to change them at the last minute to accommodate our participation in the Docent Tour. There were convenient telephones at both the Mansion and Visitor's Center for making the change and cafe staff seemed happy to...\n\n\nMore"], ["Ask for the vegetable quiche!", 5.0, "January 1, 2015", "Trisha21", "Orange County CA", 161, 120, "French onion soup, vegetable quiche and a glass of champagne make a delicious lunch treat! Make reservations ahead to insure you will be able to eat here."], ["We enjoyed afternoon tea.", 5.0, "December 28, 2014", "FF13", "Sykesville, Maryland", 223, 197, "Lunch was not offered on the last Sunday of December. However, we enjoyed afternoon tea in the Cafe at a nice table in a relaxed atmosphere. The tea included a beverage of our choice (even if we didn't want tea, there were other options.) Included in the fixed cost was a plate of finger sandwiches and miniature pastries. Service was...\n\n\nMore"], ["Tasty Meal", 4.0, "December 5, 2014", "Roy F", "Williamsburg, Virginia, USA", 172, 65, "we ate at the café is a part of a group tour of the Hillwood mansion. There were approximately 25 of us and they had a very nice separate room to accommodate us. Appetizer was either a salad or onion soup which was average. My wife grandson and I had the chicken in a brown sauce with roasted potatoes and...\n\n\nMore"], ["Lovely lunch", 5.0, "December 2, 2014", "Marysusan G", "Puyallup, Washington", 23, 9, "We enjoyed light lunch and tea. They were remodeling which made it a bit challenging but they did a great job on service. The new dining area will add much needed room. It is a perfect afternoon spot with your girlfriends."], ["A Quick Convenient Lunch", 3.0, "October 14, 2014", "nderiley", "Washington DC, District of Columbia", 86, 35, "Since you can spend many hours at Hillwood, having a cafe is a must. I was seated in the overflow but still quickly served my quiche of the day and french onion soup with a little wine carafe. The soup was nothing to write home about, I always hope for gratinated cheese on french onion but despite this the flavors...\n\n\nMore"], ["Disappointing service", 2.0, "October 7, 2014", "Mary C", null, 3, 1, "Ordered French Onion soup and a main dish of ravioli - waited forever for the soup, then the ravioli came out after I had two spoonfuls of soup. The busboy afterword asked me if the soup was ok, and I said well, it came too late to eat. He was sorry, but did not bother to tell my waitress, who...\n\n\nMore"], ["Fine, but nothing special", 3.0, "September 14, 2014", "Winstonthecat1", "Boston, Massachusetts", 75, 51, "We needed a snack while visiting the Estate, and this did the job. The brownie was particularly delicious, and my vegetarian wife liked the veggie wrap. The staff weren't the most attentive."], ["Quaint little cafe, good food and great service.", 5.0, "September 2, 2014", "ADVISOR72201", "Little Rock, Arkansas", 37, 12, "This is a great spot for lunch while at Hillwood, so plan your trip to include a visit. Great salads with more than ample helpings, the salmon in particular is generous. Beer, wine and soft drinks. It appears they are expanding the outdoor seating. I expect you might also order a sandwich and picnic on the grounds."], ["A bad rap for a place devoted to perfection", 1.0, "August 31, 2014", "jo412", "Baltimore, Maryland", 25, 7, "I took friends on Saturday for lunch to the cafe and thought the food and service were sub par: a bad rap for a place devoted to perfection. My vichyssoise was not correct (as not made according to its original recipe) as well as warm, and there was too much vinegar in the salad dressing. Those who ordered the quiche...\n\n\nMore"], ["Tasty food, indifferent service", 3.0, "August 18, 2014", "Jennie30", "Chicago, IL", 118, 61, "Our party of three had Sunday tea at the cafe. It's a lovely cafe with outside and inside seating with air conditioning.\nWe were seated right away and ordered drinks, which came promptly, along with the set tea plate. You get an assortment of tea sandwiches and tea cookies all on the same plate. Then we were ignored by our...\n\n\nMore"], ["Ghastly Service", 2.0, "July 31, 2014", "miss s", "Northampton, Massachusetts", 6, 6, "Echoing other reviews to say that the service here is terrible. Waited fifteen minutes for an iced tea and ended up leaving because even though numerous staff saw me, no one stopped to take my order to greet me. The cafe itself is also very crowded and loud, doing nothing for the atmosphere. Really soured my visit and my opinions...\n\n\nMore"], ["The Service Was Beyond Terrible", 1.0, "July 3, 2014", "mattski0604", "Wynnewood, Pennsylvania", 57, 49, "The Hillwood Estate and Garden was a first-rate destination. A wonderful collection of art and antiquities and a beautiful garden and greenhouse. When we arrived, our party of eleven went to the cafe, and split ourselves up into two open tables. Then we sat, and sat, and sat. With no water, no waiter, no menus, no set-ups - for far...\n\n\nMore"], ["Incredibly rude service staff, do not recommend to anyone.", 1.0, "June 22, 2014", "Derek M", "Ludlow, Kentucky", 2, 5, "Incredibly rude service staff, do not recommend to anyone. Mismanaged and slow to correct multiple overcharge errors while accusing us of lying (we were able to prove our statements to be true with receipt documentation). Will not return."], ["Beautiful venue for a beautiful lunch", 5.0, "June 18, 2014", "GloriaUUS", "Aberdeen, United Kingdom", 23, 13, "The cafe is situated in a beautiful surrounding and weather permitting, I would definitely recommend getting a table outside. We had salads for lunch and they were delicious. The service was on the slow-ish side, but the venue and surrounding make the experience pleasant, it's not a place I would go to eat in rush, rather sit, enjoy and soak...\n\n\nMore"], ["Very nice", 4.0, "June 15, 2014", "colduser", "Naperville, Illinois", 68, 28, "We made a reservation and it all was very nice. Light lunch. If the café is full there is also an express window. It makes it easy to spend more time in the museum."], ["If only the service weren't so very very very bad", 2.0, "May 18, 2014", "Daninboise", "Boise Idaho", 98, 56, "The location is stunning, the food delicious, the wine wonderful... But the hostess was slow the servers ignored or forgot everything moments after being told, so very disappointing."], ["Friendly Staff but disappointing Tea", 2.0, "May 11, 2014", "VirginiaSnoweater", "Virginia", 36, 54, "First I want to say, the staff was very friendly and helpful. Also, I've been to many teas, $15 was a bargain and should have been my first warning.\nLast year, I tried making reservations at Hillwood Cafe for tea on Mother's day. It was booked. So this year I made reservations in January. According to the website, tea reservations...\n\n\nMore"], ["Express menu food very fresh", 4.0, "April 28, 2014", "LisaKay50", "Fredericksburg, Virginia", 104, 33, "We got the turkey sandwich and lemonade. Bread was whole grain and lots of meat on the sandwich -- you might want to split one. Everything tasted very fresh. If the place is busy, you won't find anywhere to sit as the tables are all reserved for the regular menu and served dining. However, you can take your food to...\n\n\nMore"], ["Good food, good prices, spotty service", 4.0, "April 26, 2014", "momE1", "Front Royal, Virginia", 201, 128, "The tea/lunch room is a wonderful addition to the Hillwood experience. We had reservations and were seated promptly. If you decide to eat here, be sure to make reservations well in advance as the place was quite crowded. We split the 3-course lunch of salmon salad, borcht and a hazelnut dessert cake as this would have been WAY too much...\n\n\nMore"], ["Hillwood Cafe Tea - Second Time is NO Charm!!!", 2.0, "March 16, 2014", "amiddl", "us", 47, 24, "Went with a friend just this summer and it was FAB!!! Food, service, environment - everything was on point. Went today and I cannot believe in just 9 months the place went downhill that fast. It's $15 for tea and $20 if you add wine - which is a great price don't get me wrong. In June it was a...\n\n\nMore"], ["Elegant little cafe", 4.0, "January 4, 2014", "BrewsMom", "Northampton, MA", 142, 83, "On a chilly December day we had an impromptu lunch at the Hillwood Cafe. We had to wait about 20 minutes for a table, but lunch was worth the wait. Excellent soups and salads. Service was really good and attentive. They serve special teas as well. We hope to go back on a summer day as the outside tables were...\n\n\nMore"], ["Convenient and delicious", 5.0, "November 12, 2013", "Swiftfeet", "San Jose CA", 19, 9, "Had the autumn chicken salad and squash soup. Can I please get a recipe for the squash soup? It was that delicious and the salad was great, too. Not inexpensive, but worth it!"], ["Lunch outside", 4.0, "October 29, 2013", "SharOnMader_13", "Fremont, Ohio", 48, 19, "We enjoyed our lunch outside on a sunny day! Service was slow for those of us on a tight timeline. Convenient to not have to find another place for lunch."], ["Cute garden setting", 4.0, "October 2, 2013", "MaryofMassachusetts", "Plymouth, Massachusetts", 266, 121, "Varied menu, good service. Presentation of salads beautiful. Dine inside or out. Museum theme continues with some food choices. Well worth price. Beer, wine and special iced teas...looked like assorted sandwiches for take out to picnic area too!"], ["Great food mostly but forgetful service!", 4.0, "September 30, 2013", "MariusInMD", "Baltimore, MD", 64, 54, "Three of us has pretty tasty food for lunch. And even some Postum - a coffee substitute!! The cucumber soup was bland... but other than that a great meal! I had the Veggie wrap special. Very tasty!! The views are amazing of course!! The patio has heaters too for when it does get cooler. The server, Dave, was nice enough...\n\n\nMore"], ["Tasty and Wholesome", 5.0, "September 8, 2013", "debby t", "Marshall, Virginia", 59, 35, "Reservations are advised to eat in the cafe as this is a small establishment, but there is seating inside and out. I wanted to eat in the grounds so purchased food to take out and eat in the gardens. I saw plates coming out from the kitchen and was impressed, they looked tempting. I had the vegetable and cheese spread...\n\n\nMore"], ["Afternoon Tea", 4.0, "July 29, 2013", "LibyAH", "Washington, District of Columbia, United States", 116, 44, "Prosecco or Cava are available along with a nice selection of tea. They offer a Veggie option to the finger sandwiches. The Cafe itself is efficient and nothing like the rest of the museum but the staff is friendly and the food is good. If you're there and have a reservation - do it. Otherwise, afternoon tea is best elsewhere."], ["Nice salad", 4.0, "May 15, 2013", "Duzerma58", "Scranton, Pennsylvania", 30, 12, "Had a nice salad inside the cafe. I liked that I did not have to bring food with me and could get a break from the heat outside."], ["Great for Lunch or Tea", 5.0, "April 25, 2013", "kzdallas", "Washington DC, District of Columbia", 127, 215, "The Hillwood Cafe has a lovely setting alongside the gardens and you can eat inside or out. Very relaxed, so you can stop by for a coffee or tea when visiting the museum and/or gardens, or spend some time and have lunch. The sandwiches and salads are tasty and hearty."], ["Horrible service, limited menu, very expensive", 2.0, "March 29, 2013", "eagle132", "Houston, Texas", 116, 65, "Just wanted a cup of coffee and something small to go from what they call the express after looking at their very limited menu\nVery expensive very rude servers ( details don't matter.....) but needless to say don't rec it bring a sandwich"], ["Delightful", 4.0, "March 26, 2013", "CaribeTraveller", "Huntsville, AL", 95, 90, "Excellent service. Good variety. Reasonable prices. Pleasant atmosphere. We had Avery enjoyable lunch. The daily quiche, salads, minestrone, and chocolate cake were all very good."], ["A respite.", 4.0, "March 25, 2013", "thewizardEd", "Washington DC, District of Columbia", 4, 1, "This cafe is best when a large tour group is not at the estate. Reservations are a good idea. In the heat of Summer, the inside seating area is a refreshing oasis; in the Spring or Autumn, ask to sit outside. You can also purchase food to eat away from the cafe on the grounds of the estate. I would...\n\n\nMore"], ["Nice to have a place to eat at Hillwood", 3.0, "November 25, 2012", "Jillnt6772", "Bethesda, Maryland, United States", 115, 50, "This is a nice place to have while you are visiting so that you can visit a bit, eat lunch, and then finish your visit. The food is good, the place is clean and best of all it is convenient!"], ["Make a reservation!", 5.0, "October 8, 2012", "Marcy U", "Arlington, VA", 15, 30, "The cafe is small and somewhat noisy when full. Reservations are a must. Two in our party had crab cakes and two had smoked salmon. The food looked good and tasted even better. A special 3-course fixed priced lunch with a Belgian waffle and strawberry dessert was tempting, but we chose a la carte."], ["Nice", 3.0, "July 19, 2012", "onthego11_12", "Aventura, Florida", 104, 42, "Food was nice, service was good. it was clean and was a please to sit and begin to catch your thoughts and start your tour again."], ["Dine like a millionaire!", 5.0, "July 19, 2012", "HolidayHappy29", "Washington DC, District of Columbia", 27, 4, "We ordered the High Tea, and while it was a bit pricy, it was worth every luscious bite!"]]], ["Bread and Salt", [["Great food and staff", 5.0, "September 14, 2015", "Scott S", "Mason, Ohio", 5, 1, "We had a great time at this restaurant. The food was terrific and the staff were great. Will definitely go here in the future."], ["Very Pleasant lunch/brunch spot", 4.0, "August 20, 2015", "dc1sanibel", "home", 148, 91, "Had a very enjoyable Sunday lunch/brunch on the outdoor terrace- very relaxing and large outdoor space. Food was quite good and very well presented. The falafel plate, poached eggs with smoked salmon and omelet were all very good. The potatoes that accompanied the egg dishes were outstanding."], ["Pleasant but quirky", 3.0, "August 16, 2015", "pmr2", "Washington DC, District of Columbia", 145, 51, "I went here on a Sunday afternoon with friends and we found the place spacious, somewhat upscale in a hi-tech modern way, and yet unpredictable. The menu was an odd assortment of choices and didn't seem quite as Mediterranean as billed. Since I didn't want anything heavy, I opted for the omelet and salad. The food was fresh enough, and...\n\n\nMore"], ["Friendly and tasty", 5.0, "August 1, 2015", "286solotraveler", "Washington", 41, 4, "Bread + Salt staff are the friendliest. The menu is small but everything is beautifully presented, fresh, and tasty. A lovely sunny glass-walled room with an outdoor patio with big umbrellas. Plenty of street parking."], ["Mediterranean brunch", 4.0, "June 10, 2015", "jdc8mbc", "California", 186, 103, "We were in D.C. visiting our niece who is attending American University. The brunch menu has traditional breakfast items as well as Mediterranean offerings. The mezze plate was very tasty and filling as was the 3-egg omelet. There is a full bar. The restaurant is spacious and airy with a modern upscale look. It's a nice place for students to...\n\n\nMore"], ["In need of Restaurant Impossible", 2.0, "June 5, 2015", "RocketReview4U", null, 24, 6, "The sign reads \"Mediterranean Bistro\" but there was but one ethnic item on the menu. The decor ranged from high tech metallic to flea market specials. Then the slop served over the steak I ordered was there to mask the generous helping of fat and over cooked vegetables. The service was comparable to a county fair: inexperienced wait staff that...\n\n\nMore"], ["Perfectly Grilled Tuna encrusted with sesame seeds", 5.0, "May 19, 2015", "4000crichton", "Washington DC, District of Columbia", 29, 9, "I tried a new restaurant, despite the fact that it was empty, and ate the best Salad Nicoise I have eaten in Washington, D.C. I've lived here a decade, ordered it often, and often found the tuna dry- a sacrilege! In this salad, everything was perfect: the tuna was medium rare as I'd requested it to be, the olives were...\n\n\nMore"], ["I wanted to love it, but didn't even like it", 3.0, "May 18, 2015", "WFleet", "Washington DC, District of Columbia", 136, 54, "The location is excellent and the restaurant itself is really lovely, with inside seating that flows to the patio. The decor is well-designed. I was so excited to have another restaurant option in the Tenley/Friendship Heights area as there aren't a lot of great food choices in this area. However, both of my visits left me disappointed. First, the server...\n\n\nMore"], ["A Jewel of a Find", 5.0, "May 16, 2015", "Richatd K", "Washington DC, District of Columbia", 12, 8, "My wife and I were passing by last evening and liked the physical plant. We went into a delightful place, large comfortably spaced tables, very nicely (and expensively) decorated. The service was great and the food was delicious. I was in the mood for a pizza and it was very good. My wife had the trout in a light,\nbuttery...\n\n\nMore"], ["Mint juleps & the Kentucky Derby", 4.0, "May 2, 2015", "redhead1015", "Tampa, Florida", 70, 22, "Very good drinks, beautiful restaurant, plentiful, responsive staff, appetizers were good - though not Mediterranean to me- we did not try them but dessert looked amazing"], ["Nice lunch option in Tenleytown", 4.0, "March 25, 2015", "VanNessVoyager", "Washington DC, District of Columbia", 105, 88, "A friend and I visited Bread and Salt for lunch on a weekday. We were impressed. The menu had a good variety of lunch foods. I ordered the Ahi Tuna Salad - presentation was great, the ingredients were delicious, and the food was tasty. Also got a fresh baked cookie for desert, because there were so many enticing baked goods...\n\n\nMore"], ["AAffordable Lunch Venue", 4.0, "March 20, 2015", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Try the Ahi Tuna Salad (with great tomatoes) and the Chicken pot pie. Both are delicious.\nThen for to the bakery section and take some dessert home! Chocolate eclairs, brownies, rum ball, apple strudel. Yum."], ["Everything was delicious", 5.0, "February 13, 2015", "CathyCole", "Dallas, Texas", 121, 46, "On our way to tour American University, we were looking for a lunch place and happened upon Bread and Salt.\nThe service was great and the food was equally as good.\nWe had the omelette, pasta a la tenley, calzone, steak panini and an excellent Bloody Mary."], ["So delicious, I wanted to lick the plate...", 5.0, "February 1, 2015", "Eileen K", "Washington DC, District of Columbia", 7, 5, "My family in DC likes Bread and Salt and have been there 5 or 6 times. Yesterday was my third dinner there and it was delightful! The first two times I had the eggplant pizza - excellent though the 2nd time the large garlic halves were not necessary - the pizza is very good without them.\nYesterday evening I ordered...\n\n\nMore"], ["Needs some quick revamping", 2.0, "December 27, 2014", "BlueNWashington", "Washington DC", 341, 120, "Went to this new place for lunch (about 1:00 pm). The receptionist greeted me with \"Can I help you with something?\" Not a great signal about staff training. I was taken to a table for two in the almost empty restaurant---the table was covered with dirty dishes. The receptionist said, \"no problem, take the next table over\". During the 45-minutes...\n\n\nMore"], ["Shaky first impression", 3.0, "November 7, 2014", "Lotte F", "Washington DC, District of Columbia", 33, 7, "we,a party of three women, went there for the first time.Its a fairly new place, so I'll be a bit careful with my judgement.\nAtmosphere: lively, but not too loud.Modern,open and not very \"cozy\".TV sets showing sports on mute.\nService: friendly ( a bit too friendly,since I don't like to be touched on the shoulder or back by the waiter),but...\n\n\nMore"], ["Welcome newcomer", 5.0, "October 30, 2014", "rockwell121", "WDC", 170, 42, "Bread and Salt is just off Wisconsin Avenue, north of Public Tenley and Dancing Crab. Beautiful, all-new facility is surpassed only by its attentive wait staff and quality food. This is a welcome addition to the neighborhood and worth a cross-town trip."], ["Excellent start", 5.0, "October 11, 2014", "StevenBeller", "Washington DC, District of Columbia", 118, 39, "My wife and I went for dinner, and it was really very good indeed. Antipasto--excellent; steak frites--beautifully presented and very tasty (including the freshly sauteed courgettes); but the best of all were the desserts: My wife had a tarte au chocolat--she is an expert on things chocolate, and she loved it; I had \"La Brunoise\" which was a confection of...\n\n\nMore"]]], ["Native Foods Cafe", [["Good if a bit odd", 4.0, "October 11, 2015", "stonerose5", null, 183, 52, "Oops...didnt realise this place was vegetarian! Food was pretty good...I had a reuben sandwich and partner had a burger. We also had sides of potato salad and fries respectively which were OK. Bit odd that when we told the server we didnt want sides she said they were part of the original price...on seeing the receipt we realised they werent,...\n\n\nMore"], ["Good food.", 4.0, "October 10, 2015", "Kdm1061", null, 17, 6, "I'll give a 4 star because of the food, not because of the service. I had to re order after I already paid because what I ordered they didn't have it(My first wonder was why they didn't check first). The food itself was good but I did not appreciate the hassle to actually get the food. The location is really...\n\n\nMore"], ["Good for lunchbreak", 4.0, "September 22, 2015", "Sara B", null, 5, 0, "I sometime eat here during my lunch break. I like it very much and the service is fast. I recommend the portobello sandwich. Nachos are also delicious, but it is better if you share it with others (big portion). Give it a chance even if you don't eat vegan usually."], ["Excellent vegan food", 5.0, "September 19, 2015", "Mark H", null, 3, 2, "It's true that good vegan food doesn't have to resemble meat, but when you get that craving, this place is fantastic! I had a grilled \"chicken\" and avocado wrap. Delicious. Huge portions."], ["Inconsistent at best.", 2.0, "September 7, 2015", "michaelahlers", "Arlington, Virginia", 10, 0, "Up front, I'm a strict vegan and staunch proponent of animal rights. When I come across exclusively plant-based restaurants I can't help but to write a glowing review. Native Foods Café is, typically, no exception. I've dined often at several locations and their offerings are exceptional. That said--despite my universal enthusiasm for vegan restaurants--I'm objective. Management needs to take note:...\n\n\nMore"], ["Great lunch", 4.0, "August 25, 2015", "ClaireL81", "Manchester, United Kingdom", 57, 17, "We only realised this was a vegan cafe half way through ordering - not a problem at all but we are not even vegetarian. The food was very tasty and the portions are excellent. Nice iced teas as well which went down a treat on a very hot day. I'd go again."], ["A health and fun eating spot", 5.0, "August 19, 2015", "Timitraveler", "Washington DC, District of Columbia", 21, 5, "Tucked next to the Navy memorial on Pennsylvania Ave this vegan restaurant offers a wide range of fresh food choices. The seasonal menu choices allow for a rotating selection of food. Service is friendly with patient explanations of menu selection. Outside patio seating gives diners a pleasant view of the Navy Monument and people watching."], ["Worth a visit, at least to READ the menu!", 3.0, "August 18, 2015", "L-L F", "Boston, Massachusetts", 9, 3, "This café menu makes an effort to replicate foods that native American would have eaten. They are not uniformly delicious now, nor were then then, no doubt."], ["A pleasant, delicious restaurant!!! Not pretentious, first quality food.", 5.0, "August 8, 2015", "Manmap", "Hagerstown, Maryland", 123, 50, "My grandson didn't realize he had a vegan portobello and sausage burger until he noticed after the meal that the meat was vegan. My twister wrap was delicious!! If you get a chance to try the sweet potato fries, they are yummy as well.!! I will definitely be back!!"], ["Food Mediocre", 3.0, "July 18, 2015", "Tiffy_Bird", "La Plata, Maryland", 294, 185, "I have tried Native Foods Cafe at least three times for weekday lunches. I am not vegetarian, or even vegan, but I do like most veggies & try to at healthfully. I was very excited to see this open on the Navy Memorial Plaza. Yet I have been disappointed by the menu and its reliance on \"fake meat.\" If you...\n\n\nMore"], ["Very good food, Great service", 4.0, "July 14, 2015", "PMD53", "Richmond, Virginia", 7, 4, "This is what I would call good vegan food, fast. I am not vegan but impressive food and choices. Very friendly staff."], ["We love the food, however the service suffered on this day", 4.0, "July 11, 2015", "dewey.nikhu", "Delaware", 227, 116, "We visited here for dinner on July 4. The lines were long. The ice machine was down. A few tables needed to be cleared off. All the food was being served in to go containers even if dining in. It was so obvious they did not have enough staff here on this day. They had also run out of certain...\n\n\nMore"], ["I dig this place and I'm not vegetarian!", 4.0, "July 9, 2015", "Ayesha C", null, 26, 7, "I'm not vegetarian but this place has me hooked to its tasty 'chicken' ranch burger. And the fresh drinks they offer, especially the amazing blueberry-hibiscus tea and the watermelon fresca. Perf for summer!\nConfession: I actually thought the chicken was real chicken until I took my third bite and decided to inspect the burger LOL it was so good that...\n\n\nMore"], ["Yummy Vegan Food and Drinks", 5.0, "July 7, 2015", "Alexander A", "Sankt Polten, Austria", 87, 29, "On our short visit in DC, we didn't wanna spend too much time for lunch so we just went to the next café that we saw - and it happened to be the Native Foods Café. The lady who worked there, Jasmine, was one of the nicest and most helpful people I have ever met, we were literally blown away...\n\n\nMore"], ["I was shocked at how awful this food was", 1.0, "July 6, 2015", "Michele D", "Chicago, Illinois", 54, 14, "I rarely eat meat and I was so excited to try this. It was basically raw vegetables with a tasteless dressing and fake chicken tenders. Vegetarian food can be so much better than this. Prime lunch time and there were only tourists. That should have been a warning sign."], ["Delicious vegan fare next to Archives Metro", 4.0, "July 1, 2015", "VACanary", "Alexandria, Virginia", 23, 7, "Great place to grab a seat and delicious vegan fare. Easy to access--right next to Archives Metro. A bit noisier than the one at 18th and M, but food is every bit as delicious."], ["Excellent Vegan", 5.0, "June 30, 2015", "Shawndc5", "Washington, DC", 7, 26, "All vegan that is really tasty. The sandwiches are all well prepared, and the soups are delicious. The staff is friendly. The combinations on the sandwiches/wraps are quite good, and although the cold drinks are not very sweet, they are refreshing."], ["Delicious vegan food", 4.0, "June 23, 2015", "Katherine S", "Rockville, Maryland", 28, 1, "I ordered the \"chicken\" ranch sandwich, which was delicious! I told the cashier that it was my first time and she was very welcoming, explaining the concept of the restaurant. I have eaten lots of fake meat products, having been vegetarian for about a decade, but the \"chicken\" on my sandwich was phenomenal! Great taste, great texture. I also got...\n\n\nMore"], ["Good option for everyone", 4.0, "June 18, 2015", "Mo M", "Fayetteville, Georgia", 12, 7, "We stopped in this restaurant after a long day of site seeing. Our vegan family member was very happy to find this place and the rest of us were also pleased. Good sandwiches and soups. The have great lemonade and other drinks. Also had really good desserts. Right next to a metro station, so convenient access. I would definitely recommend...\n\n\nMore"], ["Not a vegan, but this place could change me!", 5.0, "June 12, 2015", "Kristina W", "Michigan", 7, 0, "Had the chicken bacon avocado and it was insanely good! Son had something else and his was great as well. Fries were great and there were many kinds of tea. Worth the stop, right off the metro at Navy Memorial station."], ["Very Good for a Quick Bite", 4.0, "June 3, 2015", "anniemh2o", "Washington DC, District of Columbia", 59, 28, "The food and service were above what I expected for a fast-food style vegan restaurant. I had an avocado wrap and some lemon-dill potato salad that was to die for. The house-made lavender lemonade was very good too. The option for beer and wine was nice to have as well. The great thing about this place, is that you won't...\n\n\nMore"], ["Unusual menu of salads/sandwiches", 4.0, "June 1, 2015", "H S G", "Macon, Georgia, United States", 129, 28, "A delecious Reuben sandwich of sourkraut and a mystery meat which tasted like corned beef. Unusual menu but it was good. 4/5. Service: Fast food restaurant with friendly, prompt service. 5/5.\nDecor: Looked brand new with immaculate, modern, beautiful uni-sex rest rooms. 5/5. Value: 4/5 $.\nWould I return? Yes."], ["Nice option for vegans or healthy eaters", 4.0, "May 27, 2015", "MFred", "Washington DC, District of Columbia", 41, 27, "Good portions, big flavors. Even regular meat lovers will find something to enjoy here. Plus they have a nice selection of fresh made teas, lemonades and frescas. A little pricey but good."], ["Plant based and tasty!", 5.0, "May 23, 2015", "3RedDoxies", "Fort Lauderdale, Florida", 411, 197, "Wish this chain would make it to FL! The food has lots of items vegans will love with veggies and tofu. But it also has many flavors that everyone could enjoy.\nThe Japanese crusted sesame"]]], ["Five Guys", [["Eh", 3.0, "October 2, 2015", "reddogsailor", "Reno, Nevada", 53, 39, "Ok. It's five guys so you know the burgers are good but I would really like to have seen a cleaner place to eat at. Seems typical of a place in the city though."], ["Try the Hots!", 4.0, "July 10, 2015", "J L", "Raleigh, North Carolina", 277, 68, "We got in just before a bus load of tourists...good thing! The service was kinda slow, but the hots and burgers were great. Easy to walk to several local attractions and a great place for a quick lunch. Try the cheese, bacon hot dog with onions!"], ["Always good", 4.0, "April 10, 2015", "latink", "Houma, Louisiana", 58, 29, "Tons of fries!! Perfect burgers!! Never disappoints! Not far from Nationals stadium! And close to the navy yard metro stop"], ["Good burgers", 4.0, "February 3, 2015", "BorkGordon", "Lexington Park, Maryland", 204, 86, "I ate hear after the winter classic on the way back to the hotel. The food was good and I got a ton of extra fries like usual."], ["Great burgers!", 4.0, "January 10, 2015", "Patrik D", "Malmo, Sweden", 164, 73, "After exploring the eastern parts of The Mall and The Capitol we set the goal for this restaurant. Washington DC was our first stop during our roadtrip en northeast US and Canada and we hade decided to visit this place in advance as we've heard good things about their food.\nAnd we were not disappointed! It might have taken quite...\n\n\nMore"], ["Great Burgers, fast Service, very clean", 4.0, "December 27, 2014", "Lenalein N", null, 98, 19, "We always liked Five Guys but this Restaurant is one of our favorites. It is very clean, the staff is friendly and fast and the Burgers are great. We usually order four different burgers and two portions of Cancun fries with drinks. We are always satisfied and leave this place happy."], ["Good burgers", 5.0, "September 24, 2014", "Barbara W", null, 4, 0, "Good choice of burgers , not long to wait for your order, also not expensive. The local police seem to like the food quite a few eating in there."], ["Five Guys is the BEST", 5.0, "September 2, 2014", "Slevinelaw", "Arlington, Virginia", 31, 24, "You cannot get a better burger anywhere. They say it and it's true! The fries are as good as the burgers. Beware those with peanut or sesame allergies."], ["Nice gluten-free option", 4.0, "September 2, 2014", "gtaylor05", "Panama City Beach, Florida", 67, 32, "It was really hard for me to find places to eat being new to eating gluten and dairy-free. Five Guys offers gluten-free fries and hamburgers without buns, placed in a bowl with all the toppings you want. It tasted great and it was close to our hotel!"], ["Taters and more taters", 5.0, "August 20, 2014", "Ed W", "Palestine, West Virginia, United States", 3, 3, "Place was spectacularly clean, not even greasy smell. Be careful though the fries are WahHoo, but very large quantities in an order. Suggest start with regular for two and if you still feel hungry, just get another small..... Large must be close to 3LB if wonderful taters, but unless you plan on taking them to mix with mayonnaise for Potato...\n\n\nMore"], ["Price keeps going up", 3.0, "August 1, 2014", "MichaelG65", "Silver Spring, MD (USA)", 27, 2, "Sadly, the price keeps going up so that the little burger is no longer a bargain. Eating peanuts helps to pass the time while waiting for your order."], ["Great burgers and Fries", 5.0, "May 22, 2014", "scott-in-Alaska", "Anchorage, Alaska", 24, 16, "You better be hungry if you go here! Pretty much any burger you can think of they will make. Fries are their signature, as they make them straight from the spud, and tell you from which farm the spud came from. Seriously, it was a really good place to eat!"], ["alot for the money", 4.0, "April 25, 2014", "jujubeewootwoot", "Pittsburgh, Pennsylvania", 56, 16, "I was very surprised how good the burgers were. I would eat there again, and the price was right, and the place was clean."], ["Buuurgers", 3.0, "February 26, 2014", "Wil-Jr", "Honolulu, Hawaii, United States", 19, 4, "It's 5 Guys, so the burgers are big and messy..just like I like them. It's not a big store at all but they get the job done."], ["$12.49 for a burger and soggy fries", 3.0, "January 8, 2014", "theriggfam", null, 146, 40, "You'd be better off at Wendy's or McDonald's as the wait was long and the quality was low. They don't go in order of who came in the door first, but rather by regulars. Was very disappointed."], ["Great burgers and fries", 5.0, "December 5, 2013", "AMB85", "Rotterdam, Zuid-Holland, Netherlands", 53, 14, "Great hamburgers, the fries were also delicious. Value is fantastic. This is central George Town, the space is rough and ready but does the job. Staff were polite. If you've not been to a Five Guys, it's definitely worth a visit."], ["Welcome hot food", 5.0, "December 2, 2013", "micheleielliott", "St. Pete Beach, Florida", 132, 60, "Sick of left over Thanksgiving turkey and stuffing, it was a good change to grab a hotdog at Five Guys - husband had hamburger. Fries were tempting but the desire to keep off a few more pounds won out so we said no thanks but the fried looked good. Our food was freshly cooked and delicious. I have never been...\n\n\nMore"], ["To all UK visitors", 5.0, "October 20, 2013", "ALISTER54", "Aberdeen, United Kingdom", 104, 73, "I am not a fast food fanatic and had to be talked into visiting a burger joint by a friend that lives local. Wow this is not a burger we get in the UK.... Make this part of your holiday and try it, you will absolutely love Five Guys.\nThe best fast food I have ever had."], ["Tasty burger...bring your appetite", 4.0, "August 27, 2013", "torleafsfan29", "Toronto, Canada", 21, 2, "Burgers were really good; grilled to order and weren't dried out at all. Fries are very much an acquired taste- they cook them to order so they were quite hot. A \"regular\" burger is actually 2 patties.\nIt's not fast food and they tell you it takes a few minutes to get your order ready. They have peanuts in the...\n\n\nMore"], ["Exactly What a Five Guys Should Be", 5.0, "July 19, 2013", "All-Fifty-2013", "San Jose, California", 54, 29, "Look, Five Guys serves up cheeseburgers, they do not serve health food. It is not a fine dining establishment. So within the context of that, if you want a cheeseburger and fries, seriously friend foods, they absolute deliver. They give you enough fries to sink a ship! I really appreciate the extended list of toppings you can get on your...\n\n\nMore"], ["Best burger/fry gut bombs ever", 5.0, "July 5, 2013", "Melmel79", "Bethesda, Maryland", 88, 52, "Great service, fries are awesome, burgers likewise, you can choose whatever you want on them and they have an impressive selection of options. They offer free peanuts that you can snack on while they cook your burger.\nThey have calorie counts for the health conscious too. Always had friendly quick service!"], ["Always a great burger!", 4.0, "June 18, 2013", "pnmbn", "Chicago, IL", 108, 27, "Good staple to have nearby! Five guys does a good burger.....and their fries are the best! Good service."], ["Awesome Burgers + Fries = Five Guys", 5.0, "May 27, 2013", "Diamond_Debutante", "Des Moines, Iowa", 147, 60, "My husband wanted to try this while we were in DC so we stopped by after our tour of nearby Nationals Park. We each ordered a cheeseburger with everything and decided to split a medium fry. We were starving and still couldn't finish all the amazingness! Apparently a \"cheeseburger\" is actually a double by any other restaurant's standards. A little...\n\n\nMore"]]], ["Potbelly Sandwich Works", [["Very fast and good.", 5.0, "July 11, 2015", "deltadwn27", "Oklahoma City, Oklahoma", 29, 7, "great sandwiches and lots of options. crowded but the crowds move in and out quickly. I found out I wanted to go back again before I left. Good bread choices and veggies too."], ["Salads looked awesome.", 4.0, "April 28, 2015", "Angela H", "Sanford, North Carolina, United States", 46, 41, "Tried their soup and natural fruit shakes for dessert. Not crazy about the cheddar broccoli soup - too thick, too cold and didn't taste homemade, but the shakes were great! Saw the salads as they went buy and smelled the applewood bacon cooking for their sandwiches. Next time I'm going to order a salad or a sandwich - with bacon!"], ["Surprisingly good", 5.0, "March 27, 2015", "fishheadflorida", "florida", 61, 38, "Stumbled on this place near our hotel. Came in near closing, kinda got the impression we were infringing, but maybe I was paranoid. They nailed the turkey on flat bread and the Oreo milkshake they had recommended. We wanted to come back but decided to eat at a new restaurant each meal while in DC. Small interior seating and some...\n\n\nMore"], ["Great fast food lunch option", 4.0, "September 22, 2014", "tikidream", "bethesda, md", 388, 110, "The sandwiches and salads are fresh and tasty. One of the few places you can get lunch for under $10 in downtown DC. Seating varies by location."], ["It was our last day in DC", 4.0, "October 30, 2013", "Flounder B", "Hayward, California", 293, 79, "The Secret Service had just shut down visitors from taking pictures in front of the White House. So we opted to have lunch prior to our departing flight home.\nYou step into a turn-of-the-century country store atmosphere with plenty of collectibles. Personally, I enjoy the days that have gone by. It reminds me when life was simple and folks knew...\n\n\nMore"], ["Typical potbelly", 4.0, "October 26, 2013", "James G", "Thunder Bay", 183, 57, "Wanted a late supper of soup and sandwich - unfortunately only one type of soup left that late -- wife and i both had different sandwiches -- hers was the turkey - i had the wreck -- mine was ok - hers though was outstanding -- so hence the middle of average and excellent rating -- have had better sandwichs...\n\n\nMore"], ["Great and Fast", 4.0, "September 4, 2013", "TN-bigphil", "N.E. TN", 75, 12, "Went for lunch. It was very crowded but got in and out very quickly. Everything was very fresh and tasty."]]], ["Au Bon Pain", [["Fast breakfast", 5.0, "July 1, 2015", "Jeff W", "Annapolis, Maryland", 202, 54, "Love love love their coffee! Best reason to stop and also fantastic pastry. One of the few chains worth a review. I get bagel sandwiches elsewhere, pastry is their best item."], ["Good Inexpensive Fare", 5.0, "December 29, 2014", "dakota1956", "Washington DC", 92, 38, "This is my go-to place for lunch. Excellent selection of soups that rotates daily -- medium size is $4.30. Salads are $7, nice selection. The quality is even, no matter what location, and there are dozens around DC!"], ["Great Selection for fast casual food", 4.0, "October 22, 2014", "Darryl L", "Marana, Arizona", 119, 53, "We ate at several Au Bon Pain restaurants, even one in the Dallas Fort Worth airport. Surprising inexpensive and serving fresh food, I can give them a very high recommendation.\nTry the soup, it is excellent, but be careful. There are two bowl sizes but you have to look carefully when you select the cardboard soup bowl container before you...\n\n\nMore"], ["Good value", 4.0, "August 9, 2014", "Sarah W", "Wolverhampton, United Kingdom", 39, 15, "We had two large muffins for $4 and two large hot chocolates. Lots of choice on drinks and cakes. Great for a midday snack."], ["a good cup of coffee", 3.0, "June 15, 2014", "5fishes", "Dallas, Texas", 41, 11, "and a treat for the day. Liked that coffee and a breakfast sandwich could be had for under $10. eggs are precooked then sandwich is assembled. one day, our eggs were still cold even though cheese was melted."]]], ["McDonald's", [["yes its mcdonalds", 3.0, "October 7, 2015", "happytraveler41706", "Newburyport, Massachusetts", 30, 5, "it is what it is, fine for fast food and you know what you are getting since it is the same that you get at home. Good, clean and decent. Not exciting, but, for the price, it may fit!"], ["Hey, it's McDonald:s", 5.0, "September 1, 2015", "Wil K", "Washington DC, District of Columbia", 21, 1, "A Big Mac tastes the same the world over!\nOrder a double hamburger with shredded lettuce and Mac sauce - voila!\nA \"poor man's\" Big Mac!\nYeah!"], ["Quick service", 4.0, "August 25, 2015", "Richard R", "Los Angeles", 107, 84, "Nice quick service. Clean and cheerful employees. Nothing bad I can say at all! Make sure you ask for catsup."], ["Convenient", 3.0, "July 25, 2015", "hmeschoolr", "Nashville, TN", 12, 26, "Convenient for a cold drink in the summer but not the cleanest. A lot of construction work was going on and that seemed to be their clientele?? We stopped in there once around 4pm so maybe it was the time of day??"], ["No surprises", 5.0, "July 18, 2015", "Larry G", "Washington DC, District of Columbia", 6, 0, "McDonald's in Air and Space Museum is convenient, attractive, clean and reasonably priced. I've enjoyed it several times in my many years in DC."], ["Huge capacity and fast service at Air & Space Dulles", 5.0, "June 21, 2015", "fastman83", "Jacksonville, FL", 205, 98, "We visited Air & Space Dulles and found this huge McDonalds adjacent to the Gift shop. Food was off the full normal McDonalds menu and there were enough cashiers to handle the large crowds."], ["Poor Service - Poor Food", 2.0, "June 12, 2015", "Chad C", null, 11, 3, "I visited this location twice in one week for breakfast. Each time staff was discourteous in the food did not taste fresh (as fresh as McD normally tastes)."], ["Always dependable", 4.0, "May 29, 2015", "Janis K", "Cleveland, Tennessee", 51, 11, "McDonalds is always dependable for those who are in a hurry. Love the sweet tea and chicken wraps with fresh vegetables. Great location near the Holiday Inn Capitol."], ["Surprising", 3.0, "May 28, 2015", "GailB B", "Millom, United Kingdom", 50, 19, "I've never liked McDonald's and don't usually go in. However the food at the hotel was top price and pretty poor so we wandered in here for breakfast. I was most surprised that for less than $10 we both ate a reasonable breakfast. We went back again the next day!"], ["A+++", 5.0, "April 27, 2015", "TheFloridaAdvisor", "Lake Wales, Florida", 262, 149, "Service, speed, locations, and prices all very great!\nDC is a city with amazing sights, mostly free. However, parking is the worst I've ever seen in the entire East coast, except NY.\nFood prices in DC were also more than astronomical.\nPlaces to eat are also, especially on Sunday, nearly impossible to find."], ["Fast food", 3.0, "March 24, 2015", "RovingCOO", "Lombard, Illinois", 864, 179, "It was fast. The fries were very hot and salty so that was good. One weird thing was that they gave me a bottle of coke instead of a cup. I have never seen that before. Just regular old McDonalds otherwise."], ["It is what it is", 4.0, "November 29, 2014", "longhair9", "Proud to be British", 81, 40, "Like all other McDonalds, we used this once or twice for quick snacks. Nothing different but perfectly adequate for our needs."], ["great location good service", 4.0, "November 28, 2014", "joyce b", null, 31, 17, "great location 1/2 block from holiday inn capitol. good service, good quality. did a nice job of keeping lines moving and getting orders filled quickly and correctly. newly remodeled. friendly staff."], ["Convenient and Fast", 5.0, "August 23, 2014", "Ljsjayhawk", "Kansas City", 28, 12, "Just down the street from our hotel. We grabbed breakfast here on most days and had dinner here a few times when other places were closed. They were very efficient and quick with getting orders filled."], ["So convenient", 5.0, "August 11, 2014", "Marg L", "Louisville, Kentucky", 41, 12, "This McDonald's is just a couple of store fronts away from the Holiday Inn Capitol, which made it easy for us to grab a light dinner after a huge lunch one day. The staff was friendly and the meal was good."], ["The cheapest Big Mac combo", 4.0, "August 6, 2014", "Tadpolewizard", "Brasília", 62, 66, "For just $5, the cheapest Big Mac combo I ever had. In NYC, this is the price for just the sandwich and the fries. Could have more seats - I don't like the tall benches they have, if I wanted them, I'd go to a bar - I went to the one beside the Food Court, on Pennsylvania Av., next...\n\n\nMore"], ["Nobody will ever truly beat McDonald's french fries", 3.0, "July 30, 2014", "JanetMcE", "Washington DC, District of Columbia", 80, 29, "If all you are looking for is familiar, this is just fine, but when you are in a city with such diverse food options - keep on walking.. Again, nobody will ever truly beat McDonald's french fries but if you're visiting the city and not accompanied by little ones insisting on a Happy Meal, make yourself happy and ease on...\n\n\nMore"], ["Really", 1.0, "May 20, 2014", "Ken P", null, 4, 1, "I'm not really sure how McDonald's can rank higher than most of the restaurants in Washington DC. If you were really a traveler here and visiting the DC area you would understand there's many many more options to choose than McDonald's. It's ridiculous to see the ranking on Trip Advisor. It makes me not want use this app! This is...\n\n\nMore"], ["Great visit", 5.0, "May 14, 2014", "ironfox", "Bogota, Colombia", 25, 35, "Fast and friendly service. Serve yourself drinks. Strange that you have to go to the counter for napkins, but otherwise fine. Cool A/C."], ["The worst McDonalds Ever", 1.0, "May 12, 2014", "Vanessa-NC", "North Carolina", 60, 26, "I usually don't expect alot from a family/fast establishement, but this was the nastiest/Filthy McDonalds I have seen in all my life. They were out of everything and they were napkins and toiliet paper laying out all over the floor. I was embarrased as there was a foreign family beside us and I hope they don't think all Americans were...\n\n\nMore"], ["Consistent", 3.0, "March 31, 2014", "penntrainer", "Georgia", 259, 102, "Offered full franchise menu onsite inside and outside of the National Air and Space Museum. Reasonable prices."], ["Good and Fast Service", 4.0, "November 22, 2013", "maximuspro", "carbondale", 4, 3, "Mc Donalds menu is pretty straight forward. the staff were friendly, fast efficient and quick to accomodate any specific requests"], ["SWEET TEA", 3.0, "September 3, 2013", "Kevin B", "Niagara Falls, Ontario, Canada", 12, 2, "The food was typical of McDonald's, but If you order sweet tea it is SWEEEEET. We could not drink it. We even tried to water it down but it did not help."], ["A little scary... the derelicts hang around inside and outside", 3.0, "August 15, 2013", "scienceguy2001", "Yuba City, CA, USA", 52, 27, "We had two meals here and they were both fine. The staff was helpful the first time and bored the second time. There were people just sitting there ... staring at us ... and staring at us... uncomfortable. Outside is construction so one must be careful. We stayed at the Holiday Inn a block away so the was an easy...\n\n\nMore"], ["PLEASE do not eat here", 1.0, "July 30, 2013", "TexasInd", "Columbus, Ohio, United States", 18, 6, "Don't know the exact location name, but it's 2 blocks from the Residence Inn Capital (en route TO the Mall)..bored discourteous\nand raw chicken/terrible Mac/cold hard fries/junkie sleeping in the flooded bathroom/puddles surrounded coke machine....\"Oh yea\" and didn't move the entire time we were there (20+ minutes)"], ["One of the worst", 1.0, "July 28, 2013", "julibeth", "Meadville, PA", 118, 88, "My husband and I ate breakfast here on Sunday morning of July 28, 2013. I ordered 2 milks with my breakfast, and paid for them. We had to wait for the order, which was not an issue. When the server gave us our order, there were no milks. Instead they had put milk in my husband's coffee (he drinks it...\n\n\nMore"], ["Very good", 4.0, "July 23, 2013", "LeVorna C", "Havelock, North Carolina", 7, 3, "I was thoroughly pleased with the location and cleanliness of this restaurant. I was here for class and it was nothing more than a few feet away to get a quick meal."]]], ["Terasol", [["Excellent French Bistro", 5.0, "August 31, 2015", "AlreadyBeenThere", "Knoxville", 72, 36, "4 of us celebrated a family birthday. What a fun evening we had. French onion soup was phenomenal. Wait staff was prompt. They kept bringing their excellent bread to our table. We shared our meals with each other because they were all so good. Then we got desserts, all different, shared again. What a fun evening! Definitely come back to...\n\n\nMore"], ["A touch of Europe surrounded by fastfood.", 4.0, "August 9, 2015", "BermudaCbear", "Bermuda", 31, 9, "Nice ambience in a semi-residential neighbourhood. The restaurant doubles as an art gallery and also sells various \"arty\" yet tasteful items. Weekend nights include live music.\nIt closes a little earlier than most other things in the area but the food is freshly prepared and may be limited. Food is good, servings more than adequate with a good but reasonable...\n\n\nMore"], ["Good for desserts", 2.0, "August 1, 2015", "Igor S", null, 10, 28, "Had French Onion Soup, Salad Nicoise, and Chocolate Bread Pudding. I am not expecting Paris-quality Onion Soup in DC, but it was worse than French Onion Soup in cafeteria at my work! Salad Nicoise was lacking olive oil big time. Chocolate Bread Pudding was the highlight of the dinner - really, really good."], ["Mediteranian Charm in a local bistro!", 3.0, "July 27, 2015", "shetown12", "shepherdstown wv", 135, 46, "Quiet, neighborhood hangout. We were guests of a local, and as such, I truly expected better service. The restaurant was not busy, and yet we had to repeatedly ask for wine and bread refills. And the bread was to die for, so I don't understand being so stingy with it! That being said, the cheese platter was appealing, and the...\n\n\nMore"], ["Goo food, with a confused staff", 3.0, "July 22, 2015", "Wolfgang3002", "Washington", 56, 18, "Terasol, relatively new, on a busy street, is worth a visit for the food, if not for the most confused staff. The quiche was excellent as was the moule, but the most pleasant surprise was the bread, which is often uninteresting at most restaurants. If the weather allows, I would recommend sitting at the outdoor tables. Despite few customers on...\n\n\nMore"], ["NEIGHBORHOOD GEM, GOOD FOOD, QUIET & CRAFTS TOO!", 4.0, "June 12, 2015", "Lois C", "Bethesda, Maryland", 152, 29, "Having checked in advance whether the kitchen can accommodate to my salt-free diet, I was eager to dine with friends in a setting where we could hear each other's conversation. Indeed, the outcome was very pleasing and the food was tasty, beautifully presented and plentiful. Especially enjoyed the chocolate mousse dessert. Most of all I want to thank the chef...\n\n\nMore"], ["Sidewalk French Bistro", 4.0, "June 6, 2015", "RocketReview4U", null, 24, 6, "Charming French Bistro with sidewalk seating on NW Connecticut right across from Politics & Prose. Simple,quality, fresh and authentic French cuisine. The decor inside is a little like a thrift store, but the pleasant wait staff make up for the quirkiness of the art."], ["Two salads", 3.0, "June 4, 2015", "juangabriel26", "Bogota, Colombia", 10, 4, "I asked for a beet salad and a blue cheese quiche. I didn't know the quiche came with a salad. So, i ended up with two salads. Both plates tasted well, yet i was left with the impression that the maitre was so much in a rush to take my order that he overlooked what i asked and didn't take...\n\n\nMore"], ["Two Salads?", 3.0, "May 30, 2015", "Beth R", "Washington DC, District of Columbia", 28, 8, "I was debating between the red pepper soup or a salad as a starter. I got the salad and a sandwich which ended up coming with a salad. It would have been nice if the server had told me (and my friend) because we were disappointed we didn't get the soup starter and didn't touch the second salad. The panini...\n\n\nMore"], ["Surprisingly Veg-friendly French Restaurant", 4.0, "May 22, 2015", "Amy Dara H", null, 27, 9, "Two neighbors (both vegetarian) and I (a vegan) spontaneously decided to dine here upon noting the menu options. The server informed us which items were vegan. The service was attentive but not overbearing, and the food was excellent, although I felt that the timbale de legumes was overpriced."], ["Spectacular hidden gem", 5.0, "May 11, 2015", "Mamasnotcooking", null, 34, 18, "We had a large group scheduled to celebrate a graduation (ON MOTHER'S DAY NIGHT!), and this restaurant left no stone unturned for our happiness. The food and service were outstanding, the personal attention to detail was amazing, and we felt pampered, indulged and very special. The bread pudding is something I will continue to dream of (and use as the...\n\n\nMore"], ["A very pleasant night out with a friend", 5.0, "May 10, 2015", "redhead1015", "Tampa, Florida", 70, 22, "I went to dinner here with a friend. For appetizers we shared a serving of lamb sausage and mushrooms and wine sauce, enough for two and very good. We tried two different salads that were delicious. I had the shrimp Cesar, which had a lot of fresh, large shrimp and was very good. My friend had the salad special and...\n\n\nMore"], ["Paris on Connecticut Avenue", 5.0, "April 20, 2015", "BetsyLex", "Washington, D.C", 24, 7, "This charming little bistro has good food, a welcoming feel, and art and music. The ingredients are fresh and the dishes well-prepared. Such a welcome addition to our neighborhood. Some posters have complained about slow service. I've never found it to be a problem, but I'd also suggest that the relaxed atmosphere is part of its charm. Paris-style service, not...\n\n\nMore"], ["Always Reliably Good Service", 4.0, "April 7, 2015", "littlemac4", "Washington DC, District of Columbia", 75, 34, "Early on a Friday evening, there was live music! We were concerned about the noise as they set up right behind us, but it was quite pleasant. Service is great. The mussels were a bit small though. I have had the quiche and it has always been very good. A great neighborhood restaurant."], ["Convenient to Politics and Prose, not a great restaurant", 3.0, "March 17, 2015", "StLawrencelover", "Washington, DC", 189, 76, "I went for lunch with a fiend after a visit to Politics and Prose! We were seated promptly and given menus and water, and then bread (excellent bread.) Then we waited quite a while for the server. Granted, she was the only server in sight but it was too long. We both ordered the Salade Nicoise. I chose tuna and...\n\n\nMore"], ["Decent Brunch, But Not Worth Going Out of your Way", 3.0, "February 8, 2015", "DD S", "Alexandria, Virginia", 62, 15, "This is a decent neighborhood spot for brunch, but the small dining room is very cramped and service was extremely slow. We didn't even get our coffee until we had been there for 45 minutes. The brunch selection is rather limited. The Bloody Marys are quite good and spicy though! Perfectly poached eggs and delicious bacon."], ["Breakfast Surprise", 4.0, "December 28, 2014", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Dropped in on a Sunday morning (when nearby Jake's said they could not accommodate us because they had only one waiter show up for work-poor Jake's) and had a fine breakfast experience. Recommend the spinach omelet. My favorite: 3 wonderfully moist and buttery scrambled eggs (most restaurants will offer only two and most cooks don't know how to do scrambled...\n\n\nMore"], ["Uninspired and bland", 2.0, "November 12, 2014", "dr_austin", "Chevy Chase, Maryland", 8, 12, "If you are looking for good french cuisine, you're in the wrong place.\nIf you are looking for good ambiance, look elsewhere...\nThe restaurant looks like my daughter's kindergarden: a small room with cubbies to the right and low, cheap tables and chairs.\nWell, the cubbies were not to deposit our stuff, they were displaying some artisan pottery work, which...\n\n\nMore"], ["Good French food in small neighborhood place", 5.0, "November 11, 2014", "BostonRedSoxNation", "Boston", 51, 21, "Very traditional French menu, well done all around. Nice wine menu. Attentive service (some reviews complain of slow service, but not a problem for our visit tho' on a Sat nite). Combination restaurant and gift shop, interestingly. We wondered if the coffered ceiling is real tin, or if not how it was made!"], ["A Neighborhood French Bistro", 5.0, "November 11, 2014", "Richatd K", "Washington DC, District of Columbia", 12, 8, "Terasol is a real addition to our neighborhood. When looking at a restaurant you want good food, good service and friendly staff.\nAlan and his lovely wife, Sabrina (a Parisian) have hit 4 1/2 to 5 on all those criteria. The staff is outstanding and accommodating-if something is not to your liking (rare), it'll be taken care of quickly and...\n\n\nMore"], ["Excellent choice", 4.0, "November 6, 2014", "JChused", "Washington, DC", 20, 25, "This is a simple place with simple yet absolutely delicious food. It's a great place to go for lunch or for a dinner before or after a reading at Politics and Prose. Price reasonable, dress casual...just fun."], ["A Very Good French Bistro at American Prices", 4.0, "October 14, 2014", "Jonathan R", "Washington, District of Columbia, United States", 196, 62, "Having just come back from Paris, my wide and I stopped by Terasol partly out of nostalgia and partly just to find a quiet place for lunch. We'd only had brunch there some years ago, so it was a treat to find that Terasol has an excellent lunch menu. I was pleased with my onion soup (not too salty) and...\n\n\nMore"], ["Quaint French Restaurant!", 5.0, "September 24, 2014", "terriv53", "Libertyville, Illinois", 13, 2, "This is a restaurant with delicious food! We usually stop for breakfast every time we visit the DC area. The ingredients are great. We have always had a great meal. Coffee is served in a french press and is great! Service is very good!"], ["Disappointed on last visit", 2.0, "September 20, 2014", "Didi L", "Annapolis, Maryland", 30, 10, "A last attempt to eat at Terasol was wrapped in an odd disappointment. Previous visits with different groups of friends (and dining alone) have been pleasant and warm. Be warned that\nthough the website lists hours as 11a to 9p, with a menu shift for dinner at 530p, we were brusquely turned away at 4-something pm.. The comment delivered with...\n\n\nMore"], ["Neighborhood gem", 5.0, "August 2, 2014", "DCNative61", "Washington DC, District of Columbia", 6, 1, "We go quite often to terasol. The food is very good bistro fare, a fy good and well priced wine list, and great staff who care about the food and the customers. We are working on becoming regular patrons."], ["French bistrot and local gallery", 4.0, "May 12, 2014", "pmr2", "Washington DC, District of Columbia", 145, 51, "It bills itselt as a French bisto and artisan gallery, and so it is. I had lunch here with a friend on a weekday and, as it was a hot, sunny day, had the salad nicoise, my friend the quiche lorraine. I had the option of tuna or salmon, and went with the latter--a good choice as it was slightly...\n\n\nMore"], ["one of our favorites", 5.0, "April 17, 2014", "Jillnt6772", "Bethesda, Maryland, United States", 115, 50, "This little, funky, small restaurant serves some of the best food around. We go on Friday nights to hear live music. The service is excellent too."], ["Great Neighborhood Feel", 4.0, "March 25, 2014", "littlemac4", "Washington DC, District of Columbia", 75, 34, "A small restaurant with a personal feel. Excellently prepared dishes, quiet atmosphere great for conversation. Easy on-street parking is an extra plus."], ["Bistro on Connecticut Ave", 4.0, "March 5, 2014", "Clay W", null, 83, 14, "A small place in our neighborhood. Crusted swordfish and Steak and Frites tasty. 1/2 price bottle of Pinot Noir helped to wash it down. Delicious chocolate mouse. Good place for conversation. Mirrored walls make it seem bigger, and can be distracting: those people look like us: wait a minute, it is us!"], ["Delightful meal", 4.0, "January 24, 2014", "LoveThatView", "Washington, DC", 44, 42, "On a frigid January night, we were delighted to enjoy the warmth of Terasol. This cozy French-style bistro was just the ticket before an event at Politics and Prose, which is directly across the street. The chicken soup, served in a crock, chased away winter blues as did the generous serving of steaming bouillabaisse. Add a glass of wine and...\n\n\nMore"], ["A solid 3.5", 3.0, "December 22, 2013", "baysail", "Takoma Park, Maryland", 70, 32, "This is a good restaurant and one that we plan to return to. It has a nice ambience and good if not distinguished food. The salmon wrap goat cheese was tasty if a bit plain. The salad and dressing that went with was excellent. We had the cod and the salmon entrees. In both cases the fish was a day...\n\n\nMore"], ["Good Food, Casual Dining", 4.0, "December 18, 2013", "littlemac4", "Washington DC, District of Columbia", 75, 34, "Wonderful neighborhood restaurant with a casual feel. The small dining room includes displays of crafts and small items for sale at the front. A wall of mirrors gives the dining room a larger feel. Although small, the tables are far enough apart so you are not sharing your conversation with others. The French menu options are very good. A nice...\n\n\nMore"], ["Consistently Really Good", 5.0, "December 8, 2013", "CA-MR", "Maryland", 26, 33, "We’ve eaten brunch or lunch here about 7-8 times and it is consistently really good. Their croissants are some of the best anywhere. Quiche, french toast, and lentil salad are some of my favorites. I’ve never seen it crowded, so I hope more people go because it is a local gem."], ["Great bistro in D.C.", 5.0, "November 7, 2013", "MGE711", "Saint Helena CA", 6, 2, "An under-the-radar local eatery with terrific French bistro food. Terrific lamb chops, French onion soup. Interesting French wine list."], ["TRULY DELICIOUS!", 5.0, "October 23, 2013", "Cholstc", "D.C.", 15, 26, "I was invited by my family to Terasol, as it's in their neighborhood (near Connecticut and Nebraska Avenues in Northwest D.C. and it was a revelation. The restaurant itself is very pleasant, but it was the food. Ah, the lobster ravioli... moist, with real chunks of lobster, in that nice creamy light tomato sauce, with fresh spinach. The tangy blood...\n\n\nMore"], ["Great ambiance", 5.0, "October 20, 2013", "Durham123", "Durham", 46, 16, "Stopped in for dessert one evening. Fabulous crepes and my fellow diner had the featured dessert which was a work of art. If I was one of those folks who posts photos of my food--this would have been it. Oh, and did I mention these dishes also tasted great! Nice selection of hot tea--including some unusual caffeine free choices beyond...\n\n\nMore"], ["One of the worst steaks I ever ate", 1.0, "October 4, 2013", "finny123", "Tshwane, South Africa", 105, 79, "I am so sorry to write this review because I really like Terasol. At least, I mean I like the atmosphere, the owner, the decor and the fact that it's a local for me. I have eaten lunch here once and it was nice, quiche, salad etc. It's got a nice outdoor area. It was recently voted Open Table's neighborhood...\n\n\nMore"], ["neighborhood \"French\" restaurant", 3.0, "October 3, 2013", "Dr_J_F_M", "Bethesda, Maryland", 113, 38, "This small restaurant that also sells crafts is popular in the neighborhood. It isn't very French although our waiter tried to use a few French words, all of which he mispronounced. He must have been new, for the regular wait staff were swifter with our questions. We enjoyed a fine cheese platter of 4 very tasty cheeses, although none were...\n\n\nMore"], ["Delicious and Great Service", 5.0, "September 24, 2013", "EmGusk", "Washington DC, District of Columbia", 23, 15, "Love this cute neighborhood place. Great service from an attentive staff member, delicious steak frites, and just a wonderful ambiance. When you sit out on the sidewalk, you almost feel like you're on vacation, even though you're sitting on Connecticut Avenue."], ["Charming local restaurant", 5.0, "July 23, 2013", "Robbie K", "Vienna, Virginia, United States", 6, 4, "We eat at so many chain restaurants that it is always a pleasure to dine at a local restaurant. The ambience is charming as this restaurant is also an artsy gift shop. The menu had something to offer everyone and the portions were plentiful. The pricing was less than we pay in the Northern Virginia suburbs. We ordered the salmon...\n\n\nMore"], ["Worth a visit- or a re-visit", 4.0, "June 24, 2013", "Kate3717", "Lexington, Kentucky", 142, 103, "We were unimpressed with our first visit to Terasol a year ago, but neighbors started reporting that it had undergone an overhaul and was worth a re-visit. That turned out to be good advice-we have since gone for both dinner and lunch (inside and out), and have come away really pleased. The mussels were excellent- lovely and fresh. The quiche...\n\n\nMore"], ["Post wedding dinner", 4.0, "May 21, 2013", "upstateny", "upstate ny", 12, 17, "Great meal after a mid day wedding. Our waiter (Dennis) was highly entertaining. Food was better than average."], ["Hidden Gem", 4.0, "May 7, 2013", "TEAM-UP", "Minneapolis, Minnesota", 11, 5, "An unpretentious but excellent French bistro/cafe that offers friendly service and authentic French classics. along with other delicious menu choices! Pair it with Politics and Prose, and you have a wonderful afternoon or evening adventure!"], ["Delightful. Charming!", 5.0, "April 22, 2013", "lifecoachdoc", "Bethesda, MD", 8, 5, "Right across the street from Politics & Prose, so go to an author evening, or browse this wonderful bookstore, then treat yourself to a meal @ this absolutely delightful neighborhood gem. Went to Cork in DV Friday. Ignt w/friends--way too noisy & full of 20 & 30 something's only (we're baby boomers). Sat. night, friends scored reservations at the hot...\n\n\nMore"], ["Unassuming but excellent!", 4.0, "March 21, 2013", "calderwatson", "washington d.c.", 8, 3, "Terasol is easy to miss, but don't walk by it. In the windows are art and pottery from local artisans, but the restaurant is in there, behind the crafts. This is excellent, casual, French bistro food, not pretentious, but delivers every time. We find the staff friendly and warm, service can get a little slow on busy nights, but it's...\n\n\nMore"], ["Cuisine Classique (Good Eats)", 5.0, "March 12, 2013", "Peter K", "Chevy Chase, MD", 109, 73, "Terasol--actually Terasol Gallery & Café--is an unpretentious little star among Washington's resurgent, authentically French bistros. It is indeed a gallery, too. Shelves along the walls are decked with local artisans’ pottery, jewelry and objets d'art. That’s a worthy diversion when you’re waiting to eat. But it’s a rare pair of ceramic earrings that can match the gems that arrive on...\n\n\nMore"], ["Tasty", 4.0, "February 17, 2013", "thewilsonswanderings", "Washington DC, District of Columbia", 60, 57, "Fun little neighborhood venue with good French/American brunch items. And as the title states, it was tasty!"], ["Surprise!", 4.0, "January 23, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Terasol has recently updated its menu-providing an eclectic mix of traditional French (onion soup, jambon et fromage, croque monsieur, several types of quiches, moules) and American style breakfast at brunch. Quaint decor, friendly service and civilized background music complete the tableau. As an added attraction, a small gallery provides collectibles, soaps, etc. A fun alternative to its rowdy neighbor down...\n\n\nMore"], ["Cozy, intimate, FANTASTIC food!", 5.0, "December 11, 2012", "my3gems", "Boston", 6, 4, "I dined with my daughter on Friday morning, Dec. 7, 2012 at Terasol at about 9 a.m. We were preparing for a full-day of apartment moving, so this breakfast was the best way to get started. First off, the staff was wonderful - we were the only ones there (it was a work day!) and took a seat by the...\n\n\nMore"], ["Great local restaurant", 5.0, "December 11, 2012", "Eric_W844", "Washington, District of Columbia, United States", 69, 14, "Terasol is a great local restaurant that has recently come to our neighborhood. French style with wonderful fish stew and mussels. Fresh bread alone is a meal. Good wine list too."], ["Yummy....", 5.0, "November 15, 2012", "PrinceT1", null, 4, 3, "We did not expect the menu to be as extensive and varied. Love everything we ordered. A must visit for breakfast and/or lunch."], ["Pleasant Neighborhood Respite", 4.0, "November 11, 2012", "rockwell121", "WDC", 170, 42, "4 of us enjoyed a top-flight meal here on a busy Saturday night. Service was a little confused at first but cheerfully righted itself for a smooth dining experience. Asparagus soup, beet salad, scallops, filet mignon, cod, chocolate mousse, and pear frangipane tart were all excellent. Solid wine list and as-ordered cocktails complete the experience. Cement floor adds to the...\n\n\nMore"], ["Very Pleasant Surprize", 4.0, "November 5, 2012", "SueandBoots-Moriarty", "Rockville, Maryland", 3, 0, "We chanced on Terasol through referal from Politics and Prose bookstore. It is a small unassuming locale from the outside, but warm, with French decor inside. The food is excellent. I had the Bouillabaise and it was delicious. The service was accomodating and friendly. We will definitely return in the near future."], ["Sunday evening surprise!", 4.0, "October 31, 2012", "cedangeles", "Washington, DC", 69, 30, "This was our first time to dine in Terasol. For a neighborhood artisan bistro, the food was surprisingly good. Service was quick, perhaps, because there were only a few diners that Sunday evening. The bouillabaise on the menu was cream-based yet the kitchen accommodated my husband's request to have a tomato-based version which was delicious. My rack of lamb was...\n\n\nMore"], ["Pizza to die for", 5.0, "September 14, 2012", "e2trainer", "Glasgow, United Kingdom", 31, 54, "The service is great the food super, just leave a little for the tiramasu well worth it, try the pizzas well made and very tasty and if you cant finish it they will give it away from you"], ["Bright, attractive, good neighborhood", 3.0, "July 23, 2012", "EllKell", "Maryland", 47, 102, "French decor with pottery and jewelry for sale, café with linen tablecloths. Had time to kill on a very hot day before an appointment, so I ordered a white wine spritzer. Friendly, young server/bartender. Economically advantaged housewives lunching."], ["Paris in Chevy Chase", 5.0, "July 12, 2012", "BetsyLex", "Washington, D.C", 24, 7, "Terasol is exactly what's missing from most of D.C. -- a small, family-owned cafe with authentic French classics. If you like chain restaurants, you won't be happy here. But if you want to dream (or reminisce) about a trip to Paris (or the French countryside) over a glass of Burgundy and tasty but unpretentious French food, I highly recommend Terasol....\n\n\nMore"], ["Nothing Special", 3.0, "March 31, 2012", "trvladdict", "Washington DC, District of Columbia", 332, 282, "I wanted to like this cafe because of the unique addition of a local artisan gallery and its attractive entrance. Instead, I had average food in a bland atmosphere. Once you get past the entrance, its just another average cafe that serves an ok lunch."], ["Sweet little cafe with a brief menu of French brasserie classics", 4.0, "March 25, 2012", "Amanda F", "Washington DC, District of Columbia", 15, 10, "Like croque monsieurs? Salad nicoise? Baguettes with chèvre? Then you'll probably love this quiet, French-influenced cafe. (If you're looking for burgers & fries and TVs, head next door to Jake's American Grill instead). We have had a nice lunch here three times now. Service is not always speedy, and we wish the prices were a bit lower, but overall we...\n\n\nMore"], ["Little food appeal", 2.0, "January 24, 2012", "BlueNWashington", "Washington DC", 341, 120, "Small menu with immodest prices. Sandwiches and soup mainly, with nothing much to recommend them. Service is very erratic, starting with the owners. Place seems to be popular with book groups, PTA planners, etc., but not a place to go with a date."]]], ["Absolute Noodle", [["Great place for lunch", 5.0, "October 11, 2015", "Tom A", "Alexandria, Virginia", 7, 1, "7 of us had lunch here on Sunday afternoon. We all had different items and no one was disappointed. Sushi was out of this world. We recommend any of the noddle dishes. Great price for plenty of food."], ["Good place ... stop in.. check it out..", 4.0, "August 4, 2015", "pyrsandplanes", "Chester County, PA", 51, 21, "Cute little place tucked away near the fairfield inn. We walked to the restaurant, good luck finding parking! Funky diverse asian themed menu, Wife liked the gluten free choices, kids and I liked the Sushi rolls and soup. Reasonable prices for DC, attentive service. A lot warm in teh dining room, but it was a hot evening. Bathroom was VERY...\n\n\nMore"], ["Wonderful find", 5.0, "July 17, 2015", "JudyE65", "Virginia Beach, Virginia", 103, 42, "We were looking for another restaurant and discovered it didn't look so great, stopped to ask a man about it and he recommended this one and the food was great, just what we were looking for large portions, great flavor, and great selection. Very glad we found this one. Prices were good and we would definitely go back again. We...\n\n\nMore"], ["Great Lunch", 4.0, "February 5, 2015", "Courtney L", "Alexandria, Virginia", 118, 31, "Absolute Noodle has great food selections. From sushi, to noodles, to hibachi. I have come for lunch on more than one occasion and have no complaints. The Singapore noodle is amazing. The sushi is great. Be careful because at times it can get pretty smokey in there."], ["Love this place!", 4.0, "December 18, 2014", "Local_Diner66", "Wayne, Pennsylvania", 90, 39, "Good food, fast friendly service, reasonable prices, a decent portion sizes. Great vegetable bento box for lunch, and they have awesome unsweetened green tea."], ["The Good, The Great, and Why You'd Avoid.", 4.0, "December 13, 2014", "blewjaye", "D.C. Metro (Maryland side)", 57, 127, "Wifey and I were off to see the Caps @ the Verizon center and wanted to try a new (to us) restaurant. Since noodle places seem to be the new rage these days, we decided to give Absolute Noodle a try. We ordered the fried squid app, Lemongrass coconut soup as a second course and for the main entrée of...\n\n\nMore"], ["Great Spot just outside the Craziness", 5.0, "November 29, 2014", "DavidHD413", "Greenfield, Massachusetts", 139, 55, "This is an excellent location, it is just outside of Chinatown and on the East Side of Verizon Center.\nI thought the food was really flavorful and great portions for the price while still being downtown.\nI went here three times over the course of a week and a half and each time we had large groups. Every one found...\n\n\nMore"], ["good basic Asian food", 4.0, "November 4, 2014", "RWFY", "Issaquah, Washington", 24, 8, "There was a lot of variety in the menu different Asian foods--Japanese sushi - this was very satisfying\nWe also had Singapore noodles which were okay (not the best I ever had but nothing objectionable)\nThe people I ate with had had takeout from this establishment and enjoyed it so we went there for the dinner meal"], ["A pleasant Surprise", 5.0, "October 21, 2014", "Robert B", "Hot Springs Village, Arkansas, United States", 8, 1, "It is not High end and It is a block away from downtown Chinatown, but it is worth walking over to.The food and service are exceptional. The butternut squash soup is unique. Every thing we had was excellent. I look forward to another visit"], ["Sushi and noodles - well okay. Something for each of us", 3.0, "July 24, 2014", "Gregory F", "Arlington, Virginia", 117, 35, "I am not a noodle fan, although I like good ramen and some udon or soba noodle dishes. I have had noodles from Absolute, but this I ordered sushi. The sushi was fresh, tasty and similar to most nigiri found in the US. Service was good but getting the bill at the took some effort. The restaurant is clean. I...\n\n\nMore"], ["Love this place", 5.0, "March 31, 2014", "DCUrbanMom", "Washington DC, District of Columbia", 88, 25, "It's a bit of a hole in the wall (which adds to its charm). I like that it's not so well known so still no real crush of people (though it is getting busier during lunch). The \"create your own noodle bowl\" is terrific. Fave is soy sauce broth, ramen noodles and then any variety of meat and toppings that...\n\n\nMore"], ["Solid 4 stars!", 4.0, "March 23, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "This place is about the only place in China town in DC that I come back repeatedly again and again, because it is reliable good fresh food. I have to point out that I had NO connection to his place, I am a customer like anyone else. The noodle is the best choice in this place, but I had sushi...\n\n\nMore"], ["Pick your own noodle!", 4.0, "January 4, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "One of my favorite place in the Gallery Place area. The noodle is a must, if you have not tried it, you really should. You can still decide what ingredients to go into your noodle, you start by picking your noodle and then your broth and then what kind of toppings. My friend picked God knows how many topping, they...\n\n\nMore"], ["Tastebuds totally satisfied", 5.0, "October 25, 2013", "The_Full_It", "Alexandria, VA", 17, 14, "Uncluttered but intimate space with an open kitchen and little works of art delivered to all the tables. At our table, the bulgogi and the spicy coconut lemongrass soup were wildly successful. The soup, for $10, was complex, richly coconut flavored but light, generous serving of chicken and noodles. The menu presents a wide variety and I look forward to...\n\n\nMore"], ["Good price", 3.0, "October 4, 2013", "TinaWC", "DC", 74, 31, "I went that for lunch on a weekday and it was quite empty at 11:30am. I ordered a soy sauce ramen with pork belly and bamboo shoots. It was good in general. The pork belly skin did taste a little burnt and the bamboo shoots tasted different from others I've tried in the past. Noodles were of good quality though....\n\n\nMore"], ["Love the Broths!", 4.0, "July 16, 2013", "Capsgirl19", "Arlington, Virginia", 66, 35, "My husband and I went here last Friday for dinner. It's a 3 minute walk from the Gallery Place metro (near the chinese friendship arc).This is a little place around the corner. It was quiet and the music was entertaining.\nWe ordered Bulgogi Udon, Duck Soba with Baby Bok Choi and Scallion and Thai Spicy Lemongrass Noodle. My husband loved...\n\n\nMore"]]], ["Wisemiller's Deli", [["Good place for a quick bite", 4.0, "August 1, 2015", "ChrisfromTO", "Toronto, Ontario", 105, 72, "My wife and I were walking around Georgetown and while I was checking out the Exorcist stairs, she found this little gem for lunch. She had the \"Chicken Madness\" chicken sub (which she really adored) and I had the \"Taste of NY\" pastrami sub for $7.50 each. Both come with a small bag of chips and a pickle spear. They...\n\n\nMore"], ["This is an insider spot. Tourists won't get it till they taste the chicken madness sub", 5.0, "July 30, 2015", "Tiberius V", null, 27, 18, "If you are from Georgetown, than you will know about this spot, because once you taste this sub, you will literally drop Morton's for the evening and come here to eat this beauty. It's an insiders' spot. You really don't get it until you come here, you grab that sub (was made the same way when I was in college...\n\n\nMore"], ["Wisey's!", 5.0, "May 27, 2014", "Allyy504", "New Orleans, Louisiana", 37, 30, "Had to lave a plug for Wisemiller's. Quaint little grocery store in the heart of Georgetown. GREAT philly cheese sandwiches, made fresh on the grill. Saw me through many all-nighters!"], ["Great Student Food Or For Visiting Georgetown On a Dime!", 4.0, "September 6, 2013", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "Wisey's as it is commonly referred to is a Georgetown institution . Said to have been frequented by one of GU's most famous students, Former President Bill Clinton, the market and takeout near GU is a real find. My son's two favorite sandwiches there are the burger madness and the chicken madness in that order. Chicken madness is said to...\n\n\nMore"], ["Chicken Madness!", 5.0, "July 18, 2013", "BigEGentle", "Dubai, United Arab Emirates", 29, 13, "Half convenience/grocery store and half sandwich shop, this Georgetown staple is famous for their Chicken Madness sandwich: hot peppers, grilled chicken, and cheese on a hoagie with spices that make it a must-try. Tip: when you're in the area, call ahead to place your order. It will be ready within 10-20 minutes."], ["Pure Madness! ... Chicken Madness!", 5.0, "May 15, 2013", "pelirroja01", "Washington DC, District of Columbia, USA", 25, 19, "I attended Georgetown University and at one time lived at Wisey's, er... across the street from Wisey's. The deli sits effectively on campus across the street from a set of dorms and classroom buildings in a small building on a one way street. In 4 years at school, I successfully ate through the entire menu at least trice and was...\n\n\nMore"], ["\"Home of the Chicken Madness\"...Excellent Sandwich, Great Prices, What a find!", 5.0, "April 8, 2013", "LFMME", "Washington DC, District of Columbia", 243, 126, "Include this place for lunch when at GU or Mass at Holy Trinity Church...it's a great place.\nGrill was covered w. Chicken Breasts when we were there. Chicken Sandwiches/ Subs were great.\nKind of a traffic jam at counter to order/ pick up.\nBad at counter to pay also.\nMight slow you down - but food is worth the wait....\n\n\nMore"], ["Good food - slow service", 3.0, "August 3, 2012", "CoachC_12", "Bethesda, MD", 31, 7, "Good, greasy sandwiches - great when you need comfort food to go. No place to sit down and eat, and the set up is crowded and a little confusing for first-time visitors. The service behind the counter isn't particularly friendly, but they make a mean grilled cheese w/ tomato slices."], ["Great food, quick service, affordable", 5.0, "July 4, 2012", "NinoNJ", "Boston, Massachusetts", 135, 43, "As Bill Clinton's former hangout, Wisey's lives up to its reputation. The service is quick, the sandwiches are delicious and unique. Recommend the Chicken Madness"], ["Mad for the Chicken Madness", 5.0, "May 26, 2012", "Hoyas2000", "New York City, New York", 23, 6, "Any trip back to Georgetown must include a trip to Wisemiller's for a Chicken Madness. Chicken, Bacon, Cheese, Spices, Garlic... can't go wrong! Plus you get a free bag of Utz, a pickle and a can of soda. Don't miss this place the next time you are in the area. My mouth is watering just thinking about it."], ["Chicken Madness Indeed", 5.0, "February 29, 2012", "SouthernCross99", "New York City, New York", 86, 42, "One of my favorite deli sandwiches ever. Chicken Madness never fails to hit the spot. If you're in the mood for a great sandwich in DC, this is the place to go!"], ["The Sandwich Masterpiece", 5.0, "November 30, 2011", "GunnersMcG", "Hartford, CT", 105, 80, "The Chicken Madness is without question the greatest sandwich ever, anywhere. My senior year at Georgetown, over a decade ago, I started to realize that I would be leaving DC and so I began ordering them like a maniac. Every time I'm back Wisey's is my first (and last) stop.\nHad a friend going to a transatlantic conference pick me...\n\n\nMore"], ["Sandwiches here are the best!", 5.0, "December 19, 2009", "JH1976JH", "Pittsburgh, Pennsylvania", 29, 28, "This place is great! Sandwiches are so good! You have to get them to go as there is no seating. Sandwiches come with chips and a drink, and the price is cheap. This is the place to go for an amazing sandwich!"], ["This place is the money! Their coffee is excellent (had one every morning before class), and their sandwiches are...", 4.0, "December 13, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This place is the money! Their coffee is excellent (had one every morning before class), and their sandwiches are ridiculously good (Chicken Madness!).\nThe only gripe I have is almost everything off their grill tastes the same...its all good though."], ["Wisemiller's in Georgetown, next to the Tombs, makes the legendary burger madness and chicken madness. One of the best...", 5.0, "July 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Wisemiller's in Georgetown, next to the Tombs, makes the legendary burger madness and chicken madness. One of the best deli's on the planet. A Washington institution."]]]]