[["Rooftop Bar", [["Enjoy the View", 5.0, "August 23, 2015", "cbarney2003", "miami", 137, 63, "Enjoyed lovely cheese plate with drinks by the pool. They made beautiful virgin daiquiris for the kids. Comfortable furniture to relax and enjoy the view"]]], ["Odeon Restaurant", [["Bocadillos Deliciosos - Spanish Food", 5.0, "August 30, 2015", "NorthernVirginiaSmo", "Northern Virginia", 19, 8, "While near the DuPont Circle metro stop in DC, we stumbled upon Odeon. That was our good fortune! The once-Italian restaurant is converting to Spanish cuisine. The interior is lovely. We chose to sit just inside the open air restaurant where we were cool but could people watch as well. The sangria was perfect for a warm August day. The...\n\n\nMore"], ["But the happy hour with Moose!", 3.0, "August 26, 2015", "socioqueen", "Brooklyn, New York", 75, 31, "Moose is the man! That's the bartender. See him and he will make it your drink pitch perfect. No, really!\nWe didn't eat here but the happy hour is excellent!"], ["Excellent Italian fare", 5.0, "August 17, 2015", "Josie1952", "Lexington, KY USA", 14, 15, "We were greeted by our waiter while reading the menu posted outside. We decided to try it after passing a large number of diverse restaurants. Italian is a longtime favorite and my Godfather introduced my family to many special Italian sauces and homemade pastas he learned to make in Sicily. The wait staff and bartender were very professional - I...\n\n\nMore"], ["We Had Hoped For Better", 3.0, "August 11, 2015", "MaryandBruce43", "Washington DC, District of Columbia", 8, 1, "We're about a month late in putting in this review. About 25 years ago Odeon Café was our go-to Friday night place.  Food and drinks were always exceptional. Returning several years ago we had a delightful meal. On a recent Friday night we were very disappointed.  Out of Compari! But a nice small selection of wines by the glass.  The...\n\n\nMore"], ["\" A very pleasant surprise....!!!! \"", 5.0, "August 5, 2015", "Fabrizio R", "Chicago", 7, 36, "While laying over at the \"Hilton Washington\" for a night, I decided to take a walk and find a place to eat. The selection of restaurants was diverse and they all seemed very appealing to me... I decided to stop at the \"Odeon Cafe\" for a few seconds in order to read te menu posted outside, and to my delight,...\n\n\nMore"], ["Excellent Italian food", 4.0, "July 22, 2015", "harry_martie", "Bangor, Maine", 22, 5, "Do not let the non Italian name of this restaurant put you off from trying the food here as it serves 100% great Italian food. Friendly quick, service topped by well presented, well cooked Italian food at a competitive price.\nhttp://www.odeoncafedc.com/"], ["It's changed and no longer good", 1.0, "July 2, 2015", "JLG32174", "Ormond Beach, Florida", 49, 31, "I've been to this restaurant many times over the years and had great food and service. But things have changed and the food is just ok. It is nothing special. They don't even give you a full pint beer. They replaced the glass with a very small thick one and provide a poor value on draft beers. At the end...\n\n\nMore"], ["Excellent meal!", 5.0, "April 30, 2015", "REF60", "Boiling Springs, Pennsylvania", 120, 60, "We were told to go here by someone at our hotel and it was an excellent suggestion. The food, service and atmosphere were all great. When we are in the area again we will be back!"], ["Very Average", 3.0, "April 23, 2015", "Steve S", null, 13, 9, "Not really impressed at all with the service or the food at this restaurant. Had the Italian sausage with peppers and pasta,the peppers were thrown in as an afterthought it seemed would have been nice if they were roasted. We were not offered parmesan and when we asked were informed that they had run out. Five minutes later the next...\n\n\nMore"], ["Asked at the Hilton about a good place to have dinner.", 3.0, "March 25, 2015", "Stone2013", "Greenville, South Carolina", 38, 8, "Walked about 2 blocks from the DC Hilton to the Odeon Café. The place needs rehab. work done. The wait staff was just OK and the food was about the same. There were many other choices on the street that would have been a better choice. Sometimes it is not good to listen to the hotel staff but better to...\n\n\nMore"], ["Convenient, reasonable", 3.0, "March 17, 2015", "dmt1966", "San Marcos, Texas", 29, 24, "We visited Washington DC for a conference and Odeon was a short walk from the Washington Hilton. The food was generally well-prepared, but nothing to crave or wish to order again. My chicken appeared to be pre-formed, but my husband's fish appeared fresh. The dipping sauce with the bread was unique. This is a safe, if uninspired, placed to dine...\n\n\nMore"], ["Reasonably priced place for a pizza or a pasta", 3.0, "March 15, 2015", "Decoamie", "Washington, DC", 282, 136, "This restaurant has been around for a very long time. It is conveniently located on Conn Ave just up a couple of blocks from the north exit of the Dupont Circle metro. It has very reasonably priced lunch specials (soup or salad and one of four entrees for $12.95, at this writing) and usually has a lobster special (broiled, not...\n\n\nMore"], ["Strange decor but all around it was fine", 3.0, "February 2, 2015", "Circusdog", "Orlando, FL", 174, 102, "Odeon Café is located on Connecticut Avenue in Washington DC, just a few blocks North of Dupont Circle. The restaurant is an intimate location with an upstairs and downstairs dining area. Décor was interesting, and the dining area is dominated by 1 1/2 Greek pillars coming down from the ceiling. I say 1 1/2 as one had been chopped in...\n\n\nMore"], ["Sunday brunch with family", 5.0, "January 26, 2015", "Tony A", "Lafayette, LA", 61, 24, "The Hilton Washington recommended the Odeon and we made the short walk down the street. The waiter was excellent and helped the group make their choices. There were 3 of us that ordered off menu and he was quick to assist and didn't have any issues with the request! He kept our coffee cups and water glasses full. The food...\n\n\nMore"], ["Old World Charm in Trendy DC", 5.0, "December 18, 2014", "Su H", "Oakton, Virginia", 47, 20, "Odeon is located near Dupont Circle, which is home to tons of bars, restaurants and clubs. From the outside, Odeon Cafe is pretty ordinary. But step inside and the environment is warm and cozy. There is a lot of Old World charm in the decor. The service is great, and harks back to an era when being a server in...\n\n\nMore"], ["Fantastic food, but not so much on the service", 3.0, "September 30, 2014", "Eric E", "Boston, Massachusetts", 8, 1, "The food was fantastic, the decor was great, and even at 7pm on a Saturday night they did a good job controlling customer flow so you didn't feel squeezed. My big problem was that I was with a group of about 10 people, and after our meal we asked for separate checks. The server told us he had no way...\n\n\nMore"], ["Excellent food and service!!!", 5.0, "September 18, 2014", "Two2love", "Saraland, Alabama", 4, 3, "Decided to stop in for dinner after a business conference while strolling down Connecticut avenue. Staff were all extremely helpful and every food and drink suggestion was spot on!!! We had the lobster ravioli along with an apple and walnut salad--I never would have chosen fruit and nuts on my salad, but this was phenomenal, and the ravioli superb!!! We...\n\n\nMore"], ["Very good, great service, atmosphere a little lacking", 4.0, "September 13, 2014", "KEWLBEANS", "Tennessee", 263, 216, "Very good food and options, great wine selection, excellent service. Interior seems a bit lacking, perhaps a little casual for the type of food being served. Overall would recommend."], ["AMAZING", 5.0, "August 28, 2014", "Ana U", null, 1, 1, "I had the pleasure to go to odeon for my best friend's birthday.\nDinner was amazing! I had the veal with asparagus. It was Well executed.\nAll my group was very pleased with the food.\nIt was Friday night. We will all go back very soon."], ["Great choice!", 4.0, "August 18, 2014", "4Polos", "Mechanicsburg, Pennsylvania", 51, 26, "We lucked out with a gorgeous summer day when the front of the restaurant was open to the sidewalk and it was comfortable to sit at the sidewalk tables as well. The service was prompt and very courteous, our meals were excellent and the prices were quite reasonable. They had a wonderful selection of Italian favorites and some other creative...\n\n\nMore"], ["Family Vacation", 5.0, "August 11, 2014", "Joanne F", "Huntsville, Canada", 3, 0, "Awesome restaurant. Excellent food, great service. We were just walking around town looking for a place to eat and happened across this great place. Great food and reasonable prices. Would go again."], ["friendly and fast", 5.0, "July 11, 2014", "cautiousfoodie", "Longview Washington", 20, 13, "Had a lovely lobster dinner for a very reasonable price. Good service, and friendly staff. The servings were generous, and we enjoyed all of our selections. Especially in love with the seasoned garlic oil for the bread."], ["Nice breakfast", 4.0, "May 28, 2014", "ThomAtlanta", "Atlanta", 17, 5, "Delicious breakfast/brunch that is relatively inexpensive for the locale. Front window is open on nice days. Staff is friendly.\nBlueberry pancakes and banana foster toast were big hits."], ["Excellent Pasta and Salads... a great place to dine.", 4.0, "May 12, 2014", "barymad", "bethesda, md.", 262, 65, "Eaten here many times over a ten year period and never had a disappointing experience. Excellent Pasta, fish, and Salads. Great bar to have a glass of wine and relax. Cute little upstairs tables when you want to hide and not be recognized. I recommend the salmon pasta."], ["Good Italian food", 4.0, "April 24, 2014", "Sharron C", "Wellington, New Zealand", 238, 93, "We hadn't reserved but got a table easily enough although the restaurant was mostly full. Service was quick and efficient. We had pretty good Sangiovese from a reasonable wine list. Bread with an olive oil dip was complementary and it was good. Richard had lasagne and I had Veal al limone - both were very good. I had gelato which...\n\n\nMore"], ["Excellent service and food", 4.0, "April 23, 2014", "Irisheyesmary", null, 41, 12, "Our family had a wonderful dinner here. Our waiter was the most attentive we have ever had. I am sorry that I don,t remember his name,he has boys who play soccer in Europe! We each had a different menu item and found it to be some of the best Italian food we have had. We also had the fried calamari...\n\n\nMore"], ["Late lunch", 5.0, "March 28, 2014", "weekendwonder1", "washington dc", 189, 56, "Just had a late lunch. Paninin sandwich ( turkey breast bacon cheese ) very good with salad. Service was fast and efficient."], ["Lobster special", 3.0, "March 24, 2014", "icu4biz", "Limeport", 5, 1, "Service and atmosphere were great. The food was just average. My mistake to order lobster at an Italian restaurant.\nThe linguini and marinara sauce that came with the lobster tasted like something from a can.\nPlenty of people dining here so it must be ok? I guess I'm spoiled from my frequent business travels to Italy and fresh pasta."], ["Best cannoli ever!", 5.0, "March 21, 2014", "SunnyTeresa", "Perry, Florida", 2, 0, "Love this restaurant. We go every time we visit D.C. The food is good. The service is friendly. The prices are reasonable. The brandy cream sauce is fabulous on any type pasta. The best thing is the cannoli. It is the best."], ["nice place, nice prices", 3.0, "February 23, 2014", "rufkdlk_10", "Washington DC, District of Columbia", 50, 13, "but to have this few customers, i found the service very slow with limited menu choices, some of which were quite inexpensive for brunch. That said, the atmosphere could have been better, as there was an acrid smell like cleanser and the staff seemed distracted. Not sure i'd go again but i'm sure once it's up and running, things are...\n\n\nMore"], ["Excellent, good food, service and prices", 4.0, "January 12, 2014", "IDC637", "Washington Dc", 101, 34, "Went back to Odeon after a few years absence and it was still very good. It was a miserable night weather-wise and the place was not too crowded but the place was as much fun as I remembered it. We were four and we ordered drinks that came chilled and in generous glasses. We shared a pizza and calamari as...\n\n\nMore"], ["Tasty meal, great service, all-around excellent experience", 4.0, "December 30, 2013", "Alexandrian1026", "Alexandria, Virginia", 105, 36, "Not sure why this is listed as being in Washington, Pennsylvania! This is in Dupont Circle, Washington, D.C. on Connecticut Avenue!\nVery tasty mid-day meal was a pleasurable dining experience all around. The food was wonderful, the service was excellent, and the ambiance was great! I definitely will be back!"], ["Good Food", 4.0, "November 26, 2013", "24QueenBee", "Saint Cloud, Minnesota", 100, 47, "Our hotel was in Dupont Circle, so we were looking for a moderate priced restaurant in the area. This restaurant fit the bill. I liked the table by the window, the white tablecloth and the excellent service. The food was good. I had veal with mushrooms, my husband had lasagne. My dinner was prepared very well, tender meat and just...\n\n\nMore"], ["Very Good", 4.0, "September 30, 2013", "lgt190", "Central Texas", 32, 10, "Very good food at a good value. Not a large or fancy restaurant. Just good food and good wine. House wine is very good as are the daily specials. Excellent service when we dined. I would recommend Odeon to anyone that enjoys Italian food."], ["Great place to host a party in DC", 4.0, "September 22, 2013", "jtarka", "Havertown, Pennsylvania", 5, 4, "We had a group of 20 in their upstairs, private dining room to celebrate my son's birthday. The food was very good and the service was friendly and excellent. The prices were also reasonable. They managed to keep track of drinks and dinner on ten separate checks and get everyone served in a timely way. They were also extremely accommodating...\n\n\nMore"], ["A Great Meal that started with 'Hello' and a Smile", 5.0, "September 14, 2013", "sal1107", null, 22, 21, "From our hotel, we strolled down Connecticut Avenue trying to pick a restaurant for dinner. We walked past several great restaurants including \"Odeon\". Each one had a great menu and al fresco dining. We walked back to Odeon because we were greeted with a smile and hello as we passed. No one else had done so. We sat along the...\n\n\nMore"], ["Very good", 4.0, "September 10, 2013", "ChrisK29", "New York City, New York", 112, 45, "We were looking for a place to eat and we found this place. It was a Wednesday night and not crowded. It is nice to have a reasonably priced meal in DC. The pasta and pizzas were very good. We were a party of seven and we all enjoyed our meal. The service was very good. Would definitely go back."], ["Neighborhood pizza", 5.0, "September 5, 2013", "Clark845", "Jacksonville Beach, FL", 102, 29, "I was on a stroll in the Dupont Circle neighborhood when my stomach told me it was time for lunch. The Odeon Cafe looked interesting so I went in. It is a nice looking restaurant that looks like it had been a bank at one time. The bar is along the left wall with table seating on the right. There...\n\n\nMore"], ["Treated like a criminal with a groupon", 2.0, "July 29, 2013", "theonlybaz", "east hartford,ct", 6, 3, "Stopped in on a Saturday afternoon neighborhood very busy, this place was empty.\nService was very good in the beginning, 3 of us, veal Marsala was tasteless, chicken park was of the frozen variety, pasta ok\nCharged 12 dollars for a glass of white wine and 8.86 for 2 fountain comes\nNo one finished third meal, we requested the bill...\n\n\nMore"], ["So so", 3.0, "July 15, 2013", "about-leisure", "United States", 61, 25, "Beat salad was good. Pasta primavera was pasta with carrots. Husband said bruschetta was tasty, but his pasta and seafood was over cooked. Won't be going back with so many other places to try in the neighborhood"], ["Good food, good value", 4.0, "June 10, 2013", "joashes", "Kuala Lumpur, Malaysia", 34, 33, "Had the whole Maine lobster with linguini and marinara sauce. It was good that they managed to maintain the different texture and taste of the different parts of the lobster. The portion was filling and to me that is good value. The ambience was ideal to enjoy the meal while watching the streets of Washington.\nI would certainly recommend this...\n\n\nMore"], ["Fun evening", 4.0, "June 6, 2013", "nmfMaine", "Maine", 50, 33, "We were a large group at a convention and had a very enjoyable evening. The calamari was excellent. Not chewy at all. I had the lamb shank special and the canolli that was very good. Our server was very helpful ."], ["Tasty dinner", 4.0, "May 2, 2013", "Traveljunky973", "new york", 83, 29, "Dined here the other night and had thechicken Marsala. The chicken was a bit too tender and difficult to cut, but it was pretty tasty. The service was very good, and the waiters and busboys are very attentive- my glass was never without water.\nThe warm delicious bread and the garlicky sauce that accompanied it before the meal was great,...\n\n\nMore"], ["good lunch, brunch with dupont circle location", 3.0, "April 28, 2013", "babette50", "Gladstone, New Jersey", 91, 29, "picked this spot because they accept reservations for small parties e.g. we were three. food was pretty good, service a little lax. but overall good meal in good location at good price."], ["Yuck", 1.0, "April 26, 2013", "Pam B", "Near Detroit", 22, 12, "I got eggplant parmesan and ordered a salad on the side. It's typical in most of the restaurants around there for the salads to be ala carte, so no big deal.\nDon't eat here.\nThe salad was some wilted greens. The eggplant parmesan looked and tasted like it was microwaved. The pasta on the side could have been served by...\n\n\nMore"], ["Bread!", 5.0, "April 9, 2013", "Ynnub", "Chicago, Illinois", 50, 27, "I like this place. I've been here a couple of times over the years on business trips. The service is fast and the food is good, but there is one thing that is special. The bread and olive oil dip is insane. I'm embarrassed to ask them, but I'd like to take a jar home. I'm giving a 5 rating...\n\n\nMore"], ["A surprise!", 5.0, "March 30, 2013", "P A", "Chicago, Illinois", 34, 16, "A surprising find. Seafood pasta was great. Loved the bread and its dipping sauce. And interesting garlic onion flavor. Grill calamari is fresh and not too salty. Scallop and shrimp were both great!"], ["customer service and food", 1.0, "March 21, 2013", "586anna", "Windsor, Canada", 2, 0, "We were there during March break and had ordered their recommended wine and antipasto platter. At 10.00 per person we got deep fried cheese sticks, fried calamari and was told there would be a nice cheese as well. We specifically asked if it was a hard parmesean, we were told yes. we got with the fried crap, a bit of...\n\n\nMore"], ["Smoked salmon pizza, who knew?", 5.0, "March 16, 2013", "Eagle1949", "Cleveland, OH", 85, 47, "My wife and her friend lunched at the Odeon during our visit, and she raved about the food and friendliness of the staff. They had planned to do some touring after lunch, but the atmosphere encouraged them to stay and talk for much of the afternoon.\nImpressed with her experience, I suggested that we go back for dinner later during...\n\n\nMore"], ["Italian restaurant conveniently located on Connecticut Ave", 4.0, "February 26, 2013", "CraftsmanTraveler", "Washington DC, District of Columbia", 59, 18, "Reviews are very mixed. We had not been here for several years. Went on a Sunday evening, and everything was lovely. We eached ordered off the special menu and were very pleased with the food, service, and the price."], ["Italian and nice", 3.0, "January 9, 2013", "Dukesnyder", "Ligonier PA", 142, 44, "Service and atmosphere are quite good. I have enjoyed my meals here, but the wine options should be better."], ["Great Restaurant", 4.0, "January 4, 2013", "Adrian A", "Johannesburg, South Africa", 108, 51, "My wife and I went for brunch twice in 2 days at this restaurant. We found it very strange that it was so empty on both occasions. We loved the decor, the staff were efficient, helpful and friendly, the unpretentious atmosphere of this family run business was also refreshing. The food we had was just great although 3 eggs in...\n\n\nMore"], ["Another OK Italian Restaurant", 3.0, "December 28, 2012", "TommyBoy94", "Philadelphia, Pennsylvania", 468, 471, "This is a pretty typical Italian bistro with a decent menu of pastas, pizzas and other typical Italian fare. The waiter was much better than average and was knowledgable about the food. The Bolognese sauce was nothing unique or special but more than adequate. Atmosphere is fairly modest and Itlaian music is playing in the background. This is definitely a...\n\n\nMore"], ["Yet another mediocre overpriced restaurant in DC using wilted produce", 3.0, "December 20, 2012", "wodaabe", "Washington DC, District of Columbia", 109, 42, "I didn't have high expectations after being greeted by the blasé female hostess who later examined me from head to toe critically putting me ill at ease. The waiter provided terrific service and while there were some highlights to our meal, unfortunately this restaurant resembles so many other overpriced and pretentious DC restaurants with their mediocre food. My salad was...\n\n\nMore"], ["Good food for a quick brunch", 3.0, "December 15, 2012", "wbullseye", "Fayetteville, North Carolina", 680, 579, "I happened to be looking for a museum located nearby the Odeon Restaurant when I noticed the brunch specials. I decided to give it a try and was not disappointed. As other reviews mentioned, Odeon was pretty much vacant while other restaurants seemed full as I walked down the street. That was a shame since Odeon had good food and...\n\n\nMore"], ["I really like this place", 4.0, "October 25, 2012", "Geoffrey D", "Charlestown, Maryland", 94, 52, "I met up with a couple of old friends during a recent trip to DC. One lives in DC, the other was in town like me, for a conference. The one from DC recommended Odeon after we discovered it was a 45 minute wait at our first choice. I was worried when Odeon was half full and the rest of...\n\n\nMore"], ["Service, food, atmosphere", 4.0, "October 23, 2012", "1213pdg", "Williamsburg, Virginia", 106, 54, "Excellent meal, very attentive staff. Reservations were honored promptly for party of 8. Only negative was temperature control (a little too warm on a fall evening),"], ["Good food, small portions", 4.0, "October 20, 2012", "gretasuetoo", "Medford, New Jersey", 29, 10, "The saltimbocca was excellent, served with sauteed vegetables. My husband had the spaghetti bolognase which looked more like an appetizer portion than a main course. The service was good. Our waitress was attentive and the busboy kept our water glasses filled. Overall the experience was good."], ["Pleasant Brunch", 4.0, "September 16, 2012", "areview28", "Silver Spring, Maryland", 731, 296, "We had a very good brunch at the Odeon. Decor is pleasant with paintings of Italian scenes, a balcony looking out onto a small atrium space, and French doors opening out onto Connecticut Avenue. Both the Eggs Benedict and the Eggs Cafe Odeon (poached eggs and hollandaise over cured salmon and English muffin) were properly done. Service was attentive. A...\n\n\nMore"], ["Perfect Fare for the Weary Traveler", 5.0, "September 10, 2012", "Meredith1331", "Beckenham Junction", 3, 0, "After a seven hour flight my pasta dinner and glass of wine at the friendly Odeon bar/restaurant were just what I needed. Perfect atmosphere poised between casual and class and entertaining staff in constant conversation with quirky regulars from Dupont Circle."], ["Not good", 2.0, "August 28, 2012", "Ronn G", "Charlotte, North Carolina", 37, 6, "We ate here on the first night of our DC vacation. As it is located in the very busy Dupont circle, we should have known we were wasting our time when they had seats available All other restaurants were packed). We both ordered pesto (mine scallop, my companions chicken). The sauce was awful. Both dishes were swimming in oil. I...\n\n\nMore"], ["A waste of a meal", 2.0, "August 26, 2012", "RealEndres", "Nashville, Tennessee", 39, 16, "I hate to write this and be the sour voice among the reviews. My wife and I visited on August 13, our last night in DC. After walking up and down Connecticut Ave. we decided on Odeon.\nAt our table our waiter pushed us through the ordering process. He practically insisted that I order a specific glass of wine (the...\n\n\nMore"], ["looks can be deceiving", 2.0, "August 25, 2012", "EllaBarnes", "Old Saybrook, Connecticut", 28, 8, "The hotel was in a great location on Dupont Circle, its atmosphere and good menu was also very promising however, the quality of food didn't deliver. Every thing tasted, store bought, on the cheap with no flavor and poor quality. What a shame - they had all the great ingredients for a great italian restaurant but left out the most...\n\n\nMore"], ["a nice bistro", 4.0, "August 24, 2012", "BrittanyDub", "Washington DC, District of Columbia", 31, 6, "I originally came simply because it was DC restaurant week but ended up ordering off the regular menu. The food was very good and the many waitors we had were very nice. We didn't know who to tip! They were very attentive to our needs and the dim lighting made it very romantic, even though several people were there with...\n\n\nMore"], ["Nice ambiance", 4.0, "July 17, 2012", "girltrippin007", "Milwaukee, Wisconsin", 22, 2, "Had the Calamari to start my Filet Mignon with mushrooms was tender and very flavorful the Vegetable Medley crisp & tender. My fiance had the lamb with Rosemary Mashed potatoes. Too full for dessert but will do next time."], ["Solid choice", 3.0, "June 28, 2012", "Mmmck", null, 21, 5, "Food was good, nothing outstanding. Service was friendly and competent. Handled large party well and I will eat here again when in the area. Prices provide really good value."], ["Fantastic Food and great atmosphere", 5.0, "June 13, 2012", "MagicMan52", "London", 114, 43, "been there twice - both times were great. Really good food with friendly service. Best Italian in Du Pont Circle area in my opinion"], ["good food, great bar", 3.0, "May 21, 2012", "Bob E", "Philadelphia, Pennsylvania", 62, 39, "The food here is basic. a good choice for pizza and a glass of red wine."], ["We hosted 22 for dinner and it was wonderful", 5.0, "May 18, 2012", "Lee H", "Denver, Colorado", 59, 49, "My son graduated from American University on Saturday May 12th. We chose to host a post-graduation dinner party at the Odeon Cafe based up recommendation from a friend and the location minutes from campus.\nWe had an amazing experience here hosting dinner for 22. It was exactly what we had hoped for and I'd go back anytime.\nThey gave us...\n\n\nMore"], ["Decent food", 3.0, "May 17, 2012", "I82X73", "Grandview, Washington", 135, 82, "Small busy place. Food is okay, but nothing memorable."], ["Excellent!", 5.0, "April 27, 2012", "littleyacht", "United States", 50, 48, "Great service, reasonable prices, delicious food! Within walking distance of the Washington Hilton."], ["Just okay", 3.0, "February 29, 2012", "murpco02", "Floral Park, New York", 4, 2, "My friend and I went to this restaurant mostly because we had a $25 coupon from restaurants.com. The location in Dupont is convenient and easy to find. Most of the two person tables are right by the entrance which was a bit annoying with people coming and going. Its also pretty much right in the bar- there's no separation between...\n\n\nMore"], ["Food OK - nothing great", 2.0, "January 14, 2012", "SJ-Traveler-01", "Sewell, NJ", 57, 24, "The food is only OK and the portions rather small. The dessert was terrible, they call it chocolate soufflé, but it is not a real soufflé, it was dry and totally industrial. The food is also too expensive for the quality and quantity. I will not come back."], ["yummy!", 4.0, "December 20, 2011", "littlejunk", "McLean, Virginia", 62, 26, "My dinner companion had been here several times, but it was new to me. I thought we might have been dressed too casually but jeans were actual in the majority here. There were good specials that evening, including mushroom caps stuffed with crabmeat (which came sizzling in a cast iron pan) and Pasta Cleopatra. I went for a simple pizza...\n\n\nMore"], ["Good food and service", 5.0, "November 20, 2011", "bjthaler", "Philadelphia, Pennsylvania", 251, 96, "Great location close to Dupont Circle. At 6:55 they gave us wine at $3.50 a glass. It was a full glass too. The food was really hot and tasty. I had the veal parm and wife had the pasta with seafood. She loved it. It may have been called pasta de la mara. Very hot rolls with great olive oil...\n\n\nMore"], ["Excellent food in Dupont Circle", 5.0, "November 11, 2011", "Ron S", "Fort Collins, Colorado, United States", 5, 4, "Great Italian fare. Ask for a seat upstairs if you need some privacy in a quiet smaller venue"], ["Average Italian", 3.0, "September 28, 2011", "DCTraveller40", "Washington, DC", 31, 23, "A friend from out of town visited recently and wanted to have dinner at Odeon, which he had not visited in some years. Since I had not eaten there in some time I readily agreed. I can not say that the experience was disappointing, but it certainly was not a special meal.\nThe staff were very friendly but the service...\n\n\nMore"], ["Nice location, okay food", 3.0, "September 19, 2011", "LSMorales", "Fort Worth, Texas", 75, 24, "The location of the restaurant is nice and it has a nice romantic feel. The service was nice and quick and the wine was reasonably priced. However, the food was not as great as expected. If you visit, be sure to get a seat on the balcony for the full ambiance of the restaurant."], ["A Quiet Restaurant for Grownups", 4.0, "April 26, 2011", "Nauplion", "Seattle", 22, 12, "Lunch was a simple insalata mista, which is a very good test for a restaurant. Absolutely fresh, freshly-roasted chicken, fabulous prosciutto. Odeon was cool and quiet, and the sound level allowed for conversation. The maitre d' was warm, and turned out to have fascinating things to say about Tunisian politics. I will be going back whenever I am in DC....\n\n\nMore"], ["Quaint Dupont Italian restaurant that we highly recommend", 5.0, "November 25, 2010", "SeeourUSA", "Myrtle Beach, South Carolina", 86, 32, "Ate at Odeon on Thanksgiving night and we had non traditional meals. I had mahi\nWith mushrooms and pasta which was yummy. I like my pasta with a light amount of sauce and this was perfectly made for my taste. My husband and son also enjoyed their meals. What really stood out was the service which was fabulous.. I suggest...\n\n\nMore"], ["The worst restaurant we visited in the US", 1.0, "October 6, 2010", "stonefish100", "Aberdeen, United Kingdom", 2, 0, "Myself and my girlfriend spent 3 weeks vacation travelling through various cities in the US, and the Odeon in DC was by far the worst dining experience we had. It was AWFUL from start to finish.\nWe were staying locally in Dupont and had very good meals in other restaurants on previous nights, however from the moment we walked in...\n\n\nMore"], ["I love this place!", 5.0, "September 28, 2010", "kittymittens", "Providence, Rhode Island", 9, 7, "I have been to this restaurant twice, and I loved it both times. It's very similar to little restaurants you will find in Rome. The service has always been quick and attentive and the place has always been clean. The pasta with smoked salmon is amazing :)\nThe prices are very reasonable and they have a decent happy hour mid-week....\n\n\nMore"], ["Yuck - not fresh at all", 2.0, "August 7, 2010", "adrianacollado", "Miami, FL", 40, 29, "I felt a hint of trepidation after our waiter brought over the bread and olive oil dipping sauce to the table. The olive oil looked murky and tasted bland, even though we could see the parsley, onions and other seasonings in the bowl. Not a good start. We ordered the stuffed mushrooms for appetizer, and they were not particularly flavorful...\n\n\nMore"], ["Loved it", 5.0, "May 24, 2010", "twobutlers", "Newport, Tennessee", 46, 25, "Great little place. Small and intimate. Food is great and the service is excellent. Highly recommend it."], ["A wonderful dining experience!", 4.0, "April 23, 2010", "Mom_of_the_groom", "MA", 3, 1, "My sister and I found the Odeon Restaurant while walking home after a day of sightseeing. How fortunate for us! 8 days in DC and this was definitely one of our best meals. The food, basic italian fare, was delicious and fresh. The calamai was sweet, light and tender. The salads were crisp and fresh. Pasta was perfection, served al...\n\n\nMore"], ["Tasty Meal and Great Happy Hour", 4.0, "July 15, 2009", "RayBannon", "Kent, Washington", 42, 40, "I thought the Odeon was dandy and chose it after the Thai Chef looked seedier in person than it did on the web site.\nCouldn't complain about the happy hour wine price on a nice house Chianti, and then had calamari fritti (well done with a light coating. Not a lot of sweet flavor in the rings, though they were...\n\n\nMore"], ["great service, good food", 4.0, "April 26, 2009", "iselynjenniep", "Saluda, North Carolina", 287, 145, "we really wanted italian and were staying in dupont circle so we found this place - our server was the best, extremely friendly. the food was good, slightly expensive. some dishes were better than others."], ["Not worth your time", 1.0, "December 1, 2008", "Norwaykek", "NC", 56, 29, "Our family of five at here November 28th, 2008. They charged $3.50 for our four year olds apple juice. They also charged our other four year old and our six year old drinks at 2.95 for each lemonade. We were asked if we'd like refills. No mention that this would cost us another 3.50 for the apple juice and 1.50...\n\n\nMore"], ["Been there with friends...", 5.0, "October 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Been there with friends and family over ten times and I haven't heard a complaint yet. That's impressive."], ["Look for another option in the Dupont Area", 1.0, "September 27, 2008", "Muriel12", "Albuquerque, New Mexico", 88, 167, "A colleague and I walked a few blocks of the Dupont area looking for a good place to eat. A few looked great but were loud and/or had waits of up to one hour. In the end, we settled on Odeon. The downstairs dining area was about 35% occupied and it was relatively occupied.\nThe bread and olive oil dipping...\n\n\nMore"], ["Ups and Downs", 3.0, "August 22, 2008", "bisbohemian", "Bisbee, Arizona", 154, 311, "My wife and I walked in here on a Thursday night. Good smells coming from the kitchen lured us in....\nThe staff looked like they were extras from the Gogfather, so we figured it was pretty good....and the olive \"butter\" we were served with the bread was good enough to drink! My wife immediately started trying to figure out what...\n\n\nMore"], ["Very good meal for all", 5.0, "March 31, 2008", "Chicago5", "Chicagi Il", 25, 28, "We wandered into the Odeon on a Sunday night with 3 Adults and 3\nwell behaved kids. I was a little worried when I saw there were no other children. Needless worry. We were welcomed and sat at the bar foe a drink and were seated in the balcony area overlooking the pretty restaurant the kids wanted their own table...\n\n\nMore"], ["Best Italian I've yet had in DC, from a NY guido.", 4.0, "March 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best Italian I've yet had in DC, from a NY guido."], ["OK.", 2.0, "February 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "OK."], ["Okay", 3.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Okay"], ["Decent italian food. I've only had sandwiches there for lunch. Good service and reasonably priced.", 3.0, "December 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Decent italian food. I've only had sandwiches there for lunch. Good service and reasonably priced."], ["pricey", 4.0, "November 29, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "pricey"], ["Undiscovered gem", 5.0, "June 21, 2006", "Statler Waldorf", "Washington, DC", 17, 33, "I am a DC local and my friends and I wandered into the Odeon because we didn't feel like waiting an hour at the other hot spots on Connecticut Avenue. We had low expectations, but figured we could keep our orders simple and it would suffice.\nWell, this restaurant greatly exceeded my expectations. First of all, the entire server staff...\n\n\nMore"], ["Very Pleased With Dinner", 5.0, "April 4, 2006", "danrichard", "Indiana", 45, 108, "Had dinner at the Odeon on April 1. Very satisfied with both the food and the cordial service. The atmosphere is casual and the prices are reasonable. My wife had salmon and I had veal. Both were well prepared and delicious. I finished with tiramasu, which was equally well prepared. The Odeon is well worth a visit."], ["Great food! Affordable!", 5.0, "December 16, 2005", "A TripAdvisor Member", null, 1, 0, "We wandered into Odeon early in December and found them very warm and welcoming. The service was first-rate, food was awesome, and I would definitely recommend it. We liked the fact that the menu items were recognizable, things that we had actually HEARD of before, and there was great variety. The bread was warm and crusty, served with a delicious...\n\n\nMore"]]], ["Southern Hospitality", [["Southern Hospitality", 4.0, "October 14, 2015", "flobow3648", "Washington DC, District of Columbia", 32, 10, "Excellent brunch with great drinks. Uses Apple pay so can pay the bill using your phone.\nDinner menu looks interesting; based on my brunch experience will be back!!"], ["A favourite in Adams Morgan.", 4.0, "October 8, 2015", "Wineaux FromAlexandria", "Alexandria, Virginia", 253, 115, "We live in Old Town Alexandria and frequently visit Southern Hospitality. They serve great food, nice atmosphere, and attentive staff. The only fault that I have is the wine list ... I'm here for dinner, I like wine (and have an extensive cellar) but refuse to pay $75 or more for an ordinary wine that I can find in an...\n\n\nMore"], ["Good place for brunch in Adams Morgan", 4.0, "October 6, 2015", "paxa", "Washington DC, District of Columbia", 370, 207, "This seems to be a popular place for brunch, especially for large groups. The Sunday we went there were several large groups (although none with small children) and all the choice seats were reserved. If you sit in the porch area enclosed by canvas/clear plastic (window) walls - with very warm heat lamps hanging from the ceiling - there's not...\n\n\nMore"], ["Tavelzoo voucher", 5.0, "September 27, 2015", "TimandShannon", "Leonard, Texas", 58, 20, "We ate here over the weekend and the food was great. The shrimp and grits were delicious, as well as the salmon and pecan pie. We used our travelzoo voucher which was a great deal! We are from the south and our waitress was very friendly and kind like people from the South!!!"], ["Somewhat Southern", 3.0, "September 12, 2015", "JD28204", "Charlotte, North Carolina", 290, 144, "Being from the South, maybe I'm being too harsh, but I didn't find this to be so Southern. One friend had the fried chicken, which apparently had recently changed. The old version was delicious, according to him; the new version, just ok. I had a chicken sandwich (Southern?) which was supposed to have a cilantro aioli. I could hardly taste...\n\n\nMore"], ["Neighborhood hometown feel", 5.0, "September 2, 2015", "Rubyreddnc", null, 6, 3, "Visiting family in DC and trying local restaurants in Adams Morgan area. Nice outside seating area very enjoyable in pleasant weather. The service was friendly and welcoming. We enjoyed our varieties of foods and cocktails."], ["Good food, Good environment.", 4.0, "August 24, 2015", "KansasTravelgrl", "KansasTravelgrl", 115, 46, "Ate dinner here outside. Enjoyed people watching and not being as noisy as some of the area restaurants are inside on a weekend night. I had the pulled pork sandwich with sweet potato fries. My friend had the salmon. Both were good. We splurged on some pecan pie. It seemed \"boxed\" and definitely wasn't home made. So enjoy the meal,...\n\n\nMore"], ["Sampler on a mission for Dessert", 4.0, "August 16, 2015", "HiTonya", null, 5, 1, "I really went for dessert only, I really loved the pecan pie with a side of vanilla gelato. It was warm and an inviting presentation. My companions wanted dinner so i sampled the fried chicken with collard greens. It was not the best but ok, the chicken was deboned. I also tried the steak salad, that was very good with...\n\n\nMore"], ["Charming", 3.0, "August 12, 2015", "DCN2012", "Washington DC, District of Columbia", 40, 3, "A neighborhood gem indeed. They have good choices with the intent of having something for everyone. The apps are really good, (although the kitchen could fine tune their seasoning a bit more). The staff is very pleasant and Southern Hospitality is a great fit overall for the Adams Morgan corridor."], ["Great Service, Great Food", 5.0, "May 25, 2015", "Donna S", null, 11, 6, "All around good experience here after a long day of sightseeing in DC. Great service but not rushed. My entree, baked salmon, was delicious. The Key Lime pie with coconut gelato was one of the best I've ever tasted. We are going back later this week."], ["Bottomless Mimosas!", 4.0, "May 21, 2015", "Jen W", "York, Pennsylvania, United States", 11, 6, "Very good meal! Our table split fried green tomatoes and hummus as appetizers. Both were delicious but the hummus plate could have had a little bit more carrot, celery, and pita for dipping. I had the bottomless mimosa and the waitress was good at keeping me topped off. My entree was the fried chicken Benedict and it came with tater...\n\n\nMore"], ["Wonderful Brunch", 5.0, "May 19, 2015", "Jorbryan", null, 2, 0, "A group of friends attended this brunch and were very happy with our experience. The food was very good! The best dishes being the fried chicken benedict and chicken and waffles. The staff kept our table happy with attentive service and being quick. We purchased the bottomless that was kept filled by our waitress and totally worth the price. This...\n\n\nMore"], ["Things are going south at southern hospitality", 2.0, "April 25, 2015", "Tom H", "London, United Kingdom", 5, 6, "We chose to have brunch at Southern Hospitality, having seen it on the blog 'B****s who brunch'. It was a big disappointment.\nThe service was friendly but the decor was tacky.\nThe food was downright bad. The sunshine sandwich - biscuits, sausage, egg, cheese and tater tots - was incredibly bland and only lukewarm. The biscuits were doughy. The cheese...\n\n\nMore"], ["BOTTOMLESS BRUNCH!", 5.0, "April 23, 2015", "dhunt8", "Atlanta, Georgia", 16, 5, "Two words: bottomless drinks. And for under $15! Sitting at a corner in the awesome Adams Morgan neighborhood, the brunch was good, but the drinks is really the cherry on top. I had the french toast, bacon and eggs, which all was mediocre, but I enjoyed the experience."], ["Skip it", 2.0, "March 21, 2015", "MSSwhy", "Washington DC, District of Columbia", 10, 12, "We went for brunch. Some of the food was cold, coffee was weak and temperature inside kept changing. We chose to go there because our 1st choice was busy-- we should have waited."], ["Brunch ... Nothing Special", 3.0, "March 18, 2015", "lsg12", "Wilmington", 31, 36, "We had brunch on Sunday at Southetn Hospitality ... They had less than 5 people in the restaurant but made us stand in the alcove area until the rest of our party arrived. Which if it had been crowded would make sense ... But there were only 2 tables with customers! The waffles were light and fluffy the chicken filet...\n\n\nMore"], ["Worst chicken and waffles ever", 1.0, "March 18, 2015", "Jayelohim", null, 1, 1, "I didn't know people could screw up chicken and waffles until I went here.\nI was in DC for a couple days and stopped in for an early dinner. In hindsight, I should've known better than to order food from a place that didn't have a SINGLE customer. I sat at the bar and ordered the chicken and waffles. The...\n\n\nMore"], ["New Years Fun!", 4.0, "February 18, 2015", "SJamila", "Miami, Florida", 102, 37, "I love this place. I've been here many times when it first opened and I went for New Years and had a great time. The bartenders are always great and you can tell they're experienced. The drinks we're mixed well and the music had us in the spirit of the holiday. I have been on other occasions and I also...\n\n\nMore"], ["Chicken and Waffles- Authentic and Awesome", 5.0, "December 2, 2014", "Toni B", "Washington, District of Columbia, District of Columbia, United States", 10, 4, "I am a fan of the restaurant, the menu, and the staff!!!!!\nI am overly critical of any restaurant that has Southern options on their menu. This was by far the best combination of authentic seasoning, juicy chicken breast, abd fluffy waffles to accompany it. Whew. And then i had a dark and stormy as my drink (ginger beer and...\n\n\nMore"], ["Best bar service in AdMo", 5.0, "November 16, 2014", "iStefPayne", "Washington DC", 126, 58, "And they have Pappy 20 year Kentucky straight bourbon (currently)!\nI feel a little biased writing this review because I think of the owners and staff as friends... Because they created that, the first time my posse and I went in, a few years ago when they opened. Unlike other bars in the hood, they remember me and my friends...\n\n\nMore"], ["Brunch Menu- solid and limited", 3.0, "November 10, 2014", "NickMiller_Clarity", "Concord ma", 58, 22, "Went for Sunday brunch with the family. Arrived before the place filled up. Service great. Menu - several variations of \"Benedicts\" and other choices (limited number and they all looked terrific, if a little heavy on the cholesterol). I broke ranks and enjoyed the quinoa spinach salad. Terrific and in sufficient quantity. Grilled cheese sandwich was goopy and good. Bacon...\n\n\nMore"], ["Fun place", 3.0, "November 9, 2014", "mribando", "Oyster Bay, New York", 122, 39, "We spent the afternoon at the zoo with our niece, nephew and their 2 small children. I found this place on Open Table, made a reservation and hoped for the best. It was mid-afternnon on a Saturday and the place was hopping. It was a lively bar / pub scene, and had I know this was the type of place...\n\n\nMore"], ["Good food and ambiance.", 4.0, "October 26, 2014", "Joanne L", "Marlboro, New Jersey", 202, 40, "This is a nice restaurant right by the DC zoo. We had reservations for Saturday lunch for 3. When my daughter and I arrived there were lots of tables both outside and upstairs. We asked for an outdoor table and were told they were all reserved. We followed the hostess upstairs and she put us by a table do about...\n\n\nMore"], ["Great Choice in Adams Morgan", 4.0, "October 13, 2014", "Wineaux FromAlexandria", "Alexandria, Virginia", 253, 115, "Southern Hospitality is a great choice in Adams Morgan. Great menu selections that are well-prepared. And, save room for dessert .... Delicious."], ["Good food", 4.0, "September 3, 2014", "maquam", "Swanton, Vermont", 38, 12, "I was in town for a prolonged business trip and we decided to try some place new for dinner. The menu has a good variety and there are good beers on tap. My only issue was I ordered a sandwich without the bun - and ended up getting a grilled cheese - when I explained to the server that wasn't...\n\n\nMore"], ["Nice Brunch - Good value food", 4.0, "August 10, 2014", "Andrew K", "Birmingham, United Kingdom", 40, 22, "Keeping this short ; family needed a meal and these guys came up trumps. Nice food - good buzz about the place and enthusiastic staff. Cant say much else but we were happy."], ["Good brunch", 3.0, "January 23, 2014", "mttaylor9", "Baltimore, Maryland", 200, 100, "We dined at Southern Hospitality for brunch last Sunday.\nWhile the food was good it wasn't, as OpenTable called is \"Best Brunch in DC.\"\nA note to the management. Don't ever tell a table with children that there is a 2 and a half hour time limit on the table and show them where it is printed on the menu....\n\n\nMore"], ["Lovely place with a nice menu and good drinks", 4.0, "December 10, 2013", "TommyS614", "Waldorf, Maryland, USA", 61, 3, "We went here before going to the national zoo lights display and were pleasantly surprised with the food and drinks we got here for dinner. The staff was courteous and it was not super busy at 6ish on a Saturday evening. I'd definitely recommend this to anyone who wants a nice casual place within walking distance of the zoo"], ["Good, but Lacking Southern Hospitality", 3.0, "October 27, 2013", "DrBob41", "Detroit, Michigan", 70, 24, "We went here for diner on a Saturday night. We were seated upstairs by the window which was good for people watching. The food was good, but lacking in extras. For instanced, I ordered the meat loaf which seemed a little heavy (dense) and had only a little dallop of gravy for it and the mashed potatoes and no hot...\n\n\nMore"], ["Great service, food good but not outstanding", 4.0, "October 17, 2013", "MelindaJo", null, 14, 6, "I met a friend here for dinner on a Tuesday night. It was easy to get a table outside or inside at no wait at 6 pm. Our server was wonderful. She offered me tastes when I couldn't decide between wines. She made good suggestions as to what to order. The food came very quickly! It was all good, but...\n\n\nMore"], ["Perfect for Sunday Brunch before the Zoo", 4.0, "October 4, 2013", "ManyMilesStill2Go", "Doylestown, Pennsylvania", 155, 75, "We wandered up this way while walking from Foggy Bottom Area to the zoo. We went in for Sunday Brunch since it was crowded, the menu looked good. and I wanted grits... And what a great find! This is definitely a place where quality is over quantity - everything we ordered was delicious - the small plate of shrimp and...\n\n\nMore"], ["Two words: Eggs Chesapeake", 5.0, "October 2, 2013", "Greyjoy100", null, 50, 27, "Get the Eggs Chesapeake for brunch. You won't regret it! --crab cake goes great with the eggs. Their bloody marys and orange crushes are also well done. They also have outdoor seating which is nice when the weather is pleasant. On another occasion I went for dinner upstairs which was good. Burger was pretty good, but I wouldn't rank it...\n\n\nMore"], ["Brunch was good", 4.0, "September 2, 2013", "Celeste P", "NEW JERSEY", 90, 95, "We had a party of 6 for brunch I had the grits with shrimp it was so tasty. The portion was small. The price is expensive but it's a nice place to meet people for brunch. It was hot outside so we opted to eat inside upstairs. The service was ok."], ["A neighborhood gem", 5.0, "July 18, 2013", "WorldTraveler1960", "McLean VA", 36, 47, "Went there for a fundraiser but were surprised with the quality of food. Portions were generous and the bartenders know how to pour a drink. Prices were quite reasonable given the other restaurants in the vicinity. Check it out ... You'll love it"], ["Essentially a bar with tables outside - and rubber chicken", 3.0, "June 6, 2013", "JohnEO", "Colchester, UK", 182, 268, "Southern Hospitality is located on a busy and noisy intersection in Adams Morgan. If you want somewhere quiet. This is not your location. I imagine the same goes for the bar inside. If you want Southern fried chicken, you want to avoid. I thought mine had been cut from someone's boot. It was breaded, tough to cut, and tasted nothing...\n\n\nMore"], ["Quiet but nice", 5.0, "June 1, 2013", "chakstoneboo", "Guadalajara, Mexico", 110, 84, "I visited on a quiet night but got great services by a friendly bar tender. I did not get to eat but he mixed me up a great couple of drinks"], ["It was OK", 4.0, "April 16, 2013", "desp4vacay", "NJ", 28, 56, "We visited Southern Hospitality on a Sunday night. Had a 7pm reservation and we arrived right on time. They asked us if we would prefer indoor or outdoor seating as it was an April evening and had been rather warm that day, though it was turning chilly. Well, they have heaters in the ceiling if you sit outside, so we...\n\n\nMore"], ["Great Food and Service", 5.0, "April 7, 2013", "SoloLadyWashingtonDc", "Washington Dc", 13, 5, "Southern Hospitality lives up to its name. The staff is friendly and attentive. The food is excellent. Be sure to visit for brunch."], ["Great fried chicken", 4.0, "February 17, 2013", "TravelingNN", "Dublin, California", 61, 27, "I lived in SC for 6 years, so I know a thing or two about good fried chicken and macaroni and cheese. Southern Hospitality got it right. Their fried chicken, macaroni and cheese, and greens is delicious. The chicken is flavorful and not greasy. The entire meal was delightful. I will go again when I am in the Adam Morgan...\n\n\nMore"]]], ["Tunnicliff's", [["Lazy Brunch at a Washington Institution", 4.0, "October 4, 2015", "Ted J", "Hilton Head, South Carolina", 37, 22, "Great brunch spot in Capitol Hill. Adjacent to Eastern Market, Tunnicliff's harkens back to Washington DC circa late 19th century. Try the Western omelette, home fries (with a nice kick) and Chocolate Chip Pancakes, fluffy with a great chocolate chip to batter ratio. Endless cups of good coffee toped off a leisurely meal. Recommended!"], ["Good for breakfast in Eastern Market", 3.0, "September 12, 2015", "Sataviolet", "San Antonio, Tx", 79, 38, "Stopped by for brunch. Had eggs- poached eggs with lump meat crab. Eggs were great, potatoes were fried and just fair. Coffee was below average. Entire restaurant needs a good cleaning."], ["Very good meat loaf open faced sandwich and calamari. Personable server too.", 5.0, "August 14, 2015", "Ec328888", "Chocowinity, North Carolina", 159, 62, "We shared an order of calamari and a side salad which were each plenty to share. Each had the open faced meatloaf sandwich with creamed potatoes. Very nice slab of meat loaf with gravy Potatoes were fine. Our server was a Russian who engaged us in good conversation when we guessed his nationality. The prices were fine for the volume...\n\n\nMore"], ["Excellent food and service", 5.0, "April 4, 2015", "Vateacher5", null, 3, 3, "We stumbled across Tunnicliffs simply because we were hungry and it was the first place we came across. The food was excellent, particularly the omelet and poached eggs with crab. The waitress was great and even chatted with the two kids in our party."], ["Dropped in for a pint or two of guiness....", 4.0, "November 9, 2014", "Krav1", "Upstate New York", 65, 62, "The place seems great. Great location downtown in DC.\nNice vibe. Great watering hole!\nFriendly bartender....menu looked good."], ["Good Food, Great Service and Ambiance", 4.0, "October 12, 2014", "CandyMan627", "Lutherville, Maryland", 197, 67, "The building housing Tunnicliff's was once a tavern and residence run and occupied by a great-great grandfather in the 1800's. His daughter, my mom's maternal grandmother, was born in the residence above the Tavern. Great family history as both sides of my family have had businesses in the Capitol Hill area in the late 19th and early 20th centuries. And...\n\n\nMore"], ["Excellent brunch spot near Eastern Market", 4.0, "September 29, 2014", "MomME50", "Maine", 120, 55, "Had brunch at Tunnicliff's earlier this month, sitting in their mostly enclosed patio area, which turned out to be great for people watching on a Sunday morning. Food (2 different omelettes, breakfast burrito) was very tasty, service was extremely efficient & friendly. Prices were quite reasonable, too - all in all, a very enjoyable experience and we'd definitely like to...\n\n\nMore"], ["Great brunch options", 5.0, "August 13, 2014", "moreworld2c", "Poulsbo, Washington", 171, 61, "Just about every Sunday of the year after church, I head to Tunnicliffs Tavern in Eastern Market for brunch with a group of friends. Some days there are three of us, other days we have ten or more. We are always received warmly, seated quickly, and served promptly. The brunch menu is excellent: steak and eggs, breakfast burrito, farmers omelet...\n\n\nMore"], ["Cobb salad with a friend from HHS", 5.0, "April 28, 2014", "BigDaddyWied", "South Bend", 76, 42, "Great meal and conversation at Tunnicliff's Tavern. An old high school friend recommended and took me there. Probably the best Cobb Salad that I have ever eaten and a generous portion as well. My friend got wings as an appetizer and a Reuben based on the waiter's advice. He loved the Reuben and had 2 beers as well.\nService was...\n\n\nMore"], ["Neighborhood Tavern...great food for the family", 4.0, "April 23, 2014", "Adamommy", "Waterbury", 18, 8, "We ate here our first night in DC. Great menu with salads, burgers, seafood and pizza. Good kids menu, too. Service was slow even though it was not busy, but the atmosphere relaxing. Our food was very good and generous portions--we had a pepperoni pizza, greek salad and tuna. We will be back."], ["Wonderfull Washingto Pub Restaurant", 5.0, "October 24, 2013", "Pyffy", "Northants, UK", 9, 51, "I have already posted this review on the Tunnicliffs (without an apostrophe) review site so please forgive me for re-posting it here as thi sseems to be the current review site..\nWe returned from Washington D.C. at the end of August and I wanted to review a couple of outstanding restaurants we encountered whilst there. The Tunnicliffs Tavern being one...\n\n\nMore"], ["A good place for a big group", 3.0, "June 10, 2013", "revkate", "Decatur, Georgia", 50, 14, "Met friends with kids here for dinner - very kid friendly. My food was mediocre, but the pasta special my mom had was great. All in all a good place for a beer and too meet friends, but not a place I'd go for the food necessarily."], ["Good Local Pub", 5.0, "May 21, 2013", "cnance", "Edmond, Oklahoma", 9, 1, "Visited DC in March 2013. The owner of our rental said Tunnicliff's is a locals hangout, he was definitely right. My family and I visited 3 times during our week stay and the food was excellent everytime. Good beer selection, lots of TV for watching sports, and an area towards the back geared to family seating. Warning, gets loud for...\n\n\nMore"], ["Good pub with typical pub atmosphere", 4.0, "March 11, 2013", "DanHOntario_Canada", "Ontario, Canada", 78, 45, "Had supper last night at Tunnicliffs. It is a typical pub with a good selection of beers on tap and bottled. My wife had Pesto Penne and I had the meatloaf. The food was hot and serviced fast. Both entrees were excellent with good portion sizes. The local beer was great too.\nAlthough we didn't have the three specials they...\n\n\nMore"], ["Service bad food cold watered down mimosas", 2.0, "February 24, 2013", "DrGoodaye", "USA", 17, 11, "I visit DC all the time. I complained about flat champagne and warm mimosa, all they did was add some to the juice.... thats gross. not a single bubble...The eggs were overcooked and arrived lukewarm and the waiter's attitude was... who cares?? Too bad, nice flavor profiles. Spend your money elsewhere. The worst part.... no one gave a damn.\nGo...\n\n\nMore"], ["Brunch stop", 4.0, "January 26, 2013", "Monica S", "Maryland, United States", 77, 29, "We were checking out Eastern market and decide to grab a bite. I highly recommend the Farmer's omelet which had some of my favorite things (bacon, cheese, and MASHED POTATOES). YUMMY! Hubby had the breakfast burrito with home fries. He liked it. I thought it was ok but I may have stolen some of those delicious fries. We also ordered...\n\n\nMore"], ["Escaped from rain...", 3.0, "August 30, 2012", "PDXAJ", "Portland", 23, 7, "Ducked in to escape a downpour and decided to eat lunch. Able to get a table on covered patio without a wait. Service was slow and food mediocre,"], ["Outstanding Weekend Brunch in Eastern Market", 5.0, "August 1, 2012", "Gary P", "Louisville, Kentucky", 63, 22, "When visiting Eastern Market in Washington, DC, this wonderful place serves a brunch menu until 3 pm on Saturday and Sunday. Lunch food, of course, is also available. The food is absolutely delicious, fresh, and beautifully plated. I had a Nova Scotia Benedict-- two perfectly poached eggs sit on top of a toasted English muffin. The eggs rest atop of...\n\n\nMore"], ["Big Brunch", 4.0, "July 30, 2012", "Alpha B", "Charleston, South Carolina", 67, 48, "Come hungry, leave wider. Omelettes, potatoes, pancakes. Outdoor seating on Saturdays to watch the Eastern Market parade of nations."], ["Neighborhood bar", 3.0, "July 25, 2012", "deeflyy", "Washington DC, District of Columbia", 16, 3, "that won't let you down for serving consistent solid food. nothing to write home about per se, but it's a great watering hole atmosphere with a generous outdoor seating area and good comfort food."], ["Nice Neighborhood Place", 4.0, "July 12, 2012", "anniemh2o", "Washington DC, District of Columbia", 59, 28, "Decent food, great burgers and a fun place to watch sporting events. Outdoor seating and enclosed in teh winter. Dog friendly outside year round."], ["A good, local bar.", 3.0, "July 3, 2012", "Kevin B", "Chicago, IL", 86, 58, "While we were visiting the Eastern Market, we stopped in Tunnicliff's Tavern for a drink. The place is full of regulars which says something. The staff were friendly and the drinks good."], ["Good food, decent service, young clientele", 4.0, "June 11, 2012", "LaChatNoir", "Indiana", 203, 132, "Our VRBO proprieter touted it as best burgers on the hill. We had a late dinner on the patio out front one night. Husband was very satisfied with his meatloaf, mash potatoes and sautéed veggies. I had to try the Texas burger, piled high with toppings on a tasty bun, it was delicious. Fries were above average, hot and crispy....\n\n\nMore"], ["nice visit to old friend; pleasantly surprised", 4.0, "May 31, 2012", "walton56", "Washington, D.C.", 183, 86, "we recently went to Tunnicliff's after a visit to Eastern Market and the Sunday market, our last visit perhaps 28 years ago. my expectations were not high, as we stopped for a drink and a bite. the old atmosphere was the same - cosy, unassuming. they had a decent selection of bottles and drafts, which we enjoyed. we had a...\n\n\nMore"], ["Pint for the History Buff", 3.0, "April 23, 2012", "Ferinha", "Washington DC, District of Columbia", 61, 40, "This establishment has been here for quite some time. I'm a big reader of presidential biographies and have seen Tunnicliff's appear in several books with James Madison and Thomas Jefferson. This was also a hotel back in the day.\nAnyway, aside from the historical perspective, which I really enjoy, this is a nice place to go for brunch. It's cozy....\n\n\nMore"], ["Eastern Market Gem", 5.0, "April 19, 2012", "Raymond D", "Yantic, Connecticut", 21, 13, "Nice menu and excellent service, staff patient and accommodating.Fairly priced, comfortable decor and clean. Indoor or outdoor seating,obviously strongly supported by many of the locals, but very welcoming. Menu was varied and had great apps, nice salad choices and burgers. Dinner menu included a number of tempting specials, I look forward to a return visit next time I'm in the...\n\n\nMore"], ["Small and cozy", 3.0, "February 15, 2012", "tothebeatofadrum", "Washington DC, District of Columbia", 16, 9, "Good for dinner - but the staff does not accommodate happy hour groups very well."], ["spiffing up the place", 4.0, "January 26, 2012", "E20003", "dc", 76, 79, "tunnicliff's was skating for a while, but now they've put a lot of energy into making the place new again. always can be relied upon for good bar food and a busy crowd. sometimes the beer list can be haphazard though."], ["Eastern Market and Tunnicliffs Tavern make for a nice Sunday brunch", 4.0, "January 1, 2012", "skjwatkins", "Birmingham, AL", 27, 41, "Pros:\n*Food - The brunch is great! If you like eggs, try the Eggs Benedict with lump crab meat (YUM). If you're not into brunch, they also have hamburgers and sandwiches on the menu.\n*Atmosphere - if you want a sports bar atmosphere, sit up front inside. If you want a quieter more elegant atmosphere, sit in the back. If...\n\n\nMore"], ["Accidental nice find", 5.0, "December 27, 2011", "Loriinchas", "Charleston, South Carolina", 45, 38, "We were actually aiming to have lunch at Montmarte on the Hill the day after Christmas but it - along with most of the other restaurants in the immediate area - was closed. Except for Tunnicliff's. This is definitely a neighborhood type pub. The dark paneling gives it a very cozy feel in the cold weather. We sat the the...\n\n\nMore"], ["Cheers Revisited", 3.0, "November 28, 2011", "dceuropatraveler", "Washington DC, District of Columbia", 106, 46, "They know your name here! Good neighborhood bar. Food is not what you come here for, though they have a pretty good menu. Would not want to check out the cooking operation, though... Have had some pretty mediocre food here. But like I said, good neighborhood bar, fun to bring friends to, good for some drinks and maybe some bar...\n\n\nMore"], ["A Very Nice Neighborhood Bar", 4.0, "November 26, 2011", "ace4444", "Fairfax, Virginia", 431, 141, "To be fair, we went to Tunnicliff's for drinks only, but really liked the place. The inside was very nicely appointed and the drink selections kept us happy through several rounds. They had Redbridge for the gluten-intolerant member of our party. Service was excellent, the atmosphere was lively and the food being served to/eaten at other tables looked delightful."], ["We felt insulted by the treatment here", 3.0, "September 25, 2011", "Curnutte", "Aiken, SC", 38, 25, "First the good - the food was fine. But the staff has no manners whatsoever. The hostess and our waiter were both curt, and their behavior bordered on rude. We were a party of 5 with a young child - all very nicely dressed; and yet our bill came with the gratuity included. We don't look like the kind of...\n\n\nMore"], ["Wow, no thanks", 2.0, "August 11, 2011", "KR", "Washington, DC", 11, 11, "This place looked convenient & relaxed enough to stop in for weekend brunch after an afternoon of browsing & shopping in DC's Eastern Market. What a mistake - from the first curt dealing with the hostess, to the initial experience with our waiter (who berated us for having ordered our initial round of drinks at the bar WHILE WE WERE...\n\n\nMore"], ["Best Breakfast", 5.0, "July 10, 2011", "eaglekg", "Arlington, Virginia", 186, 54, "If we are ever near Capitol Hill on a Sunday, we go to Tunnicliff's for breakfast/brunch. The Eggs Benedict with crabmeat (they call it something like Eggs Chesapeake) is simply one of the best things that I've ever eaten. The crowded and bustling atmosphere on Sunday morning is just what you would expect for the area, but the staff handles...\n\n\nMore"], ["Good, but nothing outstanding", 3.0, "June 26, 2011", "twoandtwomakes5", "Falls Church, Virginia", 25, 4, "Food was good, but nothing really special. We sat outside, which was lovely, but the tables are a little too close together, so getting in and out is awkward if there are people at the next table over. The waiter didn't have a beer list and couldn't quite remember what beers they had, but was otherwise nice enough. We selected...\n\n\nMore"], ["Great burgers!!", 5.0, "August 15, 2010", "Zaphod", "Shepherdstown, West Virginia", 192, 131, "On a trip to Eastern Market, we liked the looks of this place and just picked it out of the blue. I had a burger, and it was one of the best I've ever had. The beef was flavorful, it was cooked perfectly, and it was topped with just the right amount of a savory blue cheese. My wife was...\n\n\nMore"], ["Good food, rude service.", 2.0, "July 18, 2010", "ColumbiaKeef", "Columbia, Maryland", 1, 0, "For two years I lived around the corner from Tunnicliff's and considered it one of my better neighborhood places and it was often a go-to place when being indecisive. The food was always good, atmosphere low-key and the service was good enough to not really pay attention to it.\nI've since moved out of the area and my wife and...\n\n\nMore"], ["Good pub food.", 4.0, "January 9, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good pub food."], ["Fantastic brunch, yummy...", 4.0, "October 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fantastic brunch, yummy pizzas. Perfect neighborhood bar/restaurant"], ["The service is really great... it's a nice atmosphere... like the bar on \"Cheers.\" The food is good and I...", 4.0, "September 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The service is really great... it's a nice atmosphere... like the bar on \"Cheers.\" The food is good and I must say that I have spent a lot of time here!"], ["Great bunch! Best pancakes and blood marys.", 5.0, "March 3, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great bunch! Best pancakes and blood marys."], ["They have a wide selection of food, so it's a great place to take tourists who want a relaxed meal - in the heart of...", 2.0, "February 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They have a wide selection of food, so it's a great place to take tourists who want a relaxed meal - in the heart of the market."], ["It's Cheers....Capitol Hill style. Definitely a place where they \"know your name\"....well at least if you...", 3.0, "January 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It's Cheers....Capitol Hill style. Definitely a place where they \"know your name\"....well at least if you shed out some decent bucks at the bar."], ["Best burgers in DC!", 5.0, "January 16, 2008", "shrtsassygirlyinTX", "El Paso", 15, 16, "This place has the best burgers by far in DC! The food here is great and the staff is super attentive!\nThis is the type of place you can hang out with after work with friends or even take your parents when they visit. The burgers are great and the crab cakes are yummy!\nI enjoy visiting in the summer...\n\n\nMore"], ["Bar with really good food, excellent pizzas, often good specials", 5.0, "November 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Bar with really good food, excellent pizzas, often good specials"], ["If you're looking for a...", 4.0, "November 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "If you're looking for a nice brunch spot this is it. Best plates are Eggs Chesapeake, Farmer's Omlette, French Toast, and Chicken Sandwich. $3 Sam and Sam Seasonal during Nationals Games."]]], ["&pizza", [["great place to grab lunch by the Basilica", 5.0, "July 31, 2015", "taddoloco", "Hudson River Valley, New York", 52, 20, "We had lunch here after visiting the Basilica. Three guys from Brooklyn were very impressed with the Pizza. What a great concept!"], ["Awesome pizza", 5.0, "July 17, 2015", "Peter H", null, 11, 7, "People were caring and kind. Wonderful pizza. Not only homemade you choose fresh ingredients: type of crust, a type of sauce, different cheeses, vegetables and meats or other proteins (chickpeas, shrimp, eggs, falafel) and a top finishers (greens, cheeses, etc) and a type of oil if you want.\nYou can go as simple or as complex as you want.... For...\n\n\nMore"], ["Make Your Own Pizza", 4.0, "June 29, 2015", "dpl1975", "Wheaton, Maryland", 26, 1, "This is a fun place to go and experiment with pizza sauces, toppings, and crusts. Be sure to get there with some time to spare, though, as the line can be longer than usual on the nice DC afternoons, and there can be a lack of seating inside. It's also a good value, because you can make two meals out...\n\n\nMore"]]], ["Rialto", [["Not quite Paris, but almost", 5.0, "July 1, 2015", "Fada C", "Washington DC, District of Columbia", 7, 1, "For Father's Day, I took my husband to Maxime's. It was such a delight to be back in the space where he and I had spent a lot of time (previously The Guards, then Rialto's). Maxime's was reminiscent of the numerous restaurants in Paris with the prix fix for steak and frites. We enjoyed the cocktails and the food; since...\n\n\nMore"], ["Convenient Location, Good Food, Ok Service", 3.0, "March 20, 2015", "Threedogstwokids", "Toronto, Canada", 109, 64, "We were tired after a day of sight seeing in DC. This place is well located right on M Street in Georgetown. The service was OK but not the best. The place was not busy and yet it seemed as though we were looking for service staff.\nThe food was well prepared and presented.\nOverall we walked out full but...\n\n\nMore"], ["Fantastic Italian food", 5.0, "March 16, 2015", "Andy R", "Chicago, Illinois", 50, 19, "Rialto was a very nice surprise serving the best meal I had while in Washington DC. The restaurant and decor are modest but the food was a notch above the typical italian food served at most restaurants. The server recommended a wonderful chianti, the breads and oils were fantastic and the pasta dishes were superb. The prices were very reasonable...\n\n\nMore"], ["Disappointing", 3.0, "January 27, 2015", "dcoalr", "Atlanta, Georgia", 90, 42, "The Rialto is a very nice looking restaurant. The bar is fun, and we often stop by for a drink. I made a reservation for my husband's birthday dinner, since he has always wanted to try a meal there. We shared an arugula and pear salad, which was fine. He had a pasta dish that he said was good, but...\n\n\nMore"], ["Some huge misses in the kitchen.", 2.0, "January 11, 2015", "Kalindanya", "Michigan", 91, 64, "Once the leaden bread arrived at the table, I was ready to bolt, but the waiter was attentive and the menu items were inviting and so we stayed. The house salads were decent but overdressed. THe main courses were disastrous. I love Bolognese, but the pasta in the Rialto's bolognese was rubbery and overcooked, and the sauce tasted like something...\n\n\nMore"], ["Ultimate people watching", 4.0, "January 5, 2015", "Ally T", "Boston, Massachusetts", 14, 8, "If your a budget conscience backpacker, this probably isn't somewhere you want to get dinner.\nThat said, it's still worth a visit if you want to really experience (read: eavesdrop on) what Georgetown is all about. I just had a seasonal white sangria (delicious, if a bit overpriced) at the chic bar and listened to the conversations around me."], ["A solid choice for dinner.", 4.0, "January 2, 2015", "CocoCantrelle", "Canberra, Australia", 162, 104, "Rialto is a good choice for dinner. The ambience is great inside the restaurant and we were seated near the (gas) open fireplace. Food was tasty and the menu has a range of choices and specials."], ["Nice place", 4.0, "December 17, 2014", "estrelitzinha", "Brasilia, DF", 9, 2, "Rialto is a very chic restaurant. I love the furniture and the enviroment.\nI went there during happy hour and got a pizza for $8, if I'm no mistaken.\nEverything was going great until i asked for the check. The waiter charged me the full price for the pizza. I asked him about it and he told me that the...\n\n\nMore"], ["Perfection", 5.0, "December 9, 2014", "AVNieves", "Cheshire, Connecticut", 35, 13, "When a last minute group of 8 formed for dinner, I worried we wouldn't find a restaurant. My worries disappeared after reserving a table at Rialto. The staff was incredible, the atmosphere was perfection and the food was outstanding. My only complaint is that standard drinks, i.e. vodka martini, manhattan, etc from the bar were not good. But after order...\n\n\nMore"], ["Great food and service", 5.0, "November 24, 2014", "Alisonjenk", "North Carolina", 32, 15, "Loved the charcutterie selection and cheeses. Meatballs (polpoette) are great and the calamari was fresh in a light batter.\nA great find."], ["A little pricey", 3.0, "November 20, 2014", "oceanyeesa", "Orange County", 40, 9, "Good Pizza. They do a great happy hour with pizza 1/2 off, but make sure you are in the bar to get that price"], ["Good food, disappointing service", 4.0, "November 11, 2014", "Calypso007", "Pittsburgh, Pennsylvania", 267, 116, "This is a nice restaurant for escape the noise and bustle of M Street and for a good Italian meal. The menu is varied and there is something for everyone. The atmosphere is cozy and chic. I had the Raviolini and they were very tasty, though quite heavy. My only gripe is that the waiter was very grumpy and really...\n\n\nMore"], ["Excellent Italian food", 4.0, "November 3, 2014", "Earthman199", "California", 7, 1, "Ate here several months before, and again in October 2014. Not cheap, but food was excellent. Fish prepared as well as I've ever had it in a restaurant. Portions tend to be small, but that seems to be the trend these days. Service was fine, others seem to have had problems but we didn't. We've eaten at a lot of...\n\n\nMore"], ["abysmal dinner service, not recommended", 2.0, "October 28, 2014", "jg325", "WashingtonDC", 489, 320, "Went to Rialto with my partner, and the service here is absolutely abysmal. Definitely not recommended.\nIt was easy to get a reservation here, and when we arrived at 6:30, there was basically no one here. The restaurant self is very large, and we were given a choice of basically all the tables. They have a large gas-fired fireplace which...\n\n\nMore"], ["Italian Treat in DC", 4.0, "October 26, 2014", "rick b", "rockville, md", 31, 21, "In the vibrant Georgetown neighborhood of The District is this also vibrant Italian restaurant on M. Street. Rialto is busy on weekends and some weekdays, so it's a good idea to make reservations. We visited on a Friday evening with reservations and were seated immediately and right across from a nice fireplace which did not produce unwelcome heat. If you...\n\n\nMore"], ["Good food - poor service", 3.0, "September 12, 2014", "Tamada77", "Washington DC, District of Columbia", 21, 15, "The food at Rialto is quite nice and reasonably priced - especially for Georgetown. However, the service we received was very poor. We received our appetizers - pumpkin soup and eggplant Parmesan (both excellent) - promptly and then literally never saw our server and again. After too long of a wait our food arrived. Both dishes - cavatelle with fava...\n\n\nMore"], ["Good Soup and Pizza", 4.0, "September 3, 2014", "nanu p", "Arlington, Virginia", 32, 11, "I have been here twice . Once in the winters when I was cold and had the Minestrone soup here and the other time I had the Cheese Pizza to go. Both the items were excellent. The service at the Bar was efficient ( the Bartender - she was from Morocco ) . Would go there again based on food...\n\n\nMore"], ["Keep Walking", 2.0, "September 1, 2014", "voltravel", "Washington DC, District of Columbia", 41, 18, "We dined here Friday night with friends, all of us locals. The appetizers were run of the mill at best, the entrées were over cooked and over salted. The wait staff was so so. Keep walking, there are way better restaurants in this foodies town than Rialto."], ["Excellent", 5.0, "August 20, 2014", "Kaz H", "Perth, Australia", 12, 3, "We went hear in a party of 4 and ordered a bunch of things to share. The Pizza's and Gnocchi wit the pesto sauce were a highlight. Very tasty indeed. Great service and nice wine recommendation from our waiter too she was absolutely lovely from Bulgaria if I remember correctly. I would definitely go back."], ["GRATUITIES 20% already included in your bill", 2.0, "August 15, 2014", "maude b", "Montreal, Canada", 2, 1, "My husband and I went to Rialto last Wednesday night and received the bill with the 20% tips already written on the bill and couldn't change the amount as the waiter proceed to payment before we could have say something!! Once we saw the amount we asked him why he charged us 20% and he respond that when you have...\n\n\nMore"], ["We've made this our regular place.", 5.0, "August 11, 2014", "ShelClarkDC", "Washington DC, District of Columbia", 6, 11, "Okay, full disclosure: Rialto is just two blocks from our home in Georgetown. But we'd be regulars even if wasn't our local spot. Absolutely the best happy hour in town, so we're there at least once a week for their amazing (and very authentic Naples-style) pizza and drinks. Pizzas are half price every night but Saturday! We've also dined in...\n\n\nMore"], ["Small portions", 4.0, "August 10, 2014", "minimelon", "Cornwall, Canada", 69, 32, "The restaurant is set within a old historic type building. The service is attentive. The variety of food is not all that exciting. The Bruschetta was served soggy."], ["Good Italian food in Georgetown", 4.0, "August 3, 2014", "JRMom", "Maryland", 30, 8, "Upon a recommendation we decided to try Rialto for dinner. Four of us dined here. We shared 3 appetizers: Pizza, Eggplant Parmesean, and Meatballs, all were good. Entrees were also tasty. Seafood stew was full of fish and seafood, garlicy but a bit salty. Added hot pepper flakes because I like spice. Would order this dish again. Pasta Bolognese was...\n\n\nMore"], ["A Great New Chef", 5.0, "July 15, 2014", "GiancarloBuonarroti", "Washington DC", 130, 83, "The new Chef Michele(Michael) Lisi haas made Rialto a go to spot for excellent Italian food! I went with friends, one of whom grew up in Naples, Italy. We had the following\nWatermelon Salad-Excellent with ricotta salata and baby tomatoes, a touch of mint, delicious and refreshing!\nScamorza- wrapped in pancetta and grilled gently-delicious treat from Puglia region of Italy...\n\n\nMore"], ["Ok place", 3.0, "July 2, 2014", "Z R", "Villingili", 23, 5, "Great location but the food didn't show the love of the chef. There are better places around and cheaper."], ["Sloppy Poppy", 1.0, "June 29, 2014", "turtlekrawl30", "turtlekrawl30", 45, 35, "I guess when you follow one of the salad chef in and out of the bathroom and he doesn't wash his hands, your night isn't going to get much better. Not wanting to cause a scene or get him fired, we didn't report it, just didn't order a salad.\nWe did, however, order pizza and a $7.00 glass of sangria...\n\n\nMore"], ["Hip Italian restaurant in the East end of Georgetown", 4.0, "June 13, 2014", "0beachbum0", "McLean, Virginia", 82, 29, "Great basement private room- very hip in environment and décor and good for private party. All four in the dinner party (ate upstairs) had very good food and a very nice waitress. Would recommend for a good dinner.\nInteresting co-ed bathroom (sinks/washbasins are co-ed in same spot) with bathroom split but very close in separate stalls- not for the shy....\n\n\nMore"], ["Food excellent !", 5.0, "June 11, 2014", "kaycavanagh", "London, United Kingdom", 36, 33, "We were actually looking for another resturant but my phone died and couldnt remember address, So after driving in the rain we just parked up outside rialto and went in, husband didnt want italian as he is a chef & italian,\nBut what a lovely surprised, Wasnt very busy, so service was excellant, friendly and efficicent,\nWe shared stater called...\n\n\nMore"], ["Nice option and space but food spotty", 3.0, "May 28, 2014", "Arlington30", "Arlington, VA", 121, 69, "I liked having another option in Georgetown but thought menu limited. Our waiter not the best but other waiters who helped us when he was no where to be found great. We shared the fish and\ncaesar salad. Salad best thing about meal."], ["Great for Small Plates", 4.0, "March 31, 2014", "nmfMaine", "Maine", 50, 33, "We were looking for an Italian restaurant when we were walking in Georgetown, because my two year old granddaughter had asked for salami and cheese. By the time we arrived she had fallen asleep, but we were given a spot by the fireplace where she could sleep in her stroller at the table. Our very able server, Ali, let us...\n\n\nMore"], ["Excellent Happy Hour Destination", 5.0, "March 29, 2014", "Shadowz425", null, 10, 6, "I went to Rialto twice in the past week while in Georgetown for a business trip. We ate at the bar on both occasions. The bar is tastefully decorated and has a modern feel. The overall atmosphere is very cool. From the bar you can see the pizza oven and the chef's prep area. Rialto has very reasonably priced happy...\n\n\nMore"], ["Great", 5.0, "February 25, 2014", "Marc L", "Westport, CT", 53, 37, "Great energy and food. Glad our hotel recommended it. This minimum number of characters is a waste of time"], ["Very nice experience", 4.0, "February 16, 2014", "CigarBob50", null, 57, 53, "Was able to secure a table for Valentine's Day with my wife and overall had a very good experience. Our waiter was Simon who despite the sheer numbers of diners for dinner did a remarkable job taking good care of us. Cheese and meat appetizers were very tasty with lots of choices. Good range of entrees for dinner and desserts...\n\n\nMore"], ["Best Brunch now in Georgetown", 5.0, "February 2, 2014", "smartiq", "Athens Greece", 239, 132, "Having experienced numerous brunches in the area, i was pleased to see the Rialto newly offering brunch. We had both types of eggs benedict, one wigh salmon, as well as mushroom pizza. Eggs were perfect and pizza delicious ! Bust bestest of all were the chocolate hazelnut filled raviolis for dessert! Service was most pleasant as well. Will go again...\n\n\nMore"], ["Good food, bad service", 3.0, "January 23, 2014", "laysadc", "Washington DC", 327, 134, "My friends and I went to Rialto a couple weeks ago. We made a reservation and were seated right away, but we didn't see a waiter for over 10 minutes. It took them a while to even bring us water. We ordered various appetizers and small plates, but they forgot to bring one of our dishes. The food, however, was...\n\n\nMore"], ["Good food with mediocre service", 3.0, "January 14, 2014", "LLB4", "New York City, New York", 31, 14, "OK, it was New Years Eve. The food was quit good. The waitstaff & the reception were very confused. I didn't order ceviche but the waiter brought it to the table twice, almost insisting that I ordered it. Until he found the right table."], ["Awesome Food", 5.0, "January 4, 2014", "Michael H", "Staten Island", 17, 2, "Went to Rialto for dinner with a party if 9. The decor is very retro and well done. The appetizers are great small dishes that are meant to be shared. Everything from the seafood, meatballs and artichokes was great\nHad the fresh pasta that is made on the premises for a main course and it was fantastic!!\nThe service was...\n\n\nMore"], ["Two visits, one good, one not so good!", 4.0, "December 31, 2013", "Ber909", "Cumbrian", 82, 90, "We had a short break in Washington and found this relatively new restaurant whilst strolling in Georgetown. First time we visited was very good with its Italian Tapas style of food and ordering. All tasted very good, service nice and a good atmosphere.\nWe enjoyed it so visited again 2 nights later – Not so impressive, service was slow to...\n\n\nMore"], ["Delicious Italian!", 5.0, "December 16, 2013", "Eleanor A", "Williamsburg, Virginia", 5, 1, "Stopped in for a quick lunch during a marathon Christmas shopping excursion in Georgetown. Sat at the bar and had a lovely light lunch of polenta with sauteed mushrooms and truffle oil. The focaccia with olive oil was also delicious and my Peroni was ice cold. It was the perfect comfort food for a cold and rainy day. Service was...\n\n\nMore"], ["Something for Everyone", 4.0, "November 12, 2013", "TMD16", "Adelaide, Australia", 50, 25, "I ate at this restaurant with some colleagues while we were in DC for a conference. I love the concept of this restaurant, with its wide variety of choices and ability to mix and match a meal to your choosing. I especially liked the fact the menu featured home-style Italian favourites like lentils, and the excellent salumi and cheese selection....\n\n\nMore"], ["A bright spot for Democrats or Republicans", 4.0, "November 12, 2013", "Texman1313", "Houston, Texas", 44, 11, "Enjoyed the food and service. Try the Italian beer if you want something new. Portions were just the right size. If I hadn't visited the bathroom, I would have missed the lady making pizza in the basement. Worth the trip. Don't forget to ask for the dessert menu. There are some real gems available."], ["Wonderful addition to Georgetown", 5.0, "November 9, 2013", "Fremdenfuhrer", "Boulder, CO", 108, 39, "The Rialto now graces the address on M St where the Guards stood for many years. It offers a delightful array of Italian small and large plates. The range of offerings easily permits assembling several tastes into a delightful meal. The wine list has a good range of options both by the glass and by the bottle. I had had...\n\n\nMore"]]], ["Al Dente", [["Has become a neighborhood favorite", 4.0, "October 3, 2015", "Jean A", "Bethesda, MD", 141, 29, "Although a bit expensive, the food and service make this a regular stop on my \"Let's get Italian\" route. Aside from a good wine list and helpful staff, the food is consistently good and above average if you order the pizza (you can watch it in the oven) or a traditional pasta dish. The cauliflower side was quite yummy as...\n\n\nMore"], ["Great food in a laid back neighborhood atmosphere", 5.0, "September 20, 2015", "GeorgeWashDC", "Washington DC, District of Columbia", 20, 12, "Roberto Donna has unbelievable cooking talent... Al Dente showcases this in spades, and at incredible value-for-money. Impeccable pastas and pizzas...we are so lucky to have place in the neighborhood."], ["Sweet Italian", 4.0, "September 5, 2015", "birchmont25", "Maryland", 60, 25, "Neighborhood Italian with master chef Roberto Donna. So good. So convenient. And the wine list is great, too! Love that reservations are easy to make. If you have a hard time with small kids around, make your reservation for the 730 crowd."], ["Great food if you have plenty of patience", 4.0, "August 12, 2015", "apkam", "Washington DC, District of Columbia", 14, 2, "The menu and the food is amazing, and remarkably, Chef Roberto Donna is always in the kitchen. However, the service is slow and disorganized and frustrating. It's s pity, because this place could be great."], ["Delicious food & wine!", 4.0, "July 25, 2015", "Alicedixon", "Wellington", 18, 6, "Highly recommend this place which was bustling with people on a Friday night. Love the open kitchen and the comfort of seeing what goes on behind the scenes. Great service and the food was delicious - the trout was to die for and they were certainly generous with their protein portion. Thanks for a lovely meal!"], ["Seriously underrated neighborhood gem", 4.0, "July 22, 2015", "dralixj", "Washington DC, District of Columbia", 14, 18, "It's a mystery to me why this restaurant is not packed every day! The food, under the supervision of talented chef Roberto Donna, is consistently delicious, fresh and flavorful. Service is attentive, seating is comfortable and there always are seasonal specials. Wines by the glass are well priced and represent a good range of price and style. And desserts!! Yesterday...\n\n\nMore"], ["True Italian food with a true Italian chef", 5.0, "June 5, 2015", "Giuseppe B", "Fairfax, Virginia", 2, 1, "Since the beginning I was feeling back in Italy with chef Roberto personally guiding you through the menu and explaining all around each dish.\nI loved the Molecche a soft shell crab appetiser, home made pasta was outstanding and also pizza was great for my kids.\nAt the end an home made tiramisu and an espresso were the right conclusion...\n\n\nMore"], ["A good meal spoiled", 2.0, "May 23, 2015", "JAM02", "Maryland", 166, 56, "As you'd expect, chef Roberta Donna offers an appealing Italian menu that includes both traditional and creative cuisine. When the weather is nice there is an attractive outdoor patio that's a pleasant place to spend the evening. However, what could have been a lovely evening was spoiled by a very youthful, inept and poorly trained staff who seemed to be...\n\n\nMore"], ["Delicious Neighborhood Italian Restaurant", 4.0, "May 21, 2015", "Jeff M", "Washington DC", 11, 9, "Al Dente of Washington is delicious -- It's not really fair to call this a \"neighborhood\" restaurant, the food is too good for that. But it's small and friendly with a big bar in the middle around the pizza oven that makes for communal dining. The menu is broad, with pizza from the brick oven, pasta, and main courses of...\n\n\nMore"], ["Excellent and authentic", 4.0, "March 10, 2015", "ERosewall", "De Pere, Wisconsin", 42, 20, "My only complaint about this restaurant is that we waited quite a while for a table, and the bar area was cramped and uncomfortable - we had to cram around a small hightop with only two places to sit. It was a Friday night, and we didn't have a reservation, so some delay is to be excused, but it would...\n\n\nMore"], ["Al Dente for Valentines Day", 4.0, "February 20, 2015", "klmaestra", "Silver Spring, Maryland", 71, 12, "We chose Al Dente for Valentines Day based on previous experience at the restaurant and the special deal offered that evening - any appetizer, pasta or entree, and dessert for $45 per person. The opening of the whole menu and as we learned that evening all of the specials that night was a wonderful chance to try things on the...\n\n\nMore"], ["Lunch was superb, private, an reasonable", 5.0, "February 14, 2015", "delen1", "Washington DC, District of Columbia", 118, 57, "I had the pappardelle with wild boar ragu and enjoyed every morsel. My guest had a salad with salmon. The salmon was perfect in flavor, size, and temperature. The bread that was brought to the table was so tasty that it did not need oil. After such a filling lunch I appreciated that you could get one scoop of ice...\n\n\nMore"], ["The REAL THING", 5.0, "January 21, 2015", "CubanPete", null, 26, 37, "If you like your Italian food authentically prepared, this is the place. After three visits I can't really find anything to complain about as Chef Roberto Dona has been there every time I have been and has kept an eye on everything. If you are going for lunch try the three course fixed price menu with a zucchini blossom and...\n\n\nMore"], ["Grappa and Digestivo like I was back in Italy!", 4.0, "January 19, 2015", "pinotgrigi0", "Washington DC, District of Columbia", 36, 19, "But I digress :D\nBecause I was doing a business presentation and knew I would be doing a lot of talking, I ate before meeting 2 other friends at 2:30 pm. My first impression of the place was very good and the professional wait staff put me and my friends immediately at ease as we were offered a choice of...\n\n\nMore"], ["Excellent pizza and pasta", 4.0, "January 5, 2015", "Susiewoozie12", "Reston, Virginia", 162, 50, "Stopped in on weeknight for quick dinner. The pasta (pappardelle with wild boar ragu) was wonderful. We also shared a pizza and it was also great.\nNice wines by the glass as well.\nWill come back to try more selections from the menu.\nDecor is a little weird- orange and black......but the bathroom is beautiful :)"], ["Excellent food casual atmosphere", 5.0, "December 30, 2014", "Phillips3675", "Brooklyn, New York", 37, 10, "My branzino was inspired, my wife's butternut squash ravioli was excellent.\nI didn't find the restaurant to be particularly beautiful but it was reasonably attractive.\nThe waiter was very good.\nI gave the restaurant an excellent because the food was so good"], ["Nice Holiday Menu", 4.0, "December 30, 2014", "celentms", "Hernando, Florida", 42, 17, "We chose Al Dente for our annual Festa di Sette Pesce, and were not at all disappointed. The separate courses were nicely prepared, the services was appropriately attentive, and the restaurant ambiance and noise level were pleasant."], ["Great food, but horrible service makes for a frustrating experience", 2.0, "December 29, 2014", "MJBTR", "Virginia", 1, 0, "My family has been to Al Dente restaurant several times, but the December 24 Feast of the Seven Fishes was an extremely frustrating experience. After dining for 1 hour and 40 minutes, only 4 plates (of the 8 total) had been served. And there were a number of service errors. For the mussel plate, there were 2 mussel shells but...\n\n\nMore"], ["Roberto's 8 is an extraordinary experience.", 5.0, "October 16, 2014", "Woodroad", "Washington, DC", 148, 114, "I'm a long-time fan of Roberto Donna's and went many times to the Laboratorio del Galileo, Donna's in-kitchen restaurant with a 15+ course tasting menu. He has reincarnated the Laboratorio in eight seats at the bar facing the Al Dente's kitchen, and he continues to work his magic. Our 18-course repast last night was stupendous. It ranged from a petite...\n\n\nMore"], ["Uneven", 2.0, "September 27, 2014", "Dtlaw67", "Washington DC, District of Columbia", 25, 12, "We had dinner at Al Dente with another couple. The appetizers were quite good - fried and stuffed zucchini flowers, smoked tuna with an eggplant tapanad. Two in our party had the raviolini which was flavorful, but a bit dry. Had the waitress reappeared my wife would have asked for a bit of butter or olive oil, and in the...\n\n\nMore"], ["Good food, very noisy", 3.0, "September 22, 2014", "Aristippe77", "Bethesda, Maryland", 54, 37, "The food here is pretty good. Service was pleasant, but slow. The biggest problem is the high noise levels. There is a very active bar area, and they keep the music fairly loud, so there are a lot of people talking very loud to be heard over the music. It meant that my husband and I couldn't have a relaxing...\n\n\nMore"], ["Overpriced food", 2.0, "August 10, 2014", "Urbanfarmgrl", null, 128, 26, "We had a business lunch I had a salad with the calamari. It was a huge platter of plain greens with a few calamari on it. I thought there would have been some carrots or something besides greens, but nope. My colleague had the Cesar with chicken. It was the same but he did have a full hard boiled egg...\n\n\nMore"], ["Unexpectedly Excellent Food", 5.0, "July 28, 2014", "DCMomX", "Washington DC, District of Columbia", 32, 4, "We were pleasantly surprised by everything we ordered -- so much so that we went back two days later. Outstanding and inventive appetizer salad of crab and tomato; wonderful gluten free pasta with lobster. So glad to have Al Dente in Foxhall."], ["Surprisingly nice", 5.0, "July 17, 2014", "Giorgio P", null, 78, 34, "I found it by chance, and give it a try. Definitively a place to go back both to have an extremely good \"very close to real Italian\" pizza or a nice dish. The menu is really unique.\nPlace is really nice, and service is friendly.\nI know they have an happy hour deal on drinks and food but don't know...\n\n\nMore"], ["Over-rated pizza but still okay", 3.0, "June 28, 2014", "RetiredDude", "various", 160, 53, "Went with friends on a Friday evening. The place was crowded but the service was okay. Three of us had pizza and the other pasta. The food was good but the pizza -- despite the fancy ovens -- was just okay. A good addition to the neighborhood but not worth going out of the way for."], ["Nothing Exceptional", 2.0, "June 1, 2014", "Patrick M", "Williamsburg", 1, 0, "Food (Frittata, sea bass, etc.) was OK, but not worth the time and effort of going there. Service is slow, lacks personality and not very attentive for after 4pm on Saturday. Will not go back given the numerous alternatives in the DC area."], ["Excellent, authentic food; excellent holiday menus", 5.0, "May 28, 2014", "timothina", "Kingston,Ontario", 3, 2, "I used to live in Italy, and this is the best Italian food I have had since leaving it. In fact, this is better than the vast majority of Italian food I had while living there.\nMost of the time the service is excellent, but I have had the occasional bad server.\nI have eaten here many times and our...\n\n\nMore"], ["The 90's are over!", 2.0, "May 13, 2014", "PaulineKael", "Washington DC, District of Columbia", 23, 61, "This place is totally overrated. I struggled to find something on the menu to order. It's trying hard to be a cool, hip Italian restaurant that was popular back in the 90's. Doesn't seem relevent in 2014. The food was only so-so and the service was terrible. The atmosphere isn't very appealing. In short, we couldn't wait for our dinner...\n\n\nMore"], ["Vibrant, a little noisy, but Fabulous food", 4.0, "May 4, 2014", "willbikeforwine", "vancouver", 250, 76, "This was another recommendation by friends to \" not miss\" while in DC. Wes loved it, service was attentive, food was fabulous. All plates, appis, mains and dessert were excellent. They even comped the corkage on our wine! Bene!!"], ["not bad for happy hour", 3.0, "April 8, 2014", "ajk470", "Arlington, Virginia", 18, 3, "The food was good . The service was good. The waitress did not return my credit card and I had to return to the restaurant to pick it up on another day."], ["Always consistent...", 5.0, "March 4, 2014", "Mel1776", "Washington DC, District of Columbia", 7, 8, "I've never had a bad meal here. Service is great and food is wonderful. Please order the meatball appetizer. Yum."], ["Very good inventive Italian food; great weekend brunch value; off the beaten track", 4.0, "February 17, 2014", "mclpcm", "NYC", 205, 67, "Pros: Very good inventive Italian food; decent wine choices; outstanding value for lunch by DC standards; over the top decor\nCons: over the top decor; off the beaten track; far from metro station (one reason why prices are good)"], ["Sometimes great, Sometimes good", 4.0, "January 30, 2014", "delen1", "Washington DC, District of Columbia", 118, 57, "I think the most interesting variety of foods and richness in flavors comes from the pre set menus. Chef Donna knows what he does best and it is good to try it. The brunch is also a reasonable way to explore the items on the menu. It is good that he has narrowed the menu options. I enjoy all his...\n\n\nMore"], ["Good italian restaurant", 4.0, "January 19, 2014", "ConradoSY", "Buenos Aires, Argentina", 73, 96, "New Mexico Avenue, near American Universtiy, was a neighborhood that needed good restaurants. That's it with Al Dente and Chef Geoff's. Al dente is an italian restaurant with great pasta and pizza. Though, regarding pizzas I would suggest to add more mozzarella on top. Good service too. Around 30$ each."], ["Service still slow and surly", 3.0, "January 17, 2014", "javl", "Washington, DC", 76, 70, "I am mystified as to why, after having received consistently negative reviews because of service (one of them by me months ago), al dente has done nothing to improve on this score.\nWe come here fairly often (once a month) because it is convenient for us and the food is tasty. Experience is better when we sit at the bar...\n\n\nMore"], ["best dc salad ever", 5.0, "January 2, 2014", "bisquitandgravy", "Seattle, Washington", 12, 5, "I was in DC a while back and heard that they carried local wines from my area..\nI spoke with the chef and he also informed me that they also have Virginia wines.\nI tried 2 of each and they were fabulous. But the best surprise was the choice of salads.\nBe for warned when ordering that the salads are...\n\n\nMore"], ["Best Italian Experience in Town", 4.0, "December 3, 2013", "legallyalien", "Bethesda", 9, 0, "As an Italian living abroad, I am always searching for that special home flavor. I found it in Al Dente.\nThere are many other Italian restaurants in town. Many I've tried. In none the food is so authentically Italian as here.\nThe atmosphere is generally cordial and children friendly. More could be done on this front though."], ["Okay That Al Dente is Just a Neighborhood Italian Eatery", 3.0, "November 18, 2013", "Lois C", "Bethesda, Maryland", 152, 29, "Master Chef Roberto Dono was the draw to try this neighborhood eatery close to the campus of American University. Arriving early before an evening event at AU, there was plenty of time but the food took a long time to be served. When it arrived it was okay...not outstanding. Given that one of us is on a low sodium regimen,...\n\n\nMore"], ["Excellent Dinner", 4.0, "November 6, 2013", "LFK1", "Bethesda, Maryland", 99, 34, "We tried Al Dente on Oct. 26, 2013 on a friend's recommendation. The reviews were uneven, so we didn't know what to expect. When we arrived at the appointed time after parking in the ample, free, self-parking lot, we were seated immediately. Our server guided us well, especially telling us when the appetizers and salads we wanted were large enough...\n\n\nMore"], ["A Trip to Italy", 4.0, "October 24, 2013", "TrishHWashington_DC", "Washington DC, District of Columbia", 110, 67, "Al Dente is near my home, so I walk there frequently for an evening meal. I notice the reviews are spotty--some love it, some hate it. I only have had good experiences there. My one complaint is that there's little sound absorption so the place gets loud which makes it difficult to talk. But if you desire a good pasta...\n\n\nMore"], ["New York in DC", 4.0, "October 22, 2013", "PsicologoAmateur", "Washington DC, District of Columbia", 22, 13, "Al Dente, in the former place of Sutton PlacevGourmet is a plus in the neighberhood. The ambiance is like beeing in Manhattan. Casual and In permanent motion. Pasta and Ossobuco were outstanding. Chef Roberto Dona made it again."], ["Rip off", 2.0, "October 22, 2013", "bronxboy559", "Readington, New Jersey", 33, 5, "Visiting with our son in college, we wanted to take him to a nice restaurant close to campus. Was able to get early reservations on a Saturday night at Al Dente, and the menu looked decent, so we went here. Decided to go all out and get the 4-course prix fixe dinner for $35 each. What a rip off! Came...\n\n\nMore"], ["Very Good food, team style service, dinner with a shout", 4.0, "October 20, 2013", "kappyWashington_Dc", "washington, dc", 12, 10, "Al Dente is a fine neighborhood restaurant, with very good food offerings, many unusual (scallops with squid ink polenta). We were seated promptly with a reservation on a very busy Friday. During the course of our meal we were served by at least four different waiters: one gave menu and announced specials, one took order and returned to announce on...\n\n\nMore"], ["Never Go Back", 1.0, "October 6, 2013", "Granger P", "Washington DC, District of Columbia", 1, 0, "We know the chef Roberto from his Galileo restaurants. He is talented and inventive. BUT, the service and overall experience at Al Dente was atrocious. Our French server embodied all the worst characteristics of a surly Paris waiter. Our food was late and the wine service was ill-timed. Beyond that, the space was very noisy and crowded. Even though the...\n\n\nMore"], ["Decent food, snobby service", 3.0, "September 17, 2013", "Debbie A", "Washington DC, District of Columbia", 3, 6, "My friend's pasta dish (tagliatelle) was quite good, my heirloom tomato salad appetizer was fine, but if you want friendly service then carbo-load elsewhere."], ["bad night of service at a favorite restaurant", 3.0, "September 15, 2013", "javl", "Washington, DC", 76, 70, "We love this restaurant and have been coming fairly regularly since it opened. Food is great--as it should be, since the chef is the famous Roberto Del Donna. But their service can be spotty and slow. We had reservations for a Friday night, and it took almost 1/2 hour to get a glass of wine (at Chef Geoff's next door...\n\n\nMore"], ["Food was fine, service poor, great atmosphere", 3.0, "August 24, 2013", "DCJD2012", "Washington DC, District of Columbia", 131, 71, "We dined here early on a Saturday evening, when most tables in the restaurant were empty, yet plenty of servers and bar staff.\nWe were seated at a nice table, and the atmosphere is great. I love the square shape of the bar, as well as the great furniture.\nThe level of service is rather appalling. While there were plenty...\n\n\nMore"], ["Fine Italian Dining At a Reasonable Price", 4.0, "August 22, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "First visit but a great experience. Tried the soup of the day (Minestrone was excellent), Tomato Salad, Frito Misto, and Swordfish. All wonderful. Our server was also wonderful.\nSandwich menu is enticing and will ensure a return visit to explore."], ["Food is delicious, service was slow.", 3.0, "August 4, 2013", "lkdpeach", "Alexandria, Virginia", 69, 32, "We were a party of 6 celebrating my mother in law's birthday. We started with meats and cheeses, then salads, followed by various pasta dishes. I ordered the whole wheat pasta with basil and tomato. It was delicious! I'm still thinking about it. Service was very slow. Our waitress didn't seem to be the least bit concerned about refilling drinks....\n\n\nMore"], ["\"Sono delusa\" means I am disappointed in Italian", 2.0, "July 25, 2013", "Susana E", "Chevy Chase, Maryland", 44, 27, "Al Dente belongs to a famous Italian chef who owns several Italian restaurants in the area. The decor is nice and outdoor sitting is very pleasant, weather permitting. These are the only positive comments I can make about this restaurant.\nThe food was truly not good: we ordered two different types of pasta and had the \"home made\" gelato for...\n\n\nMore"], ["Horrendous service and overpriced food", 1.0, "July 11, 2013", "tlev908", "Florence, Italy", 12, 2, "Food was decent but service was TERRIBLE.\nOur server was unable to offer recommendations or descriptions of dishes on the menu, upon ordering a glass of wine he said to me \"I'll bring it when I have a chance\" and it never came. When he came over to take our order, we started to order and literally in the middle...\n\n\nMore"], ["Not a good restaurant", 1.0, "July 7, 2013", "Travelforantiques", "Wash, DC", 24, 11, "My husband and I went to this restaurant for a nice meal and had a reservation. When we the restaurant was half empty and we asked for any table not \"in the middle\" of the aisles. The hostess was arrogant and condescending and said all the tables were taken. When other couples arrived and asked they were seated in the...\n\n\nMore"], ["Great neighborhood spot worth crossing town for", 4.0, "July 5, 2013", "B G", "Washington, DC", 74, 32, "I want to admit my bias up front - I live nearby and am always hopeful when someplace opens up within walking distance. That said, to be honest, this place is great! The huge menu has something for everyone and for Washington, DC, the food is a way above average and a good value. The interior is very cool too....\n\n\nMore"], ["So much hope and then we ate. Disappointing.", 3.0, "July 2, 2013", "AJ C", "Washington DC, District of Columbia", 169, 35, "We had really high hopes for this place. It's on a lovely street in a cool area. So far so good.\nThe place is nice inside. Nice colors. Cool bar. Great music.\nWe started with the mortedalla so far so good.\nThen we had a nice but average salad.\nMy fiancé had the pasta seafood. Shrimp way to chewy. Three...\n\n\nMore"], ["Marvelous - A Gastronomic Sensation", 5.0, "June 23, 2013", "donw20850", "Rockville, Maryland", 27, 10, "We had Sunday brunch at Al Dente. Although this was our third visit, this one was by far the best.\nThe stuffed zucchini blossoms were extraordinary. The fried soft shelled crabs & the grilled asparagus were delicious. But I can't forget the chocolate dessert with zabaglione sauce."], ["Delizioso!", 5.0, "June 20, 2013", "TuscanGourmet", null, 46, 16, "Chef Roberto Donna has done it again!!!\nThe pasta is homemade, the pizza's are made to order! What more could one ask for?!?! Savory authentic Italian food in Washington, DC!\nThe atmosphere is lively, the staff friendly and well informed about their menu. Lunch time is packed with some of the whose who in DC, and dinner time has a...\n\n\nMore"], ["really noisy and not fabulous food", 2.0, "May 29, 2013", "mkg2805", "Washington DC, District of Columbia", 69, 36, "I went with a friend on a weekend evening. The place was packed with very noisy kids - made noisier by the fact that the restaurant has lots of glass and hard surfaces. The service was very slow and the food was only soso. It may be fine for families, but we found it difficult to sustain a conversation."], ["Love this place. Pizza Gnocchi are to die for!!", 5.0, "May 27, 2013", "Mroth", "Chicago, Illinois", 19, 58, "I try to make it to Al Dente everytime I visit DC.......the outdoor patio is perfect on those spring early summer evenings.....the pizza is first rate and the gnocchi are just unbelievable. Roberto Donna the chef from the old days at Galliileo now is the chef here and it shows......this place is getting better all the time....."], ["Love it!!! Great food .....Great place......", 5.0, "May 25, 2013", "BellaField", "Philadelphia, Pennsylvania", 37, 25, "was visiting my friends at American University and they took me to their favorite DC restaurant.....Al Dente.......the pizza was superb.....great cool neighborhood vibe.......good wine list.......gnocchi's my friend had were dynamite and so was the farro pasta.......this is in one of the best neighborhoods in DC and you were see a DC of people that are who's who.....in the media and...\n\n\nMore"], ["Top chef reviewed by local magazine.....but", 3.0, "May 7, 2013", "Virginiatourist", "Virginia", 12, 4, "We went there today for lunch to have early celebration of Mother's day. Washingtonian Magazine had given this place excellent reviews and the chef has had a good track record elsewhere in DC. This was my first time at one of his restaurants, though my wife had been to one of his other places before. Overall, the food was good,...\n\n\nMore"], ["Energetic fun atmosphere with great food", 4.0, "May 7, 2013", "wilsonsumner", "Washington DC, District of Columbia", 46, 24, "We have eaten here several times and are big fans of Chef Roberto Donna from his previous restaurants. Whatever you order, make sure you have one of his pasta dishes. They are all homemade and absolutely delicious. Fish is also a specialty of the house. Don't miss dessert either. Portions are huge. Salads could easily feed 2/3 people so we...\n\n\nMore"], ["Disappointing but good service", 3.0, "April 14, 2013", "WebgabDC", "Annapolis, Maryland", 11, 5, "Was looking forward to a nice dinner at this new neighborhood restaurant particularly with famed chef Roberto Donna in house. Was somewhat disappointed. The decor is chic but don't anticipate having any quiet conversations. We were seated just adjacent to the bar which also happened to be the major narrow thoroughfare for the wait staff, busboy and hostess. After choosing...\n\n\nMore"], ["Pleasantly surprised......", 5.0, "April 1, 2013", "rossvesq", "Washington DC, District of Columbia", 198, 89, "This is the Roberto Donna's newest DC restaurant after the disaster of Galileo 3, his aborted attempt at recreating the original Galileo at Tyson's Corner. I was expecting another over-priced, over-wrought, over-hyped and only marginal place. Surprise, this place is good, really good. Positives - our group of 6 started with Margarita (D.O.C. or so the menu claims) pizza to...\n\n\nMore"], ["What a treat! Al Dente is a find!!", 4.0, "March 24, 2013", "soncijo", "Washington DC, District of Columbia", 201, 100, "Today we had lunch at Al Dente on NM Av. The place is stunning. Roberto Donna, the Grande Chef, is friendly and delightful, Giovanni, our waiter became a friend, and we ate wonderful food, as you will shortly see by the photos included. We had been here several times before, but this time was the best. Good friends, terrific food,...\n\n\nMore"], ["Don't Miss Appetizers", 5.0, "March 18, 2013", "FoodieMD", "Franklin, Tennessee", 44, 17, "Traveling from downtown out to the AU area where Al Dente is located is worth the time and cost of a cab, without a doubt. We were in town for a weekend meeting, and read a wonderful review in the Washingtonian magazine so thought we'd try it. We had 7 people and every person was delighted with their dinner. However,...\n\n\nMore"], ["Know what you are getting into. . .", 3.0, "February 23, 2013", "DCvagabond1", "Bethesda, Maryland", 136, 88, "I went with friends to this restaurant on a Friday night. We went early because we had a small child with us, and wanted a place that could meet his needs. Turned out we weren't the only ones. The placed was packed with two different groups: twenty-somethings at the bar who were well into their weekend celebrations, and making a...\n\n\nMore"], ["Great expectations but a major letdown", 2.0, "February 11, 2013", "EC_Bill", "Ellicott City, Maryland", 31, 35, "I could not have been more excited about our reservation at Al Dente to enjoy the work of famous DC chef Roberto Donna. I had even taken a cooking course at the chef's home in 2011, and I found him to be totally charming and a great teacher. It was also the Saturday night right before my birthday, so I...\n\n\nMore"], ["Not that great", 2.0, "January 30, 2013", "sunnyWashingtonDC", "Washington DC", 33, 12, "The decor is cheesy orange plastic accented by fluorescent lighting, so the setting doesn't enhance the palette. Too noisy to talk unless you get one of the back tables. Their wood burning oven lured me into trying pizza, but it was soggy in the center, with wide crust showing where they don't bother to put sauce or topping. Not impressed....\n\n\nMore"], ["If it were not for the noise", 4.0, "December 30, 2012", "cedangeles", "Washington, DC", 69, 30, "The food was very good but it was hard to enjoy the evening with lots of noisy kids and families around. It is located in the former Sutton Place Gourmet/Balducci on New Mexico Avenue. There is no noise buffer in the restaurant. The atmosphere may be attractive to those who seek a party mood but not to some who want...\n\n\nMore"], ["Good food, ugly restaurant", 4.0, "December 28, 2012", "DCGourmet", "Washington, DC", 16, 3, "Great Italian food, especially the homemade pastas, but the atmosphere leaves much to be desired. Worth the trip for the food but don't plan on lingering."], ["Zesty!", 4.0, "December 21, 2012", "Lord H", "Florida", 108, 62, "Its like this: the place is packed, there's a party by the front that's creating a ruckus and you're in the mood for fun. The waiter has an accent that seems to fit right in and each menu item appears to be more expressive to your tastebuds than the next. What do you do?\n\"Look man, you just serve me...\n\n\nMore"], ["IL MIGLIORE ITALIANO NEGLI STATI UNITI!", 5.0, "December 13, 2012", "JChiotti", "Bethesda", 8, 3, "This is the very best Italian in DC by far! Not only is the food authentic Italian, the service is pure pleasure... ask for Salvio &/or Giovanni & Alberto. They will make your dining experience unforgettable. Trust them with their wine suggestions.... try the 'tripa\", the sardines, the zuchini flowers, the rabbit w/ polenta, the pizza, the burrata w/ prosciutto...\n\n\nMore"], ["Great in every aspect", 5.0, "November 24, 2012", "ssmosley", "DC", 77, 123, "Al Dente is what i would define as an \"undiscovered gem\" of an Italian Trattoria! The ambiance, the decor and the staff ( almost all of them are Italian with distinct Italian accents) make you feel welcome and appreciated.\nWe dined at Al Dente on Thanksgiving evening and opted for their prix fixe menu ($39.95 per person excluding gratuity and...\n\n\nMore"]]], ["Muncheez Mania", [["Dont miss the chance to eat here", 5.0, "July 7, 2015", "Mark R", "Roanoke, Virginia", 10, 3, "Local favorites (like pizza and cheese steak), but why not try something a little different? I had the chicken shawarma & some of the house made humus. The chicken was moist and delicious. Served in a pita with a mix of onion / parsley / sumac, crunchy pickles, tomato and tahini. I will be honest, I had no idea what...\n\n\nMore"], ["Good value casual dining", 5.0, "June 11, 2015", "Brian F", "Frederick, Maryland, United States", 31, 9, "Casual dining with places to eat inside but no table service. Most food- sandwiches, wraps, manakish are only $7. They also have crepes and some house made special non alcoholic drinks like their mint lemonade.\nI had the Nana's Original Manakish and was a decent portion size and tasted great. I definitely plan to go back and try their other...\n\n\nMore"], ["Perfect late night spot", 5.0, "May 25, 2015", "Naturespeak", "Albany, New York", 56, 19, "What a surprise to find this Lebanese gem on our late evening search for a quick bite! We both had the chicken shawarma and their famous mint lemonade! I wish I lived closer and could enjoy this on a regular basis. It was bustling at 9:30 at night with a line out the door."], ["Surprising little place worth the turn.", 4.0, "July 15, 2014", "Fishfanz", null, 42, 11, "Off on a side road in Georgetown, this hip looking little joint will surprise you. Crepes? Downstairs. Shawarma? Two kinds, two spits. Pizza oven? Of course. Lebanese finger foods? Damn good. We tried the kibbe, and spinach pies. Don't tell my aunt, but the kibbe were as good as or better than hers!\nMy shawarma was solid, with a slight...\n\n\nMore"], ["whole in the wall", 2.0, "May 8, 2014", "Daninchatham", "Chatham,NJ", 43, 31, "went there after work last week. My friend and I ordered two wrapes, soda and fries. Fries were okay, but the swaps were small and not worth the $8."], ["Not to be missed\"!", 4.0, "December 30, 2013", "Nicky025", "Dubai, United Arab Emirates", 68, 31, "A very tiny simple place which can be easily missed: tiny door almost invisible .... What grabbed my attention were the Crepes machines & Nutella giant jar on the front window!\nIt is a good place to grab a bite/ sandwish for 6$ And eat it within 10minutes.\nQuality, taste, price: super good!"], ["Great food/ Nice surprise in Georgetown", 5.0, "April 18, 2013", "MLEPSU", "Hartford, Connecticut", 58, 25, "We were sightseeing in Georgetown and looking for a decent lunch place. We saw this young girl carrying green lemonade in a large jug and followed her to her family restaurant. We did not know what to order but there were other customers who were eating and my husband asked them what was good. They were eating these small meat...\n\n\nMore"], ["Good", 3.0, "March 14, 2013", "AshBearPig", null, 30, 11, "Good for true munchies. I usually stop by here either 1. drunk munchies late night or 2. when I'm wandering around Georgetown and want a light meal because I'll be getting dinner somewhere nice. Their fries and crepes are great."]]], ["The Iron Horse", [["Big beer selection", 4.0, "October 14, 2015", "MFred", "Washington DC, District of Columbia", 41, 27, "Great variety of beers. The place was a little loud no matter where you went but it wasn't overly crowed. They don't serve food which would've been nice but they didn't mind you bringing it in. Good drinking hole."], ["Great beer bar right in the city!", 4.0, "August 26, 2015", "LukeFlorida", "East Coast", 38, 10, "I love the beer selection at this place. All the bars have access to at least 20 draft beers and they rotate enough to keep me coming back. The upstairs is quite open and can handle a small to medium work crowd. The downstairs portion has a lot of fun games and tons of room for any large groups. The...\n\n\nMore"], ["Cool bar", 4.0, "July 20, 2015", "Shannon M", "Louisville, Kentucky", 13, 4, "The bar had good drink options and a lot of great game options. Good atmosphere. One out of the 2 bartenders who served us were really friendly. The other bartender was a little too cool for school, but maybe it was a perception issue on our part. The drink prices seemed to fall in line with the other bars we...\n\n\nMore"], ["Interesting place for a beer", 4.0, "April 18, 2015", "TryppAdams", "Minneapolis, Minnesota", 688, 364, "Where I'm from \"Tap room\" is the front house of a brewery. This little bar has a few beers on tap, plays fairly loud music, has a few tv's and caters to those looking for a bar that looks edgy and has a classic motorcycle theme. Fun place for one..."], ["Great Beer Bar", 5.0, "April 7, 2015", "LetsGoCaps83", "Waldorf, Maryland, USA", 36, 14, "This is a great bar if you want a beer and a Bud Light won't cut it. This is a beer drinkers bar, although they do have wine a liquor. Lots of tap takeovers and craft beer selections. Skee ball is always fun. No food served, but you can bring food in."], ["Great Craft beer selection", 5.0, "April 4, 2015", "Davetheaddick", "London, United Kingdom", 179, 144, "A good tap house with a great selection of craft beers. The bartender was great and willing to offer recommendations on the selection of beers to help you get a beer that you like. Downstairs has a selection of games, although the shuffleboard table was poor. Definitely worth a visit for the beer selection."], ["Great location, nice open bar", 4.0, "February 9, 2015", "Ashley J", "Sterling, Virginia", 191, 73, "We went here before heading across the street to Jaleo for dinner. We went up to the bar to order our drinks and the bar tender was very attentive. Oh and also, you get carded at the door so 21 and up only. or at least that evening. We grabbed some stools by the window to people watch and a...\n\n\nMore"], ["Fun bar with tons of games", 4.0, "January 18, 2015", "Aaron P", "Bethesda, Maryland", 237, 91, "I love Iron Horse. It's simple, they have tons of beers on tap, tvs and tons of games to play. There's not much more you need. While it's not as large as Comet Bar, Iron Horse is a great place to stop by, watch a game and just hangout. They don't offer any food which is actually great because they...\n\n\nMore"], ["Can't rate this highly enough", 5.0, "January 4, 2015", "Openfj0re", null, 150, 36, "We came in here to watch the caps game and they switched the TV for us. The bartender was super friendly and helpful, he knew everything about the craft beers and took the time to tell us. Quiet atmosphere but still very lively."], ["God I love this place, and trust that surly attitude of the staff is just a schtick.", 4.0, "October 15, 2014", "rgstrip", "Fairfax, Virginia", 72, 16, "This is one of my favorite places before a Caps game. I have brought almost all of my friends here. It is a BAR ONLY, and they serve no food, but supposedly, you can bring food in. They have great beers, and a knowledgeable group of bartenders. They check EVERYONE for ID at the door, so if you do not...\n\n\nMore"], ["BEER!!", 4.0, "September 23, 2014", "TommyS614", "Waldorf, Maryland, USA", 61, 3, "Nice place that looks small at first but they have a downstairs with shuffleboard, skee ball, and a few other games plus a lot of bartops. They have a decent selection of craft brews on tap also."], ["This place sucks.", 1.0, "August 14, 2014", "Christina S", "Bloomsburg", 2, 1, "Bartender was nice bit some jerk who worked there threw us out before we could find ins hour drinks and wouldn't reimburse us. He didn't gives ys any reason don't go there."], ["No food?", 3.0, "May 21, 2014", "yoshidapimpa", "Minneapolis, Minnesota", 7, 6, "It was strange to happen upon a bar that wasn't too high end, pricey and was near us. The even more bizarre feature was that there was no food. Only booze. Might be a reason why it was so desolate."], ["Ok bar", 4.0, "May 14, 2014", "BorkGordon", "Lexington Park, Maryland", 204, 86, "Its a good place to go pregame before the caps game. They have a decent happy hour that you can take advantage of."], ["Friendly and great place to get a drink", 5.0, "May 7, 2014", "Stuart B", "Sturminster Newton, England, United Kingdom", 36, 20, "Scoping out for a place to drink near my hotel (Hotel Monaco) and stumbled across this bar.\nReally enjoyed it with great locals, extensive range of drinks, knowledgeable bar staff and great ambience. Liked the bike in the window.\nA really great experience in my view and would have it as my local if I was not thousands of miles...\n\n\nMore"], ["Ehhh... It was ok.", 3.0, "March 26, 2014", "Luv2run2013", "Ann Arbor, Michigan", 13, 3, "Vodka tonic was ok, atmosphere was \"plastic\", seemed like a chain. If you like hanging out and drinking at TGI Fridays, then this is your place. They have bikes, but not a biker bar. It was the Sunday before St. Paddys, and 5 people were there."], ["Good vibes, beer, friendly service", 4.0, "January 7, 2014", "Rick G", "Alexandria, Virginia", 61, 32, "We stop here periodically when we are in town. The draw for us is the great selection of craft beers on tap - many from local breweries. Bar tenders are knowledgeable and friendly. The entire scene is upbeat with TVs, lots of games, and friendly folks. No food and the beer prices can be steep, but are comparable to other...\n\n\nMore"], ["Great Taps", 5.0, "October 10, 2013", "Clark845", "Jacksonville Beach, FL", 102, 29, "Looking for a place for some suds before the game or after work? Iron Horse Tap Room is the place for you. Verizon Center is just down the street. LOcals come by for the happy hour that starts at 4 PM. When I visited they had Great Lakes Brewing's Elliott Ness on tap and it was the perfect beer after...\n\n\nMore"], ["Great happy hour- no food", 4.0, "September 25, 2013", "tikidream", "bethesda, md", 388, 110, "We stopped in on a whim while in the neighborhood and were promptly carded by someone younger than our older son, which is fine, I get it, but the group in front of us was giving the bouncer a hard time and not in a nice way. We did get a friendly hello, and found seats at the bar. Since...\n\n\nMore"], ["Early evening visit was great!", 3.0, "September 22, 2013", "Iris981", "Morley, Michigan", 121, 59, "We were here in the early evening and were of very few patrons. They had an excellent selection of beer and the bartender was friendly and offered selections and better descriptions. The atmosphere was so-so. Dark. Not a lot going on. But it was great for a quick drink."], ["Good drinks", 4.0, "September 11, 2013", "NomeMan", "Juneau, Alaska", 161, 130, "So the bar itself isn't really anything special, and the whole \"iron horse\" thing comes off as shtick, but we found an absolutely awesome new drink there that alone warrants four stars. This nectar of the gods is blueberry Lynchburg Lemonade made with berry infused Jack. Holy freaking crap Batman! Those go down too easy. Ask bartender Sam for one...\n\n\nMore"], ["Loud beer bar", 3.0, "June 27, 2013", "jonekn", "Morristown, New Jersey", 129, 43, "I know people who LOVE the Iron Horse, and go so often, they are known by all of the bartenders and bouncers. That is great - some people like a divey atmosphere. I was amused, as I always am, to be carded by people who are far younger than me (but they follow the DC law). What did not amuse...\n\n\nMore"], ["Great Happy Hour", 5.0, "June 14, 2013", "shelley p", "Phoenix, Arizona", 35, 8, "We stopped here 2 different days while in DC for happy hour drinks. Great prices. If you go early, you will get a seat. This place is hopping!!!"], ["Great beer selection, food options??", 3.0, "June 12, 2013", "TomCat27", "Charlottesville, Virginia", 108, 39, "Went here late night after a Nats game over the weekend. I was not familiar with this place but we went to the basement level for food & beers. Their beer selection is top notch and their staff seemed to know most well and able to suggest what we may have liked. We asked about ordering food and he said...\n\n\nMore"], ["Good beer and people", 4.0, "May 29, 2013", "HairyO", "East Midlands, UK", 164, 359, "This is a good little bar in DC with a range of good beers and a staff who seem to know about and care about beer. The range of taps is good and varied with the beers all in top condition. It seems t draw a younger crowd especially the downstairs bar which also has a few machines to play...\n\n\nMore"], ["ok but security is a bit over the top!", 3.0, "May 13, 2013", "DCFed", "Washington DC, District of Columbia", 83, 33, "Bar is ok, kind of a middle to younger crowd with some yuppy tools but all and all can be fun. Security barged into my stall thinking there was more than one person I guess only to find me. Another person mentioned the same and he is a fed Agent, just saying they may want to take a look at...\n\n\nMore"], ["the beer was exceptional, the food wasn't", 2.0, "April 24, 2013", "John0903", "Simsbury, Connecticut", 63, 30, "Nice old place with excellent bones and the beer was exceptional. However the food wasn't. My wife had a corned beef sandwich. Half of the meat was inedable due to fat and gristle. She complained to the waiter without effect. Finally we had to insist and it was removed from the bill."], ["One of my favorite DC bars", 5.0, "February 25, 2013", "Kristy P", "Miami, Florida", 65, 27, "Great beer selection. Great TVs. You can take in your own food (i.e. Chipotle; chips and dip) and drink while you watch sports. Go downstairs. Really laid back."], ["Mixed feelings, but still good.", 4.0, "January 18, 2013", "CaptainAwethume", "Hyattsville, Maryland", 262, 85, "Iron Horse is a decent place to get a drink, watch a game and shoot the \"sheet\". It's got a downstairs area which is a lot more spacious than the upstairs area and they've got a decent selection of craft beers. Last time I was there, they carried Brother Thelonious; which is one of my top three. It's amazing and...\n\n\nMore"]]], ["7th Hill Pizza Palisades", [["Unbelievably delicious pizza!", 5.0, "August 13, 2015", "M R", "Washington DC, District of Columbia", 4, 1, "The pizza at 7th Hill is first class. The crust is thin and cooked perfectly to be a vehicle for the amazing toppings that they offer. I love the Potomac Avenue with prosciutto instead of salami. My daughter loves the margarita pizza. The burrato is terrific as ar the salads and the homemade soups. You cannot go wrong here. It'...\n\n\nMore"], ["Average pizza, amazing dessert", 5.0, "August 8, 2015", "TheBookWarrior", null, 35, 38, "We had heard about this place from a friend and were told to order the nutella pizza. The pizza was okay. But the nutella calzone was epic and heavenly."], ["Great pizza selection, great beer selection", 4.0, "July 26, 2015", "walkstx1", "New Braunfels, Texas", 31, 16, "A group of 10 of us ordered three mixed pizzas. The pizza were excellent. Great beer selection and knowledgeable bar tender. Fast service. There was also what looked like a birthday party where kids were making their own pizzas...great idea."]]], ["Mellow Mushroom", [["Great pizza", 4.0, "August 30, 2015", "DAVE B", "Pepperell, Massachusetts", 37, 18, "Went to one in Myrtle Beach and fell in love with the great pizza and craft beers. While in DC we searched this one out since it is the closest to New England.\nService was a little slow at this one, but the pizza and beer selection were great.\nCan't wait for one to come to Boston.\nIf you like...\n\n\nMore"], ["Disgusting", 1.0, "July 8, 2015", "Lucas M", "Chevy Chase, Maryland", 19, 5, "The pizza was very greasy and they couldn't understand my friends accent and brought a pepperoni pizza when my friend asked for provolone! I think it is only this location because I've been to the Greensboro location and it is much better!"], ["So unique and yummy", 5.0, "June 30, 2015", "BostonBabeBoston_MA", "Boston,MA", 217, 47, "This place is so cool. It has a great up stairs patio, open kitchen, and best of all....delicious pizza. The crust is great and the sauce is perfect. They have all these neat specialty pizza that are unique and tasty. Last time I was there I tried the Thai pizza and it was amazing! Good bar too."], ["Yum-o", 4.0, "June 30, 2015", "Michael H", "Washington DC, District of Columbia", 78, 27, "We ended up dining here after leaving another restaurant from lack of service and food delay. The staff was warm and friendly, and we were fans of Mellow Mushroom from Asheville north carolina.\nService was good, and the pizza was delicious. Can't forget about the pretzel rolls either!"], ["Hippy Pizza Done Right", 5.0, "June 3, 2015", "CCR1975", "Washington DC, District of Columbia", 33, 9, "This is becoming my favorite pizza spot in DC\nI know that's not saying much, but this is a great place\nI get the green pepper pizza\nTry the pretzels appetizer\nGreat bar to sit and watch a game"], ["Super mellow", 4.0, "May 17, 2015", "Deutschlandreform", "Hamburg, Germany", 52, 18, "Located in the Adams Morgan district, this Mellow Mushroom has both outdoor (rooftop!) and indoor seating with open air doors.\nTwo dozen craft beers on tap plus many more bottled beers. Happy Hour: Monday-Friday 3PM-7PM $2 off all draft beers.\nQuick service with the drinks. The ordered Mega Veggie came out in a timely manner, too.\nAbove average because of...\n\n\nMore"], ["Not your average pizza", 5.0, "April 22, 2015", "Nancy G", "Tiffin, Ohio", 24, 7, "Interesting menu of pizzas and other. Good beer. Outdoor seating and indoor seating with open air doors. Very nice bar area. Seating is both public and private. Nice bathrooms."], ["Mellow is the word !", 4.0, "April 15, 2015", "Timscfc", "Madeley, United Kingdom", 59, 23, "Ok it's part of a chain and not very glamorous but the food is excellent - 3 small pizzas and 2 salads between 4 of us were more than enough - and our server was the most\nlaid back dude you can imagine ! Go along -eat - enjoy - and it ain't costing you a lot"], ["Really loud; great pizza", 4.0, "March 22, 2015", "iStefPayne", "Washington DC", 126, 58, "Love the pizza at mellow mushroom - the topping selection is awesome.\nIt's not a sophisticated place, but a good choice for an easy eat out as a neighborhood pizzeria with an active bar area.\nThe rooftop offers great views of Adams Morgan and can be tough to get a seat on nice days, as its first come, first served....\n\n\nMore"], ["Amazing Pizza", 4.0, "March 17, 2015", "ssap01", "Washington DC, District of Columbia", 25, 21, "This spot is located in the Adams Morgan area of DC. This is an area that has a lot of nightlife options so this spot is perfect for grabbing a bite before experiencing a night out. The pizza is very delicious. They also have a very nice drink selection. My party ordered 1/2 mighty meaty and 1/2 house special and...\n\n\nMore"], ["Seriously good pizza, plus", 4.0, "February 25, 2015", "Evie9242", "Washington DC, District of Columbia", 28, 8, "This restaurant is on a nightlife strip of DC that has several regular pizza joints. Pass them by if you want good food. Mellow Mushroom is not a pizza joint. It is a sit-down restaurant/bar that serves incredibly good pizza, made to order when you order it! And in realistic sizes. The choices are wide and excellent -- even trendy....\n\n\nMore"], ["Only had drink, but...", 4.0, "January 7, 2015", "Rachel N", "Washington DC, District of Columbia", 72, 20, "... The pizza looked and smelled awesome! The beer selection is great, good atmosphere (very mellow).\nI will be going back to get a slice of pizza soon!"], ["Self-Service", 1.0, "October 25, 2014", "bigtoddd", "San Antonio, Texas", 4, 4, "Stopped in here for dinner, the front staff and bartender were amazing, this is the highlight. We were given our table, sat there for 10 mins, two waiters walked by several times. Finally I asked if we could get service, the first individual said let me check. Him and another waiter argued on wo was going to help us, 5...\n\n\nMore"], ["MEH-low Mushroom", 3.0, "September 29, 2014", "Amy Dara H", null, 27, 9, "Very attentive waitress. Pizza was disappointingly bland and greasy. Not because of the cheese, which I've also had on better pizza elsewhere. Also unlike elsewhere, there was an additional charge for the vegan cheese. So - let me see if I understand this: dairy cheese - for which there is NO additional charge - is eliminated, and substituted with vegan...\n\n\nMore"], ["Best pizza in Adams Morgan -- skip the jumbo slice", 4.0, "September 24, 2014", "JT M", "Washington DC, District of Columbia", 158, 53, "I live in the Adams Morgan neighborhood and this is my go-to spot for pizza. Try this place instead of the massive, cardboard Jumbo Slices that are touristy and widely popular with the drunk party people who frequent the neighborhood on weekends. Mellow Mushroom has a wide variety of fresh offerings, as well as a great rooftop and a small...\n\n\nMore"], ["Great First Experience -- Will Be Back", 4.0, "September 21, 2014", "Vulturecap", "Middletown, md", 111, 29, "We were referred to the Mellow Mushroom by the folks at the Veg. Festival in SE DC. We were not disappointed. The restaurant is located on 18th Street in heart of Adams Morgan.\nWe started with salads. I had the mini Greek Salad. It was very fresh and well presented. Mini might be a flight misnomer. It was a large...\n\n\nMore"], ["Yum!", 4.0, "September 7, 2014", "MissMuffet63", "Fairfax, Virginia", 119, 25, "Great gluten free pizzas and regular pizzas were had by all! Service was decent, the waitress was conscientious but I think they may have been understaffed for a Saturday. Of all the Mellow Mushrooms I've been to, this one had the most boring decor."], ["Amazing pizza, but not amazing service", 4.0, "September 2, 2014", "binkers441", "Pittsburgh, Pennsylvania", 116, 36, "We were looking for a different pizza restaurant but stumbled on this one, and were excited to be seated on the roof bar (which people have commented on and is noted on the sign outside the restaurant). When we asked the hostess to sit on the rooftop bar, she looked at us as if we were aliens. So we sat...\n\n\nMore"], ["Slow service, but the pizza made up for it!", 4.0, "August 14, 2014", "VonnieFoodie", "Stellenbosch, South Africa", 70, 26, "We went for pizza and some beer at Magic Mushroom in Adams Morgan.\nIt took a long time for them to serve us, but once our order was taken the pizza arrived quite quickly. Good recommendations from our server regarding the beer and the pizza."], ["Consistency", 4.0, "July 22, 2014", "Jeremy B", "Columbus, Ohio", 38, 5, "If you've never been to a mellow mushroom you need to go. Their pizza is unique and I have been to one in at least 5 different states that I can remember, they are always consistently good. This one has a rooftop deck which is great if the weather allows. Service and food were both on point. I would definitely...\n\n\nMore"], ["Great pizza in a fun neighborhood", 4.0, "June 10, 2014", "Elaine1953", "Boston, Massachusetts", 55, 31, "We found our way to Mellow Mushroom when we visited town last weekend, because some of us had been to the MM in Colorado and longed for it. We discovered a neighborhood we had never been to - it was a nice walk from the Metro- The pizza was really unique, which delighted me because I am not the pizza...\n\n\nMore"], ["Cool rooftop bar and good pizza", 4.0, "May 8, 2014", "uglychicano", "Denver, Colorado", 53, 27, "We stopped in and had a pizza and some drinks. The rooftop area was very cool and our server was great."], ["Rainy Night/Warm Pizza", 5.0, "May 1, 2014", "David W", "Washington DC", 25, 20, "Good Service from the Hostess - Bartender - Server. Rainy Wednesday night and not too busy either so food came in the perfect amount of time. Lots of Beer on Draft. The Pizza crust and sauce was very good, toppings tasty but not too gourmet. Just Good Pizza!"], ["Excellent pizza", 4.0, "January 20, 2014", "722ab", "Urbana, Illinois", 66, 23, "Certainly some of the most unique pizza combinations I've seen on a menu, but the pizza is excellent."], ["Pizza with a hipster vibe", 5.0, "January 19, 2014", "Topchef3630", "Washington DC, District of Columbia", 37, 16, "Me and the girlfriend were in search of a place to pic up a pizza and wings and i had previously eaten at a mellow mushroom in Jacksonville years ago liked it and took a stab at there dc location.\nWent in vibe was good had lots of grafitti and art everywhere ordered the thai dye and the wings they...\n\n\nMore"], ["Good Comfort Food!", 4.0, "September 27, 2013", "blessasugo", "Santa Fe, New Mexico", 76, 74, "The calzones were great and the gluten free pizza was pretty decent. The Server was excellent and really \"cared\" about his performance. 3 stories including the rooftop deck. Casual atmosphere. My husband is the best pizza chef I know...so, it is hard to beat his...but - pretty good for a casual early dinner out...oh, and a good beer selection and...\n\n\nMore"], ["Awesome, and Gluten-free Options!", 4.0, "September 6, 2013", "ColeQ", "Detroit, Michigan", 83, 20, "First, this place overflows with energy, style and good taste. Second, we needed gluten-free and diary-free that we could trust, and the Mellow Mushroom delivered! They have a great pizza menu that accommodates our food allergies and intolerance, even offering vegan options. The waiter was well versed in our needs, and made sure that we had fun while we were...\n\n\nMore"], ["If you are looking for pizza, try ...", 4.0, "July 4, 2013", "whollows", "Naples, Florida", 129, 29, "I had a hankering for pizza today. I've walked by this place a couple of times and its always busy. I checked out the ratings and they were mixed but this place had the overall best ratings of the pizza places in the area.\nI sat at the bar and got your typical bar service. The bartender was busy but...\n\n\nMore"], ["Nice", 4.0, "June 21, 2013", "StevenRobertson", "London", 48, 30, "Cool vibe with a mixture of groups, couples and the odd single person like me. Friendly people. Decent food. Excellent beer. Nice!"], ["Decent chain pizza with an OK gluten free option", 3.0, "May 22, 2013", "spinal77", "Richmond, Virginia", 35, 13, "I went here because it was one of the few restaurants in the area that was relatively safe for me to eat at. I have celiac disease so I need to eat gluten free, and they offered gluten free pizzas.\nThis place is the standard run of the mill chain pizza place, with what appeared to be a good beer...\n\n\nMore"], ["Great pizza; good service", 4.0, "April 17, 2013", "David A", "Knoxville, Tennessee", 152, 73, "We had a great time at Mellow Mushroom in Adams-Morgan. We started with a couple of pitchers of beer on the roof. Our server was excellent. It was a little chilly, and we went inside for our pizza. The pizza was really excellent."], ["Chain restaurant type of pizza!", 3.0, "April 10, 2013", "kavallone", "NJ", 36, 15, "I am from New Jersey so my pizza standards are really high. I went to the Mellow Mushroom with a friend of mine. We ordered the pizza with porcini mushrooms. It had some sort of creamy sauce drizzled over the top, it was not good. The pizza was mushy and the dough was flavored, reminded of those flavored crusts from...\n\n\nMore"], ["cool rooftop bar", 5.0, "March 31, 2013", "6stringer00", "Hagerstown, md", 88, 26, "After stopping at several bars in Adams Morgan, ended up on the roof the Mellow Mushroom, wood fired pizza was awesome, and the dark beer was really good. great ambiance with the outdoor heaters and view, will definately go back again."], ["Awesome pizza, blah service", 4.0, "February 25, 2013", "Francisco M", "Arlington, VA, USA", 169, 71, "My friend and I came here and each tried two types of pizza (if you order one pizza, they are happy to split it between 2 types for you). She had half Kosmic Karma and half Thai Dye; she said the Thai Dye was easily one of the top 5 pizzas she'd ever had, and that Kosmic Karma was quite...\n\n\nMore"], ["Surprise find...great beer selection and unique food", 4.0, "February 22, 2013", "DMO1976", "Bethlehem, PA", 161, 75, "It was freezing cold outside, and we wanted to grab a drink and snack with some friends. It was early afternoon so many of the bars in Adams Morgan weren't open yet. We headed into Mellow Mushroom on a whim, and it was a great experience. We got seats at the bar and immediately got to talking to the bartender...\n\n\nMore"], ["Best of AdMo - Good Pizza Too", 4.0, "February 12, 2013", "smh33", "San Francisco, California", 85, 26, "AdMo restaurants are pretty hit or miss, this one is great. Some of the best pizza in DC, in my opinion, and a great beer list. The atmosphere is fun, and doesn't turn into as sleazy of a bar as the rest of the places near by."], ["Not Like Other Mellow Mushroom Locations", 2.0, "January 28, 2013", "minx6469", "Baltimore, MD", 140, 138, "My husband and I have been to 2 other Mellow Mushroom locations: Asheville, NC and Myrtle Beach, SC. We loved the food, atmosphere and service. Since we're from Baltimore, the DC location is the closest to us and we were excited to have delicious pizza.\nThe DC location is unlike the other Mellow Mushrooms we've visited in that the decor...\n\n\nMore"], ["Usually great", 4.0, "December 27, 2012", "iStefPayne", "Washington DC", 126, 58, "I've had a few off experiences here based on service, and the crowd can be a little rowdy, but overall, the atmosphere is good and the pizza is great. A good casual place for all ages."], ["Good pizza place", 3.0, "November 2, 2012", "Lauren W", "San Francisco, California, United States", 48, 9, "This pizza was good. We sat on the roof which was nice. It have several levels and bars. Didn't have a drink there but they looked like fun."], ["Great Pizza, Great Beer", 4.0, "July 2, 2012", "Bcohen13", "Pittsburgh, Pennsylvania", 134, 73, "After looking at practically every restaurant in Adams Morgan, I settled on the Mellow Mushroom and was glad I did. The beer selection was excellent and varied, and most importantly, the pizza was fantastic. Tried a couple 10\"ers, and was ready to order more whether I could cram them in or not. Only complaint was the price. I made one...\n\n\nMore"], ["Great food in a vibrant atmosphere.", 5.0, "March 23, 2012", "Pete M", "Bournemouth", 14, 9, "After a long day wondering around Washington we found ourselves in Adams-Morgan. Very tired and craving for food and beer we settled on 'The Mellow Mushroom' a bustling eatery where the owner stood outside and gave us advice on places to eat. This was either complete altruism on his part or a genius display of reverse psychology; either way, we...\n\n\nMore"], ["A lucky find", 4.0, "February 14, 2012", "mqrussell", "Reading, Massachusetts", 71, 48, "We \"stumbled\" across the Mellow Mushroom while visiting Washington DC, and were happy we did. We asked the waitstaff for a recommendation - and stepped \"outside the box\" with a red potato and bacon combination. It really was VERY good! Service was too!"], ["Yummy & Good Service", 4.0, "January 31, 2012", "KandyGoddess", "Winchester, Virginia", 58, 32, "We went to see one of the shows they were hosting, and it was packed. It was fend for yourself, thankfully people were kind enough to lend a chair and another table had room to squeeze us in.\nI think our severs name was Eggs? Anywho he was nice and quick to refill our drinks( without us even asking). We...\n\n\nMore"]]], ["Empress Lounge", [["Stylish oasis...elegant and comfortable", 4.0, "September 1, 2015", "Hawkwild", "New York City, New York", 58, 26, "We were staying at Mandarin Oriental Washington, and stopped by here on a Sunday evening after returning from our evening meal elsewhere. It was the perfect choice for ending our day. Top notch spirits, my companion had his favorite kind of tea (which was served elegantly and with style), and a really nice dressed-up version of strawberry shortcake. It's a...\n\n\nMore"], ["Tea, Bubbly and yummy finger sandwiches", 4.0, "September 1, 2015", "LibyAH", "Washington, District of Columbia, United States", 116, 44, "So it's not the \"traditional\" English High Tea, however, it's still lovely, fun and quite enjoyable. So make a reservation, take your favorite girlfriends and go. Easy to get to and in a beautiful hotel. Valet parking available for not more than the price of parking in a garage - so splurge and valet. We spent close to two hours...\n\n\nMore"], ["Afternoon Tea Delight", 5.0, "June 2, 2015", "El_HB", "Randolph, New Jersey", 10, 6, "It was interesting to see the tea leaves in the glass teapot, which had a contraption in the spout to catch the leaves. My jasmine tea was nice and tasty for a white tea. The clotted cream and jam spread deliciously on the scones and madeleines."], ["River and garden views - nice stop over if in the area", 4.0, "May 15, 2015", "highlandbride", "Los Angeles, California", 164, 164, "wouldn't make a special trip here, but if in the area or staying at hotel, it's a nice spot to have a glass of wine and some appetizers."], ["Take advantage of the patio- it's beautiful!", 5.0, "April 16, 2015", "Colleen_Slattery", "Fairfield, Connecticut", 37, 19, "Art the bartender was very personable and knew his drinks- he created half of the drink menu! The patio out back was beautifully landscaped, the outdoor furniture was very comfortable and the fire pits were a nice touch!"], ["Classy Lounge", 4.0, "April 5, 2015", "Karen L", "Manassas, Virginia", 173, 74, "This lounge in the lobby of the Mandarin Oriental is a nice place to stop by for a drink or a nibble. There are many low tables with chairs or upholstered chairs or sofas for your group. The service of our drinks included a small plate of assorted olives and sesame crackers. Nice place to people watch, too."], ["Afternoon Tea", 5.0, "March 17, 2015", "JanetMcE", "Washington DC, District of Columbia", 80, 29, "The staff went out of their way to prepare a lovely afternoon tea on a day they didn't have it on the menu. Beautifully presented, artfully done and tasty. The dark chocolates hit the spot with Rosevud tea. I love the presentation. Each of us had personal teapots with a spiral filter to keep tea leaves in the pot without...\n\n\nMore"], ["Enjoy food, music. & ambience", 4.0, "February 14, 2015", "Handle_11", "New York City, New York", 109, 35, "A last minute change of plans on a holiday night & inclement weather had us dining at the lounge. It has a good selection of appetizers & entrees. The ambience is lovely, and the wait staff is personable"], ["Great for WiFi Definitely NOT for Tea!", 1.0, "November 19, 2014", "Hil8", "Baltimore, Maryland", 49, 36, "We made a reservation for the Tea Time based on your review, and pictures. Much to our dismay, we had to cancel our visit and opted for the full restaurant nearby at the same hotel. The Empress Lounge is tiny, directly next to the lobby, always full of people with their laptops, and has tiny round tables and chairs very...\n\n\nMore"], ["Perfect spot for afternoon tea", 5.0, "October 3, 2014", "JustWriteStudios", "Rockville, Maryland", 3, 0, "We had read reviews about a buffet style tea, so were surprised to have our meal brought to us at our table. Scones were perfection. All three of us enjoyed the sandwich selections, even asked for seconds on the cucumber and salmon. Favorite dessert was the mini cheesecake. I had the camomile tea with plenty of refills and of course...\n\n\nMore"], ["A great place to unwind", 4.0, "September 4, 2014", "Bettylafea67", "Brooklyn, New York", 25, 12, "I've enjoyed their drink and snack selections in the past but this time around, I relaxed and sampled some of their tea selections. I highly recommend the rose petal tea. This is a great place to unwind after a long day of either sight seeing or in my case, training. It has a relaxed atmosphere and the waitstaff is helpful...\n\n\nMore"], ["Lovely Afternoon Tea", 4.0, "July 17, 2014", "TinkWDC", "Washington DC", 68, 16, "The Empress Lounge held within the beautiful Mandarin Oriental Hotel is quite lovely. The Afternoon Tea with my Duke Ellington (DESA) Alumni made it all the better! The small bites served were tasty and the presentation was marvelous! However I would have given 5 stars had we not had to continuously shew off gnats eewww!! Its pretty small but I'd...\n\n\nMore"], ["A Lovely Respite from Business", 4.0, "October 11, 2013", "Bill_Hunt_AZ", "Phoenix, AZ", 230, 114, "The Empress Lounge is lovely to behold, and the service is excellent.\nThe only complaint would be a slightly limited bar-food menu, and a smallish wine list. However, that wine list is almost 100% devoid of \"the usual suspects,\" and that is a great big PLUS! Interesting wines, that one does not see everywhere. Now, it could be slightly expanded...\n\n\nMore"], ["The food is good and the view is nice", 3.0, "October 2, 2013", "CorpPlanner_11", "Detroit, Michigan", 165, 78, "I have had a few good meals here - coconut red curry chicken sate, chicken curry and fried rice. As much as I enjoy the food, every time I dine here, the service is way too lacking. My last time was when the hotel was sold out - the Empress Lounge had EVERY table filled - and there were only...\n\n\nMore"], ["Food was good, but too expensive", 3.0, "August 28, 2013", "mjobota", "Denton", 30, 11, "The food was good - had a club sandwich, fries and a coke. The lounge was very nice, modern, seating was comfortable. It is in an open lobby so it was quite loud. This bill was over $ 30.00!"], ["This was a huge miss", 1.0, "August 4, 2013", "Teri W", "Santa Maria, California, United States", 29, 14, "The Mandarin Hotel looks classy, but the service is hit an miss. The Empress lounge visit for us was a big disappointment.\nWe visited the lounge after returning from a moonlight tour of the monuments. The kids had missed-out on an ice cream social the hotel hosted for our group earlier that evening because the hotel staff had put the...\n\n\nMore"], ["4th of July service disappointing", 2.0, "July 27, 2013", "kberg1", null, 63, 16, "Waited 90 minutes for a cheese plate. It never arrived despite assurances that it was on its way. Iced teas took over 30 minutes. This is not 5 star quality or service. The lounge was not prepared for customers. Very disappointing."], ["Comfortable seating,great atmosphere!", 5.0, "June 18, 2013", "LAGSLP", null, 37, 10, "My son the sirloin burger, and it was amazing!! We had some wine and a cheese plate after a long day of sightseeing, and it was such a nice place to relax. The view of the gardens was beautiful, the chairs were comfortable, and the service was excellent. HIghly recommend for drinks and light dinner!"], ["Can be real mellow and really busy. Depends on the day and time.", 4.0, "May 7, 2013", "Kgosselin", "Biddeford, Maine", 86, 40, "During our recent stay at the Mandarin we found ourselves gravitating to the Empress Lounge fairly often. Service was excellent, drinks were good and food was okay but not much of a wow factor.\nMy wife had the vegetable friend rice which came in a really cool looking pot and was very good. I had a rather bland vegetable wrap...\n\n\nMore"], ["Best drinks in DC", 5.0, "March 18, 2013", "Shadi K", "Carmel, Indiana, United States", 2, 0, "Had a few cocktails at the Empress Lounge to see what it was all about, and I was blown away. The drinks were very well crafted and delicious. I had the Tom Yum (spelling) mojito. It was perfectly sweet and sour. Service was excellent. The olives and oriental mix were delicious to snack on until the chicken lollipops arrived. The...\n\n\nMore"], ["Cozy Lounge with live Jazz Music over the weekends!!!", 4.0, "March 17, 2013", "Ani J", "Tysons Corner, Virginia", 79, 116, "We stayed a night at the Mandarin Oriental this past weekend, and went to the Empress Lounge twice - once when we checked in around 2 PM and second before dinner.\nThe lounge is nicely set up. Around 2:30 PM, it was empty. We then saw people coming in for tea time. We just ordered a drink, tea, and some...\n\n\nMore"], ["tea at Empress Lounge appalling", 1.0, "March 14, 2013", "jayDallas_10", "Dallas, Tx", 11, 14, "We had planned a gathering for high tea at the Empress Lounge to celebrate our friend's special birthday. It was appalling from beginning to end. The Mandarin should not have scheduled a tea for this afternoon when they knew a large business group was going to be occupying the lounge durning their afternoon break. The room was filled with over...\n\n\nMore"], ["World class jazz, average venue", 5.0, "March 6, 2013", "iceman017", "Rockville, Maryland", 13, 5, "We have visited the Empress Lounge several times. The jazz is always top notch. The food and drink are excellent but pricy. The venue for jazz is below par. The lighting is low in the room and there is no lighting on the performers. The room is wide so if you get a table near an end you cannot see...\n\n\nMore"], ["Cool Jazz", 5.0, "February 27, 2013", "Delores S", "Washington DC, District of Columbia", 14, 13, "The female singer was really talented. We enjoyed the jazz and the delicious mixtures of tea. We didn't drink alcohol but the tea hit the spot. The large sofa made us feel right at home. Really a great place to experience jazz!"], ["Lobby Dining", 4.0, "February 25, 2013", "joeger", "New York City, New York", 131, 56, "Arrived at our hotel after a long car ride, hungry and thirsty. This was a great little place to sit at the Mandarin Oriental and people watch while we were having some great Green Curry with Chicken and very very tasty Beef Fried Rice. The table next to ours ordred the charcuterie and it looked amazing. Mini desserts were a...\n\n\nMore"], ["Memorable Birthday Tea at the Mandarin Oriental Empress Lounge", 5.0, "September 29, 2012", "Adelle D", "Washington DC, District of Columbia", 2, 4, "We had great and memorable time at the Mandarin Oriental Empress Lounge at a Birthday Tea. Approximately 12 people showed up to celebrate the birthdays of two guests. We all enjoyed the tea, drinks, plentiful food and the company most of all. We arrived early and they seated us early and they had a great selection of teas. The servers...\n\n\nMore"], ["What a disappointment", 2.0, "July 27, 2012", "Toddif", null, 10, 5, "Just went for drinks and nosh, wow , service was VERY INATTENTIVE, menu said nothing, I had the fried rice, don't bother, with a WEDGE SALAD! Nice glass of White Wine, $13 pretty standard, the rest of our stay was not worth dessert! The service, I digress! No we r not going back. Trying Hotel #2 tonite. Will report."], ["Really average tea experience: Empress Lounge", 2.0, "June 12, 2012", "cathleenmarie", "arlington, va", 40, 106, "This review is regarding the afternoon tea in the Empress Lounge. Two is too few stars and three are too many. First of all, making and confirming a reservation is annoying. You have to call between 9 am and 7pm. There is no answering machine on which to leave a message, e.g., \"I would like to confirm that my party...\n\n\nMore"], ["Glad I had a hot dog from the street vendor before dinner.", 2.0, "June 16, 2009", "rcarp626", "st. croix USVI", 86, 26, "Forgettable. We are 2 guests at the hotel meeting 2 friends. Drinks are ordered and bread is served, bread is old, hard and I pull a few pieces apart so that they can't offend another diner later on.\nI am not in the mood for sushi and not hungry, yet not wanting to be rude, I order the cheeseburger. It...\n\n\nMore"], ["Food ok - service horrible", 2.0, "January 5, 2009", "travelerone12", "Rockville, Maryland", 2, 0, "My co-worker is a frequent visitor to this restaurant -- and strongly recommended that I visit. When in DC - I took a group of friends and families (the week of December 29th) -- and was absolutely appalled at the poor wait service. It was highly unexpected.\nThe food was great - but, the amount of time that we had...\n\n\nMore"], ["Cafe MoZu is awesome for brunch when it used to be the a la carte tasting menu", 5.0, "August 17, 2008", "monra79", "DC", 1, 0, "I used to have brunch regularly at Cafe MoZu and it was excellent when they had the mini tasting menu- everyone began with mimosas and warm ham and cheese bisquits, followed by a tasting of four appetizers from the kitchen. Then you get to pick 2 entrees from the tasting menu and they come as half portions, finished with a...\n\n\nMore"], ["A downer", 2.0, "July 1, 2008", "JillyWashingtonDC", "Washington DC", 7, 1, "After eating at CityZen a month ago (which was fantastic), I was looking forward to having lunch at Cafe Mozu. It is hard to believe those two restaurants are in the same hotel. Our table was sticky and it took quite awhile for the waiter to come over and take our order. The food service was very slow as well....\n\n\nMore"], ["Breakfast was decent", 2.0, "May 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Breakfast was decent"], ["Horrible waiter", 2.0, "March 6, 2008", "srs3b", "Washington D.C.", 1, 0, "I thought Cafe Mozu would be really good since it is in the Mandarin Oriental and I've heard good things about their other restaurant, CityZen. I took my friend and my brother with me and my brother and I had just been at the DC wine and food festival and ate a lot there so weren't too hungry when we...\n\n\nMore"], ["Best Sushi in Washington, DC! I know b/c I work at Mandarin Oriental.", 5.0, "January 27, 2008", "dmlover76", "Washington DC, District of Columbia", 29, 22, "Best Sushi in Washington, DC! I know b/c I work at Mandarin Oriental."], ["Lovely decor but the food consistently dissapoints.", 1.0, "January 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Lovely decor but the food consistently dissapoints."], ["A little pricey but great food and great location in the Mandarin Hotel", 4.0, "January 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A little pricey but great food and great location in the Mandarin Hotel"], ["Good food, great view, attentive service", 5.0, "July 17, 2007", "Tom S", "Washington, DC", 36, 52, "Our first visit to Cafe Mozu included some problems with service but not with the quality of the food. The second time, everything worked well. We had a great view of the Jefferson Memorial and the Tidal Basin. The service was impeccable. Make sure to ask for the cocktail menu if it is not offered; it is lengthy and unusual....\n\n\nMore"], ["Great Afternoon!", 5.0, "November 28, 2005", "AbeTraveler", "Burlington, Massachusetts", 2, 1, "We were in Bermuda for my wife's birthgay and I took her here for one of her birthday celebrations. W both loved it. The ambiance was great, very comfortable. The presentation of food was wonderful. The staff was friendly and everything was delicious. I highly recommend Cafe Mozu!"], ["Afternoon Tea Glitzy but Disappointing", 3.0, "January 17, 2005", "mollyd123", "Washington DC, District of Columbia", 15, 59, "The resteraunt is glamerous and the food looks great, but I found some of the finger sandwiches and sweets to be slightly stale. That's disappointing at $30/pop. I had hoped the tea might be somehow more unusual and Asian-influenced, but it's fairly undistinguished-- just regular little sandwiches and scones. The scones were tasty but arrived without butter, and just the...\n\n\nMore"]]], ["Highlands Cafe & Grill", [["Great food in a small place", 3.0, "October 4, 2015", "Steve P", null, 25, 4, "Was up for Ragnar DC and rented a house that was 2 blocks away. I stopped on for breakfast one day and was beyond impressed. Had the Highland Breakfast and enjoyed it quite a bit, so well in fact that I went back the following morning."], ["I really, really want to like this place.", 3.0, "September 28, 2015", "DSCH415", "Washington DC, District of Columbia", 20, 8, "I live around the corner from this place, and I really, really want to like it. Service is sometimes good. Sometimes bad. Food is sometimes good. Sometimes bad. There's always a crowd. I've worked at these kind of cafes before, where you order first and then sit down, but I think Highlands has too many tables for the space. I...\n\n\nMore"], ["Good stop in the neighborhood", 3.0, "September 10, 2015", "hoteikeeper", "Potomac, Maryland", 38, 12, "cozy and funky neighborhood storefront size cafe. Cuban and soul food items. very casual, local spot. Great for lunch. Tasty Fried green tomatoes and cubano sandwich."], ["surprisingly good food for unassuming place", 5.0, "June 29, 2015", "Richard B", "Vestal, New York", 15, 3, "A small and plain resto in an unglamorous neighborhood of Washington, with not so great service, but food that all of us agree is first-rate. Like an oasis in the desert, with clients one likes to hobnob with. I recommend it heartily."], ["Pleasant surprise!", 5.0, "June 1, 2015", "Ricardo E", null, 28, 7, "Just had breakfast here... Great food, service, and ambiance. Keep in mine it's a pretty small place, so seating is a bit tight. The chicken and waffles were awesome, as well as the brioche French toast. Also, there's a bar! And that's never a bad thing."], ["Easy Breezy Casual Cuisine", 4.0, "April 30, 2015", "Ntreeg", "Washington DC", 27, 7, "Looking for a low-key, casual, no fuss restaurant with good food and no challenges with parking is a rarity in Washington, DC. But, I'm happy to report I found one such spot...Highlands Cafe and Grill, uptown on 14th St., NW is a neighborhood gem. It has causal, uncomplicated fare that is actually good...quality food, perfectly cooked, nicely seasoned and very...\n\n\nMore"], ["Wrong Day or Wrong Part of Town?", 4.0, "April 29, 2015", "Shahid B", "Toronto, Canada", 148, 107, "On Yelp this place comes up as 16 for Washington DC but I am left mixed about it. My salad was was quite delicious because of the tasty chicken and a good amount of it on my chicken caesar salad for only $10.\nThe place seemed to be in a very green area so I thought it looked beautiful. The...\n\n\nMore"], ["French toast. Simple but tasty.", 4.0, "March 8, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "When you arrive at the Highlands on a weekend, you'll have to go directly to order your food at the counter. They'll give you a number and then they'll call you to get a table.\nWe ordered the French toast with scramble eggs and turkey sausage and waffles with turkey sausage and scramble eggs. Food is very simple but tasty....\n\n\nMore"], ["Visited Highlands with a Scotsman", 4.0, "February 4, 2015", "rmcameron", "Raleigh, North Carolina", 40, 16, "Honestly, I'm a total geek and wanted to go because my husband is Scottish (ha) and it turned out to be pretty good. I found the place during my Yelp phase before I started using Trip Advisor. Its a little bit of a drive out into a more residential area but we went for brunch and the food was good,...\n\n\nMore"], ["My BF goes almost weekly", 4.0, "January 14, 2015", "Kristen N", "Los Angeles, California", 53, 36, "My boyfriend lives near Highlands and often comes to Highlands to grab his dinner to go. I finally tried it for myself and I was not disappointed! On New Year's Day, it was packed. We waited in line for about 20 mins to order, and another 15 for our food.\nIt's a very small, casual restaurant... Your little neighborhood cafe...\n\n\nMore"], ["Great food and great times", 5.0, "January 6, 2015", "BFeely600", "Washington DC, District of Columbia", 22, 13, "The only thing better than great food is great food with friends. I have been to Highlands many times and always enjoyed the food and atmosphere. It is a funky, small family-run restaurant, with a pronounced Latin flair. Great decor and artwork decorate the place, and the service is friendly. This time, I was with friends again, but at a...\n\n\nMore"], ["Popular local community eatery", 5.0, "October 24, 2014", "ChrisKiwi", "Auckland, New Zealand", 44, 30, "Tasty, wholesome, inexpensive food. This is not a high-brow dining establishment but a low-key, family-friendly community venue obviously very popular with locals. Try the gumbo and the lentil soup."], ["Great Highlands!!", 4.0, "July 6, 2014", "Andrew J", "Plymouth Meeting, Pennsylvania", 20, 25, "This café was quite a find! By that I mean that on a trip to DC, my wife and I were looking for a nice restaurant that offered a good breakfast menu (for me) as well as a good lunch menu (for her). It was early enough for breakfast and almost noon time for lunch so we and our sons...\n\n\nMore"], ["Yummmmm.....", 4.0, "April 18, 2014", "Crissylynn14", "Los Angeles, California", 11, 0, "The morning glory omelet was good but the home fries were delicious. There were 5 of us for breakfast and we all had great meals."], ["Exelent food and service", 5.0, "July 29, 2013", "MFishbone", null, 1, 1, "I've been in this place multiple times\nAnd the atmosphere is very cozy,friendly service\nAnd food absolutle enjoable at a rasonable price One of my favorites the tilapia,\nThis place is a must try!!"], ["Nice sandwich, nice atmosphere", 4.0, "June 27, 2013", "DCtravels11", null, 103, 44, "Stopped by with my daughter for a sandwich. I had the veggie with hummus and roasted vegetables. It was excellent. My daughter had a smoothie with her sandwich which was very good. Inside casual and outside seating-- a developing hangout for those in the 14th street heights neighborhood."], ["Great hole in the wall place", 4.0, "April 8, 2013", "jacobandjune", "Bowie, Maryland", 221, 76, "Ate here with a friend on the way to the DCA airport on a Monday afternoon and really enjoyed it. Had the Grilled chicken with potato cut fries and my partner had a salad.\nGreat outdoor seating on a cool, sunny Spring day. The service was slower than I expected, but the vibe/atmosphere of the joint and the taste of...\n\n\nMore"], ["Melting Pot Restaurant with Neighborhood Vibe", 3.0, "March 16, 2013", "Kairis316", "Washington DC, District of Columbia", 44, 5, "I was introduced to this neighborhood eatery by a friend who is a huge fan. She ordered an egg and cheese sandwich that she exclaimed over. I had a Belgian waffle, which was obviously freshly made. I would have liked it a bit crisper and more brown, but it was still tasty. I appreciated the mix of urban singles and...\n\n\nMore"], ["Cute and Cozy", 5.0, "August 2, 2012", "Lynnette D", "Washington DC, District of Columbia", 1, 1, "My boyfriend and I went there tonight and the food was delicious. The staff was very courteous and friendly? I will definitely return. The atmosphere was very warm and cozy. I had shrimp linguini and it was so good, seasoned to perfection with very nice size shrimp."], ["Small local resturant with 5 star taste", 5.0, "June 10, 2012", "MarylandIslandgal", "Silver Spring, Maryland", 10, 21, "My husband and I went to the Highland on Sat. June 9. We were looking for a place that had out door seating which they do have but the space was small so we decided to go in. The service was great and the Blackend Tilapia was supurb. My husband had the Shrimp and Grits which he said was excellent...\n\n\nMore"], ["Local joint with excellent food & conviviality", 4.0, "May 25, 2012", "MistinguetteS", "Northampton, MA", 44, 39, "Great breakfast, and one of the best burgers *ever*. What I liked most about the Highlands is that it's locally owned, and caters to local folks. Good food and good community makes it a good time as well as a good meal."], ["Great Neighborhood Place to Eat", 5.0, "November 24, 2011", "Todd J", "Washington DC, District of Columbia", 104, 36, "This is a family run place and on a typical night you pretty much see the whole family working. Standing menu and specials. Breakfast and dinner (haven't been there for lunch). Consistently great food and service. Place is small so seating can be tight and they do takeaway."], ["What a nice surprise!!", 5.0, "October 10, 2011", "Gerry090746", "Flin Flon, Canada", 17, 13, "The hostess at the B & B, The Intown Downtown Inn, recommended the Highlands restaurant to us. My wife had just checked in and it was our first visit to Washington so we walked down the street to this somewhat unimposing restaurant, although the mural caught my attention right away. We didn't know what to make of the place. It...\n\n\nMore"], ["What is there to like?", 1.0, "July 3, 2011", "DCDoctor", "Cincinnati, Ohio", 108, 60, "One of the worst DC dining experiences! No a/c and lots of flies. Only one item on their special vegan menu, which was not what it said it would be. My meal came out prior to them taking the order from my dining colleagues. Appetizers came out last...after the main course. Music was loud and repeating itself. Food was greasy...\n\n\nMore"], ["What is not to like?", 5.0, "May 4, 2011", "Janice K", null, 41, 16, "Only one thing......this is not a swanky neighborhood.... if that is your deal. However, the location on 14th Street is easily accessible by car or bus. One word of caution, look high up on building to find the name of restaurant.\nStaff and customers alike were friendly and helpful. Excellent food, loved the tilapia dinner served with yummy rice and...\n\n\nMore"]]], ["Penn Social", [["Great place to watch a game", 5.0, "September 24, 2015", "KathieT35", "Georgetown, Texas", 82, 21, "In DC and discovered that this was the watch party location for Texas Exes. There were other schools there as well in different locations. Cornhole was going on when we arrived and when the game started they filled in the space with tables and chairs, Bar food was pretty good and there are games all over the place to play...\n\n\nMore"], ["Probably good for night crowd", 3.0, "August 21, 2015", "3RedDoxies", "Fort Lauderdale, Florida", 411, 197, "Went there looking for local beer, found a couple. Decent list of beers on tap with all the usual beer suspects. 2-level floor plan can accommodate a lot of people but it was empty when we were there."], ["Awesome Spot", 5.0, "August 20, 2015", "TravelersYJV", "West Palm Beach, Florida", 27, 10, "I visited this place with a few friends night time and had so much fun! The drinks were great the price was decent the music was good but the atmosphere was so much fun! For some reason we all had a blast that night! I deft recommend to everyone. It is deft a good time!"], ["Fun bar, plenty of activities, lots of local draft beers", 4.0, "August 15, 2015", "MarySL00", "Washington DC, District of Columbia", 295, 151, "Local friends told me about this bar to go have a beer while playing cornhole, ping pong, basketball, or Cards Against Humanity! There's something in for all. We had a blast! Great atmosphere.\nDrinks are well priced and check out the digital menus indicating the keg statuses!\nAround 11pm on weekends, the basement main area turns into a large dance...\n\n\nMore"], ["Awesome spot", 5.0, "June 26, 2015", "Zambraski4", "New York City, New York", 37, 21, "Awesome place for a drink with friends. Three different floors, tons of games and TVS. Guaranteed good time. The bartenders were quick and prices are fair."], ["Service?", 1.0, "June 21, 2015", "Kim Q", "Burlingame, California", 40, 10, "We came to Penn Social a little before 1pm on a Saturday. There were 3 security men outside. I asked how the food was and one of them said \"it's OK\". They checked our ID's and we went in. There was a couple inside and 2 employees. It looked like a cool atmosphere. Big long tables that you share with...\n\n\nMore"], ["Fun place and great staff", 5.0, "April 5, 2015", "momof3boyz1dog", "Camarillo, California", 12, 9, "Fun place to watch \"the games\" on huge tv's. Lots of arcade like games to play on too. Bummer kids aren't allowed after 6pm. I understand not allowing them from 9p on but a family would have a lot of fun here. The bartenders are awesome! You open a tab and they remember your name and what we drank. Even...\n\n\nMore"], ["Alternative Scene", 5.0, "March 11, 2015", "PikkNikkTravels", "Valparaiso, Indiana", 45, 27, "After going to the roof top bar at the W Hotel, this was a nice and accepted change of scenery. More of my style. Started out great, got our drinks up stairs (please consider getting REAL cider like Magners or Strongbows) and then headed downstairs. It had options to play speedball or play table top shuffle board among other games....\n\n\nMore"], ["Penn Social", 5.0, "February 25, 2015", "Austin K", "Olympia, Washington", 79, 37, "Perfect name for this spot. Great place to socialize- whether it is board games upstairs or bar games downstairs."], ["good alternaitve to the standard bar scene", 4.0, "January 9, 2015", "Ray B", "Arlington, Virginia", 2, 0, "Penn Social is a good mix of games, TVs, and drinks in a relaxed atmosphere. I like to come here for HH and to watch games. this place can be a bit crazy after 10pm. On the weekends, this place becomes a straight up club, with lots of drunk people who occasionally like to fight. In short, the time of...\n\n\nMore"], ["Cool place to watch the game", 4.0, "November 20, 2014", "The_Exec_Backpacker", "Orlando", 254, 60, "I happened to be at Penn social during a UCF alumni watch party. Which was great being around other alums in a different city. The service is pretty good on the upper level. We didn't have servers so we had to order drinks at the bar which was a bit inconvenient. The food was actually pretty good and was delivered...\n\n\nMore"], ["Good casual place.", 4.0, "October 16, 2014", "WashingtonJonDC", "Washington DC", 248, 109, "I've been here twice with friends and have enjoyed it both times. It's a big place with a variety of things to do- they had a small concert the last time I was there. The drink prices are fairly priced and the basic pub food are not bad at all."], ["Started out nice", 2.0, "September 19, 2014", "Lawox858", "Newnan, Georgia", 66, 14, "Make a few business associates there after work. The food was good/average and the beer was priced right. But as the clock got closure to 8:00 the music got louder and louder. They were driving out the 30+ crowd fast. I would have stayed longer and purchased more food and drinks but I can only tolerate that loud of music...\n\n\nMore"], ["Really Loud", 3.0, "June 26, 2014", "dakota1956", "Washington DC", 92, 38, "This bar should be next to a college. Great selection of craft brews at a an excellent price and many big-screen TVs. But the food is simply awful. So go to drink, but go ANYwhere else nearby for something to eat."], ["College Party", 4.0, "May 6, 2014", "Molly H", "Fredericksburg, Virginia", 7, 0, "This is the perfect place for a fun, laid-back night. The basement is huge and you will instantly make friends while playing old school games (skee-ball, jumbo connect four and jenga). Pictures and reviews I've read definitely make it out to be more glamorous than it actually is though. Just be prepared to feel like you're in the basement at...\n\n\nMore"], ["AWESOME - Loved this place!", 5.0, "April 7, 2014", "BillieGirl20", "Tire Hill, PA", 147, 42, "This was a quick find while walking through DC and we were so glad we stopped. Very welcoming atmosphere, fun and eclectic. I had sangria that was out-of-this-world. The had all kinds of board games and a downstairs level that was a game room for the kid in all of us. I'd ask them to extend their menu a bit,...\n\n\nMore"], ["Beer and Sports!", 4.0, "October 29, 2013", "jpsteier", null, 14, 8, "Great place in DC for beer, sports, and games. Easy to spend all day here with plenty of activities to keep everyone busy. Lots of space with many games and TV's .. Bar prices are reasonable. I will be back again !"], ["Great Place to Hang Out", 4.0, "July 15, 2013", "Marchal M", "Fremont, California", 38, 26, "I just stopped by to catch the end of my hometown baseball's teams game and I never expected this place to be as big or as cool as it is. The staff was really friendly and put my game on a tv. This would be a great place to go with friends because they have so much to so: skee-ball,...\n\n\nMore"], ["College Experience", 4.0, "April 14, 2013", "M S", "Washington DC, District of Columbia", 94, 34, "We went here to celebrate a friend's birthday on a Saturday night. The upstairs seems pretty chill and laidback. Once you got downstairs, though, it felt like I was back in college: loud music, a big dance area, sticky floors, and drinks being spilled everywhere. It was definitely a fun time, though."], ["Bottom line: If you go for a beer with friends to watch a game, you'll be fine, but eat before you go.", 2.0, "March 20, 2013", "chantiwa", "Washington, D.C.", 22, 12, "I was here for St. Patty's Day to celebrate a friend's completion of the half marathon. Bottom line: If you go for a beer with friends to watch a game, you'll be fine, but eat before you go.\nI generally agree with the other yelpers: Penn Social is a fratty scene with pretty bad food. Our table ordered the pretzels...\n\n\nMore"], ["Huge space for DC", 4.0, "March 15, 2013", "WorldTraveler38", "Washington DC, District of Columbia", 45, 71, "The Good-\nIt's a HUGE space for the area, unusally large with a really big dance area which was great. The music was fine, and the bouncers/door guy was nice.\nThe Bad-\nThe bartender (girl) needs to slow her roll on her attitude. I thought it was just our group, but after reading multiple reviews online, it's apparently just that...\n\n\nMore"], ["Fun Bar", 4.0, "December 26, 2012", "HotelHopper25", "Baltimore, MD", 96, 101, "Penn Social is a \"game lovers paradise\" with tons of games to choose from. Truly it's a great idea...they have skee ball, corn hole, the electronic hoops machine, giant jenga, connect 4, battleship, and many more. I think I'll be hitting this place up more often."], ["Great place to watch the game", 5.0, "December 16, 2012", "mich821", "Pembroke Pines, Florida", 49, 14, "We decided to watch the wizards/heat game at Penn social after hearing it was a sports bar. The drinks were pretty good and the teriyaki wings were excellent. It has two levels which makes it nice to walk around and explore. Would definitely recommend it others."], ["Poor Management", 1.0, "October 22, 2012", "GarnetTerp", "Baltimore, Maryland", 11, 12, "I went to Penn Social on Saturday Oct 20 2012 to celebrate my 30th birthday. I had announced this plan to many friends and I was expecting about 15 people to show up over the course of the evening. We were sitting downstairs when staff came to our table and said the downstairs was closing in 15 minutes for a...\n\n\nMore"], ["Just a Fun Night", 4.0, "September 23, 2012", "tg1915", "Alexandria", 64, 18, "Penn Social is an adult playground - giant Jenga, Connect 4, Cornhole, video games, etc...there is some game for everyone to play and bring back childhood memories and make adult memories at the same time. The bartenders were great, the atmosphere was fantastic and you left just feeling happy. Definitely going back!"]]], ["Fish in the Hood", [["Huge crab cakes!", 4.0, "August 26, 2015", "JLeslie22", "Milton, Massachusetts", 51, 15, "Five of us went for lunch because we'd seen reviews for their crab cakes and their sides. The place is tiny and very busy. We weren't sure how large the crab cakes would be or whether they'd be filling, so we each also ordered fried fish. All of the fish is on ice in a case like a fish market...\n\n\nMore"], ["Yum Yum Yum", 5.0, "July 27, 2015", "ElviraDR", "Austin, Texas", 3, 1, "This place is a match box, which makes it even more special. You order the fish on one counter, then they cook it for you on the other. The crab cake is as big as your face and the sides...OMG. The owner showed up about halfway into our order and finished cooking our food himself. Great guy, told us all...\n\n\nMore"], ["Fresh Fish cooked to Order", 5.0, "July 1, 2015", "laritaraine", "Lithonia, Georgia", 24, 18, "We had a very good experience here. The owner was very friendly and talked to us while we waited for a fresh cooked to order fish. They offered soul food styled side dishes. We ordered one pound of catfish and one pound of shrimp. This was plenty for me and John. We also ordered french fries and lemonade. The owner...\n\n\nMore"], ["local landmark", 4.0, "March 17, 2015", "promitheus", null, 258, 77, "Good selection of fish - just choose and either take home or wait for it to be cooked and served with fries! Very polite stuff - they make me feel very comfortable and welcome even though I struggle with fish names sometimes. Perhaps improving ventilation would be helpful!"], ["Easy fish fry", 4.0, "January 11, 2014", "Explorer_Practicum", "Washington DC", 77, 36, "Great fried fish at good prices. A neighborhood landmark. Pick your fish, wait for it to get cooked, and take it home for yumminess!"]]], ["The Eye Street Grill", [["Great cafe!!", 5.0, "July 29, 2015", "carol m", "Chicago, Illinois", 28, 15, "Went here for lunch and loved it! Really great foods they have everything! They have an amazing salad bar with premade delicious salads as well as sushi, fruits, sandwiches, Asian cuisine, and frozen yogurt. Food is really fresh and everyone will find something they like. The location is great and has some outdoor seating as well!"], ["good", 4.0, "July 11, 2015", "deltadwn27", "Oklahoma City, Oklahoma", 29, 7, "there was fresh sushi, fresh salad and hot food all in a buffet with many choices for vegan or not. quick and fast and easy without being too packed with people, it was just right and very fresh"], ["Deli with weigh & pay buffet", 4.0, "September 30, 2014", "555JenniferL", "Great Falls, Virginia", 141, 50, "Have been buying food here for over 10 years. Not much space to sit and eat, so many grab and go, but some tables in and out. Breakfast and lunch. Good brewed coffee, to include hazelnut. Good fast service at the sandwich counter- don't be afraid to ask for special touches. Buffet at breakfast has a nice fruit area as...\n\n\nMore"], ["Breakfast, fast, hot, yummy", 5.0, "August 27, 2014", "AllyG520", "Lincoln, Nebraska", 118, 27, "Well laid out for grab-n-go, but you can eat there too. Food is well made and generally yummy. Only had breakfast, but would certainly try other meals"], ["Love this place!", 5.0, "July 8, 2014", "poligirl1719", "Alexandria, Virginia", 3, 0, "I am fairly new to the DC area, and work right across the street from Eye Street Grill, so naturally I went in to try for lunch. I'm hooked! The food is always super fresh, and the selection changes daily. It's run by Koreans, and the Korean ladies are always so sweet to me. You can get sandwiches as well,...\n\n\nMore"]]], ["Orange Spoon", [["Great find for breakfast while in Washington", 5.0, "August 31, 2015", "Foxholes26", "Hertford, United Kingdom", 301, 110, "We were staying at the Hyatt in Georgetown and this place was just round the corner for a great cheap breakfast. We started by having the buffet then as the week progressed we used to have it cooked piping hot. Best food we had in Washington."], ["Quick lunch", 3.0, "July 4, 2015", "Kassie P", null, 14, 6, "My husband and I walked here from our hotel for a quick bite to eat for lunch. We ordered from the Korean BBQ and our food was average."], ["Great little find!", 4.0, "July 3, 2015", "Lainie P", "Windsor, Colorado, United States", 39, 6, "Great find for a quick bite and plenty of adult beverages to choose from. We had the breakfast sandwiches that were made to order and coffee. Did look at both the hot breakfast buffet and the cold food. Everything looked delicious and fresh. They close by 8 during the week and 6 on Saturdays. Not open on Sundays."], ["what a surprise", 5.0, "June 21, 2015", "Stickman9", "Chestertown, Maryland", 111, 84, "We were on a 3 day getaway in DC and had read TA reviews for local eateries before going sightseeing. Most everything in DC is on the high end for price. I had read about the orange spoon and forgotten about it but we stumbled on to it. It didn't look promising fro the outside. I even walked in and...\n\n\nMore"], ["Budget restaurant, but with cracking food!", 3.0, "February 6, 2015", "HMCSpy", "Horsham, United Kingdom", 92, 61, "If you are on a budget this is the place to visit.\nClean & tidy, good food, plenty of it, great selection, even does a take away service ~ and all in plastic boxes, even if you are eating in!\nPleasant staff, accept Credit Cards, additional selection of chocolate bars, cakes & cookies etc.\nNot open Sundays, worth a visit...\n\n\nMore"], ["Nice little deli", 4.0, "January 27, 2015", "Gina C", "San Diego, California", 22, 6, "Needed to get a quick lunch and found this place around our hotel. Great selection on food considering it's a deli. You walk in and to the left you have a choice or sandwiches and wraps. Keep going and you have a selection of \"Chinese\" hot food, a mix of Latin entrees, Korean, Paella (?), in the center you have...\n\n\nMore"], ["Nice breakfast.", 4.0, "September 24, 2014", "SmyrnaNurse", "Smyrna, Georgia", 102, 31, "Walked here from our hotel for a quick, fresh take-out breakfast. We each had egg, cheese, and meat on an english muffin. Both sandwiches were cooked-to-order hot and very tasty. Coffee was good, too. Prices were terrific. Would definitely stop here again."], ["Solid food stop", 4.0, "June 12, 2014", "thephan", "Washington D.C. Metro Area", 87, 38, "The food is good, quick, and mostly takeout. Eating in is a loud, cramped mess, but the seating is not what this place is about, it is a takeout joint. Between the hot bar, cold bar, and deli/grill there will something that answers your desire. If not there is a small grocery offering. If not still, you expeccted something this...\n\n\nMore"], ["Quick, affordable, and most important - Good!", 4.0, "June 4, 2014", "bigmohank", "florida", 117, 43, "Had a quick lunch here 4 June, 2014. It's a block away from the hotel I stayed in, and friends had recommended it.\nThere are oodles of buffet style choices, or there's a counter where you can order sandwiches, wraps, and other stuff. The buffet is $7.99 a pound for lunch, I believe. And there's plenty of options, whether it...\n\n\nMore"], ["Great Carryout", 4.0, "April 22, 2014", "Gerson S", "Washington DC, District of Columbia", 74, 45, "Orange Spoon is in our 'hood and we are so glad it is. It makes excellent sandwiches and its hot and cold buffets have good, wholesome food, much of it Asian (no MSG) and all of it good."], ["I love this place", 5.0, "March 11, 2014", "lauren13219", "Washington DC, District of Columbia, USA", 2, 0, "Great selection, delicious Boar's Head sandwiches, friendly staff. If only they were open all the time! (I am a grad student and would totally come here to study)"], ["Always Reliable", 4.0, "February 20, 2014", "FoodSavant", "Longmeadow, Massachusetts", 41, 13, "Orange Spoon is located close to my DC office, and I have visited several times. It never disappoints. Great variety, whether opting for the extensive buffet, or one of the menu options. Delicious!"], ["Something for everybody", 4.0, "November 13, 2013", "blakektn", "Huntsville, Alabama", 30, 11, "This is one of those odd spots one finds largely in urban areas. It's a sort of combination sandwich bar / Korean takeout joint / salad bar / hot buffet / market / wine shop. And oddly enough, it's a pretty decent place to grab lunch. We wanted something fairly light, so we wandered in. She had salad, and hot...\n\n\nMore"], ["Great Buffet", 4.0, "July 23, 2013", "Gerson S", "Washington DC, District of Columbia", 74, 45, "Orange Spoon is a recently opened Salad Bar and Hot Buffet in Washington, DC's West End. It's very convenient for neighborhood denizens and the office crowd. Buffets can be a grab-bag but the quality of Orange Spoon's offerings is excellent. They also make great sandwiches. There is also a small mart which has some staples and a relatively large wine...\n\n\nMore"]]], ["El Camino", [["... for a quiet sunday night..", 3.0, "September 21, 2015", "Giorgio G", "Washington DC, District of Columbia", 72, 14, "I was there with a friend: we appreciated sitting outdoors on a busy street to savor the crispness of a late summer night and people watching.. the syrens of the firetrucks were less appreciated, but definitely part of the urban atmosphere, which we liked... also, all of the customers seemed to be local folks, just stepped out of their homes...\n\n\nMore"], ["Great tacos", 5.0, "September 17, 2015", "Sagamartha77", null, 20, 11, "The staff are great. The food is fresh, and clean, and flavorful. I can't stop going back. The drinks are fun. Check it out"], ["Enjoyed our food and company!", 4.0, "September 12, 2015", "Matt M", "Indian Land, South Carolina", 35, 17, "My wife and I dined with family here in August and were very pleased. We had a few courses of Margueritas and chips/salsa. The guacamole was very good, better than most I have had in restaurants. Their service was knowledgeable and good. My entree was Chilaquiles which is layers of corn tortilla chips, fresca con crema, chorizo and cheese with...\n\n\nMore"], ["Yummy Brunch", 5.0, "May 31, 2015", "Freddie121853", "Highland, Maryland", 1, 0, "We had a fabulous brunch today at El Camino. Chef Dot has created an inspired innovative brunch menu. The tastes still linger long after we are home. Great selection of beers as well as fantastic cocktails. The staff was friendly and attentive with the right amount of interaction. We can't wait to get back to sample their dinners. Great job!!!"], ["Unexpected Treat!", 5.0, "May 19, 2015", "Harrison1964", "Washington, DC", 27, 20, "El Camino is out of the way for me, but was suggested by a friend, so I gave it a try. It is wonderful! In a pleasant, if a bit funky space, with warm and welcoming people, this place is a gem. They serve the best Mexican food I have eaten in DC and I have been here for 22...\n\n\nMore"], ["Hipster Mexican joint", 3.0, "May 8, 2015", "Sara S", null, 36, 14, "i suggest trying at least 2-3 tacos per person so you are able to taste a few favors. Skip the pricey, small portion of guacamole and get the chips/salsa instead - amazing salsa verde! Their bartender definitely took some time to craft their drinks list and it shows. My husband had the Sylvia which was a throwback to an Old...\n\n\nMore"], ["cute little quaint restuarant", 4.0, "April 22, 2015", "Bankslady", null, 41, 14, "Met some of my friends for dinner and drinks on a Thursday night. This place is cute, quaint, and an ideal place for someone who does not want a large crowd. The Tacos are really good and range from 2.50 - 3.50 a piece, They are small but very good, try the Chorizo and Potato taco YUM! The happy hours...\n\n\nMore"], ["Local spot and off the tourist radar.", 5.0, "April 1, 2015", "DCGator6", "Washington DC, District of Columbia", 10, 7, "Came here with friends on a Saturday night - waited about 30 minutes by the bar. The place was buzzing. Fast service at the bar with some interesting drinks. Good margarita if you like it tart with lots of salt. Our server was great and answered our questions. Definitely some of the best mexican food I've had. It was very...\n\n\nMore"], ["Nice neighborhood spot", 3.0, "February 27, 2015", "DCInsider", "Washington DC", 201, 112, "Went here with some Bloomingdale locals and had a nice dinner. Cool and trendy space without being pretentious. Really friendly staff- and I love when the chefs bring out food themselves. It shows they care and are proud of what they serve.\nThey may be catering to the American pallet... but I thought the heat was missing. Living in Mexico...\n\n\nMore"], ["Excellent Mexican in Bloomingdale!", 4.0, "February 10, 2015", "Matthew L", "Washington DC, District of Columbia", 68, 28, "A great little find in Bloomingdale. The food is quite good, and the atmosphere is very trendy with a very neighborhood vibe, but not overly crowded. The service is exceptionally friendly. I recommend the tacos and the margaritas - will definitely be coming back!"]]], ["Roti Mediterranean Grill", [["Incredible flavors!", 4.0, "September 20, 2015", "scjjmm", "Thallichtenberg, Germany", 76, 28, "Nothing fancy about this place, a little confusing if visiting for the first time. I ordered the rice place with roti chicken. You pick your sauce and sides, they have over 6 sides to choose from, I went for the hummus, couscous and olives. Get the pita bread. Everything tasted so good, what amazing flavors. Overall doesn't look very appealing,...\n\n\nMore"], ["Loved it, cant wait!", 5.0, "September 9, 2015", "yuvarajvima", "Austin, Texas", 123, 69, "When will this chain open in Texas? This is the chipotle for falafel - with lovely toppings, and choice of salad bowl or wrapped in tortilla (laffa bread). The best part if the choice of sauces - you know I am a sauce lover - they have yogurt based, pepper based, spicy, garlic and a tasty, creamy hummus to go...\n\n\nMore"], ["Good fast food", 4.0, "July 24, 2015", "FJA1726", "WILLIAMSBURG", 7, 2, "I enjoy Roti's \"Best Plate Ever.\" It is a satisfying, high protein (38g) meal at a responsible price--at about 600 calories."], ["Not bad, but not sure what all the fuss is about", 3.0, "July 18, 2015", "Adam G", null, 40, 15, "We ate dinner here one night while we were in DC (looking for something fast/casual), and the reviews all were pretty good. Our food was fine, but the felafel was dry and overcooked, as was their \"roti\" chicken. It was fast, and it wasn't too bad, but it wasn't great either."], ["Great experiment our first night in.", 4.0, "July 16, 2015", "KasStL", null, 17, 3, "Food was fresh and nicely done for 'fast food' style restaurant. There were several choices on the menu that appealed to each of us. The price was right. The servers were smiling and upbeat. We dined in and watched many people come and take food home."], ["Worth the stop", 5.0, "June 27, 2015", "Michele W", null, 6, 1, "If you like Mediterranean food this is the place. This was a phenomenal meal. Quick. Great flavor. I throughly enjoyed the food."], ["So very disappointed.", 2.0, "April 14, 2015", "TravelerMR", "LosAngeles, CA", 112, 57, "I love med food and was so excited that there was an award winning casual med food restaurant right by my hotel. I was even more pleased when I saw the wonderful prices. I got the Best Food plate with freshly grilled chicken kabobs. I was horrified to see they squirted some orange sauce on them (but realized I should...\n\n\nMore"], ["Great flavors, great price convenient location", 4.0, "February 18, 2015", "Josh T", "Durham, North Carolina", 25, 11, "Near my NoMa hotel, open til 9, authentic flavors, fresh and natural ingredients. Only complaint is that I came in during the evening, and they were short on chicken kabob meat, and roti. Hope they will keep all menu items stocked til close."], ["Good Fast Food", 4.0, "February 15, 2015", "juheston", "Livonia, Michigan", 34, 5, "I typically grab a bite to eat at this restaurant while staying at the Hilton Garden Inn next door when traveling on business. The food is fresh and fast."], ["Great location", 4.0, "October 27, 2014", "Jerry L", "Mississauga, Canada", 118, 43, "I liked the food and the easy menu. The food was good and the staff took the time to ensure we were well looked after."], ["Just before closing", 4.0, "October 17, 2014", "derikj", "laptop", 17, 4, "We arrived a few minutes before they were closing the store for the evening. We had limited choices. But the food we had was exceptional. This is not the kind of place you go for a nice dinner it's more of a diner counter service kind of restaurant. I can't wait to go back when they have the full menu...\n\n\nMore"], ["Excellent", 5.0, "October 14, 2014", "JandGBG", "Toronto, Canada", 49, 34, "Close to hotel and really hit the spot. we were starving from traveling and despite that we each made our pita last till the evening meal as well it was so full of yummy stuff!"], ["Yummy stuffed pita...", 5.0, "October 6, 2014", "C I", null, 111, 32, "First time in a Roti Grill, and I loved it! The variety and freshness of the stuffings for the pita were fantastic. My favorite had to be the eggplant, although it was all good. The staff were not real helpful or friendly to a \"newbie\" in the line, but no prob, that's part of the charm of traveling. Nice choice...\n\n\nMore"], ["Not Bad", 3.0, "September 25, 2014", "sheiksan", "Honolulu, Hawaii", 208, 103, "This restaurant was close to my hotel so I tried it one night. The portion was generous and food was tasty, but the meat was tough. I am a Mediterranean food lover and this place was about a 5 out of 10. But it is fast food, after all."], ["Great quick mediterranean!", 4.0, "July 15, 2014", "savvyc", "DeLand, Florida", 40, 19, "I come here whenever I need my mediterranean food fix. I am never disappointed! Plenty of choices and combos. I get the chopped chicken salad as is. Absolutely delicious! You can always get extra of whatever comes on your meal, just ask, they are happy to do it for you. Most meals come with pita bread, get it....it's good! Wonderfully...\n\n\nMore"], ["Worth eating here", 4.0, "July 12, 2014", "sblackman27", "Brooklyn, New York", 32, 18, "Great meal for under $10!! Their chicken wraps and rice dishes were big and super filling! Great for take out or eat in."], ["Quick and good food.", 4.0, "August 15, 2013", "Al168Trenton_NJ", "Trenton, NJ", 117, 42, "I had a pita sandwhich which was excelent. You have your choices of meats and sides. Great value and two doors down from the Hilton Garden Inn on 1st St."]]], ["Aroma Cafe", [["Great for a stop on a hot day handy for the Metro", 5.0, "June 23, 2015", "akh1946", "Worthing, United Kingdom", 50, 24, "Smoothies are great and very full of fruit. Almond croissants great. We were made to feel very welcome, thank you"], ["Great place for breakfast and lunch", 4.0, "April 9, 2015", "IAMZ", "Milwaukee, Wisconsin", 29, 7, "Friendly place to eat breakfast or lunch (did both). I believe the owner and wife run the cafe, very nice people. Great place to stop in DC before seeing the sites."], ["Very enjoyable.", 4.0, "January 5, 2015", "ghinga", "LaGrange, Ga", 72, 23, "Got there because of a restaurant coupon and glad we did. I ordered a curry which didn't taste much like curry but it was flavorful and good. Nice staff with pleasant service. Well worth the stop."], ["Good breakfast stop", 4.0, "July 17, 2014", "Margaret915", "Shreveport, Louisiana", 18, 10, "Enjoyed breakfast and the street view through the large windows - Good food, friendly staff, Bagels, coffee, eggs, all were delicious."], ["Excellent", 5.0, "May 4, 2014", "Joanne S", "Edinburgh, United Kingdom", 2, 0, "Don't know the man's name - but the owner (I assume) was so friendly and the menu was varied. The food fresh and the coffee good."], ["My go-to - best coffee in the area", 5.0, "February 1, 2014", "elk1787", "Washington DC, District of Columbia", 19, 8, "This place is great and the owners are wonderful. Their coffee far, far surpasses Starbucks. Sam the owner remembers everyone's standard drink orders and notices when I've been away for a week or so on business. I love supporting their business and look forward to stopping in each weekday morning."], ["Good for a quick breakfast", 4.0, "January 8, 2014", "PipR_UK", "Bristol", 7, 13, "I stopped in for coffee and a breakfast BLT. It was after 11am so breakfast was no longer being served, however they still happily obliged with a breakfast order request. It was quick and tasty and the coffee was good. It was close to my hotel, Melrose Hotel which was convenient."], ["Very good breakfast", 4.0, "November 17, 2013", "Andy2411", "Sydney, Australia", 21, 11, "As our hotel was just around the corner, we stopped off hear for breakfast before tackling a day in DC, the food was very good and the service quick and friendly. We would return for breakfast and coffee."], ["Just OK", 3.0, "June 27, 2013", "FromAway67", "Orlando, Florida", 203, 105, "We went with a large group of parents. The food for that event was served family style. While the food was good, I would not go back as there are too many great restaurants in DC to eat at. This one is average."], ["Good breakfast stop - owners very courteous and accomodating", 4.0, "May 22, 2013", "valueman84", "Laguna Woods, California", 69, 19, "Quick breakfast stop here - Owners work very hard here - serving and cooking to order - lots of locals here - seemed to be friendly with the owners and each other - lots of Lattes served here -"]]]]