[["Bar Rouge", [["nice staff, good snacks!", 5.0, "October 7, 2015", "Cathy R", null, 3, 0, "love the wings! always lovely staff. patient and perfect for happy hour with that free wine at 5pm and never overcrowded"], ["Average to poor food at best", 2.0, "July 29, 2015", "calbearfan", "bay area, ca", 66, 41, "Not up to Kimpton standards. You would think with a very limited menu they would do the things on it well. They don't. Skip this place and fight someplace near by that is better"], ["Modern yet Retro", 4.0, "June 13, 2015", "TwinkleTravler", "Manassas, Virginia", 109, 28, "Very interesting seating, cozy ambiance, - good breakfast served in bar (eggs, has browns, toast) - was $12, which was a fair price to dine in DC."], ["Even the locals come here", 5.0, "June 8, 2015", "VacayTimeGirl", "Phoenix, Arizona", 26, 10, "Very good happy hour! Stylish and sexy atmosphere. The servers are super attentive, quick, and friendly."], ["Great wine and cocktails", 5.0, "May 11, 2015", "Leiah S", "Phoenix, Arizona, United States", 8, 1, "the bartender was amazing and gave us a supper good dirty dirty dirty martini! Love the wine hour as well!"], ["OK for a quick drink, not a destination", 3.0, "February 16, 2015", "lfurman05", "Philadelphia, Pennsylvania", 3, 0, "Not much of a vibe. Fine to grab a drink if you're staying at the property. Very friendly bartender."], ["too narrow and noisy", 1.0, "February 2, 2015", "Yovany E", "New York", 2, 2, "the bar is just too long too narrow and full of not very polite people.\nthis bar need a renovation and redesign so visitors can feel more comfortable when asking for a drink is super difficult to reach the bartender"], ["Business trip late night drink & snack", 3.0, "January 26, 2015", "margaretelise", "Rego Park, New York", 94, 36, "I wasn't here long; just wanted some food & a drink before going to bed (staying at the Rouge Hotel). So my POV isn't very broad but this place was just lovely - by my 'average' rating I mean you should totally go if you're here (nothing spectacular to go out of the way for, it's not close to much)....\n\n\nMore"], ["Nice decorations and music", 4.0, "November 8, 2014", "flora z", null, 130, 40, "The atmosphere is upbeat and modern. The unique and edgy decoration adds a touch of personality to the bar.\nThe dinner tastes great with decent services. The breakfast is simple but hearty. However, there is only one waiter/waitress to serve the tables. Maybe it is a little bit under-staffed."], ["Wine Reception lead to tasty snacks", 4.0, "August 4, 2014", "Jennimusing", "Winston-Salem", 33, 11, "Not a huge menu but a tasty one, with a hipster flair to go with the decor. We liked the appetizers and craft cocktails.\nWe did not partake, but breakfast smelled delicious."], ["Nice atmosphere, good value, weird seats", 4.0, "June 21, 2014", "RichardinOhio", "Williamsburg, Virginia", 521, 284, "They have a nice appetizer menu, good value for drinks, nice but small space. Some of the chairs are oversized, very strange for a bar--rather like a kasbah in Morocco... If you are staying in the hotel Rouge, it's a good diversion, but if not, I'm not sure it's worth a stop. Very pleasant staff--it doubles as the breakfast space...\n\n\nMore"], ["Great staff", 5.0, "April 9, 2014", "Joe H", "Cary, North Carolina", 185, 61, "The Bar Rouge is a small intimate bar in the Rouge Hotel. It was a nice place to relax after a long day. The staff was attentive and very pleasant."], ["Love it!", 5.0, "April 2, 2014", "Viajem0s", "Miami, Florida", 14, 4, "Super cute and chic and also elegant, great drinks, great staff and food is yummy. Worth the price. The girl who is there is super friendly and professional, she can advice you in tips to get around the city and other places to visit. The music is also great, awesome environment overall."], ["Inadequate tables for dining", 2.0, "March 15, 2014", "45DegreesNorth", "Montreal", 327, 211, "Two mornings we tried to have breakfast (during early March, certainly not high season) but each time no tables could accommodate us, while the limited larger tables were taken often by just one person. Seating not managed well by staff. Small oval tables along the benches are more suited to drinking than dining. Better if they had square or rectangular...\n\n\nMore"], ["Go for happy hour", 5.0, "January 7, 2014", "kathady", "Boston, Massachusetts", 69, 45, "Food was good. Happy hour very fun. Bartender friendly and accomodating. We sat in the lobby so we could have our dog with us."], ["Nice place to hang out for a few drinks", 4.0, "December 9, 2013", "Mitters W", "Naples, Florida", 20, 24, "It was right by the road side and it was this cool deco, that was quite fascinating. Love to sip a drink and look out of the window."], ["Decent Bar", 3.0, "October 19, 2013", "Trisha W", null, 12, 5, "This was a cute and decent little bar near my hotel. Very small, not much to write home about, but it was a good happy hour. Our waitress wasn't very good though."], ["Check the Gratuity", 3.0, "September 22, 2013", "Oztraveller97", "Melbourne Australia", 50, 16, "They added 20% without prior notice and followed us out when we tipped less. We were always advised 20% is for exceptional service, this was average at best. Readily rectified though when the manager was advised. Food was good, but a bit pricey for what it was."], ["cute bar nice staff", 4.0, "August 14, 2013", "qman7", "nyc", 6, 8, "small little bar nice people, nice staff.My wife and i were staying at the hotel so it was a nice place to end the evening of seeing the sights os washington dc"], ["Washington, DC", 5.0, "May 31, 2013", "relldy01", "Saint Charles, Missouri", 34, 11, "Rouge Hotel has a good location and staff. Everyone was very helpful and suggested locations for lunches and dinners. I list of these with a map would be very helpful."], ["Bar Rouge", 5.0, "February 10, 2013", "ndf321", "Ohio", 5, 1, "We visited Bar Rouge both nights that we stayed at Hotel Rouge. The drinks were great, especially the bloody Mary. The sweet potato tots, bruschetta and hummus were all delicious and the happy hour deals made it an excellent value. Our bartender Charisma bent over backwards to accommodate our special requests and was super friendly."], ["Very good, bar staff could have used more help", 4.0, "February 3, 2013", "Angela C", "Washington DC, District of Columbia", 15, 4, "We had a few drinks in the Bar Rouge before our night out on the town. The bartender was very attentive, but as the night (it was a Saturday night) wore on, the bar became more crowded and she was having difficulty keeping up. Another bartender on a Saturday night would have made this visit perfect."], ["Very rouge indeed", 5.0, "January 15, 2013", "jane s", "sanctuary cove", 102, 51, "Great cocktails, good wine list and excellent service. Smallish and fun. Just watch that you don't hit you head on the hanging lights! Everyone does - and watches you do it too."], ["Small, But Nice Place to Hang Out", 4.0, "December 15, 2012", "Mayoplan", "Virginia Beach, Virginia", 296, 168, "During the 5 o'clock managers reception, I sat by the window in the Bar Rouge watching walking traffic up and down embassy row. Also, the naked statues by the window, give it a style that's hard to forget. Breakfast in the morning is also served in Bar Rouge"], ["Poor Service", 2.0, "November 18, 2012", "jwc3", "Raleigh, NC", 46, 48, "The food was good, but the service was slow. We placed a drink order and waited about 30 minutes for our drinks. We saw others walk in after us and get serves. We eventually reminded the bartender (the only person working there) that we had ordered drinks and she made an \"oops\" expression. She had completely forgotten our order. The...\n\n\nMore"], ["In House Comfort", 4.0, "November 12, 2012", "Harlemstyle", "New York City, New York", 49, 10, "Stayed at Hotel Rouge and ended each night at Bar Rouge for a night cap and a way to relax from my hectic day. The Bar is very cozy, with warm lighting. Tasty drinks and delicious appetizers. Loved being able to walk a few feet to the elevator to my room."], ["Nicely done at late night.", 5.0, "November 11, 2012", "Philly R", "Philadelphia, Pennsylvania", 2, 1, "Order the burger! It was fantastic! The bar chairs were seriously uncomfortable. I hope they change them out soon. Excellent bartender!"], ["Nice party area", 4.0, "November 2, 2012", "LuizDomanski", "Curitiba, Brasil", 21, 20, "Great hotel bar! Nice music, smoke free area (except at the deck), great drinks, great beer, cool snacks."], ["Planning a Chic Event?", 5.0, "October 17, 2012", "ItsMissBrooks", "Washington, DC", 14, 15, "This is where you want to do it. The food is delicious and the kimpton event planning coordinator is such a pleasure to work with that I have referred my friends and family there often."], ["Small, intimate lounge with great food!", 5.0, "October 1, 2012", "Focused77", "SAINT PETERSBURG", 63, 15, "Great service, small menu but enough options to find several items you'd like whether salads, meat or seafood. Appealing presentation, amazing taste! No need to leave the hotel to go anywhere else to eat."], ["Rigo - what can I say?", 5.0, "August 16, 2012", "Susie S", "Somerville, Australia", 17, 6, "Cute little space located at street level at the Hotel Rouge. They were happy to help with anything and give local tips & hints...that was handy. Great spot to relax, enjoy your wine - great wine list! Fantastic company, locals are happy to mix with guests at the Hotel, an added bonus."]]], ["l'Enfant", [["great duck!", 4.0, "October 15, 2015", "uvamon", "Cancun", 163, 62, "I had the duck it was very good in flavors....not so much meat and more of the vegetables....the onion soup was not espectacular!"], ["Cool vibe", 4.0, "October 11, 2015", "JAG2021", "Washington DC, District of Columbia", 66, 21, "Stopped by for a drink and appetizers prior to another engagement. Cool place w/ good music, good ambience and an eclectic crowd. Tsvetomir H. took care of me at the bar with a well crafted cocktail. Recommend the pommes frites (although you'll have to request mayonnaise)."], ["Lacking je ne sais quoi", 3.0, "September 13, 2015", "Delphine384", "Saint Louis, Missouri", 130, 50, "This restaurant wasn't quite a disappointment, but didn't live up to my expectations either. The outside is cute and attention-grabbing. The interior is set up like a French bistro. The menu is pretty varied and most palates can probably find something that they like. However, our meal experience while not bad just wasn't great. First off, the service is slow....\n\n\nMore"], ["Best for drinks on the patio", 3.0, "August 14, 2015", "aDCArtist", "Washington DC, District of Columbia", 2, 0, "The service is good, but the food and drinks are over-priced and the portions are small. If ordering wine, expect the minimum, 4-oz serving size."], ["So glad we found this little gem!!!", 4.0, "May 8, 2015", "JoeyandTinaCarney", "Richmond, Virginia", 27, 9, "My husband and I were staying a few blocks away last weekend for our anniversary and found this corner restaurant in the Adams Morgan neighborhood. It was a cold evening so we did not get to enjoy the patio but sat at a table next to the front window and enjoyed watching the Friday night activity surrounding us. The crepes...\n\n\nMore"], ["Longtime crepe place on the edge of Adams Morgan", 5.0, "March 29, 2015", "merskamp", "Silver Spring, Maryland", 32, 8, "One of my favourite places in DC. I love Crepes and have been coming here for about 10 years.\nThey have a good beer selection and the crepes are outstanding. I had a banana split dessert crepe last night and it was great. What else to stay, have always had good customer service here. Its cozy (read: cramped) inside but...\n\n\nMore"], ["Can't Say Enough", 5.0, "November 20, 2014", "Sing4Elohim", "Toledo, Ohio", 38, 9, "I was so happy to walk into this quaint little establishment for an intimate dinner during vacation in DC. Armed with a livingsocial coupon, my boyfriend and I ordered the duck confit, gnocchi, and a dessert crepe which were all out of this world! The atmosphere made me feel as though I had been transported overseas (minus the accents) and...\n\n\nMore"], ["Great Food and Great Location", 5.0, "October 20, 2014", "mrterriers2", "Phoenix, Arizona", 40, 19, "We ate here twice and both times sat on the patio and enjoyed all the street activity. Joel was our waiter both times and provided excellent service. One evening we both had the flatbreads, cheese antipasto, pommes frites and wine. The flatbreads were delicious and the antipasto had a good variety of cheeses. On our next visit, we had a...\n\n\nMore"], ["Nice patio, bland food", 2.0, "August 17, 2014", "bru12345", "london", 65, 22, "This place is in a great location and that's what you pay for. I'll refrain from saying much more. Walk a block up or down 18th street and you're bound to found better alternatives."], ["Excellent", 5.0, "July 31, 2014", "Mgal1", null, 3, 6, "Quaint little French cafe. Great atmosphere. Nice wine list and wonderful food. The staff was very friendly and attentive. The fig flatbread was AMAZING!! Crepes were authentically delicious."], ["Belgian cafe", 5.0, "July 29, 2014", "Andrei M", "Bethesda, Maryland", 22, 8, "Beer, beer, and again beer. Plus nice neighborhood and great service. Excellent time spent there...."], ["Terrific food, attentive staff", 5.0, "July 28, 2014", "rochestertraveller", "rochester new york", 130, 32, "We stumbled upon this restaurant because we had a Groupon - and so glad we did! The food was excellent - we had frites and a flatbread pizza for starters - the sauces for the frites were tasty. Dinner selections were plentiful...and the dessert crepes (I had frangelico nutella!) were delicious.\nI don't think you could go wrong here."], ["One of best patios in AdMo, IMO", 4.0, "July 22, 2014", "iStefPayne", "Washington DC", 126, 58, "L'Enfant's patio is completely reminiscent of Parian cafés that I love -- tiny tables and itty glasses of table wine, some good service and some leaving much to be desired. The beverage menu has my French favorites: Ricard, earthy Bordeaux... and my favorite Belgian beers: Chimay, Delirium. Even better, Tuesday night is half price Belgian beer night and you know...\n\n\nMore"], ["Lost But Nummy Find", 5.0, "July 2, 2014", "Sara H", "Menomonee Falls, Wisconsin", 113, 37, "Well, I was lost trying to find a restaurant my teen had chosen after leaving the zoo. We could not park anywhere and stumbled into this restaurant at lunch time starved! We immediately order the cheese plate and gobbled it up except for the bleu. The duck confit crepe was lovely. The chicken crepe was not to my taste but...\n\n\nMore"], ["nice outdoor terrace, good food and service", 4.0, "June 20, 2014", "jenabaindelhi", null, 910, 426, "A friend and i had dinner here tonight---and it was gorgeous to sit on the terrace and enjoy life in the neighborhood. The menu is limited and focused on French/Belgian food. We both had crepes, which is the speciality. Nicely done, simple, and tasty. We also had dessert crepe--- grand marnier and caramel. The server was supposed to light the...\n\n\nMore"], ["Very disappointing", 1.0, "April 18, 2014", "Steve A", "White Mountains", 90, 28, "Very disappointing. Duck Confit should be so tender that it fall off the bone. It is obvious to me that this chef knows nothing about French cooking. The windows have not been cleaned in a year. Also the gnocchi was fair at best."], ["A little hit & miss....", 3.0, "March 26, 2014", "Heather M", "Calgary, Alberta, Canada", 64, 24, "This is clearly a popular little neighbourhood bistro as it was packed when we arrived for a late dinner. It is very small and crowded with tables, but very pleasant. Our server was prompt, but all business - he didn't waste any time chit chatting with us. I ordered the soup of the day and anti-pasta platter and my daughter...\n\n\nMore"], ["Le Boum brunch is incredible", 5.0, "March 16, 2014", "Erin G", "Greenville, North Carolina", 25, 8, "We went for the Saturday brunch called le Boum. You need reservations months in advance, and pretty pricey but the most fun you can possibly have at brunch. Food was pretty good, the dj was awesome and everyone in the place spends the three hours dancing on your chair. It's a wild time so make sure you go with good...\n\n\nMore"], ["Back for Sunday Brunch", 4.0, "November 17, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Try this personable eatery for Sunday brunch....outdoor seating (while the weather permits). Delicious Eggs Benedict with Salmon. Variety of Crepes. Try a Bowl of Cappucino (it is actually served in a bowl). Wait staff charming as well."], ["Slow service ok food good location", 3.0, "September 22, 2013", "exclea", "Washington DC, District of Columbia", 194, 99, "We waited for 5 mn even though tables were empty but there were no waiters. Half of the food on the list wasnt available. We had to wait 10 mn just to order and half an hour for the food to arrive. You have better options"], ["Exceeded both my low and high expectations", 5.0, "July 8, 2013", "gregcaires", "Fairfax, Virginia", 11, 4, "Specifically went for the Saturday afternoon brunch: La Boum. I was pleasantly surprised that the food was far better than expected; the Steak Frites was cooked perfectly and tasted just like those I've had in Parisian cafes. The dance party was crazy good time better than I had expected, and I had high expectations for this event. Bring your closest...\n\n\nMore"], ["OK", 3.0, "June 23, 2013", "Mike S", "Washington DC, District of Columbia", 1, 0, "I love the Belgian beers there. We went there for brunch, ordered the Eggs Norwegian. Food was not hot. waitress never asked us how was our meal. She was slow, was somewhat disappointed in the service."], ["Good food, but way over priced - give it a pass", 3.0, "June 22, 2013", "zhuzhuboyer", "Ft. Hunt, VA", 71, 35, "Food was good, but in VERY small portions. Drinks were delicious, but at $11 and up - shouldn't they be? Left there hungry even though I had a starter (salad), pork medallions (sized for a child), an dessert (a lonely, small crepe on a huge plate). The plates are enormous, but the portions are so small you're certain it's the...\n\n\nMore"], ["Great Bistro in Adams Morgan", 4.0, "June 6, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Good selection of Belgian brews. Crepes are special , French Dip sandwich, Croque Monsieur, Mussels, or le hamburger. Good for lunch or dinner. Excellent service."], ["Enforced Gratuity for Party of Three", 3.0, "May 20, 2013", "WKElaineO", "West Kelowna, Canada", 4, 4, "Staying in the Adams Morgan area of DC, we wandered around the neighborhood before coming upon l'Enfant. It was too nice an evening to sit inside, so we asked for the patio. Very small tables, we needed two for the three of us. Disappointed that smoking laws here permit smoking in restaurant eating areas. However, the location next to the...\n\n\nMore"], ["Great Food", 4.0, "April 16, 2013", "EowynTravels", "Annapolis, Maryland", 74, 28, "I met a friend in DC and she wanted to try this restaurant. It was a nice walk from the Dupont Circle metro. Once we arrived I used the bathroom and had a little trepidation. It was dark and not clean. They need a remodel; badly!\nThe food was a different matter; it was fabulous! We had the scallops appetizer,...\n\n\nMore"], ["Adams Morgan neighborhood location", 4.0, "November 26, 2012", "travellight47", "Ohio", 87, 29, "Small, neighborhood restaurant. Has Straffe Hendrik beer. Mussels were good and garlicky. Music a little loud.\nWhat's the Saturday \"Clothing Optional\" brunch all about?"], ["EXCELLENT !!!", 5.0, "September 30, 2012", "Roriie", "Quebec, Canada", 10, 23, "This restaurant is just fantastic !! We went there to eat supper. Everything was good. Cappuchino are enormus and sooo delicious !! And take the crepe as a dessert. Choco-strawberries are to die for !"], ["Quaint.", 4.0, "February 2, 2012", "joburkholder1", "Annapolis, Maryland", 586, 190, "The cafe is small. We had reservations which were made conveniently through Open Table. Casual atmosphere. We passed on appetizers, had French Dip and Le Croque Monsieur. Both were served with a nice side salad that was topped with a light dressing. They were prepared well and tasty. The menu had many nice choices and it was difficult to decide...\n\n\nMore"], ["Great for Belgian Happy Hour - Good the rest of the time!", 4.0, "October 19, 2011", "brusselsdaniel", "Washington DC, District of Columbia", 90, 46, "L'Enfant is a small French/Belgian style cafe on the corner of 18th and U Streets NW in Adams Morgan. The interior is filled with small tables and could be anywhere in France. The outside has a large terrace.\nThe best thing about l'Enfant, and the thing which won my heart when I moved from Brussels to DC in 2009, is...\n\n\nMore"], ["bad food, small portions, no value for the $", 1.0, "June 27, 2011", "dcintlfolks", "Washington DC, District of Columbia", 1, 0, "We looked forward to a nice French bistro meal. What a joke. Ordered one beef bourguignon and two chicken fricassee - waiter came back and said no fricassee, so changed to two \"truffle\" macaroni/cheese. $17 for an almost tasteless mini portion of beef, $15 for a ramekin of mac/cheese (with truffle oil) and equally tiny salad. And the mini piece...\n\n\nMore"], ["Nice, but overpriced", 3.0, "May 1, 2011", "kbpneacl", "Lorton, VA", 133, 63, "I went to L'Enfant Cafe after they put a deal on Living Social. It is a small, nice place on the corner of one of Washington's many crazy intersections: FL Ave, 18th and U Sts. Good people watching. The place prides itself on Belgian beers, and has Belgian food options as well, but oddly has a French flag hanging outside....\n\n\nMore"], ["Very pleasant experience, esp. during happy hour.", 3.0, "November 29, 2010", "cblukens", "Somerville, Massachusetts", 92, 36, "Nice neighborhood place with a solid menu and beer list. Being there in November meant it was very cozy inside, but the patio looks very cool. The house wine was tasty and cheap during happy hour. My wife and I really liked what we had - food was pretty standard Euro-gastropub with bistro portion sizes. The service was the standout...\n\n\nMore"], ["Breakfast Bistro and Belgian Beers, this place has it all.", 5.0, "January 21, 2010", "CulinaryCreator", "Northeast", 17, 17, "L'Enfant is within walking distance of the Dupont Circle metro stop. It is a cozy french bistro on the corner. My girlfriend and I stopped in for brunch on a cold windy day. We got a nice table that let us watch all of the action in the busy restaurant. It was clearly a favorite of the locals, and we...\n\n\nMore"], ["Way overpriced mediocre food and dismal wine selection", 2.0, "July 7, 2009", "FLtraveller76", "Orlando, FL", 13, 74, "First, this is not a true French restaurant. What French restaurant has only Belgium beer and a selection of four wines, all of which are mediocre. The savory mushroom crepe was decent, but my white chocolate dessert crepe was devoid of any chocolate. I think they forgot to put it in. All in all, I had a crepe, my date...\n\n\nMore"], ["sunday brunch is good", 4.0, "November 24, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "sunday brunch is good"], ["Good for light, inexpensive and romantic meal. Don't go hungry! Do go for the beer.", 3.0, "October 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good for light, inexpensive and romantic meal. Don't go hungry! Do go for the beer."], ["After a night of drunken' dancing, this place hit the spot for brunch. A little slow on the service but good food, and...", 4.0, "April 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "After a night of drunken' dancing, this place hit the spot for brunch. A little slow on the service but good food, and nice atmosphere."], ["Love the wig night!", 3.0, "April 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love the wig night!"], ["They serve crepes! Like...", 4.0, "March 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They serve crepes! Like the old crepe truck at Penn! I love crepes! And the beer, yum."], ["One of my favorite places to go in the summer--cheese plate is very good.", 4.0, "February 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of my favorite places to go in the summer--cheese plate is very good."], ["Food is pretty good, beers are better, but beware it closes early!", 3.0, "January 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Food is pretty good, beers are better, but beware it closes early!"], ["Good crepes. A bit dark...", 3.0, "January 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good crepes. A bit dark inside."], ["Excellent french wines, belgian beers... the food is okay, friendly service, but a bit dark and noisy B", 3.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent french wines, belgian beers... the food is okay, friendly service, but a bit dark and noisy B"], ["Good comfort food. Try their crepe with strawberry, banana and nutella is wonderful. They also have Stella on tap. This...", 4.0, "December 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good comfort food. Try their crepe with strawberry, banana and nutella is wonderful. They also have Stella on tap. This is good for a small group or if you want to have a comfortable atmosphere to chat with someone one on one."], ["Great service and environment, plus they always have a few good looking bartenders.", 5.0, "November 29, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great service and environment, plus they always have a few good looking bartenders."], ["Bonjour Paris and Hello History", 5.0, "April 8, 2007", "disheveled7", null, 38, 76, "L'Enfant Cafe is located in the heart of NW DC, amid the bars and nightlife. It's humble facade may be overlooked at first -- the lights dim inside, but you'll surely recognize the giant Eiffel tower near the door.\nOn a weekend night, it may be hard to get a seat, even at the bar; the restaurant is cozy, and...\n\n\nMore"]]], ["Roti Mediterranean Grill", [["World of Spices- One Awesome Meal", 5.0, "October 15, 2015", "M5633NCkimr", null, 4, 0, "The most amazing falafels ever and the most amazing spice filled meal. Not to mention the awesome green tea was thirst quenching! One of my new favorites."], ["Surprisingly good", 4.0, "July 18, 2015", "Xtudofan", "Tampa, Florida", 36, 37, "First time eating at this Mediterranean/middle eastern fast food concept in of all places, a subway station. Good prices, excellent food, helpful staff. Not much more to ask of a restaurant. Better than the typical Gyro or falafel place. Our family of four stuffed ourselves for under $40. I'd recommend to anyone for cheap, decent, good food. Will go back...\n\n\nMore"], ["Surprisingly yummy", 4.0, "July 8, 2015", "Valerie H", null, 10, 0, "I ate here for the first time upon arriving at Union Station from the airport. Good, fresh food, and excellent customer service. The lines moved quickly, and everyone was so nice. Would definitely eat here again."], ["Never a disappointment", 5.0, "July 2, 2015", "green4859", "green4859", 127, 39, "I've been to this restaurant numerous times being that I work in Union Station. The most recent visit was 2 days ago. For the first time, I tried the salmon rice plate and it was delicious! They grill to order the salmon so there's a wait but it was so worth it! I usually bring lunch to work but when...\n\n\nMore"], ["Good meal, efficient service", 4.0, "June 18, 2015", "WhitO5214", "Washington DC, District of Columbia", 1807, 1906, "I was very impressed with the efficiency and expediency of this place. The line was really long, but it moved quickly, and when we got to the ordering station, people were very friendly and patient, since this was my first time! The food was good, and I'd recommend this to anyone looking for good food at Union Station."], ["Great customer service", 4.0, "June 14, 2015", "KenJReads", "Buchanan, Georgia", 16, 4, "Was looking for something different, and someone suggested Greek. We were there after lunch rush, so some had to be prepared to order. Only took a few minutes, but staff were apologetic and provided complimentary drinks. The food was very tasty, and fresh. Only complaint was that we didn't expect some of the sides (couscous, for example) to be served...\n\n\nMore"], ["The Chipotle of Mediterranean food", 3.0, "June 10, 2015", "jaimeelsabio", "Baltimore, Maryland", 287, 100, "Met a friend there prior to taking a White house tour. It's quick, fresh, Mediterranean food. My wife had a platter and I had a chicken pita pocket. After ordering one gets to choose from a variety of items that goes into the order. It's good and quick when on a limited time schedule. It wouldn't be my favorite restaurant,...\n\n\nMore"], ["Yummy and healthy, too!", 5.0, "June 6, 2015", "EmmeMED", "Derry", 41, 21, "This is a fast food restaurant located in Union Station near the front. The portions are generous and there are many healthy choices, including vegetarian options. It's kind of an assembly line setup where you tell the counter worker which items you want First you order a wrap, bowl or salad and the choices include chicken, hummus, falafel, lots of...\n\n\nMore"], ["Good, inexpensive, fast", 4.0, "June 5, 2015", "Kia G", "Columbia, South Carolina", 40, 15, "Ate at roti for the first time this week, ended up eating there twice in the same week. Pretty good, rice plate and the wrap was excellent. The hummus was a little thicker than I'm used to, but still delicious."], ["Best Pita West of the Middle East", 4.0, "April 18, 2015", "DishesToDieFor", "Washington DC, District of Columbia", 46, 16, "Food here is generally good, healthy, and satisfying. I am amazed by the authenticity of the pita -- tastes just like it does in Jerusalem. Surprising for a mass market chain, but I am never disappointed. Try the sultan sandwich -- my favorite."], ["Tasty mediterranean in Union Station", 4.0, "October 25, 2014", "primerstar6", "Baltimore", 347, 182, "We enjoyed a nice, quick lunch at Roti in Union Station. We had a pita pocket and a wrap. This is a great place for a vegetarian; you can easily make a very hearty sandwich without meat here, though they did have plenty of meaty options as well. Ordering was uncomplicated, service was friendly and efficient. Prices were reasonable."], ["Great option for Union Station", 4.0, "October 17, 2014", "tonytsheng", null, 98, 31, "Great quick and healthy option for Union Station. Service always good and food is always on point. Also if you are with a group, lots of options right next to this, like Chioptle, a Salad Place, sushi and Starbucks."], ["good and fast option in Union Station", 4.0, "October 3, 2014", "jg325", "WashingtonDC", 489, 320, "Roti is a good option in Union Station, if Chipotle is not your thing. The basic concept is the same as Chipotle, but just with a Mediterranean flair.\nTrying to decide which of the two it is healthier is a pretty tough road. The food is of good quality and the line moves relatively fast. Ultimately, that's the most important...\n\n\nMore"], ["Great food at the Union Station", 5.0, "July 14, 2014", "wireless", "Wellington", 118, 155, "Not the ordinary food you would expect form a Railway Station but very good and tasty Mediterranean food delivered quickly and at a reasonable cost. Very friendly staff and pleasant surroundings and also takeaways available."]]], ["Sanphan Thai Cuisine", [["Well done neighborhood Thai food", 4.0, "August 29, 2015", "jxx9595", "Washington, DC", 488, 163, "This is our go-to local Thai eatery. The food is good and suitably priced. When you tell them about a desired spice level, they listen. Service is fine. Most Thai places around here have more-or-less the same menu, as does Sanphan. That's not a bad thing, as there are plenty of choices. We can walk here. If we want better...\n\n\nMore"], ["Thai beauty", 5.0, "June 6, 2015", "J R", null, 10, 3, "A delightful family run restaurant away from the crowds. Delicious classic Thai made with fresh ingredients and luscious sauces. Appreciated a flavorful salmon with a surprisingly good green curry sauce, extremely good pad thai , a pork and vegetable dish that was as spicy hot as advertised. A must for Thai lovers."], ["Pleasant and delicious surprise", 4.0, "May 19, 2015", "goddess0063", "Euless, Texas", 112, 41, "What a pleasant surprise this turned out to be. Our plane from DFW landed earlier that morning and we were wandering the neighborhood for a spot to eat. This place isn't much to look at outside but we love Thai so in we went. It's a clean, attractive little place with pleasant service. We ordered off the lunch menu so...\n\n\nMore"], ["Nice family restaurant", 4.0, "May 1, 2015", "John H", "Oklahoma City, Oklahoma", 26, 19, "This was a nice family-owned Thai restaurant within walking distance of the Capitol complex. They had a lunch menu with some nice selections as well as a more extravagant dinner menu. I ordered chicken pad thai and it was a very large serving that was very good. It is relaxed inside and they do offer mixed drinks and beer if...\n\n\nMore"], ["Arguably one of the best Thai restaurants on Capitol Hill!", 4.0, "April 20, 2015", "Paul P", "Laurel, Maryland", 15, 13, "Just a block away from the Eastern Market metro exit, this restaurant is almost an institution on the Hill. The menu has most of the favorite dishes you would find at most Thai restaurants with the exception of that wonderful soft shell crab. Entrees are all under $25 dollars. They have a sizeable appetizer menu and the portions are large....\n\n\nMore"], ["68 Choices and then some", 4.0, "September 2, 2014", "phloxMaryland", null, 67, 40, "Push past the lines at other nearby spots to find no-line/no-waiting (at least when we visited) and a vast array of choices. I went with my old favorites Som Tum Green Papaya salad and was not disappointed - fresh, crisp papaya mixed with carrot, cabbage, red bell pepper, green bean snaps and a tasty dressing - the perfect dish for...\n\n\nMore"], ["Good Food but Bring Your Own Friends", 4.0, "April 13, 2014", "martimbe", "Alexandria, Virginia", 57, 24, "Do go here for the food, but don't expect to make friends with anyone on staff, who all seem unhappy.\nI think this place was renovated recently, because it doesn't look at all like the photos on this webpage - it's high-end contemporary, with hardwood floors, stone tile on the walls, spare decor, airy, quite a pleasant atmosphere, with plenty...\n\n\nMore"], ["Good deal for lunch but not scentsational", 3.0, "December 31, 2013", "KentuckianinDC", "Arlington, Virginia, USA", 6, 1, "If you're in the neighborhood (Eastern Market) and want a good lunch special, try Thai Violet Chicken (with eggplant). Each lunch entree comes with a straight-forward but not special spring roll. Be aware, however, that this restaurant has the aroma of air freshener or cleaning products wafting up from the lower level on occasion, which can interfere with enjoyment of...\n\n\nMore"], ["Great Thai", 4.0, "October 29, 2013", "David E", "Washington DC, District of Columbia", 4, 1, "Sanphan hits the spot: excellent Thai food at reasonable prices. The service is polite and prompt as well. Like most Thai restaurants, they're vegetarian friendly.\nSanphan has a less charming atmosphere than the other Thai restaurant on 8th street -- I find the tv over the bar distracting -- but their dishes might be ever so slightly better. Everything is...\n\n\nMore"], ["Yummy", 4.0, "September 16, 2013", "D2JAC", null, 99, 36, "This is not fancy highend dining, it is everyday affordable. The menu has lots of choices. We enjoyed our meals."], ["Thai restaurant", 3.0, "May 11, 2013", "Holamobile", "Washington DC, District of Columbia", 81, 12, "Good Thai food. Average. Have to ask in order to get it spicy. But light taste and not oily. Service was ok. Brought out spicy sauces."], ["Unfriendly server and OK food", 3.0, "March 21, 2013", "LoveLifeAlways7", "Lansdowne, Virginia", 60, 17, "The service needs a lot if work, our waitress was not friendly and she barely said 10 words to us. She seemed like she didn't really want to be there, she was absolutely awful. Then food as just ehh. Got panaang curry since I've had it before and loved it but it wasnt that good here. Bland and the serving...\n\n\nMore"], ["Great Thai restaurant in D.C.", 5.0, "January 31, 2013", "LDIdeals", null, 39, 15, "Happened upon a great Thai restaurant while in D.C. for the Inauguration recently. Restaurant is in the SE part of town on Pennsylvania Ave. and has a great menu with lots to choose from. Thai food is one of my favorite and this place did not disappoint... great ambience as well! If I'm back in D.C. again I would eat...\n\n\nMore"]]], ["The Old Siam Restaurant", [["Enjoyed our meals", 4.0, "September 28, 2015", "MeryMeCo", "Springfield", 196, 80, "Three of us are sightseeing in DC this week. This restaurant was close to the Metro station and we were hungry. I had the seafood pad Thai and it was good. I expected a little heat but found none. The sauce was good. We ordered spring rolls and they were great. We also had chicken fried rice (my husband's standard...\n\n\nMore"], ["A Neighborhood Joint with an Isan Upgrade", 4.0, "August 10, 2015", "April L", "Washington DC, District of Columbia", 103, 39, "This restaurant has recently changed hands, names, and menus. The owners have carefully maintained locals' favorite Thai dishes and sushi while stepping things up in decor and offerings. The real draw here is the Isan (northeastern) Thai menu. Wash your hands and dig into some sticky rice alongside spicy, flavorful accompaniments. Vegans and vegetarians will find plenty of delicious choices."], ["Best Green Thai Curry I've Had", 5.0, "March 17, 2015", "StephanieinWimbledon", "Philadelphia, Pennsylvania", 10, 6, "The staff were very friendly and polite and the menu very extensive for a typical Thai restaurant. My friend and I were really surprised about the excellent quality of the food when it arrived. I had a That Green Curry for my dinner that I can say was the best I ever tasted and there was a large portion of...\n\n\nMore"], ["Try again", 3.0, "November 12, 2014", "tannec", "Maple City, Michigan", 65, 22, "The Red Curry was good; the Pad Thai with chicken wasn't the best (dried out chicken, not much flavor). Service was fast (take out) and friendly. A convenient neighborhood choice for Asian menu selections, but not the best we've had. I'd give it another try, skipping the Pad Thai and going for something else."], ["Value menu till 7 PM", 3.0, "September 25, 2014", "serene4848", "Heidelberg, Germany", 118, 103, "We stopped by The Old Siam on a Wednesday early evening after spotting a sign touting 1/2 price sushi until 7 PM. We decided to sit outside and enjoyed a Pinot Grigio for $5.00 a glass while we checked out their special \"happy hour\" menu.\nThe menu is smaller than their regular menu and offers sushi/sashimi and a few other...\n\n\nMore"], ["Wonderful Pad Cha Tilapia", 4.0, "September 24, 2014", "lfabian47", "Madison, Wisconsin", 103, 30, "Easy to get to. Just a short walk from the Eastern Market Metro stop. We shared the DC roll as an appetizer - was just OK. But then I had the Pad Cha Tilapia and it was to die for. About 9 filets lightly breaded and fried crispy, drizzled with a spicy/sweet sauce, and sprinkled generously with basil leaves. There...\n\n\nMore"], ["A neighborhood delight", 5.0, "August 22, 2014", "RetiredinDC", "Washington, DC", 16, 6, "If you are looking for consistently good Thai food in the Capitol Hill area of DC, this is the place to to. Among the best: chive dumplings, larb gai, all the noodle and curry dishes. The restaurant also has a good sushi bar."], ["Just average food - interesting neighborhood", 3.0, "August 15, 2014", "TheHappyJourney", "Miami Beach, Florida", 36, 21, "Well, this was just average Thai food. They have the usual dishes, but nothing that really stand out. The service was not bad, but not great. Worth going back? There are several other Thai restaurants in the area. It might be worth trying once, but then try the others. It is an trendy neighborhood on the edge with Eastern Market....\n\n\nMore"], ["A nice surprise", 5.0, "April 4, 2014", "David E", "Raleigh, North Carolina", 28, 22, "Our family of four stopped in on a whim when we were heading back to our rented town home one night after a long day of tourist stuff. The service was friendly, relatively fast, and the food was excellent! We had Pad Thai, sushi, steamed dumplings, and the \"alternative vegetables in house brown sauce.\" We were all stuffed and didn't...\n\n\nMore"], ["Good for Lunch", 3.0, "February 23, 2014", "Negril_Rob", "Emerald Isle, North Carolina", 35, 13, "Just next to the Eastern Market Metro is a consistently good Thai restaurant.\nIf you are in the 8th St SE area and want to try a new place for lunch you won't be disappointed.\nService is good, food is good, atmosphere is ok.\nMenu is extensive.\nOutdoor seating wasn't available on a cold rainy day in December, but they...\n\n\nMore"], ["Great Thai in Eastern Market", 5.0, "October 29, 2013", "David E", "Washington DC, District of Columbia", 4, 1, "I go to Old Siam all the time for great Thai food. The atmosphere is nice, and they have plenty of outdoor seating. Service is always very quick and the food is very good. There are plenty of vegetarian options and the prices are also quite reasonable.\nThe other Thai restaurant down the street has excellent dishes, but Old Siam...\n\n\nMore"], ["Very good", 4.0, "September 27, 2013", "Addeyy A", null, 34, 9, "Fresh,very light,very good staff,love it!!! I will definitely go back,since I like it very spicy!\nThe ambien was great,the food was delicately cooked,the area was close to d Capitol and my friends enjoy it."], ["Consistent Restaurant", 3.0, "September 14, 2013", "SeriousBiz", "Houston", 80, 35, "I've eaten at this restaurant during three visits to DC and the food is always consistent. The waitress was attentive and portions are ample. Pad Thai is always a good choice. Skip the shrimp rolls on the appetizer menu. They are nothing special. This place offers outdoor and indoor seating although the back dining room is rather noisy."], ["Good Thai Food", 4.0, "August 26, 2013", "stmandula", "St. Petersburg, Florida", 113, 38, "Stopped in for a quick dinner while visiting my girlfriend in DC. The menu had a nice selection of Thai classics - stir fry, noodles, rice, curry, etc. Both dishes ordered were flavorful and a great value."], ["Poor Service by Hostess", 1.0, "July 4, 2013", "BJ J", "Washington DC", 2, 0, "This is one of my all-time favorite Asian cuisine restaurants. Have been going there since it opened. Lunch, dinner, weekend. Even waited for the re-open while they went through renovation adding the sushi section. I have taken friends from out of town there. Birthdays. Office groups I WON'T EVER AGAIN! I'm standing there talking with the hostess and pointing to...\n\n\nMore"], ["Good Thai place in a great neighborhood", 4.0, "June 10, 2013", "revkate", "Decatur, Georgia", 50, 14, "Very kind wait staff and very accomodating with the diverse dietary needs within our party. Food was good and there were plenty of options for all of us. It was not remarkable Thai food, but was more than passable."], ["Authentic Thia and Sushi", 4.0, "May 28, 2013", "rockandrollD", "High Wycombe, United Kingdom", 26, 18, "We ate in the Old Siam Restaurant twice in the 3 days we were in DC. The food is superb and very tasty. The Thia dishes were as good as we have had in Thialand and the sushi was fresh and delicious. The service was very good and the waiting staff were helpful and pleasant."], ["Authentic and delicious", 4.0, "February 24, 2013", "Col_Mustard1", "Indianapolis, Indiana", 86, 44, "Dinner here is a pleasure in the tastes and textures of Thai cuisine. Whether it is a curry, a stir fry or a noodle dish (our party had one of each) you can be assured it will be brought to the table hot and nicely presented. The vegetables are fresh and crisp, the sauces seasoned to your preference in terms...\n\n\nMore"], ["Excellent sushi!!!", 5.0, "December 21, 2012", "threelittlefish856", "Florida", 78, 113, "In DC, I had been staying at the Capitol Hill Hotel and was a bit disappointed that there didn’t appear to be any sushi restaurants within a short walking distance of me. I decided to try out Old Siam, even though it was touted as a Thai restaurant. I was happy to see that they did add a large sushi...\n\n\nMore"], ["Thai food experience", 5.0, "December 3, 2012", "Torri N", "Washington DC, District of Columbia", 61, 35, "I must admit that I am not a huge fan of Thai, HOWEVER, I have tried several Thai restaraunts to compare and try new things. The first time I went to The Old Siam, I was underwhelmed with the idea that my friends wanted Thai (again), I tried the Bangkok Noodles and fell in love. I absolutely love this dish...\n\n\nMore"], ["Tasty food!", 5.0, "November 29, 2012", "Ewalamb", "Tennessee", 105, 58, "Great Thai selection on the menu. The appetizer spring rolls were so good we ordered them twice. The food is so fresh and flavorful and nicely presented. There are happy hour prices for drinks before 6pm. The atmosphere is very welcoming and the staff was very friendly and courteous. The menu is reasonably priced and the portions are just right....\n\n\nMore"], ["Thai Restaurant off the beaten path....minutes from the Mall", 5.0, "November 24, 2011", "mmbb63", "Lilburn, GA", 24, 7, "This is a terrific neighborhood restaurant with amazing food. We go every time we are in DC regardless of where we are staying. It's three Metro stops from the Mall straight ahead as you come up the escalator at the Eastern Market station."], ["Nothing Special", 3.0, "November 7, 2011", "craigkl", "Fresno, California", 31, 16, "We had the good fortune to be able to use a friend's condo in the Eastern Market area of SE Washington and ate at several restaurants in the area. Since the reviews for Old Siam seemed a little thin, I thought I would contribute an opinion.\nThere is quite a lot on the menu, and we only tried three dishes,...\n\n\nMore"], ["Delicious Thai food", 5.0, "May 15, 2010", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Delicious Thai food"], ["Food is good, and consistant with Thai food I have had in Bangkok. Love the outdoor seating and services was fast too!", 4.0, "February 4, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Food is good, and consistant with Thai food I have had in Bangkok. Love the outdoor seating and services was fast too!"], ["Friendly wait staff...", 3.0, "July 28, 2008", "RabidMapache", "Lynchburg, Virginia", 94, 13, "Friendly wait staff, long wait, cool location and ambiance."], ["Four of us had great meals, two vegetarian, one chicken and one pork. The fact that we had to turn the page to see all...", 4.0, "April 14, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Four of us had great meals, two vegetarian, one chicken and one pork. The fact that we had to turn the page to see all the veggie selections on the menu automatically impressed us. The ambiance is lovely, the service is good. On a Sunday lunchtime, we were in and out in 1.5 hours with no reservations. And under $100...\n\n\nMore"], ["I like it!", 5.0, "March 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I like it!"], ["Get the Old Siam noodle...", 3.0, "November 24, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Get the Old Siam noodle soup. It's fantastic!"], ["Nice Thai-Food, very good service.", 3.0, "November 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice Thai-Food, very good service."]]], ["UNO Chicago Grill", [["Great Location, but go elsewhere for pizza", 3.0, "September 24, 2015", "Ginger0908", "Elkin, North Carolina", 61, 40, "After a day of sightseeing and then wandering around Union Station, we were hungry and tired. The reviews I read of Uno were not great, but we finally chose it over others in the station because of the variety of the menu offerings and the location (overlooking the main part of the station). My husband ordered fish and chips and...\n\n\nMore"], ["Uno pizza place", 5.0, "September 3, 2015", "Shannon9602", "Shannon9602", 17, 0, "Good restaraunt with many memories during my college years. This was a go to pizza place among my deaf peers."], ["Nice views of station", 4.0, "August 1, 2015", "john l", "fort dodge", 137, 37, "Travel to DC to get Chicago pizza? We were in union station and we were hungry, Uno fit the bill. Pizza was excellent, however service was a bit slow. Can eat inside or \"outside\", there are some nice views of the train station if you eat inside by the railing."], ["Food Great, Service Improving!", 5.0, "July 23, 2015", "Race2Win", "Cary, North Carolina", 68, 29, "When I have the opportunity to eat at Union Station, I almost always choose here. The food has always been good even when the service was not. But this last time, I was encouraged because our waitress, Rashidaha, was amazing! I watched her hold down the fort on an entire balcony of people giving it everything she had. She took...\n\n\nMore"], ["A good place to catch a bite at Union Station", 4.0, "July 13, 2015", "Francisco O", "Iowa City, Iowa", 116, 44, "The food was delicious. I highly recommend their Nuovo Deep Dish Italiano Pizza. That was an unexpected treat of flavor in every bite and is a small enough pizza for one or two people. If you are not in the mood for pizza, their steaks cooked at medium are delicious as well.\nThe atmosphere is okay overall. If you like...\n\n\nMore"], ["Nothing surprising...", 3.0, "July 2, 2015", "green4859", "green4859", 127, 39, "Uno is not a restaurant I would usually go to or first come to mind for casual dining. This particular Uno is in Union Station and since I work here, I have it as an option when I don't bring lunch. On my last visit, I find it to be just ok, just as with my other visits (this is...\n\n\nMore"], ["Pricey", 3.0, "May 3, 2015", "WIBadger10", null, 135, 31, "The food is decent but way over priced in my opinion. We order an appetizer, a slice of pizza and a soda, it was over $30. Very good service from our waiter."], ["Great food, terrible service", 3.0, "April 19, 2015", "Brandon B", "Lanesville, Indiana", 7, 2, "Had to wait a while to be seated. Once seated had to wait at least 10 minutes for a waitress. Although we were sitting at a table across the aisle from the bar (maybe 5 feet from the bar), when I ordered the appetizer special I was told we had to be \"in the bar section\" to receive that. As...\n\n\nMore"], ["Late Evening Meal Okay, Service Okay", 3.0, "April 11, 2015", "CoachSr", "Atlanta, Georgia", 84, 51, "Ten of us stopped by last night after the late city bus tour. Got in about 11 pm, asked the greeter if they had room for us, she kind of looked sideways with a little grimace, and walked off to check something. I guess she did not know if she was allowed to seat 10 at 11pm or not (open...\n\n\nMore"], ["Birthday dinner", 5.0, "March 27, 2015", "TravlerNM", "Angel Fire, New Mexico", 34, 16, "In town touring from New Mexico on my birthday. Had dinner here. The mushroom Flatbread was so yummy! Great service as well."], ["Mad at March Madness", 1.0, "March 24, 2015", "Bobby B", "DC", 3, 1, "I was here to watch March Madness games and everything about this place sucked. I saw people complain and leave because TVs were too small, Management could not change channels when games ended, food was horrible."], ["Great spot to grab a bite", 4.0, "March 6, 2015", "P E", "Washington DC, District of Columbia", 69, 32, "Good menu with lots of choices. Easy access to trains/buses etc but not much room for luggage FYI. Fast friendly service without a huge bill and great for people watching within the station itself."], ["Poor Service and Poor food", 2.0, "February 28, 2015", "Readrun", "Long Island, New York", 137, 39, "My friends and I were looking for a casual place for lunch while in Union Station and decided to try UNO. The flatbreads on the menu sounded very good and looked appealing at the table next to us, so we each ordered one. I ordered a half flatbread with a salad, although the waitress brought me out a full claiming...\n\n\nMore"], ["Yummy!", 4.0, "December 31, 2014", "ProfessorOT", "Hamilton, Canada", 235, 148, "This restaurant is located in Union Station and has a very comprehensive menu. We had a great server, Antonio, who although he was very busy was calm and very attentive. We ordered chicken wings, fries, and the shrimp scampi. The portions were large and delicious. A great spot when you are travelling via train or metro."], ["great chicken parm and great service", 4.0, "December 30, 2014", "mad155", "DC", 278, 75, "Went here on a Monday night. Seated right away. You can sit out in the open area or inside. If you prefer quietness, sit inside and if you can request the seat along the railing. can watch the people below that are either just arriving or leaving DC. Service was great and very friendly. Salad was good and the chicken...\n\n\nMore"], ["Great Pizza!!!", 5.0, "December 10, 2014", "Dinah W", null, 153, 42, "The Pizza was outstanding as was the wine and salad. Our server was both knowledgeable and helpful!!"], ["Menu great; food not so good", 3.0, "November 21, 2014", "jxx9595", "Washington, DC", 488, 163, "The menu offers a ton of choices, but the food that we ordered left much to be desired. Two different chicken sandwiches sounded great, but neither was notably tasty. Fries were okay. Service was a bit below average, but it was a very busy Friday lunch. Those taking trains may have a better experience at off-peak hours. It only because...\n\n\nMore"], ["Gluten free offerings", 4.0, "November 5, 2014", "23wearytraveler23", "Chicago, Illinois", 77, 26, "Went to Uno's in Union Station after work with some colleagues because they had some gluten free offerings and due to severe celiac disease I can't have any contact with gluten. I was a little worried as their gluten free offerings are only one page of their menu. I was pleasantly surprised as the waiter listened attentively as I explained...\n\n\nMore"], ["Soup and flatbread was good", 4.0, "October 26, 2014", "isletripper", "New York City, New York", 202, 54, "The Italian style flat bread was really good. Just the right amount of sauce, ricotta, and sausage. The bread was crisp. The clam chowder was surprisingly delicious. Amazing meal while on the run."], ["Unos - in a great location", 4.0, "October 21, 2014", "David10536", "Katonah, New York", 93, 15, "We've been to many Unos in many locations and the food is the same in all of them, but this one wins because of the location. It is on the second floor of Union Station and get a great view of the hustle and bustle of the entire building while you leisurely eat your meal. Best deep dish Chicago-style pizza...\n\n\nMore"], ["Everything just takes so long ...", 3.0, "October 15, 2014", "Seth J", "Seven Corners, Virginia", 480, 162, "Popped up here for lunch one time, finally finding where the entrance was located, and was quickly greeted and seated by a hostess. Server quickly acknowledged my presence and took my drink order. And this is where \"quickness\" stopped dead in its tracks. Took about 10 minutes for a drink to arrive, then an ungodly amount of time for a...\n\n\nMore"], ["good food, strange layout", 4.0, "October 14, 2014", "hotelSNOBArkansas", "ARKANSAS", 68, 26, "The food was good and they were ready and attentive to our large group of 63! The layout is strange and it's a bit difficult to navigate, but other than that...really good! Gluten-free pizza and salad was very good."], ["Slow service, room tempature food", 3.0, "October 7, 2014", "13VeeP", "Washington DC, District of Columbia", 25, 19, "The title here says it all. The restaurant is super convenient to where I work & live but I have walked out of this location more than once because the service is so slow. Waiting so long is bad enough... but to wait & then end up with 50bucks worth of room temperature food is just ridiculous"], ["Beautiful Location, Awful Food and Service", 1.0, "August 20, 2014", "rchs20", "West Chester, PA", 76, 49, "As most have said, the service was really, really slow! First off, Union Station is awesome! What a beautiful and cool space to eat. We have been to other Uno locations (including the original in Chicago) and were headed to a ballgame, so we decided to give it a try. This one was way below their standard. We were in...\n\n\nMore"], ["Food", 4.0, "August 10, 2014", "Redelf", null, 22, 5, "Good food more than pizza a good meal for a good price waitress was nice but slow need more waitress ice cold beer and 2.50 deserts everyone was happy"], ["Good Food", 4.0, "August 6, 2014", "RoamingCT", "Norwalk, CT", 161, 87, "Some friends and I ate here on a trip to DC in early May, 2014. The pizza, pasta, and salads were delicious. Recommended."], ["Great pizza, view of the concourse from a rail table!", 4.0, "July 22, 2014", "Viaggiante", "Manassas, VA", 117, 51, "Met a friend here after work and we try out different places at Union Station. Although a chain, I really like their pizza. While other choices on the menu, we went with a regular deep dish with 9 grain crust, pepperoni, olives, and roasted peppers. Delicious! Had a couple ice teas and a salad for me, fried zucchini appetizer for...\n\n\nMore"], ["poor service", 3.0, "July 16, 2014", "Howard T", "south florida", 121, 22, "bar was full, we sat on end of bar where servers pile up the glasses and we had to keep moving them out of our way, 2 bar keeps could not keep up with cleaning them, left after 1 drink. would not return"], ["Great place for a really good pizza", 5.0, "July 9, 2014", "Justo05", "Bogota, Colombia", 78, 26, "Talk about UNO pizza is Talk about Chicago Style deep dish pizza.\nI was in a business trip in DC arrive really late at night. But this place save me with it's really good pizza, great service and good price at 11pm.\nDeep dish pizza is really good, it Taste is amazing and the quality of the ingredients the best....\n\n\nMore"], ["Excellent Pizza, But Only So-So Service", 4.0, "July 8, 2014", "Race2Win", "Cary, North Carolina", 68, 29, "In this world where Domino's, Papa John's and Pizza Hut tend to be the regular pizza providers, I had almost forgotten what real pizza tastes like, but thankfully I was reminded recently at Pizzeria UNO in Union Station. The deep dish pizza I ordered was nice and crispy, not greasy, and the meat and veggie toppings were perfect! I ordered...\n\n\nMore"], ["Not bad, but not great either", 3.0, "June 17, 2014", "GloriousLakeSuperior", "Northwestern Ontario", 165, 228, "We ate at the Union Station, Washington DC location on our last night in this amazing city and we were disappointed by the deep dish pizza which is supposed to be their specialty! The crust was undercooked and the things were sparse. The salads were good, the drinks were good, but forget the pizza and try something else!"], ["Great Deep Dish Pizza", 5.0, "April 26, 2014", "Casey P", null, 50, 39, "On the second floor in Union Station we discovered Uno. We used to have one in Kansas City but I closed. One Pizza is enough for two people"], ["Desperately in need of overhaul", 1.0, "April 21, 2014", "OlivW", "Washington DC, District of Columbia", 7, 3, "I have dined at Uno's at Union Station countless times in my life, and over the years this establishment has deeply declined in quality and cleanliness. This last visit literally made my sick! I had food poisoning and was sick to my stomach for 3 days, unable to keep anything down. Hurried and preoccupied servers, sticky tables, stale water to...\n\n\nMore"], ["Yum", 5.0, "April 18, 2014", "Marshall R", "Janesville, Wisconsin, United States", 43, 15, "I brought a student group here for supper and the food was delicious. The staff was friendly and accommodating. I appreciated the variety of the food and their willingness to serve something else to someone who couldn't have pizza."], ["Lunch at Union Station, Washington DC", 3.0, "April 6, 2014", "Barbara C", "Plymouth, Massachusetts", 110, 41, "The service was good, our deep dish pizza delicious, we had a friendly server who apologized for being unable to serve my coffee with the meal (she deducted the cost from our bill). The women rest room was not very clean and one could not close one of the stall doors. It was a convenient place to have lunch in...\n\n\nMore"], ["Think restaurant food at the Dulles Airport", 2.0, "October 20, 2013", "PatrickBear", "Los Angeles, California", 56, 28, "This place is convenient and can always seat you. Not sure you will want it. The food is one step down from airport food. Lots of it, heavy, tasteless. The beer is ok, but only because they just serve it, not prepare it. For convenience it can't be beat...but next time I think I will just buy a sandwich from...\n\n\nMore"], ["Great Happy Hour!!!", 5.0, "October 16, 2013", "James C", "Arlington, Virginia", 3, 2, "Great place for a Happy Hour near the train station. I had to meet a friend that had to take a train back to New York after a short work visit. Great happy hour specials and good customer service. Plus Uno's Pizza is always great."], ["Enjoyable Pizza", 3.0, "October 6, 2013", "Mindful_Travels", "Guelph, Canada", 325, 145, "Uno still has a great deep dish pizza but the rest of the menu has really has turned commercial garbage. Other then a pizza we ordered the Buffalo Calamari and the special app call Cheese Stix. The calamari was cooked from frozen and rubbery. The Cheese Stix was nothing but a greasy bread with almost no cheese cut into 4...\n\n\nMore"], ["Accomodating", 4.0, "October 6, 2013", "JAMoya", "Albuquerque, New Mexico", 22, 8, "This is the second year they accommodate us for a group of 60+. The food was hot, and they wee prepared for us. We didn't have to wait to be seated or to eat. Food was tasty."], ["Fun at union station", 4.0, "August 27, 2013", "Betsy N", "Norman, Oklahoma", 19, 7, "My husband loves pizza UNO , & we don't have any at home. Good salads for me ( not a huge pizza fan)"], ["Would have been a 5 but....", 4.0, "August 26, 2013", "merlymoo", "lincs, England", 166, 81, "I begrudge a tip automatically being added to the bill, especially when it's 18%.\nWe called in here after a long days trip to Gettysberg. Our waitress was Cindy, she was chatty and helpful. the food was delicious - vegetable soup followed by steak and shrimp for me, a burger for him. I really couldn't fault the food or the...\n\n\nMore"], ["Nice place, but that's all.", 3.0, "July 29, 2013", "Anthony V", "CapelleaandenIjssel", 136, 67, "As we were looking to eat a pizza near our hotel, we went on our way to a small really nice Italian family restaurant, just behind Union Station, if you turn out on the left. It's called Tuscana Cafe, 2nd str NE. their food looked really great but they did not serve a pizza in the weekend. a lot of...\n\n\nMore"], ["Wish we would have tried the sushi place", 3.0, "July 29, 2013", "courtneymccollum", "Indiana", 284, 96, "This place had greasy floors and dirty bathrooms. That grosses me out. In their defense though, it is a highly traveled restaurant. The did accommodate our bill when we complained about an appetizer coming out after our meal, but in fairness we did order it a little late....however, we also saw it being brought to our table and when they...\n\n\nMore"], ["Pizza", 3.0, "July 23, 2013", "GrandmaplusGrandpa", "Easton, Pennsylvania", 16, 5, "We ordered a half pizza. There were 4 small pieces of what looked and tasted like crackers with a little sauce and cheese. I guess a half pizza in Washington is much smaller that a half pizza at home."], ["Amazing service in an unlikely location", 5.0, "July 17, 2013", "UriahRo", null, 1, 0, "When you go to union station, you don't expect a memorable experience like the one that my husband and I had. When our waiter Kevin found out through manager Chris that we were on our honeymoon, not only did they shower us with congratulations, they also provided us with gifts and dessert!! The food was great (we had the numerous...\n\n\nMore"], ["Uno in Union", 4.0, "July 2, 2013", "Pete J", "Thrapston, United Kingdom", 28, 21, "Very nice thin crust pizza, with a good selection of draft American beer. Busy place but service was tip top. Would return,"], ["GF pizza!", 4.0, "June 10, 2013", "ruthpdx", "Lake Oswego, Oregon", 47, 25, "Upstairs in Union Station. GF menu including pizza. Thin, rice crust. Very good. Reasonably priced. Good value for money. Pizza large enough for two people."], ["Great food and great service", 5.0, "June 1, 2013", "scoobysmom2003", "Winter Springs, Florida", 88, 29, "We stopped here after a long day on a bus tour throughout DC. We were seated immediately and our waiter Amir was very attentive and friendly. We had the Chicago pizza and it was the best! Thank you Amir for taking great care of us."], ["Nice lunch!", 3.0, "May 23, 2013", "ms90", "maryland", 141, 51, "Stopped here for lunch. I had a pasta dish with lobster and shrimp. It was actually pretty tasty (I was hungry, so that helped) and the portion was just enough. The price was reasonable. The server was a very pleasant and efficient young lady. I enjoyed people watching and the great view of the Union Station. I'll likely visit this...\n\n\nMore"], ["No Thanks", 2.0, "May 13, 2013", "cheecher", "Baden, Pennsylvania", 24, 38, "I make it a habit of never reviewing chain places, because by-and-large people know what they are going to get when they choose to go there. But this one bears a mention. It is nice to get a table overlooking the station, but the service was horrible. drink orders messed up, eye rolls from servers when they're told about it,...\n\n\nMore"], ["Best Cobb salad!", 5.0, "May 6, 2013", "Voice1234", "Wisconsin", 150, 71, "Enjoy your meal whike watching the hustle and bustle of Union Station. Quick service too! A bit pricey, but woth it!"], ["Good Pizza and View of Union Station", 4.0, "April 16, 2013", "Angela F", "Alton, Illinois", 24, 15, "Pizzeria Uno is one of the nice sit down restaurants in Union Station. If you do not want to eat at the food court, you should eat here! We had great thin crust pizza and sat at the tables on the outside part of the restaurant so that we could marvel at the inside of Union Station! It was our...\n\n\nMore"], ["Food was excellent but sub-par service", 3.0, "April 15, 2013", "cleopatramagnolia", "New York NY", 24, 12, "Prices were quite reasonable considering you're in Union Station. Chicken wing appetizers were excellent, as were the hamburger sliders, cheesburger, and one pasta dish. Wait staff don't seem to be happy to see you; service is a little on the slow side. It is huge inside, and so also very noisy. I think the tables by the entrance near the...\n\n\nMore"], ["Perfect Lunch Place", 5.0, "April 9, 2013", "FunkReporter", "Clarksburg, MD", 36, 16, "We came to Union Station during the busy lunch hour, but were seated after only a five minute wait. (The restaurants downstairs in the station were so cold that I knew we'd be miserable, and the food court in the basement was overcrowded.) Pizzeria Uno has a weird layout, so it is much bigger than it appears. We were taken...\n\n\nMore"], ["More Than A Pizza Joint", 4.0, "March 16, 2013", "Hrpamw", "Decatur, Alabama", 163, 71, "We visited Pizzeria Uno at Union Station but we were not in the mood for pizza. We looked at the posted menu and decided we would give it a try. We were not disappointed. We came in from the upper level and ate outside of the main restaurant (the side with the shops) and chose a table next to the...\n\n\nMore"], ["Chicago Style Pizza in D.C.", 4.0, "January 23, 2013", "Vetskidog", "Murfreesboro, Tennessee", 146, 46, "Good restaurant in Union Station. It is bigger than it seems and can seat many and larger size parties. It was a little expensive, but the pizza was good."], ["Good good in a cool atmosphere.", 4.0, "October 21, 2012", "Lynn S", "Taylors, South Carolina, United States", 27, 20, "We loved the cool atmosphere in the upper level of Union Station. Our server was excellent, service was timely and food was very good. I do think the place could use a really good cleaning. The tile in the dining rooms and the bathrooms need a good scrubbing. Overall we were happy with our experience."], ["UNO's", 4.0, "August 31, 2012", "hcpw50910", "Mohegan Lake, New York", 4, 1, "I love UNO! I never get tired of going there and enjoying a deep dish pizza. I have been to different UNOs from different states, and the food is consistent and the service as well."], ["Good Food", 3.0, "August 11, 2012", "EleniMaria", "Reston, VA", 5, 2, "I ordered the chicken and rice, my son ordered the kids pizza. The food was good. The restaurant overlooks entrance way Union station on the second level. It had a nice atmosphere."], ["Nice find in union station.", 4.0, "July 31, 2012", "Inkevable", null, 50, 21, "This was a great experience. The food was good I had a small rattlesnake pasta it was a perfect portion. My daughter and wife had steaks cooked exactly the way it was requested. It was a good deal for DC fair."], ["OK place...better for people watching", 3.0, "July 15, 2012", "Peter B", "Oak Park, Illinois", 24, 0, "The food is fair, but the location in Union Station allows you to eat OK food and watch people ..."], ["Good service", 4.0, "July 10, 2012", "LawRockaway", "New York City, New York", 157, 40, "RIght in Union Square. Pleasant waitress and typical Pizza Uno menu... Just what I wanted."], ["Will not be back", 1.0, "July 4, 2012", "familyfour65", "NM", 104, 100, "We specifically went here because we like Uno and were ready to eat dinner. Although nice, our server was very, very slow.\nA few minutes into our meal, a woman sitting close by had some issue. An employee (manager?) was kneeling by her table and she kept asking \"how could this happen\"? He kept telling her he didn't know and...\n\n\nMore"], ["Good pizza!", 4.0, "June 19, 2012", "bimbumbam2014", "Italy", 79, 119, "Was a good pizza. I came here for the review and i think that is very good. I am from Italy so i know enought about pizza."], ["Pizzeria UNO", 4.0, "June 15, 2012", "mhawrysko", "New Lenox, Illinois", 93, 43, "I've been to the Pizzeria UNO in downtown Chicago often.\nWhile this particular restaurant is inside a mall, the atmosphere is still nice. My deep dish pizza was rather good. Not sure if it was psychology or not, but I didn't think it quite tasted the same as back home. Didn't matter -- still a great pizza, with great service."], ["Yum!", 4.0, "June 5, 2012", "singdixieagain", null, 1, 0, "I arrived with a party of six. We all had something different from pasta, salad, sliders, and chicken. Everything was great. The service was a little slow but they asked us up front if we minded having a server in training and we said we didn't. She was polite and we enjoyed her. Excellent well priced choice at Union Station."], ["Uno in Union Station, Washington DC", 5.0, "May 29, 2012", "Mocha2008", "Denver, Colorado", 116, 86, "It is inside Union Station so you are protected from the elements. They have a terrace facing the beautiful U Station promenade. They have gluten free offerings and I love their mango iced tea. Prices have gone up a little bit but they have many varieties of pizza and salads. A very reliable place to take your friends and family....\n\n\nMore"], ["The best \"sit down\" resturant so far in Washington!!!", 5.0, "May 13, 2012", "Corey B", "Washingston DC", 1, 0, "It is hard to find a good \"sit-down\" resturant around the 1600 New York Ave area. Well we found one!! The food quality was fantasitic. I had the 22 oz steak with Mashed potatos and Steamed Brocolli, my wife had the Brocoli and chicken Alfredo and we both agreed that this was the best place so far. They treated our...\n\n\nMore"], ["Quality at reasonable prices", 4.0, "April 17, 2012", "Ken1945", "Syosset, NY", 32, 12, "very good salads and food - very reasonable. good service"], ["Union Station Uno is a disaster!", 2.0, "March 22, 2012", "hobedaro", "Holland, Pennsylvania", 37, 10, "Don't go if you are in a hurry. Our server was slow, unfriendly, and behaved as if she didn't care in the least about her customers. The food was okay but the service really ruined the whole experience."], ["Yummy Pizza", 4.0, "February 25, 2012", "martinamathis", "Austin, Texas", 59, 27, "I was a little hesitant since this is a chain restaurant, but I was pleasantly surprised. The pizza was delicious and they have great Sangria."], ["De-lish!", 5.0, "February 13, 2012", "havecurveswilltravel", "Toronto, Canada", 25, 11, "Very quick service. Food was amazing! Great atmosphere inside Union Station. No complaints!"], ["Worth the wait", 4.0, "January 10, 2012", "Dukesnyder", "Ligonier PA", 142, 44, "Every time I eat here there is a line, but for the Chicago style pizza it's worth the wait. The key here is not to expect too much from the service, which can range from very good to rude."], ["What a drink! And friendly bartender", 5.0, "January 7, 2012", "Wendy B", "Hendersonville, North Carolina", 143, 54, "After walking and walking around Georgetown during our trip to DC we stopped in for a cocktail while we got off our feet. The front end Manager greeted us promptly and the bartneder was so friendly. He chatted with us during our visit and he made a great drink. We each had a CC and ginger. It was a lively...\n\n\nMore"], ["Great SERVICE - Good Food", 5.0, "December 12, 2011", "muff1234", "columbus", 161, 84, "Went to the Uno near Georgetown Cupcakes. Matt was server - He was SUPER! Food was Good - Hot - Nice to get a Good Meal with Great Service!"], ["Nice Union Station Pizza break", 3.0, "December 11, 2011", "CPTESQ", "Brick NJ", 45, 15, "If you are in Union Station in DC (and evidently four million of us go through Union Station each year!)--stop at Pizzeria Uno/Union Station which is on the second floor overlooking the hustle of the Main Floor below. Our waitress was somewhat inattentive (had to ask for the oregano twice)---and at 58 years old---plenty of grey to show---I was carded!!!...\n\n\nMore"], ["Handy If You're in Union Station", 3.0, "November 10, 2011", "TarHeelBiggy", "Concord, North Carolina", 72, 49, "My wife and I arrived in Washington by Amtrak and wanted to eat dinner before heading to our hotel. We chose Uno, and it was pretty ordinary. We both got pizzas since that seemed to be their specialty, but were disappointed in the toppings as well as the crusts. About the only redeeming factor we found with dinner was the...\n\n\nMore"], ["Union Station Hideaway", 4.0, "April 7, 2011", "redrooster89", "Annapolis, MD", 161, 47, "Outstanding service and personality by our server Gail K...truly the best thing about the dining experience for lunch. Great location overlooking the activity below inside Union Station. Lobster slider and all pizza was very good.\nNice place go upstairs and get away from the crowd..."], ["unpleasant experience!!!!!!!!", 2.0, "July 16, 2009", "dd13UsaBaltimore", "Chicago, Illinois", 28, 21, "we waited more than half hr for food and another half an hr for check. we did not have napkins, forks even after asking the waitress. food is average compared to prices."], ["Don't Eat at the Lunch Buffet!", 1.0, "January 29, 2009", "Bob C", "Chicago, Illinois", 120, 107, "Usually Uno's isn't bad, but the Union Station Uno's offers a $12 lunch buffet which includes \"all you can eat pizza, soft drinks and salad.\" Sounds OK until you actually try it. It consisted of three cold pizzas that probably had been left over from days before. They looked and tasted like they had been re-heated several times. They were...\n\n\nMore"], ["Eat Here!", 5.0, "November 21, 2008", "molbeth", "Americus, Georgia", 28, 14, "Looking for a quick meal, but surprised at the quality! Wait staff was excellent, as was the food!"], ["Nice Restaurant Choice in Union Station", 3.0, "November 21, 2008", "MBAmom", "Northern Mississippi", 59, 52, "After catching a movie at Union Station, we wanted to find somewhere nearby to eat that was NOT in the food court. I had not stepped foot into a Pizzeria Uno in over ten years, and was quite surprised to find such an expansive menu. I had a very traditional selection of a deep dish pepperoni pizza - delicious! My...\n\n\nMore"], ["An unpretentious restaurant and bar inside Union Station, upper level. Pizza and pasta can be had, but so too can you...", 3.0, "November 16, 2008", "Montreal-Mathman", "Montreal, Canada", 144, 56, "An unpretentious restaurant and bar inside Union Station, upper level. Pizza and pasta can be had, but so too can you have a decent steak there. Beats the fast food court in the basement any day of the week."], ["If you must eat at Union...", 1.0, "March 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "If you must eat at Union Station, this overlooks one of the main traffic areas and has good wine prices."]]], ["Ancora", [["Theatre Dinner", 4.0, "July 23, 2015", "AlanMarch", "Bridgend, United Kingdom", 115, 51, "A great location if you are looking for a pre show meal at the Kennedy Centre. The service was good and quick and the food was very good, it was the first time I had eaten a Pizza with a white sauce base and it was excellent. The Pizzas are generous so one between two may be more suitable if...\n\n\nMore"], ["Very convenient if you're going to KC", 3.0, "February 21, 2015", "Austin H", "Missouri City, Texas, United States", 76, 16, "I went here to look for something quick before walking over the Kennedy Center. Being a pescavegan, it was kind of hard, but I ended up getting the palermo (tuna) sandwich without eggs, along with a bag of chips. Aside from so many vegetables in the sandwich, it was pretty good. I'm sure that people who eat meat and are...\n\n\nMore"], ["Temporarily dark", 3.0, "June 21, 2014", "DC196", "Washington DC, District of Columbia", 95, 49, "As reviews have noted Kinkead took over an existing space and he's now closed for renovation although he has opened his informal pizza-panini-gelati place next door Campono. Menu looks intriguing and well priced but Ancora needs to reopen before Fiola Mare with its dazzling river views and equally dazzling prices sucks all the dining-out money out of the neighborhood."], ["Quick stop before the Kennedy Center", 4.0, "May 4, 2014", "NoPegasus", "Silver Spring, Maryland", 118, 60, "We wife and I stopped in at Ancora because we needed a fast dinner before a Kennedy Center performance. We were late and really didn't even have time for dinner. However, the service here was qjuick, so we got to eat, and enjoyed the dinner. We bought and shared an excellent pinini and a large beet salad. We took it...\n\n\nMore"], ["Great food, little atmosphere", 3.0, "April 3, 2014", "Ryan L", "London", 13, 5, "My wife and I visited Ancora during our honeymoon in September 2013 and had found this restaurant through searches online and trusty old Trip Advisor.\nWe were certainly impressed by the food and service (and the company was pretty good too) but we did find the atmosphere very flat.\nAlso, we did have issues getting a cab after our meal...\n\n\nMore"], ["Great spot for pre show dinner", 4.0, "February 10, 2014", "NadoMamma", null, 71, 26, "In addition to the good food, they will vallet your car for $10 for dinner and the duration of the performance - that in and of itself is enough to dine here vice at the Kennedy Center.\nMy husband and I enjoyed our dinner at Ancora before a show at the Kennedy Center. It is a great location for events...\n\n\nMore"], ["Disappointing--Not up to Kinkead's standards", 3.0, "February 8, 2014", "arthurman2", "McLean, Virginia", 79, 16, "We were fans of Kinkead's so we were expecting to get the same zucca ravioli as we'd had there before it closed. Unfortunately they were not nearly as good. I had the eggplant app. The eggplant was tasty, but the dollop of cheese on top was way too much. My wife's pear salad was very nice. We shared the cannoli...\n\n\nMore"], ["Dedicated to quick service and delicious food", 5.0, "February 5, 2014", "StacyAnn70", "Alexandria, Virginia", 12, 0, "We really enjoyed the atmosphere, service, and especially the food. We had scallops, char, pumpkin soup, polenta, and chocolate cake. All delicious! The server asked when our show at the Kennedy Center was to ensure our on time arrival. Parking there at the Watergate is cheaper than the Kennedy Center (only $12) and we also received $6 off our meal....\n\n\nMore"], ["Service Issues Detracted from Food", 3.0, "January 2, 2014", "Missty", "Alexandria, Virginia", 87, 52, "Had a rare 7:15 reservation for New Year's Eve. Was greeted nicely at the door & our reservation was noted promptly, but then we were seated (with our coats on) at a table that was set for 4 (the hostess told us to tell our waiter it was just the 2 of us). Kincaid's food was delicious (as I remembered...\n\n\nMore"], ["EXCELLENT FOOD AND SERVICE, IT IS EXPENSIVE", 5.0, "December 17, 2013", "VAChuck", "Alexandria, VA", 846, 416, "We had a very nice dinner for four last night at Ancora, a Kinkaid restaurant. The food was excellent. We were going to the theater so we skipped dessert and coffee. For dinner, 3 people had fish (swordfish and snapper) and I had a braised pork chop. All were very much enjoyed.\nThe wines were excellent, especially the Lafollette Chardonnay....\n\n\nMore"], ["Good choice for a late, quiet mid-week meal", 4.0, "December 11, 2013", "Epic_Winter_1", "Washington DC, District of Columbia", 48, 38, "Was able to have a nice dinner here recently as part of a business meeting. The dinner was scheduled for 7pm, and when we arrived the place was packed. But by 7:30 it was mostly cleared out because the theater crowd had all left. So it actually was quite a quiet dinner (well, except for our table).\nWe sampled the...\n\n\nMore"], ["Mixed Feelings", 4.0, "November 15, 2013", "amiddl", "us", 47, 24, "The food was good but it's one of those places with big plates and little food. Ordered the short rib with porcini mushroom pasta in a tomato aioli - $18. Then, ordered the affogato for dessert - $10. It's not that I wanted to be stuffed but for $33 including tip, I did expect to at least be full. The...\n\n\nMore"], ["Close by Kennedy Center but needs to get its act together", 3.0, "October 13, 2013", "Mark L", "Rockville, Maryland, United States", 14, 6, "I came here with a Meetup group after attending an event at close-by Kennedy Center. Although early. The place was empty aside from one other small party. The barkeep was there alone with no wait staff to help him! Before we arrived he said that they were considering closing, though it was long before the posted 10:30 closing time. He...\n\n\nMore"], ["Excellent food!!", 4.0, "October 5, 2013", "darwinsail", "Washington DC, District of Columbia", 379, 305, "I loved the food in this restaurant. I know the excellent receipts from Chef Bob Kinkead before, and he renwed and in some cases updated it. The previous azreca soup have here its italian version: CERNIA ACQUA PAZZA, which is as good as the other one. The wine list, and the somelier are as great as in the Kinkead's."], ["Ancora Restaurant", 5.0, "September 20, 2013", "Barbara0001", "Delray Beach, FL", 6, 2, "My husband & I ate at Bob Kinkead's newest restaurant before a show at the Kennedy Center last night. It was excellent! I had the Romania salad w/Romaine lettuce, avocado and a lovely mascarpone herb dressing then a beautifully prepared salmon dinner while my husband had the rib eye steak both with unusual and delicious vegetables. The presentation of each...\n\n\nMore"], ["wonderful pre-kennedy center spot for a drink", 4.0, "September 8, 2013", "mas47", "Washington DC, District of Columbia", 143, 46, "Had drinks sitting outside on the patio before a Kennedy center performance and it was wonderful -- Great cocktails, tasty bar snacks and a serene and lovely location."], ["Tasty dinner, problematic service", 4.0, "July 7, 2013", "JohnAlexandria_VA", "Alexandria, VA", 3, 1, "Robert Kinkead's new restaurant, formerly Rivers, directly across the street from the Kennedy Center, is a good choice if you're about to attend a concert or play. The decor is the same as Rivers, but Kinkead plans to close the restaurant this fall and completely remodel it. Our food was tasty, but it took three attempts to get my entree...\n\n\nMore"], ["Robert Kinkead's Newest", 4.0, "July 6, 2013", "Valkyrie01", "Colorado Springs, Colorado", 45, 19, "We've enjoyed the food and friendly staff at this location through three name changes, i.e., The 600 Restaurant, Rivers at the Watergate, and now Ancora. While we truly miss some former staff members who actually became friends, two or three are still employed and continue to warmly greet us. In its new resurrection, the restaurant continues to offer outstanding menu...\n\n\nMore"], ["Great old friend in a great old spot", 5.0, "June 2, 2013", "McDmeister", "Washington DC, United States", 18, 13, "Bob Kinkead's departure from the Pennsilvania Ave. spot was a shock. So what a wonderful surprise to find that he's going to lend his expertise to the Watergate restaurant of many names. Two lunch visits suggests that this might be a keeper. Satisfying food, familiar wait staff, comfortable surroundings. The test will be the per-theater meal for a full house...\n\n\nMore"], ["There's a Place For Us", 5.0, "May 26, 2013", "MacnQ", "Washington, DC", 29, 17, "If you're going to the Kennedy Center you must go here. I read a review about Ancora and was excited to hear that there was another restaurant to go to close to the Kennedy Center. My dinner was a superior start to the evening. A wonderful Sancerre with oysters, scallops whose accompaniment was fantastic, espresso with an apple tart for...\n\n\nMore"], ["Very Good Seafood.", 4.0, "May 9, 2013", "Ozgur20817", "Bethesda, Maryland", 69, 25, "The restaurant needs renovation badly. You feel like you are in a place out of the 70s. That said the scallops were outstanding. Lots of good choices and the service was top notch. I would go back."], ["Finally a good restaurant around Kennedy Center", 4.0, "May 4, 2013", "darwinsail", "Washington DC, District of Columbia", 379, 305, "It is a very good restaurant at steps from the Kennedy Center and Foggy Bottom area. The Chef is the same from Kinkeads, which has beennthe bestnseafood restaurant in DC for years, until it was closed last December. This one have a nice italian menu, with new receipts suitable for gourmets and people that just enjoy good food. It also...\n\n\nMore"], ["Disappointed", 3.0, "April 22, 2013", "SwmboAlaska", "Juneau, Alaska", 2, 1, "Made reservations for 6 through \"Open Table\" for dinner on a Thursday at 5:30pm. Requested a view table. We arrived and were seated near the front door with no view at all when there were fewer than 20 people in the huge restaurant. Out of the 6 of us, only two others were \"satisfied\" with the meal. I ordered fish...\n\n\nMore"], ["Mixed Feelings", 4.0, "April 21, 2013", "cedangeles", "Washington, DC", 69, 30, "I had lunch two weeks ago and dinner a couple of nights ago at Ancora. The Fritto Misto I had for lunch was a disappointment but the grilled squid was delicious! For dinner, three of us had the scallops which we all enjoyed; the rest had the sea food stew (cioppino) which they said was very good. The wine list...\n\n\nMore"], ["The food is worth the trip! Especially if you are attending an event at the Kennedy Center", 5.0, "April 11, 2013", "LauraBunny", "Washington DC, District of Columbia", 28, 6, "Although our waiter was curt and occasionally slow, the food was excellent and the sommelier very helpful. We shared the grilled squid appetizer on polenta. The squid was expertly grilled, the polenta creamy, and the tomato and basil sauce delicate yet flavorful. Both entrees where wonderful. My husband had the fish and shellfish stew and I have the wild mushroom...\n\n\nMore"], ["Very good", 4.0, "April 9, 2013", "shaidan", "Boston", 81, 67, "We had a bite here yesterday before a recital at Kennedy Center. Noise level was OK. Service was prompt and efficient. We sampled the bruschetta of the day, with several different toppings, all very good. We then had the polpo, which was very fresh and cooked just right, but the dressing was so vinegary that everything was a bit too...\n\n\nMore"], ["much ado about little", 3.0, "April 7, 2013", "RebeccaMaine", "Harpswell, Maine", 148, 76, "Although the service was superlative the food was overly rich and the portions were too large. The restaurant is attractive although the artwork leaves something to be desired. Good lighting and comfortable seating makes this a pleasant place for a business lunch or dinner.\nFlavors are good but the food just seemed a little too heavy, a little too much,...\n\n\nMore"], ["Good Kennedy Center choice", 5.0, "March 21, 2013", "dohertys53", "Washington DC, District of Columbia", 55, 23, "We stopped by for dinner prior to a Kennedy Center show. This is a new restaurant housed in the old restaurant by a different owner. The food was excellent and the choices were inventive. My Friend had the scallops and I had the rabbit; both were outstanding. There is also a gluten free pasta entree available but I did not...\n\n\nMore"], ["Finally a decent restaurant near the Kennedy Center", 5.0, "March 19, 2013", "Gana B", "Washington DC, District of Columbia", 119, 101, "Comfortable, attractive bar adjacent to restaurant. Great ood in the Kinkead tradition and excellent service. When presented with the bill, I discovered that my two glasses of wine had been inadvertently left off the bill. When I pointed it out to the maitre d', he thanked me for my honesty and comped the wine. Good customer relations. The salad was...\n\n\nMore"], ["Bob Kinkead's new DC Ancora restaurant", 5.0, "March 17, 2013", "Robert F", "Washington DC, District of Columbia", 3, 4, "Bob Kinkead, well known for his Kinkeads restarant in DC and Colvins Run in Tysons Corner VA, two of the top restaurants in the area for years, has opened Ancora, a new restaurant in DC, across from the Kennedy Center in the Watergate office building. Ancora has excellent ambience, Kinkead's usual excellent kitchen and reasonable prices, a combination hard to...\n\n\nMore"], ["Not just a good place to eat before the Kennedy Center -- a good place to eat!", 4.0, "March 14, 2013", "WashingtonTraveler21", "Washington DC, District of Columbia", 113, 82, "Literally right across the street from the Kennedy Center at the Watergate complex is a new and exceedingly welcome addition to the DC dining scene -- Ancora restaurant, opened by the creator of the now-no-longer Kinkead's Restaurant. Any dedicated Kennedy Center-goer knows that the food in the Ken Cen itself is sadly second-rate, served in rather soul-less surroundings, offered in...\n\n\nMore"]]], ["Spring Mill Bread Co", [["Good coffee and crumb cake", 4.0, "September 17, 2015", "dmcengland", null, 48, 15, "Stopped in for coffee and blueberry crumb cake. Both were very good. My daughter and I visited while staying briefly in the Capital Hill area"], ["Dog Friendly Patio, great Artisan Bread but the cakes are so so", 3.0, "August 30, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "First time here, even though I stayed in the Eastern Market for a while when I first moved to DC. This place is a little bit more than a bakery. It serves breakfast, soup sandwiches and dessert as well.\nFirst thing that is important to me is that the patio is dog friendly.\nThe second great thing is that the...\n\n\nMore"], ["Bakery Outpost On The Hill", 4.0, "July 14, 2015", "mortonbrilliant", "Washington DC", 36, 15, "Great mix of sandwiches and baked goods. We're big fans of their whole wheat challah. The apple streusel bread is dangerous, too."], ["Quick and good service", 4.0, "July 10, 2015", "Chris M", "Singapore, Singapore", 9, 4, "All other places were packed so we sucked in here and had a quick lunch. Not expensive with a decent Reuben the breads were fresh and tasty"], ["Best Breakfast Brioche", 5.0, "May 7, 2015", "Headforbeer", "Greenville, South Carolina", 88, 27, "Had them several mornings during our visit. Excellent neighborhood bakery. Good breads as well. Get coffee at the cafe next door is my recommendation."], ["A favorite for bread, baked things & quick snack", 5.0, "October 22, 2014", "LitoralSul", "Fairfax, Virginia", 28, 39, "The bread is very good and some of the specialties in the baked goods are exceptional. Rosemary shortbread and the marbled cream cheese brownies as examples. Kid cookie lures with regular requests to go to the \"bread place\" to see what is featured. Good sandwiches and soup for quick lunch. Popular breakfast grab and go place for local workers and...\n\n\nMore"], ["Very good spot for a snack!", 4.0, "October 11, 2014", "Little_BritInTheUSA", "Lansdowne, Virginia", 45, 19, "Hello all,\nThe breakfast sandwiches are pretty good! My favorite snack/item are the scallion/cheddar scones -- I frequent this place about two times a week and the items are always fresh! I would get there before 9:30 if you want super fresh baked good!"], ["Good bread and other baked goods", 4.0, "August 9, 2014", "millc54", "Indian Shores, Florida", 334, 148, "I ordered the half sandwich and soup. It is build your own sandwich which is nice as it is customized for you. I got the ham and a lentil soup. The bread was fresh and delicious, the soup was superb. This is a small place is the mass of restaurants on 8th St. It has seating inside and out. The...\n\n\nMore"]]], ["Pasta Mia", [["Torture", 1.0, "September 19, 2015", "DCTraveller40", "Washington, DC", 31, 23, "I have never before given a restaurant a \"Terrible\" rating. Our experience last night at Pasta Mia, however, makes the rating understandable. We knew that there would be a wait outside for a table, but the evening was pleasant so we put up with the 25 minute wait. Upon entering the restaurant, we should have realized that this was not...\n\n\nMore"], ["The food is not good enough to justify all the rules.", 2.0, "August 24, 2015", "tchabbs", "manila", 35, 31, "Service is below par, the rule of $17 for FOOD per person is absurd (Drinks not included). No credit cards allowed. No substitutions. Salad was terrible, Pasta was good, wine was good, and desert was mediocre. Too many good restaurants in DC, will not be back."], ["True Italian Pasta", 5.0, "June 11, 2015", "CarlaNan", "Washington Dc", 16, 4, "The home made pasta is delicious! Big portions, to share. It is not a fancy place, but it worth it. They only accept cash. Small tables, not good for big groups."], ["Great find!", 5.0, "May 12, 2015", "Nicole L", "Cary, North Carolina", 1, 0, "Worth the wait! Make sure you are hungry before you go since they give you huge portions of high quality Italian :)"], ["Great Italian", 5.0, "April 13, 2015", "apearl41", "Orlando, Florida", 33, 11, "Doesnt open till 6:00. Husband and wife operated restaurant with great pasta dishes. The food was delicious and fresh and the portions were Gigantic."], ["You must accept the TOS or don't go to this place", 4.0, "March 28, 2015", "innerbum1", "Washington DC, District of Columbia", 253, 117, "We went back to Pasta Mia last night after waiting over a decade. Nothing has changed and it is still great. The pasta is some of the best I have ever had including restaurants in Italy. However, there are costs: it is ear bleeding loud (terrible accoustics), the wait can be long (no reservations), and the service slow (dishes are...\n\n\nMore"], ["Seriously overrated!!!!!!", 1.0, "December 28, 2014", "MikeMfromWashDC", "Washington, DC", 148, 89, "No reservations allowed, when our party showed up at 6:28, we were told there would be a wait, with no estimate on how long. We waited 75 minutes to sit, and another 45 for food. The staff was downright rude. Chalkboard screams \"NO CHECKS NO CREDIT CARDS CASH ONLY!!!!!!\" With six !!!!!!. The food was okay, but dripping in cream...\n\n\nMore"], ["Back in old Napoli that's amore", 5.0, "December 10, 2014", "Amierosehill", null, 18, 4, "Amazing place. For me, pasta done simply and right reminds me of traditional Italian food. This place has the taste of Italy and the charm to go with it. The house salad is a must have was done perfectly. It does take time but if you can't take the small wait for the good food cancel your trip to Italy....\n\n\nMore"], ["Biggest portions I've ever encountered!", 4.0, "November 7, 2014", "Jimbowein", "Washington DC, District of Columbia", 114, 44, "The $6 Caesar salad could have fed 4, and was absolutely delicious. The pasta dish that I ordered (fettucinne with chicken and mushrooms in a cream source) could easily have fed 3; I took most of it home with me and it held up well as leftovers. Dieters beware of this dish, however -LOADED with cream, butter, and cheese!"], ["Have patience and you'll have the best italian food in DC", 5.0, "August 27, 2014", "ThriftyThrill", null, 33, 28, "This mom & pop restaurant is beloved by locals not just for the AMAZING authentic italian food and portions, but because of its quirks. Washingtonians line up outside for hours before the restaurant opens at 6:30PM and then the first wave of customers is seated all at once while the second wave continues to wait outside. The house-made noodles are...\n\n\nMore"], ["Mount Pasta!", 4.0, "August 17, 2014", "Mario L", null, 15, 4, "Definitely a place worth visiting if you are looking for a traditional plate of Italian pasta! I recommend not eating before because the portions are enormous. One plate is enough for two people (I'm a good eater). The service was very good as the lady serving us was from Napoli and could actually speak Italian fluently (unlike 99% of the...\n\n\nMore"], ["Fresh and piping hot!", 4.0, "August 7, 2014", "NickMiller_Clarity", "Concord ma", 58, 22, "I ordered chicken and cheese ravioli with a tomato cream sauce. TREMENDOUS! The flavors in the sauce \"popped\" in my mouth, I could have ordered a bowl of it as a soup! The raviolis were large, well stuffed, perfectly cooked, all served \"off the stove\" hot in portions large enough for two. Friends enjoyed the pesto gnocchi (a light, pungent...\n\n\nMore"], ["AMAZING!!! So sad this will end in another year. A must do!!", 5.0, "August 4, 2014", "Michelle P", "New York City, New York", 5, 1, "Amazing food. It's worth standing outside to get a spot in this gem of a place. The food is outstanding. Haven't had better unless I was in Italy!! The hubby is in the back making EVERYTHING and the wife along with other staff keep the rest of the place running. We loved it! A trip back to DC for this...\n\n\nMore"], ["Inexpensive pasta place in Adams Morgan", 5.0, "May 28, 2014", "ThomAtlanta", "Atlanta", 17, 5, "This place is very small. The pasta dishes are extremely generous in size-could easily feed 2 people. Food is delicious. Place has a \"mom and Pop\" feel to it.\nBe warned-CASH only"], ["Authentic and Tasty", 5.0, "May 15, 2014", "camckh", "Kalamazoo,Michigan", 66, 43, "Stopped in on a Saturday night at 6:15. Got a table right away. It takes awhile to get your food, but that is because they make the pasta and the sauces fresh when you order it. It was worth the wait. The sauces and pasta tasted just like what I would get in Italy. Remember to bring Cash only. We...\n\n\nMore"], ["Too much food, too little service", 3.0, "April 22, 2014", "boxofrain80", "Washington DC, District of Columbia", 26, 20, "I'll start by saying that I really liked my meal - an eggplant fusilli dish. Having just moved here from NYC, perhaps my expectations are still too high but the experience left something to be desired.\nWhen we got to the restaurant, though there were several open tables, there was no one in the front to seat us. After a...\n\n\nMore"], ["Excellent homestyle Italian but at a price.", 3.0, "April 19, 2014", "Michael C", "Manalapan, New Jersey", 7, 2, "Let me first say that we visited here on a Friday night at 7:30pm on a holiday with my 2 teenage sons so you can see where this will go. I have for you, the good, the bad and the ugly.\nLet's start with the ugly: the wait. If you do NOT get there an hour before it opens or...\n\n\nMore"], ["Authentic pasta dishes worth the wait", 4.0, "August 11, 2013", "Jay G", "Edina, Minnesota", 21, 2, "The place opens at 6:30 and a line starts to form about 5:30. Atmosphere is nothing special but all pastas are delicious and the portions are huge"], ["Wonderful Pasta", 5.0, "May 30, 2013", "Dennis G", "Republic, Missouri", 99, 16, "If you walk away hungry, you didn't finish your meal. The portions will fill even the most ravenous appetite. Three of us ordered three different items, traded plates so each got plenty of each, and still took home three containers of leftovers. The sauces were wonderful. The pasta was cooked perfectly. Try to get into the first seating to avoid...\n\n\nMore"], ["Old School Italian", 5.0, "April 17, 2013", "rajunwild", "Port Saint Lucie, FL", 5, 7, "If you want old school Italian, run by the nicest owners, then go here. I recommend getting there 30 mins before they open. Bring cash only, and have a hearty appetite. The amount of food they give you would serve 4 normal people. This was my favorite eating stop on my recent trip to DC. Just awesome..."], ["Still THE one...", 5.0, "February 19, 2013", "lovelife132", null, 4, 1, "Yes, this place is tricky to find, yes they take no reservations, yes they often not very friendly with their customers, and yes they are often closed prior to their close time...but if you have the patience to stick around, wait for a small cramped table...you will get some of the best pasta you have ever had!! After leaving DC...\n\n\nMore"], ["No Manners Here", 1.0, "January 2, 2013", "LucieLM", "Washington DC, District of Columbia", 15, 11, "This little Italian restaurant has such an inflated sense of importance and ego that it forgets any sense of basic manners. In traditional, old world, European style, the owners and waiters here live by the motto: if you don't like it, you can leave. So, we left. Here, the customer is never right.\nWe arrived when the restaurant opened on...\n\n\nMore"], ["A neighborhood classic", 4.0, "December 20, 2012", "wiscomilker", "washington dc", 39, 23, "This pasta-centric family owned mainstay keeps chugging along. Have been coming here occasionally for years (anybody remember the old New Orleans cafe? - former waiter Bardia has his own place down the street on 18th) Yes - no reservations at Pasta Mia & everyone must be there to get seated. Small place & opens at 6:30pm, so get there at...\n\n\nMore"], ["Good food and leftovers", 4.0, "October 14, 2012", "JENNMCC", "Wellington, OH", 120, 63, "The staff wasn't that friendly but the food was very good and decent prices. The four of us all something different and we all enjoyed a few tastes of each others pastas. My favorite was the red and pesto sauce mixed on spinach ravioli. My seafood ravioli were also very good. We split a carafe of wine and was quite...\n\n\nMore"], ["Great food, great prices. Cash only.", 5.0, "October 11, 2012", "PrincessCaryn", "Richmond, Virginia", 26, 14, "The portions are huge, the house red wine was good. The food was excellent. The cash only policy seems odd but was not a deterrent for us."], ["Best Italian/fresh pasta in DC", 4.0, "September 24, 2012", "JeansFriday", "Washington, District of Columbia", 24, 8, "Pasta Mia was as delicious in 2012 as I remember it from 2001 and 2002, which I was happy to discover. If you don't want to wait in a line, show up at 6:15 for the first seating at 6:30 PM....otherwise who knows how long it will take to be seated. You have to have your entire party with you...\n\n\nMore"], ["Great family restaurant", 5.0, "May 4, 2012", "darladenise", "Austin, Texas", 69, 30, "Great food served family style. Can have long lines, but it's definitely worth the wait. Love walking in the Adams Morgan area!"], ["Decent food, but nothing special.", 3.0, "March 20, 2012", "RCEWP56", "Longmeadow, Massachusetts", 52, 18, "Serving sizes are way too big. We gave our leftovers to our companions otherwise half our food would have been thrown away (we were staying in a hotel). Our group of four were seated promptly, Service was not speedy, but we were not in a rush, so it was ok. Luckily we knew the portions are large, so we did...\n\n\nMore"], ["I long for the days when it was a neighborhood secret", 5.0, "March 8, 2012", "enigmajean", "Washington DC, District of Columbia", 46, 22, "I almost don't mind seeing a few negative reviews if it means those of us who live in the neighborhood could just walk in any time, like we did back when Antonietta and Roberto first opened Pasta Mia. Ah well, we can dream..."], ["I have been humiliated", 1.0, "March 6, 2012", "nathann1", "Frankfort, Kentucky", 1, 9, "I have been humiliated. We are visiting Washington as a family for the fist time in years. We read the reviews for this restaurant and decided to try it. We came in and the the patrons seated next to us told us that the portions were large so when we ordered we ordered two meals so that my wife and...\n\n\nMore"], ["Unimpressive", 3.0, "December 29, 2011", "DCMermaid_10", "Washington, DC", 14, 17, "Do not understand all the fuss over this place. Food was just okay and service lacking"], ["Big Portions, Decent Food", 3.0, "December 27, 2011", "Traveler x", "Washington DC, District of Columbia", 17, 10, "The food isn't anything extraordinary, but the portions are huge so you have leftovers. Each customer has to order worth $15 minimum, so you can't share...I don't really understand why they have these rules."], ["Mama Mia!", 5.0, "November 8, 2011", "LaurenML", "Milwaukee, Wisconsin", 3, 4, "Be prepared to have a home made, delicious, leisurely dining experience at Pasta Mia. It is a family run restaurant that serves amazing food. I'm sure the recipes have been in their family for decades. Think all Italian food is the same? Think again. A wonderful little restaurant, quaint and warm with food that is to die for. Did I...\n\n\nMore"], ["Amazing!!!!", 5.0, "November 6, 2011", "RichmondLily", "richmond, VA", 16, 17, "You have to love it! The food is fresh, cooked to order (you can watch the chef in the kitchen) and the wine list is solid. You may need to wait, but it's totally worth it. Don't try to make substitutions. They're not allowed. They pair the right sauce to the right past and you will not be disappointed. For...\n\n\nMore"], ["Big portions of great authentic pasta, no credit cards, no apologies", 4.0, "October 31, 2011", "jofawan", null, 8, 13, "Not for the feint of heart; only the brave may enter and live to tell about it. A line forms every nite before the doors open (Tues-Sat), with good reason. Family run by the chef and his wife, each dish is prepared his way, and you don't get any say in the mater; which is good. Prices have now risen...\n\n\nMore"], ["Why people line up for this is a mystery.", 2.0, "August 27, 2011", "Sinaj9", "San Francisco, California", 59, 23, "I'm glad people are so enthusiastic about this place that they will line up out the door, but why is a mystery to me. Maybe it's the woeful lack of good Italian places in DC (also a mystery)."], ["Swimming, no drowning, in oil and sauce...", 3.0, "June 9, 2011", "NicaraguaYogini", "Asia", 70, 49, "Frankly, although tasty, we thought the pasta was overpriced and over portioned. I would way rather pay less and get a normal portion of food. Main complaint was that the pesto gnocci was literally swimming in olive oil, was smothered in parmesan cheese and the second pasta dish was drowning in the mushroom cream sauce.. \" Personally prefer our pasta...\n\n\nMore"], ["I dream about Pasta Mia's food", 5.0, "September 24, 2010", "rtoblin", "Washington, DC", 110, 96, "I've now been to Pasta Mia twice, and the food is just so delicious, so plentiful, and reasonably priced. My boyfriend and I went last night for our one year anniversary because we couldn't stop talking about it after we went the first time. Yes, you will wait to be seated even when seats are open because the staff haven't...\n\n\nMore"], ["Overrated", 3.0, "September 1, 2010", "getachkaraoke", "Washington DC, District of Columbia", 51, 20, "The reason the restaurant has long lines is simple- it only has about 10 tables and the service is S L O W. I'd recommend eating a snack beforehand, no joke. However, the portions are massive. I went with two guys and we ordered three items with everyone taking a box of leftovers. The pesto gnocchi would have been great...\n\n\nMore"], ["Never understood the hype, until I went and was told 'sorry we only have fresh clams today'", 3.0, "August 7, 2010", "GluttonChops", "San Francisco", 64, 30, "I could never understand the long line outside the restaurant, but my sister kept telling me that it was her favorite. A friend and I decided to brave the line and check it out.\nI ordered the spaghetti alle vongole. The waiter apologized saying they only had fresh clams, was that all right? What? Of course it was all right....\n\n\nMore"], ["Big portions, no frills, cash only. It is...", 4.0, "March 30, 2010", "gl0betr0tter_dc", "Washington DC", 64, 43, "Big portions, no frills, cash only. It is not your average DC restsurant, but that is part of the charm. We got there around 9:00 pm on a Saturday night and waited about 30 minutes for a table. It seems that most of the staff are Italian and they are not particularly nice, just effecient. The food is made to...\n\n\nMore"], ["Best Italian Restaurant I have ever been too", 5.0, "April 14, 2009", "mom_of_s_n_y", "Israel", 51, 53, "...and that includes my trip to Italy last summer.\nEverything is simply delicious and the generous portions are amazing.\nThe owner is from Naples and the tastes take you there.\nPrices are very reasonable. Service - excellent. Atmosphere cozy and pleasant."], ["Best bolognese in DC!", 5.0, "January 9, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best bolognese in DC!"], ["OK....But", 2.0, "November 17, 2008", "Living_n_KW", "Saint Louis, Missouri", 4, 10, "Have eaten here twice. Same result: an hour and a half before we got our food. Even asked the waiter to please check on our app's. His curt response of \"its on schedule\" was less than helpful. Well, being \"on schedule\" meant another 45 minute wait. an hour and a half until the first food hit the table. Drinks, bread,...\n\n\nMore"], ["Good Pasta but the wait...", 3.0, "August 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good Pasta but the wait can be way to long."], ["Great no-frills pasta restaurant.", 4.0, "June 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great no-frills pasta restaurant."], ["Gigantic portions and hilarious protocol for getting served.", 3.0, "June 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Gigantic portions and hilarious protocol for getting served."], ["Italian diner", 2.0, "June 4, 2008", "fshanahan", "Breckenridge, CO", 3, 2, "The owners need to ditch the poor attitude because the food is not worth it. We were fortunate to have a nice waiter, and the wine is well priced, but the food was average. Avoid the pasta carbonara unless you like pasta in Velveta."], ["I keep forgetting to go...", 3.0, "May 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I keep forgetting to go back"], ["The BEST authentic Italian I've had anywhere. But, unless you are a party of 2, be prepared to wait upwards of an hour...", 5.0, "April 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The BEST authentic Italian I've had anywhere. But, unless you are a party of 2, be prepared to wait upwards of an hour and a half for a table. And don't miss the tiramisu, it's phenomenal. You really can't go wrong with anything on the menu."], ["Best cheap Italian. Long lines.", 4.0, "March 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best cheap Italian. Long lines."], ["Great individually cooked dishes. Can be slow and crowded.", 4.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great individually cooked dishes. Can be slow and crowded."], ["Great pasta, but not always worth the wait. Get there early", 4.0, "February 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great pasta, but not always worth the wait. Get there early"], ["always a line, don't know why, service and food are average, small and limited hours", 2.0, "January 30, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "always a line, don't know why, service and food are average, small and limited hours"], ["Pasta that everyone raves about for 7 bucks, cash only, but wait an hour outside for the \"opportunity\"? Meh.", 3.0, "January 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pasta that everyone raves about for 7 bucks, cash only, but wait an hour outside for the \"opportunity\"? Meh."], ["love it. plain ol' good...", 4.0, "January 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "love it. plain ol' good food."], ["Yum! do not get there past 6 or so if you want the first seating and your whole party has to be there. A little soup...", 5.0, "January 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Yum! do not get there past 6 or so if you want the first seating and your whole party has to be there. A little soup nazi-ish, but good."], ["Excellent pasta, but almost always closed. There's a line out the door and around the corner when they're actually open...", 4.0, "January 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent pasta, but almost always closed. There's a line out the door and around the corner when they're actually open though."], ["if you love pasta, you'll love pasta mia, if you dont, dont go there as thats all they have!! Expect long lines as...", 4.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "if you love pasta, you'll love pasta mia, if you dont, dont go there as thats all they have!! Expect long lines as there are no reservations taken"], ["Excellent homestyle Italian in the heart of Adams Morgan. Be aware, though - they don't accept reservations and people...", 5.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent homestyle Italian in the heart of Adams Morgan. Be aware, though - they don't accept reservations and people start lining up a good 30 minutes before the doors open!"], ["Definitely worth the wait. Although the gnocchi may not be homemade, it still melts in your mouth!", 5.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Definitely worth the wait. Although the gnocchi may not be homemade, it still melts in your mouth!"], ["tomato and mozzarella appetizer is a must. simple and tasty. the wait is long, but worth it. portions will serve you...", 4.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "tomato and mozzarella appetizer is a must. simple and tasty. the wait is long, but worth it. portions will serve you for DAYS."], ["Fantastic Italian food and it is very affordable but the wait can be a nightmare and it is cash only", 4.0, "December 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fantastic Italian food and it is very affordable but the wait can be a nightmare and it is cash only"], ["Take hours to get a table...but is really worth it!", 5.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Take hours to get a table...but is really worth it!"], ["no reservations, no plastic, slow service... yet i always seem to find my way back", 2.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "no reservations, no plastic, slow service... yet i always seem to find my way back"], ["food was good, but the line was a bit much.", 2.0, "December 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "food was good, but the line was a bit much."], ["good and cheap", 3.0, "December 11, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good and cheap"], ["Worth the wait in cold...", 5.0, "December 7, 2007", "しほほ", "Washington DC, District of Columbia", 9, 1, "Worth the wait in cold..."], ["Disappointing", 2.0, "December 2, 2007", "Miguez", "Columbus, Ohio", 4, 3, "Following the previous two reviews from this site we decided to try Pasta Mia. As had been reported, we arrived at 1800 and there was a line outside already. We were patrons numbers 31, 32, 33, and 34. They don't really give you numbers, we were just counting to see if we would be part of the first wave. We...\n\n\nMore"], ["This is the best pasta place in DC", 5.0, "December 1, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This is the best pasta place in DC"], ["They give you a huge portion for about $10. I love their tortelini.", 4.0, "November 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They give you a huge portion for about $10. I love their tortelini."], ["This place was great before everyone knew about it. The pasta is great", 3.0, "November 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This place was great before everyone knew about it. The pasta is great"], ["We were not blown away by it -- not sure why everyone else raves about it.", 3.0, "November 26, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "We were not blown away by it -- not sure why everyone else raves about it."], ["only so so for me", 2.0, "November 20, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "only so so for me"], ["Better than Italy!", 5.0, "November 20, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Better than Italy!"], ["Don't seem to be in it for money. Gone a month during the summer - not sure where. A half dozen tables in back always...", 4.0, "November 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Don't seem to be in it for money. Gone a month during the summer - not sure where. A half dozen tables in back always empty- dead relatives and friends?"], ["Fantastic authentic pasta as a great price", 5.0, "July 23, 2007", "jonah96", "Washington, DC", 8, 45, "My wife and I happened upon this place by accident. We were walking through Adams Morgan and saw a long line outside of a restuarant. Curious, we asked a couple why they were waiting outside. They said they had driven all the way down from NYC just for dinner. Needless to say, we jumped in line to see what all...\n\n\nMore"], ["Mmmm, delish!", 5.0, "January 2, 2007", "kueric09", "Lawrence", 46, 51, "I was very suprised by this place. If you are looking for good and cheap italian in DC, look no further. The server was a true italian grandmotherly figure who was friendly & funny. The pasta was spectacular and true to real italian form (from lasagne to tortelini and gnocci to ravioli) with spectacular sauces."]]], ["Gazuza", [["Hookah and drinks", 4.0, "August 23, 2015", "reroh21", "New Egypt, New Jersey", 27, 6, "We found this place when we googled for nearby hookah, and even then it wasn't really that well advertised so we were a little weary. Place was actually nice, and pretty big, so sometimes service did take a little longer. The wait staff was very nice though. We tried the grape mint flavored hookah, it was good but after awhile...\n\n\nMore"], ["Not a lot of lounges get hookah right. This one does.", 5.0, "July 7, 2015", "Paul N", null, 3, 0, "One of the best hookahs I've ever had in an American hookah lounge. In addition to that, this place has a nice ambience, patio seating, and friendly service. Great place to enjoy an evening."], ["Good Shisha, Bad Service", 3.0, "March 25, 2015", "neww0rldtraveler", "Chicago, Illinois", 146, 35, "I was in town for business, and a shisha bar is mandatory wherever I am in the world. It was super close to my hotel, so I opted for here.\nThe interior looks like a dance club converted into a space with kitchen, a bar, and chairs/tables to smoke/eat/drink in. a larger expanse adjacent to the bar was set up...\n\n\nMore"], ["Elegant Hookah spot", 4.0, "November 11, 2013", "JezePBelle", "Arlington, Virginia", 5, 5, "I enjoy a good hookah every now and then. Gazuza is right off of DuPont and I have been a couple of times with friends. Know that they're strict on IDs and they will card you so have that ready. When you get in you'll see the ambience and atmosphere is very elegant and sleek. They serve alcohol so cocktails...\n\n\nMore"]]], ["China Boy", [["Good for take out.", 4.0, "October 11, 2015", "Elena1234", "Clarkston, MI", 10, 10, "We are visiting D.C. And wanted to find a good dim sum restaurant. When we read the wonderful reviews of China Boy we wanted to try it (thinking it was going to be like dim sum). China Boy is very small inside (one table for six, and one table for two). When we got there, we decided to try it,...\n\n\nMore"], ["Rice Noodle Mastery", 4.0, "October 6, 2015", "rosielovestravel", "Chicago, Illinois", 82, 45, "5 stars for the food. Period. I don't know the word for \"al dente\" in Chinese, but these rice noodles were perfect. My hubby had to share his chow fun. It wasn't mushy or stuck like so many places. The sauce, meat and onions were delicious.\nThe meat was fatty enough to be tender, but without bites of fatty meat....\n\n\nMore"], ["Excellent noodle texture", 3.0, "July 29, 2015", "DonStruan", "NYC", 38, 43, "The noodles texture is five stars. We loved the chow fun and soup noodles. The service is the typical business like style, but I expected that. The worker was kind enough to inform me it would be about 20 minutes. She unexpectedly asked for my number to call me after I said I'd return for my food. That was a...\n\n\nMore"], ["Great Find!", 4.0, "June 2, 2015", "mrscold", "Milwaukee", 78, 19, "This is a hole-in-the-wall with great noodle dishes. We had lunch and it was delicious. If you want a true Chinese noodle place and real (not American-style Chinese) then you are in for a treat!"], ["Good Crepe", 4.0, "January 15, 2015", "KC7100", "El Paso, Texas", 102, 56, "Tired of eating standard hotel breakfast, I went there 2 mornings to buy crepes for breakfast. This place was as described in reviews and photos. I ordered shrimp and char siu crepes. They were made to order, hot and fresh. I took out and ate in my hotel. Price is a little bit off from the menu on the wall,...\n\n\nMore"], ["Authentic Chinese food", 5.0, "December 13, 2014", "Ron F", null, 25, 12, "This tiny little shopper's a very small variety but the portions are hilariously big and the food was delicious albeit some vegetables would be welcomed. Highly recommended, probably more for takeaways."], ["Great food", 5.0, "October 26, 2014", "tml7betty", null, 6, 6, "Got a tip from my friend's brother to go here. Excellent food, cash only, only few tables, so good for take out, but we are in. Tip from local was to try the hot sauce which like a pickled hot pepper. So good on the noodle dish we had. Had the pork chow foon."], ["Long wait, sooo worth it!", 5.0, "September 11, 2014", "tjlljt", null, 51, 34, "Found China Boy as we were walking to the other noodle place across the street. We decided to stop here for lunch. Extremely tiny inside, one table and a few seats. I guess China Boy is a factory and more of a take out place. We got the shrimp \"crepe\" or cheung fun (what I have known it as) and...\n\n\nMore"], ["Hole-in-the-wall rice noodle treasure", 4.0, "August 20, 2014", "Jay Y", "Houston, Texas", 215, 124, "A hole-in-the-wall establishment a bit far from the main Chinatown street, China Boy would be a difficult place to find without Yelp. If it weren't for Yelp's overall endorsement, I wouldn't even get a second thought about this place because of its unassuming appearance. However, I was glad that I took the effort to track down this place!\nChina Boy's...\n\n\nMore"], ["Good food", 4.0, "April 24, 2014", "eric j", "Kenosha, Wisconsin", 111, 54, "This place is very much hole-in-the-wall but serves some fine authentic asian cuisine. You won't find your greasy stir fry here but ask for shrimp in rice wrap or one of the noodle soups and you'll be hooked."], ["Big disappointment", 1.0, "December 29, 2013", "ShellyS S", "Midlothian, Virginia", 6, 1, "We chose to eat here based in the reviews from this site and another. It's a genuine hole in the wall which was not the problem. Based in the reviews I had read, we ordered the chicken with noodles. It was a chilly day in DC, so we gladly enjoyed the hot water given to us. Our lunch came in...\n\n\nMore"], ["It's all about rice noodles here -- and they are excellent!", 5.0, "December 9, 2013", "Chang_and_Ling", "Washington DC, District of Columbia", 43, 41, "They specialize in rice noodles and have been here for over 20 years, mainly as a wholesaler to various asian restaurants in the area. In the restaurant, they are served in soup, rolled and stir fried, each with a choice of beef, beef tripe, pork or shrimp. Most of their business for prepared dishes is for take-out but as others...\n\n\nMore"], ["Hole in the wall specializing in chow fun, noodle soup and rice noodle roll", 3.0, "October 19, 2013", "blackandblue83", "Washington DC, District of Columbia", 22, 13, "China Boy will not earn any points for its decor, seating or cleanliness. Other than a counter, there is one big round table that seats six to eight, and a small corner tbale that seats two. For the round table, you are expected to sit next to other people. When I went there for a late lunch, the meal was...\n\n\nMore"], ["The hidden secret of Chinatown", 5.0, "July 21, 2013", "sglbgg23", "Washington DC, District of Columbia", 39, 15, "This little place, just around the corner from Gallery Place offers perhaps the best Chow Fun, crepes, and noodles in the DC area and it's an excellent value. Yes it has that whole in the wall atmosphere, but it just makes it better."], ["Average noodles, not clean.", 2.0, "March 31, 2013", "FamTimeFL", null, 434, 96, "Average noodles, and they were the only thing that they could offer us. Disgusting light switches and only two tables. Definitely a big time hole in the wall. Hand written copy of the menu hanging on the wall. Needs a big time clean up. I went from a recommendation and will not be going back.\nEver."], ["Good food, reasonable prices.", 4.0, "March 14, 2013", "M D", "PA", 7, 2, "A no frills restaurant. Plenty of delicious choices. Staff was very attentive and efficient. Perfect for dinner before going to events at The Verizon Center. Walking distance from the hotels near the DC Convention Center."], ["Homemade noodles - hole in the wall", 4.0, "November 27, 2012", "chowdog65", "boca raton florida", 108, 78, "Looking for great homemade noodles then this is the place. Tiny hole in the wall does mostly take out but there is one four top and one deuce for dining in. The chow foon noodles are great and made there - really fresh and tasty."], ["Good food, great prices with no frills", 5.0, "May 21, 2012", "JSFinDC", "Washington, DC", 23, 27, "We had lunch today at China Boy in DC's Chinatown. The place is totally no frills but the food is fantastic. It's cash only and it took a few minutes for someone to realize we were there ready to order. We had the Shrimp Noodle Crepes and Beef Noodle Crepes to start and then we had the Roasted Pork Chow...\n\n\nMore"]]], ["Nando's PERi-PERi", [["Do not miss had", 5.0, "October 13, 2015", "fahaddd", null, 5, 0, "features are chicken and chickpeas (humus), spicing them distinctive and delicious eating them.\nA great experience and love the restaurant and the best restaurants, which always want to eat them."], ["Lunch", 5.0, "September 27, 2015", "Jack P", null, 6, 0, "Very authentic Mediterranean fare. Very spicy. Loved the whole chicken. They even had my favorite chicken livers. Hands on is the only way to eat."], ["Affordable but mediocre", 3.0, "July 15, 2015", "Melaney68", "Chesapeake Beach, Maryland", 413, 176, "Our table of 6 had to sit outside because the indoor seating area was small. The host will greet you, assign your table with a number sign, and then you will go inside and place your order and (hopefully) it will be delivered. Our experience was a hot evening with no shade, kind clerks at the register, a hectic line...\n\n\nMore"], ["Hot and Spicy Chicken", 5.0, "June 5, 2015", "Allrelative", "Fremont, California", 82, 24, "This review is for the location at 819 7th street near China Town in DC. We had the chicken with hot source; moist and spicy; macho peas and potato salads are also excellent. Prices is good, full chicken with 2 sides about $25. You have to go to the counter to order and they will bring food to you. Quite...\n\n\nMore"], ["Decent Lunch", 4.0, "April 9, 2015", "Matt S", "Brighton, Michigan", 579, 165, "Based on a co-worker's recommendation, I stopped at Peri-Peri for lunch. What a great change of pace, tasty option for the Navy Yard area.\nPatrons walk in and place and order, and they are assigned a table number. There are a variety of options (most primarily revolving around chicken). Staff at the restaurant suggested getting one of the chicken piece...\n\n\nMore"], ["Fresh and tasty!", 4.0, "April 8, 2015", "Jean L", "Shepherdstown, West Virginia", 13, 3, "Looking for an quick light bite before Nats Opening Day game as we were in DC earlier than expected. Decided the 4 of us would get one of each appetizer and all just share a little of each. Everything was fresh and delicious! Wings were cooked perfectly. Just the right amount of spice and heat. Extra sauces available if you...\n\n\nMore"]]], ["Johnny Rockets", [["Great shakes", 5.0, "October 9, 2015", "jmm73", "Doha, Qatar", 406, 143, "I love going to Johnny Rockets. The staff are really friendly and it's good diner food. The shakes are so good!"], ["50' s style diner", 5.0, "October 1, 2015", "jeanLochwinnoch", "lochwinnoch", 14, 8, "Done out in 50's style diner with old style tables and chairs. Lots of styles of hamburgers. Staff very pleasant"], ["Good food, good service", 4.0, "September 30, 2015", "Maria C", "El Paso, Texas", 4, 2, "We went on a chilly, late night so the place was almost empty and very quiet, but the service was still very good. The waitress had been on her feet most of the day and still had a smile for us. I recommend this place!"], ["Yuck", 2.0, "September 19, 2015", "Darrin O", "Paradise, IN", 7, 1, "Salt and grease, nothing else and the service is poor. They don't take credit cards and I don't know the last time the place was cleaned."], ["Johnny Rockets Never Disappoints", 5.0, "September 9, 2015", "macro1958", "North Charleston, South Carolina", 14, 2, "After a long day in the hot sun, I wanted to eat here and had so much fun. I made my server laugh when she asked if she could get me anything and I said lots and lots of ice water."], ["Greasy spoon", 3.0, "September 3, 2015", "Linda R", null, 3, 0, "I ate here but was not too impressed, although the service was quite attentive. The food was greasy and there were not a lot of choices."], ["Again great burger etc could do with a bit of a clean!!", 4.0, "August 31, 2015", "Foxholes26", "Hertford, United Kingdom", 301, 110, "We liked this Johnny Rockets food good, service good only thing we thought was that it could do with a good clean! We loved the limitless fries and we had a voucher from the Bus tour map so got 15% off :)"], ["Great service", 5.0, "August 22, 2015", "r h", "Spring Lake, Michigan", 2, 0, "Great service good food excellent waitress lots of service and met our needs before we asked what great customer service"], ["TURKEY BURGER", 4.0, "July 28, 2015", "benjaminzzz", "Washington DC, District of Columbia", 64, 9, "The Turkey Burger here is VERY tasty!! The fries are always on point. I come here at least 4 times a month and still have yet to try the milk shake but will do so in the near future"], ["Slowest Service Ever", 1.0, "July 12, 2015", "Brandon L", null, 1, 0, "Took at least a half hour from between ordering our drinks and receiving them. I don't even wanna stay for the food at this point; it's so irritating with service like this."], ["A good place for lunch!", 4.0, "July 6, 2015", "BZKHAB", "Baltimore, Maryland", 9, 5, "Typical Johnny Rockets but the wait staff was very good. The guys loved the pretzel burger and the onion rings are great."], ["Diner delight", 5.0, "July 2, 2015", "Barbara M", "Jackson, CA", 9, 2, "Reminded us of a 1950's diner. Service was terrific. Food delicious, and the background music songs from the 1960s and 1970. Fun and fast for lunch or dinner."], ["Terrible terrible service", 1.0, "June 9, 2015", "travelling_L0uL0u", "London, United Kingdom", 86, 45, "This is not our first visit to a Johnny Rockets but it was to this specific branch and the service was absolutely terrible it has put us of the entire chain. We were there early and I guess they had just opened but everyone was miserable. I felt like we were putting them out. We asked for chili fries without...\n\n\nMore"], ["Great Food", 5.0, "April 2, 2015", "Horleys2014", "Horley, United Kingdom", 29, 12, "We love the atmosphere at Johnny Rockets Restaurants and always try to find one when on holiday. The peanut butter milkshakes are the best."], ["Don't bother", 1.0, "March 30, 2015", "Kabolt", "New York City, New York", 3, 4, "Very disappointing! The service was slow and they servers unapologetic. It took our server about 45 minutes just to bring my daughter her milkshake. Food was not worth the wait - expensive and poor quality."], ["AVOID", 2.0, "January 25, 2015", "Nicole H", "Perth, Australia", 69, 24, "Don't go. Expensive and low quality food ... there are so many other options close by, avoid at all costs, I went as my Daughter wanted to go, and was SOOO disappointed. Would rather eat from a street cart. Fountain coke was undrinkable. Service was very slow. Food was fast food quality, but 3x the price.\nI could not understand...\n\n\nMore"], ["Great Milk Shake", 4.0, "December 17, 2014", "estrelitzinha", "Brasilia, DF", 9, 2, "The food was delicious. I went there during lunch time and they had an \"all you can eat fries\" deal, wich sounded pretty great. However, it took them a while to refill the fries. ):\nOther than that, it was a very good experience."], ["Good Food & Fun Atmosphere", 4.0, "November 1, 2014", "KristaLeeH", "Burlington, Connecticut", 69, 34, "Typical Johnny Rocket's restaurant with the fun 50's style atmosphere. Great burger & fries place. Stopped by last Monday for lunch a little after 1pm and it was busy but not packed despite being in a very busy area of the city. Fast and friendly service! Bring some nickels and use the table side jukebox! Don't skip out on the...\n\n\nMore"], ["Great atmosphere, too much a/c", 4.0, "August 31, 2014", "Christina E", "Boxford, Massachusetts", 38, 18, "After a long hit walk through the city we enjoyed the old-fashioned burgers and shakes. But the a/c was turned up too high, and pretty soon we couldn't wait to get back in the heat again. IF you go, bring a sweater, and you'll love it. My husband and sons did."], ["Disappointed", 2.0, "August 25, 2014", "Vikingman71", "Luxembourg City, Luxembourg", 10, 8, "We dropped by during our first night in DC, a Sunday evening.\nThe clientele was a typical university students-type, which is usually a sign of a good bargain.\nVery authentic 50's decor. Menu looked nice, one took the Houston burger, the other used the \"build your own burger\" formula.\nThe service was relatively quick, which was good, because we quickly...\n\n\nMore"], ["Amazing", 5.0, "August 19, 2014", "beezer90", "United Kingdom", 50, 45, "Food was fantastic here. I had the Houston burger which was so so good. Never been here before this trip and don't have one back home but I will definitely be coming back. Waitress was lovely too"], ["Monday, Tuesday, Happy Days! Mel Diner Lives.", 5.0, "August 19, 2014", "JandK1958", "Rumford, Maine", 117, 59, "OK - it's not a \"drive-in\", its on one of the busiest corners in DC. But once your inside its the classic 50s setting. Great American fare! Burgers, Fries, Shakes, Onion RIngs -- we tried them all and they were excellent! Without having them side-by-side, I'd be hard-pressed to say which is better - 5 Guys, Fuddruckers, or Johnny's --...\n\n\nMore"], ["Good burgers, nice atmosphere", 3.0, "August 11, 2014", "Tarnungus", "Vienna", 82, 39, "Well, if you want burgers in a traditional American way, this is a good choice. The food is no revelation, but it doesn't attempt to be. My only criticism relates to the somewhat slow service we experienced: the staff appeared to be limited; and if a number of other parties order just ahead of you, your order goes to the...\n\n\nMore"], ["Great burgers", 4.0, "July 23, 2014", "BGouker", "Hanover, Pennsylvania", 31, 15, "Good food, fair prices ... get the onion rings ... they are awesome!\nThis is the Johnny Rockets in George Washington University.. we were too full for the milkshakes, but they are supposed to be great"], ["Does what it says on the label.", 3.0, "May 4, 2014", "ailourophile", "Glasgow", 61, 29, "This is a hamburger and fries sort of joint and it does that well enough. Not usually our sort of place but desperation took us there one evening and what we got was fine."], ["Fantastic Authentic food and great prices too!", 5.0, "April 21, 2014", "BristolLouLouD", "Bristol", 47, 22, "This was a lovely little find during our stay. Amazing food - great quality and loads of it. An authentic American Diner experience. It even had the mini jukeboxes on each table! All you can eat pancakes were a dream and try the \"Philly Steak and Cheese scrambler\" plate - this little beauty would fill you up all day!!!"], ["Love Johnny Rockets but service SO SLOW!!!!", 3.0, "April 15, 2014", "helwise", "poole, uk", 113, 33, "We love Johnny Rockets as we find the food consistent and we like the atmosphere. The service in this restaurant was too slow though, with overstretched staff. It took ages to take an order, although luckily we weren't in a hurry. The fries didn't turn up with a burger either and the waitress seemed so stretched we didn't get a...\n\n\nMore"], ["Good food, reasonably priced", 4.0, "September 17, 2013", "LucyLil", null, 9, 3, "We used the restaurant in Pentagon City and it was exactly as you think a 50's diner should be. Food was good and service was friendly. Also seemed to be quite a lot of locals eating there when we visited which is always a good sign."], ["Good value", 4.0, "August 4, 2013", "Doug D", "Seattle, Washington", 17, 0, "Reasonably priced food in a retro 50's style setting. The burgers, shakes and onion rings are great. The family can afford to eat here."], ["Food was good-service was not welcoming.", 3.0, "July 30, 2013", "cheerhcs1", "Milwaukee, Wisconsin USA", 19, 3, "Can't complain about the food-it was just as advertised-a good burger & fries joint. However, service was lacking -we had to flag down our waitress for everything and she did not smile the whole time. Seemed like we were a bother..."], ["Good food at a reasonable price", 4.0, "July 29, 2013", "Alison P", "Downham, United Kingdom", 11, 4, "As there is so much to see in Washington we did not want to waste too much time sitting and waiting in restaurants. Jonny Rockets provided tasty food cooked as you wanted it, reasonably price and quick service."], ["Well if you're hot and have kids and are looking for a cheap lunch", 3.0, "July 29, 2013", "Tom P", "Washington DC, District of Columbia", 108, 46, "Located in the Shops at Penn Avenue (20th and Pennsylvania) its a Johnny Rockets. Food is generally good, sometimes the tables need to be cleaned when you sit down."], ["Great American Experience for Aussies", 5.0, "July 24, 2013", "Alison C", "Melbourne, Australia", 21, 15, "We had lunch at the Johnny Rocket's at Pentagon City. For a couple of Aussies it looked just like we thought a diner should. Had the feel of America in the 50s. More importantly the food was really good. The place was packed so its obviously popular."], ["Dependable, good location, free refills, top ups", 4.0, "July 7, 2013", "A L", "Washington DC, District of Columbia", 125, 52, "The service has gotten even better since the last time I was here. Great for kids. They top up you drinks and give you extra fries if you want them and the burgers are as good as ever. Dependable and location is good for downtown business."], ["Food was fine .... Service not so much", 3.0, "June 30, 2013", "pilotsfeelfree1", null, 61, 42, "It's Johnny Rockets so you know the menu. I just happen to like the menu. It's a chain so the food should be pretty consistent. The food was quick and the place was clean. We had eaten there once before and it was fine.\nThe issue this visit was terrible service with an attitude. Will probably go back as my...\n\n\nMore"], ["Decent American Food", 3.0, "June 22, 2013", "Autopiloted", "Atlanta, Georgia", 288, 114, "I stopped in at Johnny Rockets when I was given a hour wait for a table at the restaurant next door. I had a Philly Steak Sandwich, fries, and a malt. I didn't finish my sandwich, but it was alright. My malt was pretty good too, although the straw was too small. This was a 100% average meal. The very...\n\n\nMore"]]], ["Borinquen Lunch Box", [["Taste like Home", 5.0, "May 19, 2015", "VrmSjm1018", null, 72, 27, "When I finished my food I wanted to go back to the truck and see if my mom was hiding in there! I had the pernil plate with aroz gandules and tostones. All were yummy. The rice was perfect -not mushy at all. The tostones were crisp and \"meaty\" and the pork had just enough flavor...not like some places where...\n\n\nMore"], ["EXCELLENT Food.", 5.0, "December 18, 2014", "BLC1411", "Virginia", 23, 9, "The Cuban Sandwich here is amazing. I never really ate Cubans and had this one a few weeks ago. I went to Miami last week and Googled the top ranked places to get a one -- I went there and it was great -- but still not as good as this one believe it or not."], ["Awesome food, but you'll need a little time", 4.0, "November 8, 2014", "Doug E", "Washington Dc, District Of Columbia, Usa", 52, 10, "I stopped in at the Lunch Box in Chevy Chase Pavilion. It's the lunch cafe run by Range, a fantastic restaurant by Chef Brian Voltaggio in the same building. I had the best meatball sandwich of all time - beef and veal meatballs, provolone, broccoli rabe on a semolina sub roll. Wow! But it took quite a while and the...\n\n\nMore"]]], ["New Orleans Cafe", [["Great date night", 4.0, "June 30, 2015", "BostonBabeBoston_MA", "Boston,MA", 217, 47, "This place is really nice for a date night. It has intimate seating and low lighting. On weekends they have a great house band. Drinks are weak but food is good."], ["Tiny dancer", 4.0, "November 11, 2014", "Evie9242", "Washington DC, District of Columbia", 28, 8, "This little gem of a restaurant is a favorite with locals. With only about 20 seats (the most choice are in the window), the service and the food are personal and delicious. The ambiance is comfortable, non trendy (maybe even anti-trendy), an oasis in a crazily trendy, alcohol fueled neighborhood. The gumbos and beignets are yummy."], ["Not new orleans food", 2.0, "September 20, 2014", "tommy8244", "Elkridge,MD", 122, 45, "I have been in the new orleans and the jambalaya here is worse than when make it home out of a box. The gumbo had no taste, the plastic water mugs were very dirty. I don't know why people are rating this place as excellent, it's nowhere near that.\nThe jambalaya looked more like Spanish rice."], ["Bardia's New Orleans Cafe - Home Away from Home", 5.0, "September 18, 2014", "Laura L F", null, 1, 0, "My friends and I were looking for a different dining experience and we found it at Bardia’s, a quaint café in Adams Morgan. The food, reasonably priced, is out of this world and the atmosphere warm and friendly. It was like eating Mom's home cooking. We chowed down on the catfish bites, etouffee and jambalaya, yummy. The menu also offers...\n\n\nMore"], ["These people have never been to Nawlins...", 1.0, "August 29, 2014", "Ricky L", "Atlanta, Georgia", 61, 83, "We did not set out to eat here. We were headed for a BBQ joint up the street which is supposed to be among the best in the city. However, we discovered they do not do lunch service on the day we were there only after having arrived. At this point, we're starved, we've already found a much treasured parking...\n\n\nMore"], ["Beignets. Worth it. Period!", 4.0, "August 8, 2014", "NickMiller_Clarity", "Concord ma", 58, 22, "Bardi (the owner) beignets are the best. He learned how to make then in New Orleans and they are light, tasty, and sweet. Plus, You couldn't ask for a friendlier, more engaged owner. He sat with us to chat and share stories while we finished our coffee. A very sweet guy who greets new comers like old friends and old...\n\n\nMore"], ["New Orleans in DC ... Who knew?", 4.0, "July 24, 2014", "Sterg L", "Lakewood, Ohio", 77, 19, "If you have a taste for New Orleans and you are in DC then go to this cafe. The owner is the epitome of hospitality. The jambalaya was excellent. The beignets were freshly made. Truly it is a special place in the Adam Morgan area."], ["Great Find!", 5.0, "January 17, 2014", "Lynn P", "Charlotte, North Carolina", 17, 8, "This was a fun place to eat in Adams Morgan. The étouffée and salad were delicious, and the owner waited on our table. He was very engaging and gave us complimentary beignets \"to go\". I highly recommend this restaurant to lovers of Cajun cuisine."], ["A quaint, welcoming Cajun gem in DC", 5.0, "January 4, 2014", "AndyBrown79", null, 8, 5, "This place is amazing. Simply amazing! Been coming here for years and I've never been disappointed. Prices are fair and the food excellent. I've never had anything here I didn't like. Étouffée and jambalaya are equally good. Try fried okra or Bardia's crab soup for starters."], ["Amazing service, personal attention by the owner", 5.0, "November 21, 2013", "March_Break_Canadian", "Mississauga", 18, 44, "The owner of this restaurant came out to speak to us 3 times over the course of our dinner: once to clarify our order and tastes, second to present the food, third to review and tell us a little about his many years in business. We were very impressed and the bill was very reasonable. The food was delicious, adequate...\n\n\nMore"], ["Try the okra and alligator", 5.0, "September 15, 2013", "exclea", "Washington DC, District of Columbia", 194, 99, "I tried fried okra with mustard ( okra wasn't perfect but the mustard is the best I tried. True to its name. Alligator is a rare delicacy you should at least try once ( 6 usd per cup). Prices are below Adams Morgan average."], ["Bardia's New Orleans Cafe is an oasis of comfort and love", 5.0, "September 3, 2013", "Anna T", "Miami Beach, Florida", 73, 52, "There are few things I enjoy more than a good Eggs Sardou, so when I stumbled upon Bardia's New Orleans cafe here in Adams Morgan, I was very encouraged. The experience here has blown away my expectations. It's not just that the food is fantastic, the whole package is designed for enjoyment. The interior design, the light, the excellent music,...\n\n\nMore"], ["An enjoyable evening", 4.0, "June 1, 2013", "Richfield", "Ottawa, Canada", 50, 20, "After reading reviews of the New Orleans Cafe, we decided to try it out. And we are glad we did. It's a tiny restaurant with a lovely owner who welcomes you as if to his home. It's a small and intimate, but informal, place. We made reservations and were rewarded with the one table at the open air window --...\n\n\nMore"], ["Stumbled upon a treasure", 5.0, "May 9, 2013", "CJonton", "Toronto, Canada", 13, 3, "We stumbled upon Bardia's New Orleans Cafe while parking our car in front of it and decided to check it out. What a good idea this turned out to be. We had Oyster and Shrimp Po'Boys and they were amazing! The french bread it was served on was perfect - crusty, yet soft. The best I've had outside of the...\n\n\nMore"], ["Great Find", 4.0, "March 14, 2013", "Rick H", "Reedsville, Wisconsin", 11, 0, "We were deciding among restaurants in the Adams-Morgan neighborhood, and a diner enthusiastically waved us in from the front window and recommended the Bardia's New Orleans Cafe. We were glad she did. The authentic Cajun food was a treat, the owner (who was also our waiter) was very interesting to talk to, and the beignets (brought out after dinner at...\n\n\nMore"], ["What a Treat!", 5.0, "February 9, 2013", "Hope A", "Pennington, New Jersey", 4, 8, "My daughter and I just had a wonderful evening at New Orleans Cafe! It was a frigid winter's night and we chose a table in the window looking onto 18th Street. The owner placed two space heaters near our table and we were toasty warm the entire time. (I do not love restaurants where sitting near a window means freezing...\n\n\nMore"], ["Love Bardia", 3.0, "December 9, 2012", "bkarmstrong1", "Washington DC, District of Columbia", 26, 16, "The owner and staff are so nice. They are genuine about the customer having a very nice experience. The food is a little bland, but you go for the friendly vibe and drinks."], ["Fantastic food!", 5.0, "August 5, 2012", "pwrmaster7", "cleveland", 4, 4, "Had the alligator gumbo for appetizer (recommended by the owner, also our waiter) and it was delicious (5.50 a cup). I had the shrimp and chicken etoufee which was by far the best I have ever had, perfectly seasoned Wife had the prime rib po'boy which was delicious as well. We got the beignets for dessert and were also very...\n\n\nMore"], ["Love This Place!", 4.0, "May 3, 2012", "Val N", "Washington DC, District of Columbia", 2, 2, "It's intimate, it isn't fussy and the food is good. Things I've had that I like are the gumbo (all kinds), Catfish bites (the sauce is good), salad (I like the dressing), the seafood linguini was VERY tasty, and the beignets...I would actually hurt someone to get some (kidding)! But what makes the place so wonderful is the owner, Bardia....\n\n\nMore"], ["Real beignets! Good atmosphere.", 4.0, "April 19, 2012", "Miklos7", null, 24, 21, "My wife and I came across this restaurant while staying in the Adams-Morgan district. A lucky find. It was a great treat to have genuine beignets, not an item I expected to find this far north. We also had very fine Eggs Benedict with home fries. Enjoyed chatting with the owner, a charming guy who has been in this location...\n\n\nMore"], ["Good jambalaya and gumbo", 3.0, "April 6, 2012", "ChapelHillmuncher", "north carolina", 17, 11, "Small beat up hole in the wall place but clean with good service. I grew up in the South & have good memories of the homemade biscuits we used to have at dinner This cafe has real biscuits! Both our dishes were delicious. Staff were very attentive."], ["A neighborhood favorite", 5.0, "March 3, 2012", "enigmajean", "Washington DC, District of Columbia", 46, 22, "We live in the neighborhood and while we don't eat out often, this is one of our favorites. The owner, Bardia, is Iranian but trained as a chef in New Orleans and really gets it."], ["New Orleans Taste - It's There!", 5.0, "March 2, 2012", "JCSBimp", "Talking Rock, Georgia", 27, 16, "I had a wonderful crawfish etouffee, then beignets and cafe au lait, at this cozy, crowded, busy, understaffed but wonderful place. The tastes took me all the way to my memories of good meals in Nawlins. It was authentic and good."], ["Great food - authentic New Orleans Cuisine", 4.0, "January 13, 2012", "DogWorld", "VA", 98, 35, "Adams Morgan has a lot of food choices and this is a great option. We had the chicken gumbo, fried okra, crab and corn chowder, and - of course - beignets. Very relaxed atmosphere. Great food. It's a small sort of hole int he wall place but it's clean, the service is good and the food is great. Right now,...\n\n\nMore"], ["this place has a few new orleans dishes but we are talking the balkans all the way!!!!!!!!!!!", 5.0, "October 29, 2011", "cheerseddie", "nc", 57, 27, "yum yum!!!!!!!!!!!!!!!!!!! we sat outside, although the inside was inviting and clean with a huge bar.i read the lunch menu with its smattering of new orleans style dishes BUT the other menu! their main menu is straight out of the Balknas( i presume). The best gene pool must have been raided for this attractive staff. I ordered all the great...\n\n\nMore"], ["As close to perfection as you can get", 5.0, "March 11, 2011", "Visitingallthetime", "Tacoma, Washington", 2, 1, "I eat here every time I'm in town - going back to 2001. Perfection incarnate - they have the unusual distinction of actually spicing things correctly - so the gumbo does not taste like the dirty rice does not taste like the etouffee. Everything has its own distinct and delicious flavor.\nI love the staff, which seems to never change...\n\n\nMore"], ["Great place in Adams Morgan for bunch, though it can be pretty crowded. The reviewer who wrote \"nice hole in the...", 4.0, "June 6, 2009", "eventsdc", "washington, dc", 170, 88, "Great place in Adams Morgan for bunch, though it can be pretty crowded. The reviewer who wrote \"nice hole in the wall cafe with chicory and beignets\" pretty much hit the nail on the head."], ["I will be back", 4.0, "February 24, 2009", "saktunes", "Murrysville, PA USA", 41, 30, "I ate here on a Sunday night in February. The cozy place was not crowded and the service was quick.\nI had the chicken gumbo, which was quite good. It was not too spicy, but had just the right amount of spice. It was a good sized portion served with white rice. The meal was topped off with coffee and...\n\n\nMore"], ["nice hole in the wall cafe with chicory and beignets.", 4.0, "August 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "nice hole in the wall cafe with chicory and beignets."], ["I love this place. The owner is probably the nicest person in the District and the rolls are great. I'd go there more...", 5.0, "July 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I love this place. The owner is probably the nicest person in the District and the rolls are great. I'd go there more often if I weren't trying to lower my cholesterol."], ["Hey, any place with FRIED OKRA gets an A.", 3.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Hey, any place with FRIED OKRA gets an A."], ["Pretty good", 3.0, "February 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pretty good"], ["Being from New Orleans and perhaps a tad critical, I'd have to say that this restaurant is okay. One of the dishes I...", 3.0, "January 8, 2008", "FoodCriticBL", null, 12, 1, "Being from New Orleans and perhaps a tad critical, I'd have to say that this restaurant is okay. One of the dishes I ordered was the Andouille Sausage Gumbo which had more of a tomato base than a roux (brown). It was also a lot sweeter than traditional gumbo and there was no okra which was rather disappointing. I also...\n\n\nMore"], ["Small restaurant, not very comfy, but delicious New Orleans/Cajun foods... yum B+", 3.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Small restaurant, not very comfy, but delicious New Orleans/Cajun foods... yum B+"], ["beignets are great. It is like a small new orleans cafe. The service is like coming home to family for dinner. Nice...", 4.0, "December 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "beignets are great. It is like a small new orleans cafe. The service is like coming home to family for dinner. Nice people and good food."], ["A favorite because the owner is so nice. Also their fried catfish and french fries and hot chocolate are good. Chapman...", 4.0, "December 8, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A favorite because the owner is so nice. Also their fried catfish and french fries and hot chocolate are good. Chapman Taylor introduced me it."], ["Beignets for brunch and...", 3.0, "November 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Beignets for brunch and oyster po boys for later. I wish it was a little more lively, though."], ["great po boys and and there is no one nicer than bardia.", 5.0, "November 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great po boys and and there is no one nicer than bardia."], ["Great bruch but super small and always crowded.", 4.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great bruch but super small and always crowded."]]], ["Aroi Thai", [["Lunch", 5.0, "August 2, 2015", "Stanimal14", null, 81, 27, "We just happened to need a place to eat and accidentally stopped in for a bite besides my reluctance. I must say, I couldn't be more wrong. Thai steak, soft shell crabs, crab fried rice, dumblings, shrimp rolls, sushi....all delicious, fast service and only $56. Happy tummy!"], ["Alternative food place in Bloomingdale area", 4.0, "July 3, 2015", "Prawet J", "Washington DC, District of Columbia", 238, 73, "Scouting for new places to eat lunch, I went to Bloomingdale area of D.C. and found this small. and cute Thai restaurant tugged in between the more known-name restaurants in at the intersection of first street N.W. and Rhode Island Avenue N.W, Instead of ordering Thai food, I decided to go for \"sushi\" which is part of the restaurant. To...\n\n\nMore"], ["excellent thai food", 4.0, "December 2, 2014", "Patito217", "Washington DC, District of Columbia", 70, 21, "Have only had take out. Small seating area as is common for area. The food is very good carefully prepared and generous portions. Probably my favorite Thai food and I know it is my fave Thai take out. Since there are many very fine Thai restaurants in DC probably not worth a special trip but if in area and have...\n\n\nMore"], ["Good sushi. Quick service.", 4.0, "September 6, 2014", "Margie G", "Cleveland, Ohio", 43, 27, "Went on Saturday night at 5pm. Place was empty, not always a good sign but it was early. Ordered one sushi roll which was tasty and fresh. Shrimp asparagus was good. Portions were good sized. Also tried cashew chicken."], ["one delicious dish, 2nd one never showed", 3.0, "April 27, 2014", "DCsunseeker", "Washington, DC", 91, 48, "Aroi Thai has been in our neighborhood for awhile but this was our virgin visit. It was good enough I'll try it again but not so good we'll rush back.\nWe ordered a beer, two entrees and an appetizer. We got the not-very tasty shrimp spring roll, the beer and one entree -- crispy duck -- but never god the...\n\n\nMore"], ["LOVE THIS PLACE", 5.0, "March 20, 2014", "Emily L", "Lufkin, Texas", 84, 41, "My party of 9 showed up without reservations kind of late but the staff was wonderful and accomodated us quickly. The edamame appetizer was wonderful. We ordered a variety of types of fried rices and the portions were very large and everyone got full. The flavors of all types of rice were tasty. I highly reccomend Aroi Thai."]]], ["Taylor Gourmet", [["Great Place for a Quick Bite - Tasty Food - Good Service", 4.0, "September 11, 2015", "Still-Enjoying-Life", "Virginia", 74, 52, "We've eaten at Taylor Gourmet a couple of times and have never been disappointed. While 'gourmet' might be stretching the meaning of the word a bit ... since TG is really just a sandwich shop ... the quality of the items we've had there and the service behind the counter are both very good. The photos of the sandwiches TG...\n\n\nMore"], ["Awsome Cheesesteaks!", 5.0, "August 17, 2015", "Manuel M", "Bogota, Colombia", 11, 6, "A friend took me to Taylor's to try a a Cheesesteak... So we went for number 2 and I absolutely loved it. By far one of the best sandwiches I've ever had!"], ["Very so-so subs...", 3.0, "July 24, 2015", "FoodGuyWineGuy", "Washington, District of Columbia, United States", 121, 27, "Having grown up in the NY area you get used to a local deli banging out killer sandos....this place could be SO GOOD but they keep missing . I won't return.\nThe one thing that they have that is good is the semolina bread....but it's technically not correct."], ["Decent Food and Prices , Wouldn't come Back", 3.0, "July 20, 2015", "Fernando B", "Bogota, Colombia", 26, 16, "Wanted to try out the place given the better than decent reviews however didn't come out impressed at all.\nThe place itself is more of a fancier style of subway with great variety of ingredients, however it wasn't clear if the options were clear set or whether you could add or remove a particular ingredient to the hoagie.\nThe place...\n\n\nMore"], ["Very good food, a DC standard", 5.0, "July 19, 2015", "DREW1188", "Staten Island, New York", 22, 13, "Apparently DC residents and workers love this place. The Washingtonians seem to to overly exited about places to eat and seem to accept high prices. However here you can get some very good sandwiches at reasonable prices. A better deal than any Subway and classes above. Whether you like meat or not there is something for everyone. The sandwiches we...\n\n\nMore"], ["Gourmet sandwich shops - go for their kale salads!", 3.0, "July 13, 2015", "MarySL00", "Washington DC, District of Columbia", 295, 151, "Very popular for lunches and late lunches, this location serves sandwiches, salads, and other quick eats. Their best plates are their complete salads with kale, choice of protein, etc, at decent prices.\nCheap eats (approx 10$) and all-natural sodas!\nBe ready to wait at lunch. Their numerical system for calling orders is unfortunately slow..."], ["Upscale Airs with Downscale Service", 3.0, "June 5, 2015", "Jay P", "Cruz Bay, St. John", 48, 20, "When Taylor first opened in my building, I'd get a sandwich from them almost every day. Unfortunately, after a few months, their staff became less competent, almost always getting my simple order wrong: wrong sandwich, wrong bread, etc. After the third time I brought the sandwich to the office, only to find it was the wrong kind, I gave up...\n\n\nMore"], ["Bread and cold cuts", 3.0, "March 18, 2015", "ManCapHill", "Washington DC", 42, 13, "I just don't get it. It's a long bun with thin cold cuts. No warm crisp melting cheese, just some salami and cheese thrown on a white bun. Claiming to be from Philly, which further adds to the confusion, since I'm not sure that town is known for any culinary invention except cheap sliced beef and cheese whiz on bread....\n\n\nMore"], ["Arancini are fantastic", 4.0, "March 17, 2015", "BluWater1der", "Tampa, Florida", 47, 24, "It's a sub shop chain. I hate chains. That said, try the arancini at Taylor's! A ball of fresh mozzarella, surrounded by short grain rice, quick fried till the mozzarella melts and the outside turns a slightly Orange color. Dip them in the spicy marinara and savor them."], ["Best Lunch spot for a sandwhich", 5.0, "February 10, 2015", "Alex C", "Alexandria, Virginia", 2, 0, "You can't be Taylor sandwiches for lunch. Usually crowded during lunch, but they kill a line quickly and you can order and get out the door in under 6 minutes. I get the 9th street (Italian) and it is in point. Always fresh."], ["Great Food Every Time!", 5.0, "December 10, 2014", "StacyInDC2012", "Alexandria, Virginia", 174, 56, "I eat at Taylor Gourmet once or twice a month and have never been disappointed in my food.\nFrom the sandwiches, to the salads, to the risotto balls - everything is full of flavor and yummy! My current favorite is the Logan Square Salad, which is seasonal and will be sorely missed when it goes away! The grilled chicken you...\n\n\nMore"], ["Just Barely Okay", 3.0, "September 10, 2014", "JillyWashingtonDC", "Washington DC", 7, 1, "Stopped in for lunch for an Italian sandwich. The line was long but moved quickly. The woman taking my order forgot to give me my bottle of water and my change. As I waiting for change, without missing a beat, she cleared the register of the amount of change to return, and started on the next person's order. It was...\n\n\nMore"], ["Great sandwich!", 5.0, "May 6, 2014", "BeBeWhy", "New York", 62, 13, "Terrific and fresh! Don't be put off by a long line. It moves quickly. Excellent quality for a very fair price."]]], ["Lounge of Three", [["All Hip Hop", 5.0, "September 30, 2015", "Superbad", "Pittsburgh, Pennsylvania", 18, 5, "Lounge of three is the place to be if youre looking for an all Hip Hop bar with good food great drinks and a diverse crowd of people"], ["Nice place; A little cramped though", 4.0, "January 18, 2015", "Hamptongirl1998", "Baltimore, Maryland", 52, 15, "This is a cool place to come listen to good hip hop and have drinks, but it is small and a little cramped. The dj is great, drinks are good, and there's no cover ."], ["DJ to Die For!!", 4.0, "December 16, 2014", "Natasha1076", "Richmond, Virginia", 8, 0, "If you enjoy hip hop (old and new) this is a great place!! It looks a little rough on the first floor but upstairs is more lounge like and the music is A++"], ["Great place to have a good time", 5.0, "November 27, 2013", "Shawn M", "Washington DC, District of Columbia", 3, 0, "This is a great late night place to socialize with friends, hear a good DJ and have good food/drinks"]]], ["The Liberty Tree", [["Fine", 3.0, "July 10, 2015", "Per H", "Give, Denmark", 37, 10, "I'll go with my teenagers favorite expression 'fine' for this restaurant. I maybe had a little higher hopes for this visit though. Food was good but no draft beer since the compressor had broken down. Staff was nice and funny but also bringing a quite dirty glass without noticing it and rushing us out of the door... So 'fine' it...\n\n\nMore"], ["Nice spot and a neighborhood feel", 4.0, "July 9, 2015", "ihatehaggis", "washington, dc", 38, 8, "There are some awesome apps and the pizza is thin crust and always tasty. I have enjoyed things like carrot soup, risotto balls, warm pretzels and other items. (The honey mustard sauce with the pretzels could be sold solo--so good!) My husband likes the lobster rolls. The menu does change and they have specials. Nice staff."], ["Dinner at the Tree", 5.0, "June 3, 2015", "Kimberly R", null, 2, 0, "This is an establishment that been around before H street was cool. The owner/ chef extraordinaire makes soul-food; he is an inspired chef with delectable thin crust pizzas with innovative toppings: My favorite is cauliflower, bacon, lemon ricotta...potato Gorgonzola pizza to name a few. He does a mean prime rib sandwich that falls apart like butter, killer burgers and give...\n\n\nMore"], ["The pizza was very good......", 4.0, "May 28, 2015", "maryallen99", "Rockford, IL", 58, 27, "Ladies weekend in Washington, we rented a townhouse. H st. was close by, so as soon as we got there, we explored a little and found this place for lunch. It was busy, so we figured it was good, and it was! Pretty reasonable. If you are in the area, go for it."], ["Deceptive exterior - good food", 4.0, "May 12, 2015", "Galear", "Pittsburgh, Pennsylvania", 9, 5, "Family recommended this restaurant to us and we were not disappointed. The food was very good, especially the clam chowder and lobster roll! The service was a bit slow because it was a Sunday night and they didn't have enough wait staff for the number of guests. However, we were not in a rush."], ["Great Restaurant on H St NE", 5.0, "February 18, 2015", "Shawn M", "Washington DC, District of Columbia", 3, 0, "So much to love about this place. The owner, Greg, is affable and always on hand to greet customers and ensure a great dining experience. The wait staff and bartenders are very nice and always attentive.\nThe menu has a New England flair to it (I haven't seen many other places that offer lobster as a pizza topping). I always...\n\n\nMore"], ["Good menu but so-so value and taste", 3.0, "May 17, 2014", "Holamobile", "Washington DC, District of Columbia", 81, 12, "Appetizers were good and the entire menu had a wide variety of tastes. The steak, even though we ordered medium, was a bit chewy and salty. Had a lot of churassco/ flank steak and it just wasn't cooked well. The short rob dish was ramen; not spaghetti. Ingredients were good but not for the price. Service was good."], ["A Return Trip in in Order", 4.0, "April 16, 2014", "TAC-Trek5200", "Silver Spring, Maryland", 14, 5, "Went to the Liberty Tree for a post-meeting dinner with a group of 16. They handled us really well. Had mussels with red curry and peanut broth for appetizer and grilled flank steak for dinner. Both excellent. Service was very, very accommodating for our big group. Want to return her for a dinner with my family!"], ["Will definately return.....", 4.0, "April 1, 2014", "C B", "Houson, Texas", 81, 15, "My daughter, who lives in DC, chose this as one of the many restaurants to visit on this trip. So glad we did......The atmosphere was welcoming and comfortable and the service quiet perfection. Our group tasted so many items including: the fried brussell sprouts which were fantastic. The goat cheese and beet salad was good, fresh tasting dressing etc...but they...\n\n\nMore"], ["Great experience -food and service", 4.0, "March 21, 2014", "HeleneDC", "DC", 62, 24, "Six friends who had not been together for a while enjoyed this casual restaurant. The relaxed atmostphere and excellent service (thanks Austin!) were a great way to start off our evening. Hearty appetizers were good and the sauces with the wings and brussels sprouts were unique and tasty. Onion straws are typical. Entrees were lobster rolls which the lobster lovers...\n\n\nMore"]]], ["The Graham Georgetown Observatory Rooftop Lounge", [["Top ten rooftops - really?", 2.0, "October 3, 2015", "ThatchersBiscuit", "Denver, Colorado", 284, 80, "I was surprised by how small this area was aftering the front desk staff telling how amazing it is. The service was pretty poor - you have to go to the bar for a drink and they were more concerned with how you were going to pay for it before they poured - no offer to charge it to your...\n\n\nMore"], ["Best place in Georgetown", 5.0, "September 2, 2015", "Phil P", "Fareham, United Kingdom", 129, 39, "Ended up in this rooftop bar quite by chance but very glad that I did. A great crowd with excellent atmosphere and drinks that whilst pricey are very good. A very enjoyable night."], ["Great Rooftop Space but Local Bars Offer More", 3.0, "August 24, 2015", "mdgirl86", "maryland", 47, 22, "We stayed at The Graham and enjoyed everything! It is a great hotel. The Rooftop Bar while awesome because of being an amenity and the views was a bit average. I will preface this and state we did experience the bar at around 4:30 - 5:30 pm. So, it was hot and starting to fill with more locals. The back...\n\n\nMore"], ["All 3 stars are for the view alone", 3.0, "August 13, 2015", "Nell B", "Baltimore, Maryland", 18, 29, "I really wanted to love The Graham. Traveled all the way from Baltimore for it. We picked this place for a nice after work Happy Hour. It fell short. Majorly. The primary complaint is there is NO food served on the rooftop. The view is amazing and it does provide the perfect back drop of DC but it would be...\n\n\nMore"], ["Awesome place for a night out", 5.0, "July 19, 2015", "Dariana D", null, 2, 1, "Nice view, great drinks and service! It can get busy pretty quickly, so it is recommended to get there early."], ["Nice view", 4.0, "June 8, 2015", "Celine_CT", "Hartford, Connecticut", 17, 9, "Went there to mingle with friends, fun scene, nice view and good drinks. The music was not as loud as a club would so it certainly allowed us to have conversation in a nice setting."], ["Spectacular", 5.0, "May 9, 2015", "Alexis C", "Fort Lauderdale, Florida", 21, 3, "View of the whole city, great breeze from the Potomac, you can See Kennedy Ctr., Watergate, Washington Monument,. Apparently a place to be seen if you live in Georgetown."], ["Great afternoon spot", 4.0, "April 26, 2015", "Ann B", null, 151, 48, "I have now been here twice and love the ambiance and view and service. Ram is so friendly and professional! I just wish they didn't allow smoking and would turn the music down a little bit so it is easier to talk - especially since I have only gone in mid-afternoon and it seems too early (to me anyway) for...\n\n\nMore"], ["Beautiful views", 5.0, "November 24, 2014", "Katsback", "Petaluma, California", 35, 8, "We were there just before they closed it down for winter. I imagine in the summer it's gorgeous. It gets cold and they can not put space heaters in for safety reasons. The view is amazing."], ["The Graham Rooftop", 5.0, "October 13, 2014", "Breegillespie", null, 6, 7, "I loved the atmosphere and the view from the Rooftop Lounge. It was fun and upbeat and a perfect place to have a few drinks!"], ["You are paying for the atmosphere", 4.0, "September 9, 2014", "SeatOfMyPntsTravelr", "Washington DC, District of Columbia", 492, 148, "Pretentious but the view is worth the expense and putting up with the clientele. The waitstaff were neglectful if you happened to not be \"dressed to the nines\" aka in club attire but the bartenders were great. What the waitstaff needs to understand is that in a city like DC you never know WHO someone might be regardless of their...\n\n\nMore"], ["the view", 4.0, "August 14, 2014", "Leigh C", "Enterprise, Alabama", 8, 1, "Awesome view and fun \"pretty\" people. Too young for me but my daughter and her friends loved it. Drinks were pricey but the staff was every bit as friendly and helpful as the hotel staff. Wish we could have found a comfy seat by the balcony but it was crowded-the \"in\" place to be."], ["Great Outdoor Lounge With A View", 5.0, "July 14, 2014", "cnswanson", "Coronado, California", 8, 2, "Fun outdoor bar to visit on top the the Graham Hotel. Amazing views to catch the sunset. The hotel is also a must place to stay."], ["Great spot", 5.0, "June 29, 2014", "beata92285", "philadelphia", 14, 8, "The drinks and view were great! We stayed at the hotel and on both nights started our night there. Gets pretty crowded so its better to get there early and grab ore of the small tables."], ["The Graham Rooftop Bar and Lounge", 5.0, "June 24, 2014", "V Wayne Speedy L", "Richmond, Virginia", 130, 45, "Outstanding service and a tremendous view at night of the Washington, DC skyline. Very confortable couches to sit on while enjoying your favorite drink."], ["Not sure what the hype is", 1.0, "June 12, 2014", "Amy B", "Tampa, Florida", 62, 31, "Lousy service and expensive drinks on this rooftop bar. Nothing spectacular.\nWe arrived on a fairly slow Sunday afternoon and found seats ourselves (we weren't' as young and trendy as the rest of the clientele, so perhaps they hoped we'd simply leave), we sat for a while and eventually the bar tender shouted as us from behind the bar (the...\n\n\nMore"], ["Great view...not so good service and food.", 2.0, "May 10, 2014", "Cr8joy", "Indianapolis, Indiana", 67, 20, "We were invited to a dinner for about 25 people at the Graham to celebrate the recent marriage of our friend's son. The evening started out on the rooftop which does have a great view of DC. However, it was very crowded even though we had a reserved space. The appetizers were good...nothing extraordinary.\nWe then moved to the basement...\n\n\nMore"], ["Kitchen Never Has the Food Offered on Menu", 3.0, "December 27, 2013", "JosephDC2013", "Washington DC, District of Columbia", 1, 0, "not sure why, but the last few time I dined at the restaurant, some of the food is not available. Management might want to look into this or take the items off the menu."], ["Incredible view and classy", 4.0, "August 28, 2013", "Brett H", "Ponte Vedra, Florida, United States", 2, 0, "The atmosphere was incredible. Classy patrons and staff. Weather was fantastic.\nDrinks were overpriced..."], ["The staff sucks!", 1.0, "August 1, 2013", "Shonmee", null, 2, 2, "Very arrogant staff for no reason. The doorman is super rude. I will never set foot back in this establishment. The bar downstairs is kind of small. The rooftop is nice but the dress code is a little sketchy. Do you really want to sit outside in 90 degree summer DC humidity with close toe shoes? No thanks."], ["Rooftop Event", 5.0, "July 18, 2013", "D H", "Washington DC, District of Columbia", 1, 1, "This July we hosted a birthday party for my daughter and 55 of her friends on the hotel's Rooftop and were beyond impressed by the way the entire event was handled. Everyone from the Event Coordinators to the Doorman to the Front Desk was involved in making the party a success. At our first meeting with the Catering Sales Manager,...\n\n\nMore"], ["Overinflated Everything", 1.0, "June 22, 2013", "JCC608", "Charleston, South Carolina, United States", 1, 3, "Big attitude, dirty drink glasses, overpriced food and drink make this a place to avoid. The great view comes at a price. It is the price of dignity from all of the surly staff and bouncers. Spend hundreds of dollars to stay at the hotel and all you get is attitude.... and even a great bar view can't make that...\n\n\nMore"]]]]