[["Yogen Fruz", [["Confusing choices but always delicious", 5.0, "August 23, 2013", "Loveacorona", "Fredericksburg, Virginia", 221, 73, "My favorite is green tea yogurt with fresh blackberries. But, there are many choices if you can figure out how to order."], ["Great pick me up place", 5.0, "April 17, 2013", "bandmanjp", "Winter Haven, Florida", 222, 68, "This place was right nest to our hotel, so we went there twice. The yogurt was great. They actually let you pick out the fruits you want in it and they mix it in. Very good. They speak NO english. You just point to what you want."], ["Good yorgurt", 3.0, "October 19, 2012", "Lori O", "Pearl City, Hawaii", 54, 27, "It was good but, since you are in the business district we did not get to try it until Tuesday (Monday was a holiday). It fits the bill but, would not go out of my wasu for it."], ["Good yogurt", 3.0, "July 20, 2012", "albinofaerie", "Grand Rapids", 13, 3, "This frozen yogurt shop was next to the hotel, and it was hot, so we stopped in. Good yogurt- kind of pricey, but it's DC so that is to be expected."], ["Too tangy for my tastes", 3.0, "June 8, 2012", "frieda-f", "Greensburg, PA", 171, 88, "My expecatation was more TCBY and this is a lot different. It was okay, but I probably wouldn't return."], ["Yummy!!", 5.0, "June 7, 2012", "BMT451", "Bedford,Texas", 8, 16, "We always missed the open times & close times but the one day we got a chance.. It was fantastic."], ["yogurt, yum", 5.0, "April 9, 2012", "Kaye H", "Brisbane, Queensland, Australia", 30, 22, "Choose frozen yogurt and topping excellent...... we had a great time"]]], ["Chipotle Mexican Grill", [["Predictable but always fresh incredients", 3.0, "October 1, 2015", "hakccmd", "Chevy Chase, Maryland", 58, 9, "Novelty waring off with competition on the same block. Beefsteak just opened. Quality above average for bargain price and best for carry out."], ["Chipotle rocks, but this particular store does not...", 3.0, "August 19, 2015", "Aelwyn", "Tallinn, Estonia", 102, 137, "I love Chipotle. Fast, simple and good. It's hard to mess it up but I've been to this particular store twice recently as I'm in the area for business and this store seems disorganized, the employees are inattentive and it always looks like a little cleaning is in order. I love the Chipotle brand and the food, but I have...\n\n\nMore"], ["Typical Fair", 3.0, "August 18, 2015", "thespottedtraveler", "Minnesota", 137, 50, "I figured for a Chipolte, they would be great, however they missed my lettuce from my online order, and we had to wait in line even though we ordered online. A little disappointing"], ["Fresh & Delicious", 5.0, "May 15, 2015", "Debbie M", "Sacramento, California", 35, 9, "Fresh,quick and delicious, you know when you just don't want to spend alot on a lunch or have table service. This was one of those day! Its nice you pick from the many choice's what you want on your burrito/bowl."], ["Super Yummy", 4.0, "February 12, 2015", "global_teach", "Toronto, Canada", 74, 69, "I love this place. Very fast, very good, California-style Mexican. I loved my steak burrito, though it should be heated up a little given that the cold sauces cool it down a lot."], ["Online Order- what's that?", 2.0, "November 25, 2014", "TheAdventuresofET", "Washington DC, District of Columbia", 25, 36, "This location changed for the past year, especially with the customer service. Terrible customer service. Complaints sent to management but no action from them.\nDon't bother ordering online. They won't do your order until you actually go to the location to pick it up. Went there during their non-rush hour (so no customers in queue).The online ordering was a total...\n\n\nMore"], ["Fast and fresh", 5.0, "October 4, 2014", "Benjamin B", "Kigali, Rwanda", 233, 81, "We live overseas in the land of no good Mexican food. We come here everytime we come through DC and the food is always fast and fresh--it doesn't hurt that our early morning arrival puts us at the store right at 11am! Yummy!"], ["Great value", 5.0, "September 18, 2014", "sbf67", "Brisbane, Australia", 31, 11, "After seeing this fast food joint full of construction and other workers every time I passed one, I gave it a go - wow was it good - full of flavor and great value for $7.50 for the sofritas bowl."], ["Fast and Good", 5.0, "August 9, 2014", "Travelergirl998", "Baltimore, Maryland", 189, 94, "When you have been walking around town all day, this chipotle is exactly what you want. One of the only fastfood joints in this area, its great to grab a quick bite and keep moving. Also surprisingly one of the few chipotles that actually has enough seating for the crowd that it attracts"], ["Reliable, affordable, fast", 5.0, "July 30, 2014", "shannonadcock", "Clinton, Tennessee", 31, 8, "Reliable Chipotle in DC. DC locations have a tofu option as well. High-quality ingredients, made to order burritos, tacos or bowls."], ["Consistent Chipotle Quality - friendly location!!!", 4.0, "July 19, 2014", "kcroadtripper", "Kansas City", 78, 23, "Low cost option for family of 4 in DC. Consistent Chipotle Quality that we are used to, everyone gets their burrito how they like it = HAPPY!!! This location is actually friendlier than many locations we have been to at home and while traveling. Interior not as welcoming as others, but it was fine. Just north of the Q St....\n\n\nMore"], ["my go-to Chipotle that doesn't charge extra for more rice or tortilla", 4.0, "January 3, 2014", "jg325", "WashingtonDC", 489, 320, "I love Chipotle, and this is my go-to Chipotle. Unlike the other Chipotles around in Union Station and Farragut West, etc, this one does not charge for extra rice for extra tortillas. I've been going to Chipotle for years now, and the service at this outlet is almost always friendly and responsive. I have never really had an issue with...\n\n\nMore"]]], ["The Living Room", [["Not your average hotel lobby!", 5.0, "August 24, 2015", "Rob D", "Emerald Isle, North Carolina", 7, 3, "Great place to meet. Not your average hotel lobby. Comfortable but hip. Good place to have a drink and conversation."], ["Interesting decor and flashy lights", 4.0, "February 17, 2015", "peggy b", "Tallahassee, Florida", 43, 18, "The decor is fun and colorful, the lights flash and the music ranges from funky to pretty electric. I had a nice evening relaxing with a couple glasses of wine and a book. If you want to just chill for an hour or so, I think it is nice. Most of the time, talking was easy and audible. the staff...\n\n\nMore"], ["expensive but great location and service", 4.0, "October 10, 2014", "Jenofwaukesha", "Waukesha, Wisconsin", 117, 35, "comfortable surroundings,room to spread out, and quiet enough to hold a conversation. Chairs are comfortable and bartenders nice and make a good drink."], ["Comfort with flashy, hip vibe", 4.0, "August 31, 2014", "architect95", "California", 64, 49, "NOT. A quiet space to sit and chat with constant LOUD music and images flashed onto walls. Drinks are good, food is average."], ["Its great atmosphere", 4.0, "March 4, 2014", "kastroforjoe", null, 25, 2, "Living room say it all. You must visit living room is allways warm and welcome for everybody great. Location loots of fun. And loots of drink to try"]]], ["H Street Country Club", [["Fun dive bar!", 5.0, "September 22, 2015", "Jski529", "Lincoln, NE", 480, 140, "This place is a blast. They have all kinds of fun games to play including skee-ball, jenga, shuffleboard, mini golf and more. The drink menu is impressive and the service is stellar!"], ["Rooftop and more", 4.0, "September 7, 2015", "Leah K", "Fairfax County, Virginia", 52, 11, "While there are several bars throughout the city that offer air hockey, pool and other such table top games (which h street has) there are are no other bars that have indoor mini golf, making h street country club the ultimate activity spot.\nThis bar also offers you the options between a game bar, restaurant and rooftop bar environment as...\n\n\nMore"], ["Great bar, except for one bartender", 4.0, "July 13, 2015", "Rachel N", "Washington DC, District of Columbia", 72, 20, "We were at H Street Country Club for a few drinks and having a great time on the roof top. It's a great scene! I would have given this place an \"excellent\" rating if it hadn't been for Jay the bartender.\nJay has a serious attitude problem. I asked for a gin and soda with lime. When he served it...\n\n\nMore"], ["Great local bar", 4.0, "April 9, 2015", "Toni H", "Cedar Rapids, Iowa, United States", 76, 41, "I took my niece out for drinks and an early dinner. The weather was perfect so we sat on the roof top terrace. Great view from up there. I ordered the taco platter with 1 pork, fish, and brisket taco. The fish in the taco was salmon, which is different from the normal white fish most places use, but good....\n\n\nMore"], ["Mini Golf and buckets of PBR!", 4.0, "February 9, 2015", "ColonelTim", "Evansville, Indiana", 58, 28, "OK so maybe it was because this was the last stop on a long day but this place is fun. I mean indoor mini golf and a bucket of ice cold PBR. If that is not your idea of fun go back to your organic cider and tofu stir fry because this place is not for you."], ["Awesome Neighborhood Bar and Restaurant", 4.0, "December 17, 2014", "jesindc", "DC", 43, 68, "We often come here for lunch or brunch. We bring our two kids when we go during the day and they absolutely love to play skeeball, buck hunter and play to occasional round to mini golf. While I wouldn't call it a \"kid-friendly\" bar, it is certainly kid-tolerant during the day so long as your kids are under control. The...\n\n\nMore"], ["Not in the Country and Hardly a Club", 2.0, "August 31, 2014", "luv_big_cities", "Washington DC", 46, 49, "Most of DC's butthead bars for the barely legal are in Adam's Morgan. H Street Country Club is an exception. Located next to the Atlas Theater/Jazz Venue, on H Street NE, you might be tempted to give it a try after an alternative artsy night on the town. Beware. Unless you are under 25, read less than 1/4 of your...\n\n\nMore"], ["A little adventure", 4.0, "August 20, 2014", "willa66", "hartsdale, ny", 24, 18, "I read about the minigolf course in the NYT, and since my family and I have been to DC many times, seen all the major sights and we love a fun round of minigolf, we decided to check it out. It was a fun adventure because it is way off the tourist route in an area that is probably what...\n\n\nMore"], ["Rooftop bar is awesome!", 4.0, "May 28, 2014", "mickij3", "Southfield, Michigan", 98, 40, "This place is really cool. Great drinks, good food, and a rooftop with an amazing view of the city! At dusk is the perfect time to grab a drink and enjoy the laid back vibe. The nachos are huge so come with an appetite or a few friends!"], ["This is no country club! This is a very old bar w/ one room putt putt.", 3.0, "May 18, 2014", "Donna F", "Enterprise, Alabama", 96, 72, "So, we were in DC visiting our adult children. We wanted a little fun and searched for putt putt golf, only found ONE place, H Street Country Club. Said it was a restaurant?? More, it is an older bar....but they have a Mexican menu. We had the chips and salsa, very good actually...chips, pico, fresh guacamole, pumpkin seed dip for...\n\n\nMore"], ["Great Happy Hour spot", 4.0, "April 27, 2014", "CTravs", "Washington DC, District of Columbia", 40, 26, "I've been here several times, with different experiences. I've had drinks on each of the 3 floors and their happy hour is a great deal. $5 margaritas, $3 beers (2 kinds). The snacks are not only great, but they show up quickly. I would definitely watch the bill though, as more than once I have had people's drinks or food...\n\n\nMore"], ["A fun evening!", 4.0, "March 31, 2014", "Fossettes", "Barrington, Rhode Island", 120, 47, "Came here for dinner and a round of golf (!) with friends and had a great time. The margaritas are good, especially if you like them not too sweet. The food was hit and miss. Chips were great! the guac needed something (we added salt). The Cochinita Pibil was outstanding. The fajitas were good. The mini golf is a blast!...\n\n\nMore"], ["Decent Mini-Golf", 2.0, "March 2, 2014", "virginiagamer", "Westbrook, Maine", 202, 71, "We came here for the mini-golf rather than the food, so I can't speak about the Country Club as a restaurant. I was annoyed that the guy at the door gave us a hard time about the fact that one member of our party did not have her ID on her, even though it was very clear we were all...\n\n\nMore"], ["So much fun!", 5.0, "December 19, 2013", "fenchurch128", "Boston, Massachusetts", 182, 83, "Although this listed as a restaurant, the H Street Country Club offers so much more. What I'll remember about this place is the epic game of Washington-themed mini-golf on the second floor. There's also shuffleboard and skee-ball, plus some great Bloody Marys! Bring your friends and you'll have a blast."], ["You can't go wrong with mini-golf!", 4.0, "November 10, 2013", "milady112", "san diego", 13, 3, "Though not quite what we were expecting, this ar had a kind of hip feel and the margaritas were totally spot on! Try the mini-golf, at 7 dollars a round you can't beat it, and the funky upstairs course will take you through all the important places to see in DC!"], ["One of DC's Most Unique Bars", 4.0, "September 12, 2013", "Kristen N", "Los Angeles, California", 53, 36, "What a funky little place! There are plenty of neat places up and down H St, but this one ranks high on my list of those I have visited so far. Both times I've gone, I've gotten excellent service and had a fun time. Most recently, I went on a Tuesday, when it's Happy Hour ALL NIGHT and you get...\n\n\nMore"], ["Funky with Mini Golf", 3.0, "June 13, 2013", "Travis B", "Washington, DC", 36, 22, "The place has some decent food. The bouncer can be irritating on most nights, but there is an interesting funky bar upstairs in addition to a fun mini golf course. Buy your ticket at the bar downstairs and you'll get your club and golf ball."], ["Lively Bar Decent Food", 4.0, "May 25, 2013", "bagnato1", "Olney, Maryland", 431, 115, "Stopped by before a show at Atlas Performing Center next door. Had guacamole, which was excellent (the chips were fresh and good, too). Loved my margarita. Creative and tasty. Lively, fun crowd."], ["Fun spot", 4.0, "January 3, 2013", "douglas r", "west newton", 53, 19, "The best part of this bar which is found very few and far between are the shuffle boards. I could have played that for abour 8 hours straight. They have a couple other fun game there. The bar is pretty wide open, so it doesnt get too tight. The bar itself is quite long. The bartenders were all nice. They...\n\n\nMore"], ["Funky fun... but stay away from the marguerites", 4.0, "October 1, 2012", "mai2centsworth", "San Diego, California", 145, 71, "Last weekend hubby and I decided to go on a date and explore the new H Street corridor. I'd been hearing about it for a long time and he wanted to see what all the fuss is about. So, I pulled a list of \"happenings on H Street\" from the Internet and off we went. First stop was the H...\n\n\nMore"], ["Go for the games and beers with friends, but this is not a \"restaurant\"--the food and service are mediocre.", 3.0, "July 22, 2012", "chantiwa", "Washington, D.C.", 22, 12, "After a fun night, here's our advice: keep in mind that you're going to this place to play mini-golf and drink beer (or margaritas) and have a goofy/relaxed evening. Yes, the ambience is kind of fratty. But sometimes it's fun to shake things up a bit from sophisticated wine bars and romantic dinners--we had fun! The mini-golf is $7/person. You...\n\n\nMore"], ["Unique fun bar that is relaxed and offers a good time every night of the week.", 5.0, "April 10, 2012", "231anonymous", "Washington DC, District of Columbia", 27, 24, "Skeeball, shuffleboard, a killer selection of elite tequilas, and very friendly, funny bartenders make this spot one of my favorite DC drinking spots both on Monday and Friday nights."], ["Rude Staff, Poor Service", 1.0, "January 10, 2012", "rubyred582", "Philadelphia", 33, 14, "We were so excited to go to the H Street Country Club after more than one person had recommended it to us. We arrived early to play the mini-golf course, which was a little beat up, but a decent way to pass the time. We sat down at our table and ordered our food. After 30 minutes, our server came...\n\n\nMore"], ["A great, funky place worth the groupon!", 5.0, "December 14, 2011", "Phykos", "Atlantic City, New Jersey", 210, 140, "My friend who lives in DC purchased a groupon and suggested we go when I was in town for a visit. The first floor has pool tables, air hocky and skee ball, as well as an ample bar. Upstairs is where the magic happens with the 9 hole mini-golf. I don't know how they managed to fit it all in...\n\n\nMore"], ["Fun in the funky Altas District...good food, great drinks", 4.0, "July 3, 2010", "food_chick1", "MD, DC metro", 69, 24, "I like this place. It's always a good time. I've been back about four times. First time was for drinks and mini-golf on a Saturday night. The place was packed! Another time was Fri/Sat evening, it was busy, the chips and guac were yummy (as always) and the Pimms were tasty. Pimm's cup is their signature drink and I confess...\n\n\nMore"]]], ["Sweet Green", [["Great Salad place", 4.0, "August 30, 2015", "LondonTherapy", "London", 67, 54, "Great friendly staff. I had the Blue crab salad which was lovely although a little over-powered by the medium salad dressing and it could have done with a little more crab, however very tasty."], ["Service was pretentious but worth the experience", 4.0, "April 4, 2015", "Kriscash", null, 28, 9, "The food speaks for itself...ultra healthy, mainly gluten free yumminess! If I lived here, it would be lunch several times a week! I love salad done right...service egh..but I get it..."], ["Lots of hype ... not impressed", 3.0, "January 29, 2015", "TheBeaches2013", "Singapore, Singapore", 12, 21, "I guess I'm not super \"green\" because I just felt like something was lacking here. The concept would be good if the food was outrageously good, but I felt like I was on an episode of masterchef where they are trying to do the best with what they had ... it wasn't bad, it just wasn't memorable in any way."], ["Lunch", 4.0, "January 6, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "I really like this place. And this location is very convenient, just across the Whole Foods.\nIf you are looking for a light and healthy meal this is the right place. Recently I noticed that they add soups to the menu. I tried the lentils soup. A bit spicy. Delicious.\nI also had a frozen yogurt. Very good."], ["Good meal", 4.0, "September 14, 2014", "fizzengland", "Bournemouth, United Kingdom", 69, 34, "Ate here when we arrived in the evening from the Uk. Just around the corner from out hotel so we had researched our options for eating a good but informal light meal . Sweet greens did not disappoint. On a buzzing and safe P Street .Good quick service , very helpful , great salad . Would return , would recommend"], ["Farm to Table", 4.0, "September 1, 2014", "Kateinshanghai", "Shanghai, China", 51, 33, "I love the fresh option of farm to table food. The salads are a bit pricey, but worth it for the freshness, flavor, and healthy quality of the ingredients. It is also fast if you are really hungry and don't have much time."], ["Excellent Quick Lunch Salad", 5.0, "April 21, 2014", "Stewie55", "Ottawa, Canada", 66, 46, "Wow. The salads here are spectacular, flavorful, spicy if you want that, and also very filling. I think most people get their food to go, the small wearing area inside wasn't crowded. Quick service tho, the staff move the lunch line fast."], ["Great alternative to hotel food", 4.0, "April 20, 2014", "flimtx", "Austin, Texas", 14, 8, "I was staying at a hotel in the Foggy Bottom area, and didn't want a big expensive hotel restaurant meal. Sweetgreen offered a great, healthy, and tasty alternative. Bonus that they are open late."], ["At foggy bottom location", 4.0, "March 9, 2014", "nycmom22", "new york", 889, 250, "Wonderful outdoor seating. They will not chop you salad. Go to chop't for that. Very fresh ingredients. A little trendy. A little pricey."], ["Delicious", 5.0, "September 3, 2013", "Kelley M", "Overland Park, Kansas, United States", 14, 7, "They allow you to make your own salads with lots of fresh options. Be careful, because you pay by item and it can get pretty pricey."], ["Great Salads and Frozen Yogurt", 4.0, "August 25, 2013", "marsle", "Georgia", 228, 116, "I really like this concept with many choices! I loved my salad with kale and spinach greens plus toppings of watermelon, heirloom tomatoes, sweet red and green peppers, and sunflower seeds--the possibilities seem endless. You also chose your \"made in-house\" salad dressing.\nIf you don't want to \"make your own\" salad choices there are options like the Kale Caesar, District...\n\n\nMore"], ["A multi-unit DC based chain that delivers on its promise", 5.0, "August 2, 2013", "D_in_DC20005", "Washington DC, District of Columbia", 35, 6, "Here they ask you what kind of lettuce you want, what you want in it and mix in the dressing you prefer.\nThe ingredients are truly superior which justifies the slightly higher price than you normally pay for such a salad.\nWe have eaten there many times - can't remember a single bad experience. You won't be disappointed."], ["Trying to be thin? Eat here. Eat little.", 3.0, "July 5, 2013", "meijiqueen", "portland, oregon", 110, 23, "This restaurant with a particular vision of itself attracts many take-out customers, and a few eat-in. The salads were heavy on greens and not so heavy on the additional substances. Maybe it works for lunch, surely not for dinner."]]], ["Full Kee", [["Ordinary food and service.", 3.0, "October 2, 2015", "Bob S", "Townsville, Australia", 149, 76, "By the reviews on the way in, you'd think we were about to get traditional Chinese fare worthy of the best chefs in the country. What we got was far from that, ordinary food and ordinary service.\nLemon chicken was dry and disguised by bein drenched in the sauce, the fried rice was boring and tasteless and all other items...\n\n\nMore"], ["Not worth eating here!", 1.0, "September 2, 2015", "VW_Treffen_Traveler", "Santa Ana, California", 19, 20, "Please do not eat here, it is not worth your money. Panda Express would rate a 10 if you compared this food. This would be a 1! I ordered the lemon chicken and it is the worst I've ever had in all my years of eating Chinese food. It looks as if they made lemon jello that didn't harden and...\n\n\nMore"], ["fast, hot, good Chinese in Chinatown DC", 4.0, "August 18, 2015", "Tubman74", "Memphis, Tennessee", 169, 52, "Subwayed myself downtown late on a Sunday evening to escape my suburban HQ of 3 days for a brief sightseeing walk & a genuine Chinese meal, inspired by my exiting at the \"Chinatown\" transit stop. After a bit over an hour stroll, by which time darkness had arrived, I looped back around the north side of the Verizon Center (built...\n\n\nMore"], ["Worth a visit", 3.0, "August 17, 2015", "Bikafella1", null, 19, 9, "We were recommended this Chinese restaurant in the Dorling Kindersley guide book to Washington DC which we rate highly for all our foreign city trips. Contrary to the book, there are quite a few Chinese restaurants in the DC Chinatown area, so have a hunt around for one you like the look of. This restaurant was very clean and service...\n\n\nMore"], ["Worth a visit", 4.0, "August 4, 2015", "Carlos C", null, 30, 16, "Place is not attractive from the outside but the food makes worth the visit !\nPortions are generous and the food is tasty."], ["Pleasantly surprised", 4.0, "July 19, 2015", "Martha M", "Poughkeepsie, New York, United States", 37, 12, "It doesn't look like much from outside, or really on the inside. The wait staff are not polished. However, it is very authentic, family run restaurant. They seemed to have a lot of regulars coming in for dinner or take out. There was a huge selection of entrees/specials on the menu, many featuring fairly exotic ingredients (at least for me)....\n\n\nMore"], ["Hugh Portions!", 4.0, "July 10, 2015", "Sheila D", "Hondo", 11, 3, "After sightseeing all day, a stop at Full Kee is worth the wait! They have an extensive menu of chinese delicacies that would delight any appetite! The portions are big enough to share with everyone at the table and still have some to take home! Enjoy!"], ["Good Lunch Menu $7", 4.0, "July 1, 2015", "hmeschoolr", "Nashville, TN", 12, 26, "I never would have picked this place blind to walk in but it was very good. We ordered off the $7 lunch menu. There were probably around 15 entrees to choose from and it included fried or white rice. Three of us each ordered something different and shared. It was more than we could eat. The beef and broccoli, chicken...\n\n\nMore"], ["Good local joint", 4.0, "June 9, 2015", "bfchef", "Jacksonville, Florida", 399, 89, "My family and I needed a good Chinese meal and this place fit the bill. It's no frills but nicely prepared meal with a big menu. I did learn that not everything is available so if you want any of the market priced items, call in advance to see if they have them."], ["Walking distance from convention center; good food", 4.0, "May 25, 2015", "love_HNL", null, 97, 51, "Was at a meeting at the DC convention center and craved some Chinese food. Was not disappointed. Good service and good food. The won ton noodles were really good - especially the noodles. Hong Kong style - a bit crunchy and refreshing. Beef chow fun was also good. Would recommend!"], ["good lunch", 4.0, "May 21, 2015", "Gallo03", "Amsterdam, The Netherlands", 95, 36, "After spending a long morning touring the highlights of touristic Washington we walked over from the mall to china town and asked the lonely planet for advise on where to eat.\nI am glad we did, authentic good Chinese. Specially liked the peking duck very much"], ["Average restaurant", 3.0, "May 9, 2015", "trustinginHim07", "Chicago, Illinois", 68, 18, "I read the reviews and I was excited to eat here. The sauce for the Fried Dumplings was a little too sweet. I was excited to eat the baby clams in black bean sauce but it was mediocre. My husband liked the combination fried rice and seafood combination with mixed vegetables. I thought the combination fried rice was just average....\n\n\nMore"], ["Chinese Heaven", 5.0, "May 6, 2015", "gageman2014", "Hot Springs,Va", 5, 0, "Restaurant very poular with locals. Average meal over 16.95.\nLunch special till 3pm 7.00\nRestaurant protected by a Daoist deity-great for Daoist diners.\nWhole cooked duck displayed. Just went to zoo-not appealing. Kept thinking of zoo Waddles...\nOverall food very good and service good too. Deep fried squid very good!"], ["Great Chinese Food for a Reasonable Price", 4.0, "April 13, 2015", "sixshoots", "Garden City, New York", 95, 54, "From the outside, this restaurant is nothing to look at. But do go in and you will enjoy a very good traditional Chinese dinner for a very reasonable price. The pork fried rice was very fresh and good as was the lo mein. Spring rolls a little on the greasy side. The kids changed up a few menu items and...\n\n\nMore"], ["Can't say enough", 4.0, "April 3, 2015", "Michael C", null, 4, 1, "The food is great. The service was efficient. A member of our group from China was thrilled with the authentic offerings. Pizza have always considered the Full Kee a must when visiting DC. A recent visit gave me another reason to love this establishment. A member of our party accidentally left a cash envelope with a few hundred dollars on...\n\n\nMore"], ["\"Pho\"good!!!", 5.0, "January 31, 2015", "aliciafurrow", null, 33, 14, "Oh my God, where do I start about this restaurant? Every time my man and I come up to DC we come to this restaurant specifically for the pho it is so outstanding it's ridiculous! We will always come to this place in Chinatown to eat every time we come to DC"], ["Baby Clams and Black Bean Sauce!", 5.0, "January 21, 2015", "knight1431", "Baltimore, Maryland", 4, 5, "My co-worker has been telling me about this place for several months now, I finally drove by on my way to work and got the Baby Clams and Black Bean Sauce and it was great. I also had the Baby Snow Pea Leaf Greens. I recommend this restaurant. They also have a lot of soups to try."], ["Yum yum", 5.0, "January 16, 2015", "KC7100", "El Paso, Texas", 102, 56, "Went there straight from airport after dropping of bags at hotel. Ordered soy source chicken and wanton noddle soup for dinner. I like Cantonese food and this is fantastic. Portion is just right. This restaurant has no coat rack. Warning: waitress checked the amount you tip (physically counting $) when you handed the transaction. The 5 star rating is for...\n\n\nMore"], ["Authentic Chinese restaurant!", 5.0, "December 30, 2014", "Simonizer_Lezachez", "Montreal, Canada", 41, 10, "Recommended by Lonely Planet, this restaurant was full of Washington asian residents. As entry, we had a delicious sweet & spicy soup(highly recommended). We ordered duck (their specialty) and chicken noodle. Everything was awesome !The portions are big so arrive here hungry ;)"], ["Reasonable price and very casual", 4.0, "December 17, 2014", "wulan", "Jakarta, Indonesia", 30, 6, "This is the place I go whenever I want to eat Chinese food in DC. The restaurants serve good Chinese food with reasonable price. I love their chicken fried rice with salted fish, steamed fish, and many more. the atmosphere is very casual, so don't come here in suits. It opens early and closes very late - at 2AM!"], ["Lunch was Good Value but not a Place for Business Meals", 4.0, "November 20, 2014", "johnmoore4", "Aberdeen, Maryland", 64, 27, "We came as an office group after attending an appeals case in Judiciary Square. We felt slightly out of place being dressed to the 9s, where others at this restaurant who were also coming from court like us had changed to dress down. I could see why. There is nowhere to hang your good suit jacket or dress overcoat. You...\n\n\nMore"], ["Good authentic Cantonese Chinese food", 3.0, "November 11, 2014", "Tennie D", null, 2, 0, "Good authentic Cantonese Chinese food at a reasonable price. The signature item is Cantonese wanton with noodle in dried-fish broth. Stir-fry and pan-fried dishes are good too."], ["Food is ok", 3.0, "November 7, 2014", "milton919", "San Francisco, California", 190, 49, "I read some reviews that said this place has some of the best won ton noodle soup anywhere so I was eager to try.\ni ordered the beef brisket won ton noodle soup and it was just ok. Co-worker ordered the steak cuts and broccoli and thought it was good."], ["Wouldn't Go Again", 3.0, "November 1, 2014", "Ron D", "Los Angeles, California", 133, 53, "We went with friends who raved, but we found it to be uninspiring. It is very down to earth, so that was fun. And the service was good and friendly. But the food was bland and did nothing to wake up my taste buds."], ["Interesting..", 3.0, "October 8, 2014", "Mary-Anne C", "Montcaret, France", 86, 32, "My husband and I don't normally eat Chinese food as previous experiences haven't been that good, even in China! But we were invited by people, who know about and like Chinese restaurants, to try Full Kee with them. The place was full, always a good sign, the décor was restrained and the tables just wipe-clean formica. There was a pleasant...\n\n\nMore"], ["Dirty and Disgustingly Gross!", 1.0, "September 2, 2014", "TravelChic411", "USA", 4, 8, "Don't go to this restaurant if you value cleanliness and service! Our teenage daughter had a chunk of something in the bottom of her water glass and then to top it off she found a hair in her cup of friedrice! The service is disconnected and we knew it wasn't even worth it to say anything to our waitress......this place...\n\n\nMore"], ["Amazing Chinese food in Washington DC", 5.0, "September 2, 2014", "Theringleader", null, 2, 0, "Bring a visitor from Toronto Canada , I was craving some good Chinese food on a rainy hot Sunday night in Washington DC .\nThe food was just incredible and the cheerful help were just a pleasure, this place is on my list of where to eat when I come back to Washington, hopefully soon them later ."], ["Ok", 3.0, "August 13, 2014", "Nathan M", "Santo Domingo, Dominican Republic", 36, 16, "Was there for lunch, much cheaper than eating at the Smithsonian Museums. Ordered beef tripe and chinese broccoli. Pretty good, no complaints. Roast duck, forget it. Looked like soy sauce chicken, not crispy at all. I love duck fat, but way too fatty. Staff was nice, she gave my son a fortune cookie to keep him busy.\nI guess it...\n\n\nMore"], ["Good food, fast service", 4.0, "July 2, 2014", "mrsjpvan2", "San Francisco Bay Area", 18, 3, "The food was served fast and hot. Generous portions and my favorite was the pork fried rice. Good dry braised string beans."], ["Pretty good for DC's Chinatown", 4.0, "June 25, 2014", "annapolissailing", "VA", 89, 33, "Not bad for a Chinatown restaurant that has been here for awhile. The place/decor is a little bit worn, but the bathroom is fairly clean - which is not always the case in Chinese restaurant in the city. The staff was friendly, efficient, and helpful. The food was good, not stellar, but good.\nThe lunch prices were reasonable and the...\n\n\nMore"], ["Good Chinese food at a great price", 4.0, "May 31, 2014", "kpfitzma", "Savannah, Georgia", 54, 26, "I always enjoy eating at Full Kee when I am in DC. I always take a group of friends and hop on the Metro and get off at the Galleria China Town station. He walk a block and enter this great little Chinese restaurant. Good food, good service, good prices and a great location."], ["Best Chinese I ever had", 5.0, "April 17, 2014", "Elmom1", null, 8, 6, "Not fancy by any means, but the food was fresh and delicious. Best chicken fried rice ever!\nHad two kids with me, so we kept it simple, ordering pork Lo Mein and Wonton soup with the rice. Very genuine, decent service. It's in the heart of Chinatown, easy to get to from Metro stop at Gallery Place. As is the...\n\n\nMore"], ["Fodor suggested, I would not", 3.0, "March 27, 2014", "Kathrynhjones1", "Montgomery, Alabama", 15, 9, "My husband and I made the trek to Chinatown to eat at Full Kee because Fodor's DC guidebook said it was a good place to eat for Chinese food in Chinatown and that it was special and affordable. While the service was great, the food was just ok. I feel like of the many Chinese and Asian restaurants in this...\n\n\nMore"], ["A Sizzling Dish without Sizzle!", 3.0, "January 31, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Ever since I moved to DC over 2 years ago, upon my first trip into Chinatown, which is not a real Chinatown to me by comparison to other Chinatown in London, Paris or other cities in the states. On top of that I had a terrible lousy meal in a restaurant that won an award from the Washington Post, I...\n\n\nMore"], ["Disgusting", 1.0, "January 19, 2014", "danieljcohen", "Philadelphia, Pennsylvania", 83, 23, "Nothing looked fresh - not even the Ducks in the Window. They only gave 4 pancakes with peking duck and then charged for more.\nSoups and spices were offensive and they didn't even care when they picked up plates and should have noticed that most of the food was left behind.\nGross"], ["Good Food", 4.0, "January 5, 2014", "Queenwondergirl", null, 75, 21, "The decor is worn out, but the menu is extensive and food is good. You'll get a good value. Go with friends so you can try many different dishes. I would like to return to sample the large noodle soup bowls."], ["Authentic Cantonese food", 3.0, "December 31, 2013", "Lois L", "Wayne, PA", 76, 34, "Full Kee serves up good, traditional Cantonese food. This restaurant is not fancy, but the staff is friendly and attentive. They speak English and several Chinese dialects.\nSoy sauce chicken was good; the roast duck was meaty but too saucy and did not have crispy skin, the roast pork was adequate. The barbequed meats would have tasted better if fresh...\n\n\nMore"], ["It Felt a Bit Like an Eatery in China Itself", 3.0, "December 6, 2013", "HeadingOut98229", "Bellingham, Washington", 156, 52, "That it felt very much like places I've visited in China, that isn't necessarily a strong recommendation for everyone. The restaurant had a bit of a grimy feel: not super clean, cheap seats and tables, and (as another review noted) somewhat indifferent service. The prices (for lunch) were extremely reasonable, and the food tastey enough. My duck on rice was...\n\n\nMore"], ["Authentic Chinese Food", 5.0, "November 3, 2013", "cdptraveler", "San Francisco, California", 54, 29, "One of the few original Chinatown restaurants left with food that is more typical of the Chinatown in San Francisco. Most in the restaurant were speaking chinese. Service is indifferent, but that's not why you go."], ["Very good service and food", 4.0, "September 22, 2013", "Larry T", null, 28, 8, "We came on a referral and were not disappointed! Had dumpling soup and then the oyster casserole. The people were really nice, happy to see us, and helpful."], ["Great restaurant in Chinatown", 4.0, "August 27, 2013", "doepie1969", "Amsterdam, The Netherlands", 102, 33, "Delicious food and great prices. What else can you expect in Chinatown. It was easy to find. We had found it on the internet before we visited the city. Friendly staff."], ["You get more than you pay for.", 1.0, "August 7, 2013", "Mark P", "Grayslake, Illinois", 23, 5, "Was told this was the best in China town. Would never come back. Could not eat with family because they could not prepare gluten free for me. Waiter make a disgusting reference to his anatomy and walked away."], ["Decent Cantonese food in the heart of Chinatown", 3.0, "July 28, 2013", "Tommy087", "Zurich, Switzerland", 124, 63, "Decent Cantonese food in the heart of Chinatown. The dumpling and noodle soups were very nice. The dry fried noodles were a bit greasy. Fast and friendly service, despite being very crowded. Reasonably priced."], ["Great food", 4.0, "July 14, 2013", "Rose C", "Fraser, Michigan", 339, 101, "This was a recommendation from our hotel down the street. What a great walk through the China gate entrance. The service was wonderful and the food was delicious. It was a great meal and the price was good."], ["Has potential to be good.", 3.0, "July 8, 2013", "Dara50", "Jax, FL", 94, 72, "Eaten here in the past and was impressed by their ability to fix it with ingredients you like. Recently, had some wonton noodle for lunch. Didn't mind that the toppings were extra like fixing a pizza. Although, it should start with the basic wonton noodle and greens. Greens ended up extra. Another ordered shrimp wonton noodle and we couldn't distinguish...\n\n\nMore"], ["Hong Kong Roast Pork Noodle Soup gets 5 stars", 4.0, "April 8, 2013", "Stuart P", "Woodbridge, Virginia", 8, 2, "The Hong Kong Style, Roast Pork Noodle Soup is Epic! Best in the city. I've tried it everywhere else and nothing comes close. The dining area is a little \"hole in the wall-ish\" and feels like what I would imagine an eatery in Hong Kong China would feel like. The Roast Pork Noodle soup keeps me coming back. Ask for...\n\n\nMore"], ["Authentic for sure!", 4.0, "March 15, 2013", "George G", "San Antonio, Texas", 96, 25, "I was just walking down the street a headed to a meeting. As usual I was about 1 hour early and I was getting hungry. I saw a number of folks heading in and thought I'd take a chance. I have the Lemon Chicken and steamed rice with hot tea. Not many times I get a business meal in DC...\n\n\nMore"], ["Zagat must not have been here lately", 1.0, "January 26, 2013", "Rebeccabrandrecipes", "Santa Barbara, California", 4, 1, "Seafood was not fresh in pan fried noodles, Wontons were thick and pasty in Won Ton Soup, and not stuffed very flavorfully."], ["A good and extensive menu", 4.0, "January 14, 2013", "Buppa1", "Boston, Massachusetts", 175, 44, "Full Kee is what one would expect. Simple furnishings but a very extnesive menu. Food is good and varied. A good choice."], ["Food quality - negative change", 2.0, "December 17, 2012", "MrTraveller2010", "Baltimore, Maryland", 27, 34, "I am adding my comment to check if other patrons have noticed the change. We have eaten at Full Kee over the years and the food has been consistently good, except the last time we were there (November 2012). Just about ALL the food we ordered tasted bland, including the Congee with pork/preserved egg and the Shrimp dumpling Hong Kong...\n\n\nMore"], ["Poor service, bad food", 1.0, "October 21, 2012", "JohnTan_12", "Singapore, Singapore", 2, 0, "The waiting crew was arrogant and uninterested. We overheard them chiding another group of Caucasian diners in Mandarin seated 2 tables across from us. This place served the worst Chinese food we ever tasted anywhere around the world. Beyond the 10% service charge plus an additional token tip for the poor service, the Chinese waitress had the audacity to approach...\n\n\nMore"], ["Good food.", 5.0, "August 26, 2012", "HatWaterMapCheck", "Dallas, Texas", 64, 26, "This place is light on ambiance, and the staff (while polite) definitely like to get their tables flipped as quickly as possible. However, the food really is very good and you will have enough left to take home for another meal (or two). I went here a few times, and loved the seafood combo fried rice. This is one place...\n\n\nMore"], ["Great authentic food!", 5.0, "August 22, 2012", "sdm23669", "Miami, Florida", 49, 53, "Every dining experience I have had here has been great! I look forward to eating at Full Key everytime I go into the city, the only downside they have ruined other chinese food experiences for me! I only want Full Key chinese and nothing else seems to compare!"], ["no frills, great service", 3.0, "August 19, 2012", "ngkgschck", "mount airy, maryland", 59, 34, "We stopped here for a quick bite because of the Fodor recommendation. It is a no frills place and a few ducks were hanging in the window! I am a steamed dumpling fanatic and I must say theirs were only okay. The chicken satay was very tastey as was the wonton soup and tea. Hubby enjoyed the shrimp rolls. The...\n\n\nMore"], ["good food and fun atmosphere", 4.0, "August 10, 2012", "werejustatravelin", "Westminster, Colorado", 23, 8, "We all enjoyed the food. I wasn't quite sure what I wanted to order but knew what i wanted in the dish. She had something special put together with exactly what I liked. It was very good. Portions are large so we shared 2 between 3 of us. The servers were so friendly. They had some very unique items on...\n\n\nMore"], ["Best! Soup! Ever!", 5.0, "May 5, 2012", "Jmazerolle", "New Brunswick, Canada", 20, 29, "This was the best soup I’ve ever had. It’s better than the soups I had in San Francisco, Montreal or New York. Simply outstanding. A great meal, and a great price. Just a short walk from our hotel (Hotel Monaca\\o) and the Verizon center."], ["Chinese Food not for Chinese...", 1.0, "February 21, 2012", "UptownXriver", "New York City, New York", 37, 30, "If you are Chinese, I do not recommend you to go to this \"Chinese restaurant\". It tasted aweful as Chinese Food... I ordered Salt and pepper pork chop, tastless pice of rock.... wonton soup, horrible!! Vegetables was really good! Congee...... tastless chicken with rice ...\nIf you are not Chinese, you may enjoy the food. You can tell...well... there is...\n\n\nMore"], ["Best Food We Had All Trip", 5.0, "February 15, 2012", "TLaymon", "Conway, Arkansas", 75, 52, "We stopped by China Town for a quick lunch before a meeting at the Capital. The $6 lunch menu was extensive and delicious! We also tried the Egg Drop Soup. I don't even like Egg Drop Soup, but it was sooooo good. I did look at their dinner menu, and it looks like entrees were between $17-23 apiece."], ["Not sure I'd go back", 3.0, "February 6, 2012", "tilda54", "Washington DC, District of Columbia", 236, 167, "My friend and I went to Full Kee before a concert. I arrived at 6, he was a delayed -- and they refused to seat me until he arrived. I can see that at a fancier place, but this place is still basically a dive. I really wanted to sit down and at least order an appetiser. He'd recommended the...\n\n\nMore"], ["Fantastic Traditional Chinese Food at a Great Price", 4.0, "January 18, 2012", "jenniparks76", "Manassas, VA", 63, 52, "Dropped in here for lunch after a google search led me to Full Kee as allegedly producing the best Crab Rangoon in DC. Once inside, saw that almost all tables of Asian diners were ordering soup for their entrees and the waitress also informed me it was their house specialty. They have a standard menu as well as a soup...\n\n\nMore"], ["No frills, just great chinese at low prices", 3.0, "October 19, 2011", "mrjoef", "Lubbock, Texas", 25, 4, "With its tired steamy exterior located a half floor above street level, a one day tourist would probably not choose Full Kee. The crowd inside attests to the fact that locals don't come for glitter, they come for the great food in large quantities.\nWhen I'm in town, one of my automatic lunch or dinner choices is Full Kee, and...\n\n\nMore"], ["What a Chinatown place should be...", 4.0, "October 20, 2010", "Neutrino_FL", "Central Florida", 64, 55, "What a Chinatown place should be - not fancy, very down to earth, cheap, and good food. I was pleasantly surprised, and will happily eat here again. Very reasonable prices; clientele range from locals to business types. I repeat however, very down to earth. :)"], ["Best food, not so good restaurant. Best for take out!", 4.0, "May 12, 2010", "DCFed", "Washington DC, District of Columbia", 83, 33, "The food is extremely good!, but the building is just old and smells horrible.\nIf you get take out call first, I live one block, I call and by time I am there its ready, extremely fast and always very good!\nHard to understand on phone but they always get it right."], ["What a Disapointment!", 1.0, "February 16, 2010", "Erka", "West Virgina", 25, 17, "I spent a lot of time researching restaurants in Washington's China Town and decided on Full Kee. (I didn't read enough reviews at this site.) I echo other reviewers that the service was awful. They have an extensive menu but you better know what you are ordering because you'll get no help from the staff. They forgot to serve the...\n\n\nMore"], ["Certain items good, others poor/repulsive", 3.0, "February 7, 2010", "mvc_jones", "mvc_jones", 2, 1, "First the good. Best thing here are the soups (i.e. roasted port and noodles in broth) and the singapore noodles, request with fresh chiles instead of bell pepper. They are good solid options - but do not expect fine cuisine - more like hole in the wall type food (and priced accordingly.)\nNow for the bad. Ordering brisket on rice...\n\n\nMore"], ["Good Food....BUT", 2.0, "July 5, 2009", "avpkathy", "Kentucky", 33, 6, "The food was really good, but the service was not so good. We had to refill our drinks and get our silverware. My husband said NOT to go into the bathroom. It was so disguising that had he seen it before he ordered that he doubted that he could have eaten there."], ["Just awful ! - makes you rethink the whole tipping issue", 1.0, "January 16, 2009", "McBirniesAustralia", "Australia", 2, 4, "I wish I had read the review from the gentleman from Toronto before going to Full Kee for lunch (in Dec 2008).\nI thought I would try the place out with the lunch menu: usually a good indicator of service and quality of food when you dine for a quick rice/noodle dish or bowl of won tons. We arrived and...\n\n\nMore"], ["expensive chinese restaurant. The quality of food is not as good as I expected.", 2.0, "January 14, 2009", "Samleung", "Hong Kong, China", 6, 8, "expensive chinese restaurant. The quality of food is not as good as I expected."], ["good soup, felt run down...", 3.0, "July 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good soup, felt run down though."], ["Great rice!!", 3.0, "July 7, 2008", "sambrown50", "Dalton, Georgia", 66, 86, "My wife and I ate at Full Kee on Sunday July 5th and the lunch specials are not valid on the weekends or holidays. Therefore we missed the $5 specials and had to order from the main menu where items were anywhere from $8-$25 while most were around $15. The rice was exceptional, however, my duck still had the bones...\n\n\nMore"], ["soy sauce chicken, beef...", 5.0, "June 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "soy sauce chicken, beef ribs with salt & pepper.."], ["Best Hong Kong Noodle... don't order from the fancy printed menu. This is a noodle shop!!! order from the small pink...", 4.0, "May 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best Hong Kong Noodle... don't order from the fancy printed menu. This is a noodle shop!!! order from the small pink piece of paper menu."], ["The only place I will recommend in Chinatown.", 4.0, "May 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The only place I will recommend in Chinatown."], ["great cheap, dirty chinese", 5.0, "April 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great cheap, dirty chinese"], ["Not bad. They've renovated some what. I went recently for lunch with co-workers since its down the street :)", 3.0, "April 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Not bad. They've renovated some what. I went recently for lunch with co-workers since its down the street :)"], ["Hole-in-the-wall Chinese...", 4.0, "March 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Hole-in-the-wall Chinese -- opens till late as well!"], ["One of the few Chinese places left in chinatown. I think it's average.", 3.0, "March 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of the few Chinese places left in chinatown. I think it's average."], ["Best Chinese in town?", 4.0, "February 14, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best Chinese in town?"], ["Best Chinese food spot in DC...the only place that comes close to NYC-style Chinese food.", 5.0, "February 7, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Best Chinese food spot in DC...the only place that comes close to NYC-style Chinese food."], ["Probably the best thing...", 3.0, "January 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Probably the best thing going on Chinablock. Walking there gives a little of the gritty feel that I'm told used to define the area. Something about the rice is off, which is disastrous for this cuisine, and the place smells like tylenol. Still a good experience though, think of it as the Cantonese Ben's Chili Bowl."], ["total hole in the wall, cash only, kinda shady location...the BEST kind of restaurant. haha. the casseroles are pretty...", 5.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "total hole in the wall, cash only, kinda shady location...the BEST kind of restaurant. haha. the casseroles are pretty tasty and so are the clams (or maybe mussels?) w/blackbean sauce."], ["authentic chinese", 5.0, "December 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "authentic chinese"], ["Luch special is good... Let's try!", 4.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Luch special is good... Let's try!"], ["pretty authentic", 3.0, "December 10, 2007", "Alvcpa", "Fairfax, Virginia", 48, 5, "pretty authentic"], ["Shrimp and Walnuts, Full...", 3.0, "November 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Shrimp and Walnuts, Full Kee Fried Rice."], ["Warning: The review may turn a few stomachs.", 1.0, "May 8, 2005", "James T", "San Diego, California", 26, 87, "Full Kee was one of 3 Chinese restaurants I dined at over the last 4 days (May4-8, 2005) in Washington DC.\nFirst off, I love Chinese Food. I'm Chinese myself, and having spent years in Toronto, Vancouver, and doing a lot of travel in HK/China, I consider myself a fairly good judge of decent Chinese food. So when this week's...\n\n\nMore"]]], ["PS 7's Restaurant", [["Just desserts..", 5.0, "June 29, 2015", "wanderingwonderer", "Everywhere", 50, 8, "I only had a dessert here, but it was an amazing fruit crumble that I will never forget. One of the best desserts of my life and didn't even involve chocolate!"], ["I am Sorry", 5.0, "July 5, 2013", "Willboywonder", "Gaithersburg, Maryland", 4, 46, "This place has closed and I'm very sorry to learn of this. :-(\nI ate here once and wanted to make plans to go again, only to learn of PS7's passing. It was a great place, tasty food, and nice offerings. Although it was a little pricey for the portion sizes, it was well worth it. I hope Mr. PS...\n\n\nMore"], ["Can easily run up a bill and only fair", 3.0, "November 8, 2012", "EuropeLover_9", "Washington DC", 138, 56, "This is an attractive restaurant in the Penn Quarter of DC which is on a street that is fairly deserted. Beware of the meters which say 2hrs until 6:30pm but really mean after 6:30 you need to pay as well but can park until 10pm. Tickets are easy to come by.\nBut back to the restaurant. The entrees are from...\n\n\nMore"], ["Never Disappoints", 5.0, "November 5, 2012", "shannonac79", "Washington DC, District of Columbia", 21, 15, "PS 7's is one of my favorite restaurants in the area. I am actually a manager at a near by fine dining restaurant so I am picky. This place is reasonably priced, and the food and service is always on point. A neighborhood gem."], ["Great food, adorable service", 4.0, "October 28, 2012", "nicothed", "Washington DC, District of Columbia", 71, 43, "At first, we weren't impressed by the menu, but it quickly changed: The prosciutto with dried figs was amazing and who knew that a warm spinach salad could be so good!? The Kobe beef (not actually from Kobe, as everyone knows (see http://www.forbes.com/sites/larryolmsted/2012/04/12/foods-biggest-scam-the-great-kobe-beef-lie/) was really good but didn't knock our socks off. We took the dessert sampling and were very...\n\n\nMore"], ["Great bar burger", 4.0, "August 4, 2012", "rdear60878", "Seattle, Washington", 28, 14, "Ate here in April. Had a terrific burger in the bar with a glass or two of wine. Couldn't have been better, except for perhaps eating in the restaurant which looked very good."], ["Nice and tasty", 4.0, "July 29, 2012", "DocLBethesda_MD", "Bethesda, MD", 49, 17, "After some lunches that my wife enjoyed a lot, we had dinner here before a concert at the Verizon Center a few blocks away. The staff were exceptionally personable and accommodating, inquiring whether we had to make a show, cheerfully moving us when we asked for table that didn't feature a view of the kitchen trash can, explaining the signature...\n\n\nMore"], ["Great lunch spot", 4.0, "June 15, 2012", "ExPat0331", "Arlington, Virginia", 393, 122, "Go for lunch. The flatbreads are super delicious. Dinner is ok, but lunch you get more bang for your buck and dinner has almost the same menu items."], ["Nice space, great food, fairly noisy", 4.0, "May 6, 2012", "knittergram", "Durham, North Carolina", 67, 31, "I first went to PS 7's for a working Board meeting, and it was delicious food in a contemporary lively space. When my husband and I happened to be in DC for work again, I took him there for a birthday celebration. They gave us a window table as requested, and the service was impeccable. The waiter was knowledgeable but...\n\n\nMore"], ["Not my first visit and certainly not my last", 5.0, "April 23, 2012", "Belladoux", "Washington, DC", 65, 15, "I think it's worth re-reviewing PS 7's since it's been quite a while since my last visit. What I love about this restaurant is the excellent service, quality and creativity of the cuisine and the fact that it's quiet enough that you can actually hear your dinner companion. The bar was doing quite a business from the occasional yelps and...\n\n\nMore"], ["Wonderful service. Salty food.", 3.0, "April 5, 2012", "Amy G", "Chepachet, Rhode Island", 7, 0, "Superb service. Lovely atmosphere. Amazing cocktails.\nThe food was so-so.\nSeveral dishes were extremely salty. Their signature appetizer dish of sticky buns with pork was nothing special.\nMy husband's Kobe beef dish was over cooked and when the waiter aksed how things were and my husband hesitated slightly, the waiter was already picking the dish up to return it for...\n\n\nMore"], ["Aaaaah NO, PS 7s misses the mark", 2.0, "March 5, 2012", "DCFed", "Washington DC, District of Columbia", 83, 33, "Yes, it has a lighted menu which frankly makes it harder to see the very very limited menu, maybe thats why they did it, its got some cool swank decor, but honestly It's just lame, service was slow and unattentive, food was blaa, and atmosphere was, well there wasnt any."], ["Excellent food downtown", 5.0, "February 20, 2012", "ThMoC", "Washington DC, District of Columbia", 143, 106, "PS 7 (Peter Smith is the chef-owner of this Seventh Street restaurant) is an attractive setting for excellent food. The cognac-marinated foie gras aged 30 days and the Kobe beef \"ravioli\" (the ravioli square is under the meat, onions, etc., not around it) stood out. The experience was rounded out by knowledgable attentive service and a good wine list. The...\n\n\nMore"], ["Restaurant Week Disappointment", 3.0, "January 13, 2012", "trvladdict", "Washington DC, District of Columbia", 332, 282, "I decided to give PS 7's a try during restaurant week. In contrast to the positive reviews, I was very disappointed in the quality of the food served. The cocktail we had was so-so. The starters - oysters, salad, flat bread - were excellent, particularly the flat bread. They were large servings. The main course - salmon, pork - was...\n\n\nMore"], ["Valentine special awesome but pricey!", 5.0, "January 4, 2012", "TolerantTraveler", "Washington DC, District of Columbia", 349, 98, "The food here is wonderful with a chef who really knows how to surprise you, including bouche surprises between appetizer and entree courses. This is a great restaurant for a special occasion, which we did for Valentine's day. Hidden away on a side street nearby Chinatown, it's also aa great downtown location to get to. Valet parking too, although we...\n\n\nMore"], ["Excellent cocktails", 5.0, "January 3, 2012", "Nads82", "Falls Church, Va", 423, 110, "Wow - definitely try the punch. The cocktails and first class. The food looked spectacular, but I didn't get a chance to enjoy. I checked out the chef's tasting menu and it appeared innovative."], ["Great appetizers, but dessert was lacking...", 3.0, "November 17, 2011", "road_foodie", "Alexandria, VA", 19, 11, "The night we went was their Italian theme night. However, the food was good and our bill for two on a three course dinner and one cocktail each was $80. Not bad. We especially liked our appetizers (house made lamb/veal min hot dogs and Italian rice balls). Our entrees were good, too (Linguine with white clam sauce and Manicotti). However,...\n\n\nMore"], ["A delightful experience", 5.0, "November 16, 2011", "DCRam", "Washington, DC", 40, 10, "PS 7's is my \"go to\" restaurant. Any time we have out of town guests or want to meet friends for a relaxed and delicious meal PS 7's is the first place we think of suggesting. Last month we tried their Italian Night--a special themed night--and there are dished I wish they'd keep on the menu forever. They are offering...\n\n\nMore"], ["Very good food & a friendly staff!", 5.0, "November 6, 2011", "BreakingNews58", "Chicago, Illinois", 73, 31, "The food is great. And the wait staff is beyond helpful."], ["Great Desserts", 5.0, "September 17, 2011", "mdgpcp", "Evansville, Indiana", 15, 9, "Visited this restaurant last weekend. Entire meal was good - but the desserts were so creative and fabulous: chocolate potato cake with chocolate dipped potato chips and ganache, lemon refrigerator dessert with blueberries, blueberry jam and cookies and limoncello gelee, then the doughnuts - four different kinds."], ["Fantastic Food and Service", 5.0, "September 9, 2011", "David H", null, 8, 6, "My second visit to this local restaurant. As before, excellent menu, wonderful food and very attentive and gracious service. Definately on my return list."], ["Very Nice Flavors and Service", 4.0, "August 12, 2011", "EuroHoneyMoon2010", "Nashville, Tennessee", 130, 114, "Went here on a Thursday night with a reservation. It was our first time here and we were excited to try to the flavor mixtures from the chef. The entrance was a bit abrupt: When you walk in, there is a big wall that faces you and the bar/lounge is to your right and the restaurant part is to your...\n\n\nMore"], ["Great food", 4.0, "August 12, 2011", "CEO08", "Washington, D.C.", 20, 28, "The cocktails were ok, but the food was good, innovative and very well presented. The restaurant has a nice ambiance."], ["Very creative restaurant.", 5.0, "July 1, 2011", "Travelaroundoften", "New York City, New York", 13, 13, "I joined 5 colleagues for lunch at this restaurant and we were all extremely pleased with the food, the service and the creativity of the menu. Anyone tired of the same ole menu should give this place a try."], ["OVERRATED - GO TO FUDDRUCKERS!", 1.0, "June 6, 2011", "mariemcrabb", "washington dc", 1, 0, "We arrived early for our reservations, so we sat at the bar. I asked the bartender which drinks she recommended and she very sarcastically replied \"OH all our drinks are horrible, you should go across the street for a drink\", her humor obviously did not come across and she then said \"it was a joke, dude\". From that point on,...\n\n\nMore"], ["Do not go there hungry!", 2.0, "April 18, 2011", "ccsongos", "Fairfax, Virginia", 1, 0, "This restaurant offers a very nice, modern ambience; however, the food is overpriced and the portions are rediculously small. I went there on an empty stomach and left still hungry after sharing an appetizer, eating my own main course, and sharing a dessert. Also, it was warm in the back dining room where we were seated. The menu is unusual...\n\n\nMore"], ["And now for something completely different...", 5.0, "March 31, 2011", "rovingcarole", "buffalo, ny", 141, 83, "First night in DC on a business trip, wanted something that would surprise me and be memorable, and I picked right! My group had eaten a late lunch, and this was an early dinner, so we weren't terribly hungry, which was probably not a bad thing because the portions are a little skimpy for a hearty appetite. But then again...\n\n\nMore"], ["Pricy, but excellent bread, service and interesting menu choices", 4.0, "January 11, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pricy, but excellent bread, service and interesting menu choices"], ["Great Ducky Flat Bread and other Happy Hour bargains. Hot Dogs and Tuna Burgers were great choices, too.", 4.0, "December 3, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great Ducky Flat Bread and other Happy Hour bargains. Hot Dogs and Tuna Burgers were great choices, too."], ["Love the scallops!", 4.0, "November 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love the scallops!"], ["Great Prix Fix lunch menu!", 4.0, "November 1, 2008", "DarrenWashington", "Washington DC, District of Columbia", 32, 16, "Great Prix Fix lunch menu!"], ["Dined here during Restaurant Week and liked the short ribs and filet. The scallops were magnificent too, and we...", 4.0, "August 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Dined here during Restaurant Week and liked the short ribs and filet. The scallops were magnificent too, and we enjoyed the wine selections that were priced well and supported the pink ribbon campaign. The bar area looked fun and we'll come back to check out that at another time..."], ["I had one of the best meals of the summer in August during restaurant week here. Everything was spot-on. Would...", 4.0, "August 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I had one of the best meals of the summer in August during restaurant week here. Everything was spot-on. Would definately go back and highly recommend. Service was also great."], ["Food was DEeeee.LISH. Service a little bit slow, but probably b/c it is \"restaurant week\" - you have to have...", 4.0, "August 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Food was DEeeee.LISH. Service a little bit slow, but probably b/c it is \"restaurant week\" - you have to have the Tuna sliders!!!!! Yumm!"], ["Hot dogs and half-smoke...", 3.0, "May 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Hot dogs and half-smoke plate makes for a pleasant, if unusual, high-end lunch."], ["With sky-high ceilings and a soothing color scheme, PS7 is a modern, trendy, new American restaurant.\nFood is very...", 4.0, "April 27, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "With sky-high ceilings and a soothing color scheme, PS7 is a modern, trendy, new American restaurant.\nFood is very good, starting with the small breads (the walnut one is the best). Tuna, lamb are delicious. Seafood entrees are excellent. Foie gras is well done. Salads are tasty. Service is discrete. Wine selection is very good. I was disappointed with the...\n\n\nMore"], ["Get the beet-infused vodka", 5.0, "April 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Get the beet-infused vodka"], ["Very laid back restaurant and bar. Pete Smith is very creative with his menu. The hot dogs may be the best bar food...", 3.0, "February 27, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Very laid back restaurant and bar. Pete Smith is very creative with his menu. The hot dogs may be the best bar food ever."], ["Contemporary and approachable. Great location, great bar and lounge. One of the best looking eateries in D.C.", 3.0, "February 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Contemporary and approachable. Great location, great bar and lounge. One of the best looking eateries in D.C."], ["I've been here twice and...", 3.0, "January 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I've been here twice and the food is decent. The interior, bartender, and service are wonderful. I have yet to try their desserts however, but I hear that they rock."], ["and getting better!", 4.0, "January 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "and getting better!"], ["One of my favorites! Limited menu, but allows the chef to add delicious precise flavors and detail to the choices...", 4.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of my favorites! Limited menu, but allows the chef to add delicious precise flavors and detail to the choices available... Spacious bar, trendy pleasant setting and check out the goldfishies in the restrooms! A"], ["Always new and excellent...", 5.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Always new and excellent quality and service. There is always something unexpected and well executed there to try. You will defintely have food prepared in a way that you never thought possible...and you will love it!"], ["Fabulous swanky place. Lunches are wonderful. Get the little 4 box with a little bit of everything for lunch.", 4.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fabulous swanky place. Lunches are wonderful. Get the little 4 box with a little bit of everything for lunch."], ["nice romantic dinner", 4.0, "November 12, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "nice romantic dinner"], ["Wonderful Restaurant", 5.0, "July 23, 2007", "Rockrolex", "Washington, DC", 108, 51, "Washington has become a foodie mecca in recent years. PS 7's ranks right up there with the best of them. We had an excellent meal there recently. The food was outstanding and the service couldn't have been better. Peter Smith has some unusual takes on well known dishes. The menu is divided into small, mid size, and larger (entree size)...\n\n\nMore"], ["Favorite Restaurant in Washington D.C.", 5.0, "February 17, 2007", "Bostonian1962", "Alexandria, VA", 3, 2, "My wife and I try to frequent as many quality restaurants a year, as we can. On Valentine's Day (Feb. 14, 2007), we went to PS7 for the first time. We knew about chef Peter Smith from his days at Vidalia's, and thought we'd check out his new restaurant (PS7).\nIt blew us away!\nWe went to the bar first,...\n\n\nMore"]]], ["Port City Java", [["Breakfast", 4.0, "June 22, 2015", "Mary M", null, 10, 4, "Stopped here several times in our week in DC. Coffee, smoothies, breakfast sandwiches and wraps were all good. When we took it to go, wrap was still hot when I wanted to eat (of course it was a hot day)."], ["Iced Coffee Break", 4.0, "June 22, 2015", "Pamela M", null, 84, 22, "We stopped by after enjoying some local sights and found the full bodied coffee over ice with honey to be very refreshing on a hot, muggy day. Many varieties of beverages to choose from. We could not resist the aroma from fresh cinnamon scones! Good, pet friendly atmosphere for everyone to relax & enjoy the local area."], ["Go for a green juice", 4.0, "May 6, 2015", "Whitney K", "New York City, New York", 21, 10, "Java/coffee place but they have great juices as well. Got a green juice, decent price and very tasty."], ["Great lunch", 4.0, "May 3, 2015", "Cozmo1968", "Alexandria, Virginia", 109, 37, "My wife and I went on our first bike ride of the season, and ended up meeting some friends out near Eastern Market for lunch. They live in the area, but we suggested a place for sandwiches. They went along for the journey. Port City Java always delivers... Or at least they have the two times that we have visited....\n\n\nMore"], ["Enjoyable :-)", 4.0, "April 22, 2015", "Kimberly64", "Florida", 26, 13, "After biking around the city all morning we decided to duck into this place for a moment of relax.... Comfortable, good coffee (and muffin) nice chairs, pleasant staff."], ["Very Relaxing!", 5.0, "February 8, 2015", "Julie S", null, 1, 0, "Nice place to just sit and people watch out the large windows. Comfortable seating and casual ambiance. Great coffee, pleasant staff, varied selections and very clean."], ["Decent coffee at the Eastern Market", 4.0, "February 9, 2014", "Nickelfish69", "Bryan, Texas", 47, 29, "We stopped in after shopping at the Eastern Market. It was a good place to just sit and visit while sipping hot java."]]], ["Foggy Bottom Cafe", [["Vacation", 5.0, "August 1, 2015", "Char S", null, 7, 0, "The food is fresh and delicious. Staff is very friendly. Reasonable prices. Really enjoyed our visit . Oh and the teenagers really liked it as well!"], ["restaurant at the river inn", 5.0, "June 22, 2015", "Robin T", "California", 7, 1, "Food (seafood) and steak were really good. The breakfast had a good choice of items to choose from. It was convenient to eat at the same place we were staying at."], ["Breakfast", 4.0, "October 28, 2014", "Suni2602", "Mumbai, Maharashtra, India", 41, 15, "We stopped here for breakfast while walking from the hotel to the subway. Decent and fresh collection of rolls and croissants. Worth a stop for a grab as you go breakfast"], ["DC Institution!", 5.0, "July 9, 2012", "jodysloft", "Mountain View, California", 29, 21, "This is a basement dive bar with cheap drinks in plastic cups, but amazing atmosphere!!"], ["OK food, service left little to be desired", 3.0, "August 28, 2011", "Tinsco1", "Hampstead, North Carolina", 10, 4, "If you are staying in Georgetown,DC, you could walk to this restaurant. It's a quaint restaurant and food was OK. The night we went it was not busy, but had a hard time getting service. One of the things I did life about it was so close to hotel we were staying at in Georgetown. We did discover many other...\n\n\nMore"]]], ["Floriana Mercury Grill", [["A Neighborhood Institution", 4.0, "December 21, 2014", "John W", "Washington DC, District of Columbia", 31, 17, "Floriana rarely fails to deliver a solid dining experience. It's a neighborhood favorite rather than a fine dining experience, and is unpretentious and friendly."], ["Very good food, outstanding service", 5.0, "May 27, 2014", "DCBoomer", "San Francisco, California", 88, 49, "We met friends from out of town who were staying nearby for our first visit to Floriana. We all agreed that it definitely won't be our last! All dishes - from the spicy calamari appetizer to our entrees - were perfectly prepared. Between the four of us we had the Gnocchi, the Scottish Salmon, the Sea Scallops, and the Pork...\n\n\nMore"], ["Underwhelming food", 2.0, "May 25, 2014", "MyTravelJournal1", "Washington DC, District of Columbia", 38, 15, "I will make this one quick because there's not as much to say:\n- What's good: location and good outside space. They also have a decent wine selection and half price wine on Tuesday.\n- Average: service. No complains, but not necessarily impressive.\n- The bad: food. I have given this place several tries, but the food does not deliver....\n\n\nMore"], ["Good reputation and service but meal was badly prepared.", 3.0, "March 25, 2014", "rockySeattleArea", "Seattle Area", 88, 42, "This restaurant had been recommended by staff at another restaurant. Very nice atmosphere and courteous wait staff.\nWe were expecting a great meal after we had been served the delicious apps that three of us shared (myself, wife, daughter).\nThen things plunged. When we ordered we very specifically specified how the different entries should be cooked. Rare to medium rare....\n\n\nMore"], ["nice", 4.0, "March 22, 2014", "lucy x", "Taipei, Taiwan", 18, 9, "Not so cheap but great decor and very good food , steak cooked to perfection with a good selection of sauces . The staff are well presented and efficient ."], ["Outstanding!", 5.0, "January 28, 2014", "Dave F", "Omaha, Nebraska", 2, 0, "We enjoyed the best meal here. We were lucky that it was the last night of restaurant week. My wife and I experienced a broad range of the menu and everything was excellent. Highly recommended and a great setting!"], ["Excellent meal", 5.0, "August 10, 2013", "lscconn", "Connecticut", 5, 1, "We ate there tonight (3 people) and had an xcellent meal. We loved the atmosphere, small and cozy with a warm feel. The mussels were delicious as was the calamarie.\nwe had two rissotto dishes (lamb and seafood) that were very, very good. The service was very good ( the waiter was from Bologna, where we lived for 6 years)....\n\n\nMore"], ["Decent--not inspiring", 3.0, "August 5, 2013", "WashingtonDCLaura", "Washington DC", 20, 6, "We used a Groupon to try this restaurant, and found it to be just okay. It was pleasant but not that memorable. Nothing wrong with the food--it satisfied.But could not give this place a superb review."], ["A change of heart, a great experience", 4.0, "July 27, 2013", "gargost", "San Juan, Puerto Rico", 58, 24, "I reviewed this restaurant once before, and decided to give it a second look, which turned into more visits. The visits included the downstairs' bar as well as the dining room.\nThe various selections of food were quite good. Filet mignon, lamb, gnocchi, etc. Meat is tender, pastas are cooked just right (al dente, of course). Something that the kitchen...\n\n\nMore"], ["A Nice Spot with Outdoor Seating", 4.0, "July 7, 2013", "Jim W", null, 51, 10, "Hubby and I met Jake for dinner last night. We had a wonderful meal at Floriana. Jake had the black gnocchi for appetizer and the day's special for dinner (Chilean sea bass). Hubby and I shared the bruschetta mussels appetizer. Hubby had the filet mignon and I had the whole branzino. Jake said his appetizer and entree were good. Hubby...\n\n\nMore"], ["Top notch", 5.0, "May 19, 2013", "avalonandl", "detroit, mich", 100, 20, "We had a dinner for 11 of us and they did a faboulous job. Not cheap but the food was outstanding. Service was professional and timely considering the size of the group. The Lasagna is great, as is pastas and veal. Wine list is good- Dupont Circle is a pricey Area. If you want quanity for $ than go to...\n\n\nMore"], ["For something so highly recommended, should be much better", 3.0, "November 21, 2012", "realproperty", "Toronto", 48, 57, "The hotel and Trip Advisor said this was great. If you know good Italian food, this place should be much better. The room is tight and noisy so romantic, it is not. Caprese salad was sorely lacking flavor and balsalmic, the recommended specialty, lasagna was a plate full of mush--you couldn't find the pasta-- and the much praised by the...\n\n\nMore"], ["don't judge a book by its cover", 1.0, "November 19, 2012", "1happytraveler12", "San Francisco, California", 50, 29, "The exterior is charming, the most attractive on the street. The service is good. The wine was half-price for Sunday brunch, but at 1/2 price, it was \"meh.\" The truffle blt with fried green tomatoes was bland and greasy. The bacon was coldly greasy, the mushy flavorless tomato was coated in a greasy crumb, and the bread was greasy. The...\n\n\nMore"], ["DuPont Disappoints", 3.0, "November 19, 2012", "brian62hill", "Washington DC, District of Columbia", 35, 18, "Had dinner at Floriana with an out-of-town friend, who recommended it based on its reputation. It's set in a row house in DuPont, which is a quaint enough layout for a gift shop. However, these old homes don't lend themselves easily to multiple two- and four-tops which wind up being crammed together. Plus, it doesn't seem that much care is...\n\n\nMore"], ["great service, neighborhood gem", 4.0, "October 30, 2012", "Damian C", "Washington DC, District of Columbia", 272, 67, "took my cousin here before his deployment with a large group. Service was fantastic, server Matt is recommended. excellent food, house made pasta, and we really enjoyed the decor...it is located inside an old house in Dupont. we were lively and no one seemed to care\ntheir specialty meat-wise is short rib, a favorite of mine. I went with the...\n\n\nMore"], ["YUMMY...", 4.0, "October 25, 2012", "Alwayslooking2travel", "Minneapolis, Minnesota", 81, 31, "Great food with an interesting take on a converted row house. Outside dining option - great if you like to see the sights and enjoy the sounds of Dupont Circle."], ["Not too great", 3.0, "September 5, 2012", "William A", "Cedarburg, Wisconsin", 26, 13, "My family ate here on Monday night (Aug. 20th), the first night of our week-long DC vacation. Unfortunately, this was not among our favorite restaurants we dined at that week.\nWhen we approached and entered the restaurant there was no host or hostess to greet us inside or out. It took a few minutes of standing around in the doorway...\n\n\nMore"], ["Really good variety!", 5.0, "September 3, 2012", "vamel", "Williamsburg, VA", 60, 33, "Awesome food. Pasta was super fresh. There was something for everyone, even those who don't like pasta. Only complaint was that there was a very loud table next to us...not the restaurans fault. Would come back."], ["Really good italian", 5.0, "September 2, 2012", "Macker_SC", "Spartanburg, South Carolina", 28, 6, "This is a very good Italian restaurant! My wife and I had risotto dishes that were fantastic. Our daughter had tortellini with tenderloin filling that was over the top. Waiter was personable, friendly, and attractive. I highly recommend it!"], ["Location and service were better than the food (apart from the bread which was excellent)", 3.0, "August 26, 2012", "Laura W", "andover", 16, 7, "We chose this Resturant due to the reviews on trip advisor however were slightly disappointed.\nThe service was excellent, same waiter throughout the night who was attentive yet subtle.\nI had the caprese salad to start which consisted of two pieces of tomato and mozzarella with some lettuce leaves, which for the price I felt a bit cheated. My husband...\n\n\nMore"], ["Delicious!", 4.0, "July 19, 2012", "Katy S", "High Point, North Carolina", 10, 16, "My husband and I ate here on a Friday night. We made reservations and ate outside which was perfect. The service was top notch. We ordered the homemade mozzarella cheese for appetizer and it was good but really salty. I had the beet salad which my husband and I both thought there was flavor about the salad that reminded us...\n\n\nMore"], ["Inauthentic Italian", 3.0, "July 13, 2012", "TFH1000", "Washington DC, District of Columbia", 9, 2, "Good, efficient service but the food is about as Italian as bratwurst. What were they thinking?"], ["Who knew!?", 5.0, "July 6, 2012", "SPKinVA", "Reston, Virginia", 259, 68, "I have walked past this restaurant for years and never went in. I am glad I finally did! The service was amazing and the food was fantastic. If you want fresh pasta, visit Floriana!"], ["Hidden Gem", 5.0, "July 1, 2012", "Autumn R", "Raleigh, North Carolina, United States", 47, 23, "After reading the reviews on this restaurant, I was really unsure of what to expect. The atmosphere was very cozy and romantic. This is a great date location. We ordered the beet salad as an appetizer which melded complex and delicious flavors. For dinner, I ordered the Shrimp Fettuccine Alfredo; this was one of the best pasta dishes I have...\n\n\nMore"], ["Floriana: Italian done well....", 4.0, "June 29, 2012", "cdavis103", "Austin, Texas", 12, 6, "This restaurant is tucked in one of the brownstones along 17th and Q street. It's a short walk from DuPont Circle and it faces 17th so you have a nice view of the storefronts and the activities going on in the neighborhood. It was exceptionally hot today in DC, so sitting outside was not an option although there is a...\n\n\nMore"], ["Great place", 5.0, "June 22, 2012", "leozwaak", "Maarssen, The Netherlands", 7, 0, "Excellent food and twice a week all bottles of wine half price"], ["Superb Italian restaurant!", 5.0, "May 28, 2012", "BriaNicole", "Greenville, North Carolina", 106, 63, "My husband & I enjoyed a romantic Italian dinner at Floriana. The restaurant was really busy so we new that was a good sign that the food would be good. It is a restaurant that used to be a house so it really had great character. The food was really really good. My husband got the TORTOLLONI MIGNON and it...\n\n\nMore"], ["Another Great Find in Washington", 5.0, "May 11, 2012", "LuceHenriette", "Gatineau, Canada", 62, 36, "We thoroughly enjoyed our visit to the Floriana. We sat on the terrasse and were not bothered by the sound from the street. Service was very pleasant and food was great. Sundays and Wednesdays get busy as wine is half price but we arrived early (we had a show to go to that evening) and had no problem getting a...\n\n\nMore"], ["A Real Neighborhood Gem!", 5.0, "April 28, 2012", "Foodies4", "New Hampshire Seacoast", 52, 24, "We dined here on a Monday night so it was not too crowded. The atmosphere is very nice, with a quaint and comfortable feel to it. All four of us thoroughly enjoyed our meals. Most of the pastas are made in house and you really can taste the difference. Lasagna here is one of the best I have ever had....\n\n\nMore"], ["Nice ambiance but salty food", 3.0, "April 23, 2012", "skcornwall", "Cornwall, Canada", 20, 5, "The restaurant is located inside an old house so the dining area is homey and quite spacious; the staff were excellent with service and attentive; the Mediterranean salad had a nice refreshing dressing but there were too many olives making it salty; the lasagna smelled delicious and would have tasted just as well if it were not so salty too"], ["Excellent food and atmosphere.", 5.0, "April 16, 2012", "krice65", "Virginia Beach, Virginia", 17, 8, "The restaurant had a great atmosphere, the server was very knowledgeable about the food prep, wine selection just right. I had the tuna tartare and Maryland crabcakes. Excellent tuna, just a tiny bit spicy; crabcakes with no fillers, just good crab, perfect accompannying side dishes. Great restaurant overall."], ["Great Brunch", 4.0, "March 27, 2012", "RobHolly", "Washington, DC", 9, 6, "Wonderful brunch; includes traditional Eggs Benedict as well as not so common Shrimp and Grits. Have not had a bad experience yet. Its in a converted house, so its tight quarters, but it adds to its appeal."], ["All DC restaurants should deliver Floriana's value, service, and quality", 5.0, "March 26, 2012", "ClementMD", "Bethesda, MD", 13, 5, "We selected Floriana for a pre-theatre dinner for a party of ten. They graciously found us a quiet table and provided the promptness of service that enabled out party to enjoy their excellent fare in a relaxed fashion. Just as important, our server Giocco, carefully steered us to selections that we were likely to enjoy. And we did.\nThe salads...\n\n\nMore"], ["Tuna was frozen in the middle", 2.0, "March 26, 2012", "ERAM919", "Oxford, United Kingdom", 17, 17, "D.C. is seriously lacking in good Italian or Italian fusion restaurants. Floriana came highly recomended from a friend. The seating is snug but comfortable and the restaurant is hidden in a row house a few blocks from Dupont circle. The service was very good but the food was lacking an expensive. I had grilled Tuna. I usually like is rare...\n\n\nMore"], ["Great place, great food, great ambiance, great service!", 5.0, "February 21, 2012", "michygal05", "NY,NY", 137, 84, "We went to Floriana on Pres. wknd for dinner on a Sunday nite and it was a wonderful experience. First of all, Sunday is half price on all bottles of wine and they not only have great prices but a great selection. The food is fresh and fabulous. We had the gnocchi with the wild boar as an appetizer (its...\n\n\nMore"], ["No Customer Service", 1.0, "February 19, 2012", "Andy W", "Washington DC, District of Columbia", 1, 0, "This used to be one of my favorite restaurants in DC, but I'm never going back. When I dared to express disappointment that there was an hour wait for a table on a Thursday night, the host responded with a sassy retort and then actively encouraged me never to return. The next day I sent an email to the restaurant...\n\n\nMore"], ["Very Lovely Dupont Neighborhood Italian", 4.0, "January 31, 2012", "BFunk88", "Washington DC, District of Columbia", 27, 23, "My girlfriend and I decided to try this place out, since it was near her apartment and had pretty high ratings here on TA. As previous reviewers have said, don't let the outside fool you. The inside is very nice for such an old building. The lighting is very low, which makes for a great romantic atmosphere. The building is...\n\n\nMore"], ["Inventive Italian Menu", 4.0, "January 24, 2012", "ace4444", "Fairfax, Virginia", 431, 141, "We came out of the cold and wet and into the very cozy confines of Floriana. We were seated next to the fireplace at a well-set table. We dined on a Sunday evening and it was half-price wine bottle night (check the frequency). I can personally vouch for the black gnocchi and rock shrimp appetizer (very nice), the braised short...\n\n\nMore"], ["Parking included", 5.0, "January 16, 2012", "Coolsvpmom", "Virginia", 33, 23, "We went here for a pre-theater dinner. The host and manager told my husband he could park in front of the restaurant, which we did. When we came back from the play, we had a ticket. By that time the manager had left, but the staff on duty said he would call and apologized about the ticket. We thought we'd...\n\n\nMore"], ["Great way to bring in the New Years", 5.0, "January 2, 2012", "Robbbyva", "Arlington, Va", 33, 61, "We went to Floriana - one my of favorite restaurants in the DC area. For NY Eve dinner, they ahd a great prixe fix dinner - 6 courses. They had a vegetarian, a meat and fish dishes. All the courses were excellent. We also elected to include the wine pairings with each course. Loved it! (Although... I am still not...\n\n\nMore"], ["Fun, tasty and noisy", 3.0, "December 5, 2011", "boybanker", "Washington DC, District of Columbia", 141, 67, "We went with friends on a Wednesday evening, where we enjoyed half-price wines. The Italian food, creatively interpreted, was overall interesting, and reasonable value for the price. Two sweetbreads lovers were impressed by their tasty and generous appetizers, and the lightly fried calamari with two sauces were, for someone who's fussy about calamari, nicely done. My lasagna was rich and...\n\n\nMore"], ["Excellent experience!", 5.0, "November 5, 2011", "ldw30341", "Knoxville, Tennessee", 17, 9, "We wanted an intimate, romantic Italian restaurant near the Swann House (to celebrate our wedding!) and read very good reviews for Floriana on Trip Advisor. We were not disappointed! We had early reservations and since we had mentioned our wedding when making reservations on Open Table, they greeted us with celebratory champagne. We had the restaurant to ourselves at 6...\n\n\nMore"], ["Terrific Italian Restaurant in Dupont Circle", 5.0, "October 31, 2011", "TJSM", "Vinings, Georgia", 29, 33, "Intimate and romantic, this converted old brownstone offers great Italian fare in the heart of historic Dupont Circle. The wine selection is very good and quite reasonably priced. We had a window table for two, which made for excellent people watching while we waited for our appetizers and entrees. The lasagna was among the best I ever had -- very...\n\n\nMore"], ["Great Italian Food", 4.0, "October 24, 2011", "dhen", "Los Gatos", 364, 269, "I agree with all of the more recent reviews that this is a very special restaurant. All four of us enjoyed the food we ordered, especially the lasagna. We were hoping to eat outside but because of rain ate inside. Despite the change, we loved the quiet ambiance of inside. The service was excellent, and we appreciated the friendliness of...\n\n\nMore"], ["Simple Delicious Italian Food", 4.0, "October 2, 2011", "Liz G", "Washington DC, District of Columbia", 10, 0, "Happy to have found a \"go to\" restaurant in Dupont Circle. Went for birthday dinner for my spouse and we weren't disappointed. The pesto ravioli and tiramasu was excellent. Dowstairs seating is best. Liked it so much, we went back with our parents three days later."], ["One of my favorite restaurants in DC", 5.0, "September 25, 2011", "athena381", "Washington, DC", 132, 68, "Wow...what a surprise. This restaurant is a gem in Dupont Circle. We ventured to try Floriana because we bought a Groupon coupon and we are so glad we did. The food out outstanding...the menu is quite extensive as well. Jeff, our server was phenomenal. Excellent service.....attentive without being too intrusive.\nI had the filet...cooked rare...and it was perfection. My husband...\n\n\nMore"], ["Don't be fooled by the outside - this is a spectacular restaurant", 5.0, "September 6, 2011", "Tang_UK", "Washington DC, District of Columbia", 22, 8, "I've been to Floriana a handful of times and every time it's been wonderful. The service has been very good, unobtrusive, knowledgeable, polite etc., the food is always wonderful and the wine list impressive. Having been there last night for the first time in a few months, I've decided it's my new favorite in DC. The awning on the outside...\n\n\nMore"], ["delicious entrees", 4.0, "August 25, 2011", "906girl", "Washington DC, District of Columbia", 2, 0, "We had wonderful butternut squash zucca and scallops risotto. Outside seating is charming but loud if crowded."], ["\"Excellent food and a fantastic waiter\"", 5.0, "August 11, 2011", "MontrealRuth", "Montreal", 31, 9, "Went to D.C. for a weekend to visit my two eldest grandchildren who are working there for the summer. Before I went I told them to choose a restaurant for Saturday night that they wouldn't go to if their grandmother wasn't paying. They checked menus and came up with Floriana, and what a treat it was! It was a hot...\n\n\nMore"], ["Disappointed.", 3.0, "July 7, 2011", "gargost", "San Juan, Puerto Rico", 58, 24, "I've been wanting to visit this restaurant for a while. The patio was inviting every time I passed by. We finally decided to visit and we chose, unwittingly, the day and time of the Capital Pride Parade. The patio had been set with a bar, and people were standing all around the patio. While the experience was a fun one,...\n\n\nMore"], ["Perfect diner, great wine. You should eat...", 5.0, "October 3, 2010", "ugundlach", null, 9, 0, "Perfect diner, great wine. You should eat here when you are in Washington DC"], ["www.WOW.com!", 4.0, "August 8, 2010", "ChrisJamesDC", "Alexandria, Virginia", 1, 0, "I will never forgive myself for waiting so long to try Floriana. My experience beginning in the hidden parisian boite of a bar and ending in the very same place was nothing but stellar. Arriving without a reservation, we were asked to wait \"downstairs,\" down a short descent of a hidden stair we were greeted with a beaming smile, and...\n\n\nMore"], ["Great atmosphere", 4.0, "March 30, 2010", "soy_latte_togo", "Tokyo, Japan", 55, 39, "Floriana continues to be a great neighborhood restaurant. The food is good - not fantastic Italian - but my husband is from NY so we have really high standards. But the service is fantastic (really nice people) and the atmosphere is perfect for a quiet, relaxed and casual dinner. I love that there is candlelight but I can still wear...\n\n\nMore"], ["Enjoyable Dinner", 4.0, "October 27, 2009", "Bernsie01", "Raleigh", 27, 19, "My partner and I went to Floriana the night before his Marine Corp Marathon run and the food was awesome. The tortellini was amazing! The service was very accomodating and friendly."], ["Nice unfussy neighborhood Italian joint", 4.0, "February 11, 2009", "katbreuf", "Washington, D.C.", 1, 0, "Floriana is in my neighborhood and it is a good little stand-by for when we want a nice (but not too fancy) italian meal without a huge price tag. Waitstaff is friendly, and it is in a cute intimate townhome. While the food isn't the best Italian I've ever had, I've never been disappointed. House wines by the carafe are...\n\n\nMore"], ["Check your bill !!!", 2.0, "May 28, 2008", "Honestfood", "Amsterdam, The Netherlands", 31, 9, "Seems they can't deliver the same quality and service all the time. Don't go there with someone if it's his first time in the US on the first evening - it left a bad impression. When we went there there plates were okay/good, one was not good.\nMost annoying: the lack of service. Waiting time turned out to be 3...\n\n\nMore"], ["The pasta with filet inside will melt in your mouth, great drinks, cozy home-style atmosphere... B+", 3.0, "December 22, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The pasta with filet inside will melt in your mouth, great drinks, cozy home-style atmosphere... B+"], ["home of a great birthday...", 4.0, "December 21, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "home of a great birthday din din"], ["Amazing", 5.0, "April 24, 2007", "mana427", "New York", 1, 0, "My friend and I have been to this restaurant several times and we've never been disappointed. If weather permits, the outdoor patio in front is a great way to people watch while having a glass of sangria. The servers have always been attentive, without interrupting your meal. I've been to many restaurants but Floriana by far has the best risotto...\n\n\nMore"]]], ["Station 4", [["Delightful Lunch", 4.0, "October 12, 2015", "Drury1334", "Washington DC", 17, 3, "In an area that is starved for good restaurants, Station 4 is a wonderful addition. We had lunch which was very good with an extensive menu. The waiter was nice and efficient, but we laughed as he appeared to be just waking up from a nap. I would never suggest that you choose a restaurant based upon one wait staff,...\n\n\nMore"], ["Enjoyable atmosphere and delicious food", 4.0, "September 19, 2015", "tstanley_12", "Gulfport, Mississippi", 8, 2, "Station 4 was a very nice restaurant. We sat outside which was nice to have our group away from everyone. The food was great and the service was top notch. I would definitely go back."], ["Very good", 4.0, "September 16, 2015", "esparky321", "Huntingtown, Maryland", 17, 1, "I went in around 1:30 sat at the bar and order a pizza I asked the nice young lady behind the bar which did she think was the best either the fish taco or the pizza. I was told that they are known for there pizza with homemade dough? I got the margarita pizza it came out nice and browned...\n\n\nMore"], ["Great place, fantastic brunch, good bartenders !!", 5.0, "September 5, 2015", "jorian d", "Washington DC, District of Columbia", 19, 6, "We love this place. Its a local spot on the waterfront. The bar has a section with couches. They have a good beer selection and they surprised me with Heineken Light, which is a beer that I can drink with anything."], ["Chicken Shortage?", 1.0, "August 17, 2015", "Jan P", "Fairfax, Virginia", 42, 8, "Never again. Yes, we were there for a pre-theatre dinner; we arrived a few minutes before 6pm (90 minutes before show time) and the maître d' as well as our server indicated that getting us in and out would not be a problem. We settled on pork belly tacos (was interesting enough to try but no \"wow\" there) and grilled...\n\n\nMore"], ["Average but not much Selection", 3.0, "August 13, 2015", "Connie Y", "London, Kentucky", 147, 79, "This restaurant was just okay. It was late, not much open after a baseball game, so it was great that the doors were open for us. My husband and I split a pizza and it was good. The only things on the menu that our teens were interested in were the burgers. Pricey for burgers. One teen ordered hers well...\n\n\nMore"], ["They have espresso!", 4.0, "August 12, 2015", "Csaba P", "Timisoara, Romania", 34, 10, "After looking for a decent espresso for days, I accidentally discovered this bistro. They have good espresso, the best I could find in DC so far."], ["A spot before the theater...Arena Stage", 3.0, "August 11, 2015", "rgstrip", "Fairfax, Virginia", 72, 16, "If you are going to the Arena Stage theater, this is worth checking out. Had some yummmy appetizers...pork belly tacos, and other stuff. I would actually like to have written about them, but their menu online is their winter menu, and apparently, they have not taken the time to update their info.....take this for what it is worth as you...\n\n\nMore"], ["Just not very good", 2.0, "August 3, 2015", "NativeDC", "DC", 58, 21, "The neighborhood really needs a good restaurant, and unfortunately Station 4 is not it at this time. By default, they probably do a good pre-Arena stage business, and if the food got better they could be a force to be reckoned with. The food just isn't very good. The mussels were so small they were hardly worth the trouble, and...\n\n\nMore"], ["A Great Place For Dinner & Drinks Before A Show At Arena Stage", 4.0, "July 25, 2015", "Christopher M", "Elkridge", 183, 61, "Friends and I decided that we wanted to have dinner together before seeing a show at the Arena Stage, and with Station 4's close proximity, it was an obvious choice. The casually-elegant atmosphere and decor of the restaurant is welcoming, service was prompt and courteous, and the food was quite good overall. I especially like the three-course prix fixe \"pre-theater\"...\n\n\nMore"], ["Nice restaurant, great staff", 5.0, "July 23, 2015", "hobbes1", "Barrie", 8, 15, "Nice meal and good choice of beers. They have a Paella special one day during the week. Staff is very attentive and pleasant without being intrusive. They will accommodate kids."], ["Delicious Dinner at a Reasonable Price", 4.0, "July 23, 2015", "TeacherT", "Sugar Grove", 31, 14, "This restaurant was recommended by our concierge Richard at the Marriott Residence Inn DC Capitol. It was a short walk from our hotel and on Monday nights they have a three course meal,for $20 per person plus bottles of wine at half price. We thought why not! This restaurant is a beautiful space, light and bright. We sat at a...\n\n\nMore"], ["Very disappointed", 1.0, "July 17, 2015", "Dcemperor", null, 1, 1, "I went to station 4 for my 53rd birthday celebration with 7 dear friends. This was my fourth time at station and service was slow the chef got our orders wrong. In particularly my friend ordered a well done kobe burger without onions. When it arrived to the table it had raw onions then then second burger came with cooked...\n\n\nMore"], ["Amazing Birthday Brunch", 5.0, "June 13, 2015", "TravelingKey", "Bowie", 40, 17, "My husband planned a wonderful surprise for my milestone birthday with a party of 20+ family and friends. The setting was super chic and modern and we had two tables right in the middle of the dining area.\nMy meal was delicious -- I had the Farm Fresh Omelet and shared an order of French Toast--and the mimosas were great....\n\n\nMore"], ["Sunday brunch!!", 4.0, "June 7, 2015", "Gene C", null, 12, 2, "3 adults ate outside on a Sunday morning to very good service from an attentive waiter. We opted for the \"endless Mimosas/Bloody Mary's. Both were excellent.\nMeals were the Chesapeake Benedict, The National,, and Farmers Omelette. Again, very good well presented. Definitely will come back."], ["I'll stick to coming to Brunch", 4.0, "June 7, 2015", "Bex H", null, 3, 4, "So I have been here about 8-10 times. I felt this time let me write a review.\nI visited on Friday early evening for some dinner after a workout. My sister and I decided to come here because we have only eaten for brunch which is always yummy.\nWe had a familiar waiter, who is always a pleasure. I ordered...\n\n\nMore"], ["Nice decor, indifferent service, overpriced food.......", 3.0, "June 1, 2015", "mjeffersondc", "Washington DC, District of Columbia", 42, 55, "I pass by here regularly, and have stopped in for a drink on occasion, which I had enjoyed. Had a fantastic wedge salad here once when waiting for a green line Metro problem to clear....\nLast week I was extra hungry and decided to get dinner. Menu selections seemed limited, either appetizers, or high priced entrees. Not many options if...\n\n\nMore"], ["Vibrant Atmosphere", 5.0, "April 26, 2015", "Lisa L", "Smithsburg, Maryland", 45, 15, "Station 4 is a great find! The atmosphere is vibrant. We were there for their Saturday brunch. We each had a different type of omelet- both were very good. I recommend the wheat toast. An artisan bread- wonderful. Each came with a mixed greens salad. Brunch came with endless Bloody Mary's, yum! Very nice way to start a Saturday."], ["Walking distance from Arena Stage theater", 4.0, "April 26, 2015", "Laurie B", "Farmington Hills, Michigan, United States", 123, 48, "Although the service was sub-par at Stage 4 restaurant, the Kobe beef hamburger sandwich and calamari were delicious following a stellar performance of \"The Originalist\" at Arena Stage. We thought the venue and presentation of food was pleasureable but the venue needs work on hospitality."], ["Great pre-theatre menu", 4.0, "April 23, 2015", "rmgis", "Spring Creek, Nevada", 61, 32, "There were 10 in the group with 9 headed to the nearby theatres. Their pre-theatre menu had a choice of three openers, three entrees, and two desserts. The location is right across the street from the Metro station so has very easy access."], ["Not what I ordered!", 3.0, "April 21, 2015", "Peggy K", "Winchester, Virginia, United States", 11, 2, "Conveniently located near Arena Stage. Ordered the Ribeye Steak with potatoes and seared Brussels sprouts - was served a New York Strip with potatoes and broccoli. Ordered dessert only to be told that out of the four choices, what I ordered was not available. The soup of the day, a tomato bisque was excellent. The service was good but overall...\n\n\nMore"], ["Great food but very loud when many customer are present.", 4.0, "April 16, 2015", "TOM_C_NY", "Dix Hills, New York", 18, 10, "Great steak and many beer draft choices. Close to the hotel and in a safe area. Don't have more to say but need 100 char."], ["Great food. Caters to Arena Stage Crowd", 4.0, "April 12, 2015", "Kevin H", "Washington DC, District of Columbia", 32, 15, "The food is excellent, but on the higher range of price. Everything I've had has been excellent. This is one of the few restaurants in Southwest DC at the time this review is being written. They have excellent pizza and mixed drinks. Station 4 has a finer dining / modern ambiance. I've met friends here for dinner and friends here...\n\n\nMore"], ["Nothing Special", 3.0, "April 6, 2015", "landc2015", "Washington DC, District of Columbia", 116, 40, "Where to eat before a performance at Arena Stage? This has been a long unresolved question. My most recent visit to Station 4 reinforced my view that it is conveniently located but provides only adequate food."], ["Nearby and food is good", 4.0, "March 25, 2015", "Andrews_Mommy", "Arlington, VA", 90, 56, "Happy Hours are great here -- finger food is good. Service is fast and efficient.\nLunch is good here as well. Have been here many times. It's not amazing but consistently good."], ["Expensive & greasy", 2.0, "March 10, 2015", "Olivier-Paris-82", "Paris, France", 14, 11, "Food was greasy so I was not able to finish. Service was too fast that I barely had the time to start my drink and finish my appetizer that the pizzas were served. $110 for 2 with pizzas and a shared appetizer is simply ridiculous. Especially for SW but even for NW."], ["Overpriced", 2.0, "March 2, 2015", "comminsdaniel", "Washington DC, District of Columbia", 26, 12, "Living right around the corner from Station 4, it took me 6 months to go there to eat. My initial thoughts on the place were confirmed. While the room is nicely designed, this restaurant is very overpriced for the quality of the food and service.\nService was friendly but somewhat awkward. The restaurant was 100% empty aside from my table...\n\n\nMore"], ["Perfect before a show at Arena Stage", 4.0, "February 23, 2015", "Ann A", "New York City, New York", 5, 1, "Station 4 is a great spot for a bite before, or a drink after a show at Arena Stage. The Station 4 pizza (with pork belly & caramelized onions, yum!) Is a party in your mouth & for a healthier choice, their salmon is perfection. And I still have dreams about the Station 4 burger...I can hear my arteries slamming...\n\n\nMore"], ["Neighborhood Spot", 4.0, "January 27, 2015", "Steve408", null, 155, 57, "Over a two week period we ate at Station 4 on two occasions. My daughter just moved to this area and this was very convenient to her building, the Metro and Safe way grocery. All entree's were worth trying. Chicken, Kobe Burger with fries, Pork Shank fell of the bone and the salmon were all very good . Service was...\n\n\nMore"], ["New Year's Eve", 4.0, "January 14, 2015", "caomhail", "Williamsburg, Virginia", 40, 10, "Had reservations but arrived early for drinks with friends. Service in the bar was courteous and attentive.\nNew Year's Eve menu was 3 course, fixed price with great options for each course. The starters and entrees were great. The dessert we chose was apple pie a la mode but it was served cold on a cold; two in our party...\n\n\nMore"], ["Worth a visit", 3.0, "January 10, 2015", "Sara C", "Washington DC, District of Columbia", 83, 28, "We attended a Christmas party at this venue. The location is easy to get to and there is a parking garage underneath which allows you to park for $11 for the whole evening which isn't bad for DC. The menu we were served was BBQ pork sliders and linguini. Both were very good and filling. They had converted the restaurant...\n\n\nMore"], ["Very tasty - well prepared", 4.0, "January 6, 2015", "RobbCMU", "Fairfax, Virginia", 26, 13, "We booked a reservation for New Year's Eve. It was a prix fixe menu consisting of an amuse bouche and 3 courses (including dessert). The smoked trout mousse was plentiful, but wasn't anything special. That was really the most disappointing course - after that, the food was magnificent. The roasted chestnut soup with duck confit was spectacular. Others at the...\n\n\nMore"], ["Only restaurant in blocks", 3.0, "December 31, 2014", "chevychickie2016", "Pittsburgh, Pennsylvania", 47, 16, "Our party of 5 arrived tired and hungry after a 6 hour car ride. We were immediately seated by a tired and bored looking hostess and got a fancy table up front. The restaurant was probably more expensive than what we would have picked had we had more options and we didn't want to mess around with a fancy menu....\n\n\nMore"], ["Should be on everyones A list of \"to go to places\"", 4.0, "December 30, 2014", "johnnap", "Florida, usa", 106, 33, "Short Uber ride for us tourists but worth the expense and travel time. We enjoyed both he setting and the food. A innovative menu, priced reasonably and executed perfectly. Friendly knowledgable service who make you feel welcome."], ["A great surprise", 4.0, "December 29, 2014", "Linda R", "Crisfield, Maryland", 54, 17, "In early 2014 my husband & i ate here for lunch. We were not impressed. On December 23, we planned to meet our daughter at another location; however, the restaurant was closed for the season. We didn't want to have to drive to another restaurant so we walked to Station4. So glad we did. Food was excellent. Drinks well priced....\n\n\nMore"], ["Not Worth the Money", 1.0, "December 29, 2014", "DCM1025", "Washington DC, District of Columbia", 4, 4, "We went here before our show at the Arena Stage. The food was terrible and overpriced. The steak was overdone and the salmon was practically raw. We told the waiter and he tried to make it up to us by providing my husband with a second cocktail that he did not want. We told them that we had to be...\n\n\nMore"], ["Good food, service, and atmosphere", 4.0, "December 16, 2014", "Elan H", "Aspen Hill, Maryland", 29, 17, "We were four people having brunch on a Sunday at noon. The restaurant took our reservation but it wasn't at all crowded. The atmosphere was elegant and lovely with comfortable table or booth seating. Our waiter was friendly and attentive but didn't rush us. We each ordered different dishes and they all came out within a minute or so of...\n\n\nMore"], ["Great service but...", 3.0, "December 14, 2014", "baysail", "Takoma Park, Maryland", 70, 32, "... the soup of the day was excellent. The wine selection was modest but good. The bread was delicious and seemed fresh. It was marred though by a weirdly smoked butter. The people on both sides of me disliked it too. The entrees we had (quinoa and salmon) were pedestrian at best. The kitchen ran out of the fish special...\n\n\nMore"], ["Good Food. Not Too Elegant", 3.0, "December 6, 2014", "MassimoBeach", "Kalamazoo, Michigan", 148, 51, "The noise and horrid sound system killed the experience.\nThe food was lovely. Really loved beet soup and pizza was good. Excellent salads here.\nThe service was fine, but not charming or special.\nI would not return. It wasn't due if it was a diner or fine dining."], ["Great place to eat by the Arena Theater", 5.0, "November 23, 2014", "tanddGaithersburg_MD", "Gaithersburg, MD", 38, 14, "We were very impressed with Station 4. they held our reservation even though we were 45 min late due to traffic. We ate off the theater menu and had excellent food and service. Drinks were expensive but the service was quick and we made it in time for the show."], ["Station 4 gets a 10!", 4.0, "November 18, 2014", "Toni H", "Harleysville, Pennsylvania", 18, 3, "Visited Washington, D.C.. recently and looked for a nice place with good food for lunch. There didn't seem to be much in the immediate area besides Pizza joints (we were staying at the Marriott), so we got a suggestion from the hotel clerk. He recommended Station 4 and gave us directions, so we walked the 4 blocks. It was about...\n\n\nMore"], ["very good for theater patrons", 4.0, "November 12, 2014", "Scud1952", "Columbia, Maryland", 48, 29, "Around the corner from Arena Stage - bar was packed at 5pm, but had a reservation at 6 for a 7:30 show, and they sat us early. Hour and a half was perfect time. On the expensive side, but good service and good food, though the crab cakes were somewhat tasteless - but big!. Pork shank was excellent. Theater menu...\n\n\nMore"], ["Keep working on it Station 4", 3.0, "October 24, 2014", "Charlotte H", "Washington DC, District of Columbia", 78, 18, "Appetizers were tasty. Buratta with artisanal beets was a well made dish and filling before a show at Arena. Drink menu was fun. Loved sweet lady. Pizza margarita was nice. My friends said salads were fine. We did have to get the manager to resolve an idiot waiter's insistence on windexing a glad wine column in the midst of the...\n\n\nMore"], ["Pleasantly surprised", 5.0, "October 15, 2014", "Lauren L", "Athens", 7, 1, "The decor is very modern and chic! I loved it! Even the bathroom was interesting! Ordered lunch trio soup, salad and half a sandwich for only $10! Everything was delicious! Service was spectacular!"], ["Nice Sunday Birthday Brunch Celebration!", 4.0, "October 5, 2014", "KCM_Live", "Washington, DC", 53, 33, "Our Sunday brunch was an extremely pleasant experience. The waiter was efficient and friendly, and the food was moderately priced and had a diverse selection of menu items. The Duck Fat Fries were delicious!! We had a large party--10 including two small children--and the staff was very accommodating. Overall a very pleasant experience."], ["Brunch Favorite!", 4.0, "September 14, 2014", "Gudewich", "Washington DC, District of Columbia", 78, 27, "I love to eating brunch at Station 4. The portion sizes are good, not too much food, but enough that you are full. The restaurant is beautiful and the staff is friendly. Yesterday I had eggs, bacon, and potatoes. The eggs were cooked perfectly, the bacon nice a crisp, and the potatoes were seasoned well and tasted great! Simple delicious...\n\n\nMore"], ["We were so surprised - and so happy!!", 5.0, "August 24, 2014", "CasualTravelerMass", "Wayland", 17, 6, "We happened on this restaurant because it was near where we were staying for the weekend. Given the somewhat mixed reviews, our expectations weren't off the charts - but we had such a good meal!! My husband, who usually doesn't get as excited as me about food, nearly swooned over how good it all was!! Service was top-notch, the excellent...\n\n\nMore"], ["Good grilled fish", 4.0, "August 2, 2014", "Ugogio", "Milan, Italy", 34, 13, "Just landed in DC delayed and pretty late we had what was supposed to be a survival dinner. We were positively surprised by the nice location and the platter of grilled fish was well prepared and very rich.\nOnly the spinach were ruined by some strange Indian spice rather than the plain taste we were expecting"], ["Paella Night and Sangria on Wednesdays!!", 4.0, "July 2, 2014", "adamcohenil1", "Princeton Junction, New Jersey", 41, 10, "Had dinner with my brother while we both happened to be in DC on business. Found this restaurant, and enjoyed a nice pitcher of peach sangria with some seared tuna (with wasabi) and paella. Food was interesting and tasty. The prices were reasonable (maybe a bit pricey, but for the quality and taste, I thought very good). I'm not sure...\n\n\nMore"], ["Poor Service, Poor Food", 2.0, "July 1, 2014", "Catriona E", "Charlottesville, Virginia", 13, 9, "Station 4 looks chic and elegant, but my experience belied the first impression. I ordered to-go which was to be picked up at the bar. Although not serving other customers, and with my bagged meal sitting on a nearby counter, the woman in charge ignored me, inputting something into her station computer. Meanwhile, the duck fat French fries (highly touted...\n\n\nMore"], ["A very nice meal", 4.0, "June 12, 2014", "Bruce J", "Melbourne, Australia", 86, 52, "We visited Station 4 on a Monday and found they had an excellent fixed price menu for only $20. In addition, they also had several wines at half-price too.All three of us started with a nice salmon carpaccio. For mains two of us had more salmon, while the third member of our party had a vegetable brochette. For dessert two...\n\n\nMore"], ["A Nice Surprise", 5.0, "June 8, 2014", "ebeard", null, 68, 45, "We had dinner at Station 4 prior to attending a performance at the Arena Theater. We had read mixed reviews on Trip Advisor so were a bit hesitant to try it for dinner. What a pleasant surprise! The weather was good so we had the opportunity to eat outside I had read reviews which said the restaurant was noisy but...\n\n\nMore"], ["Great Food, Rock Concert Sound Levels", 4.0, "May 30, 2014", "MCA806", "Herndon, Virginia", 4, 1, "My wife and I had dinner at Station 4 the other night before seeing a show at Arena Stage. The food (Miso Glazed Chicken Thigh for my wife, Crispy Pork Shank for me) was outstanding, probably the best restaurant value we've gotten in a long while. However, and this is a BIG however, it was absolutely the nosiest restaurant that...\n\n\nMore"], ["Very uninspiring", 2.0, "May 23, 2014", "Swankie", "London", 84, 54, "We went here for dinner on a warm May evening and sat outside.\nFirst course was the house salad that was so tired it nearly fell asleep! Brown edged lettuce, limp spinach leaves, two tiny slices of apple and a soggy vinegar dressing. We sent it back and it was deducted from the bill.\nWe then had pizzas. I guess...\n\n\nMore"], ["Unlimited Mimosa Brunch!!", 4.0, "May 13, 2014", "elCubanito305", "Washington DC, District of Columbia", 23, 12, "Tried this place out due to a travelzoo voucher I had purchased and glad I did! the brunch options are amazing full size plates. I had the Huevos Rancheros and my wife had the Farm Fresh Omelette. They were both delicious.\nIf you go for brunch they have unlimited mimosas and they are very quick to refill. As a matter...\n\n\nMore"], ["Great Food but Noisy Atmosphere", 3.0, "May 13, 2014", "twn030577", "Stafford, Virginia", 33, 21, "We decided to try Station 4 prior to our show time at Arena Stage. The restaurant is conveniently located to the theatre with on street metered parking. We opted to grab a quick margherita pizza and drinks. The pizza size was larger than expected and taste great. The service was quick, efficient and attentive. My only complaint would be our...\n\n\nMore"], ["Station 4, a nice dinner for theater night", 4.0, "May 6, 2014", "Rachel H", "Washington DC, District of Columbia", 1, 0, "My husband and I enjoyed the $35 theater 3 course dinner menu before the show at Arena Theater. I ordered the Salmon and my husband the Gnocchi. Very good food and good price! We had a Viginia wine, which we love! Been around the world, VA has excellent wines! The only issue was the dirty wine glasses, which our waiter...\n\n\nMore"], ["Nice friendly spot..good food", 4.0, "May 1, 2014", "LPLoveToTravel", "Wake Forest, North Carolina", 165, 60, "Just got into DC quite hungry waiting for my team to arrive. Walked down for a light dinner & really enjoyed a Cobb Salad. The servers were attentive & the atmosphere was delightful."], ["Awesome food", 5.0, "April 15, 2014", "TheRoni", "New York City, New York", 16, 13, "The best meal I've had restaurant in a very long time. Excellent service. A bit pricey, but hey, its downtown DC. 2 members of our party had the salmon and say it was perfect. I had the pork shank served over spinach. The best! If I hit the area again I'll definitely be back. Very impressed."], ["No Taste", 2.0, "March 30, 2014", "Barbara J", "Morehead City, NC", 173, 96, "Was directed here for good pizza. Was a pretty formal dining venue. Not a pizza place although they feature pizza. Had a margherita pizza and it was awful. No taste at all . Had to get some ranch dressing to give it flavor. Pricey for menu items, and no value at all."], ["The bar is a pleasant and inexpensive experience", 4.0, "March 29, 2014", "Kim T", "Washington DC, District of Columbia", 126, 33, "You have access to the pricey restaurant menu, but also to bar-only fare and happy hour specials. Include the smoked gouda mac 'n cheese or the duck fat fries and you'll not be disappointed."], ["It was okay.....", 3.0, "March 22, 2014", "themuffin8r", "Florida", 53, 48, "The ambiance was great, loved the décor and mood of the place. We didn't eat but the food at tables around looked and smelled great. We had drinks in the bar area and mine was poured heavy handed which I really appreciated, no skimpy drinks here. Our waiter was very friendly, but he could have come around a bit more...\n\n\nMore"], ["Great Brunch, lots of noise", 4.0, "March 8, 2014", "dlosea", "Silver Spring, Maryland", 459, 149, "We had an assortment of egg dishes- omelettes, etc. that were all fantastic with GreAt spices. Virgin bloody Mary's were spicy with loads of fresh horseradish. Our only complaints were the noise (excessive) and the odd arrangements of the bathrooms. Bit overall a success right near Arena Stage."], ["Meh....", 2.0, "March 2, 2014", "navidad_not", null, 76, 30, "This was our first visit to Station 4. We went for brunch. The menu was reasonable. The duck battered fries were delicious. We all shared two portions.\n3/5 entrees showed up to our table cold and needed to be returned to the kitchen. They ran out of the chocolate lava cake which three of us were craving for dessert.\nThe...\n\n\nMore"], ["poor service w/ aloof and lazy staff", 2.0, "February 24, 2014", "Gilbert T", "Washington DC, District of Columbia", 4, 5, "Move on....service is quite bad and the bartender, Eduard.....aloof, lazy, arrogant and inattentive."], ["Delicious food / Fantastic service", 5.0, "February 24, 2014", "agapeMom", "Raleigh, North Carolina", 184, 70, "Service was fantastic and food was delicious. Our son had a pepperoni pizza, my husband had the theatre 3 course chicken meal and I had vegetable risotto. Atmosphere was elegant but casual."], ["Delicious lunch at a great price", 4.0, "February 13, 2014", "Thefun5", "columbia maryland", 22, 12, "Delicious cream of chick pea soup and sandwiches. I would have rated the restaurant a 5 if the salad dressing on the side salad were better, it was like pickle juice. Great waitress and decor."], ["Way too overpriced", 2.0, "February 2, 2014", "Snowblossom1", "Indianapolis, Indiana", 4, 6, "This restaurant is waaaaay too expensive for the food. I had a strip steak which was extremely greasy and fatty, and a mashed potato dish which was just soaked in butter or cheese, or some other such stuff and I could feel the whole thing clogging up my arteries as I ate. Our bill for 2 people (without alcohol) was...\n\n\nMore"], ["Brunch prior to show @ Arena Stage/Convenient location", 4.0, "December 9, 2013", "Marsha H", "Reston, Virginia", 38, 5, "We ate @ Station 4 for the first time prior to a show at Arena Stage on Sunday, Dec. 8th.\nIt was a wintry mix of freezing rain and show so the location of the restaurant couldn't have been better. We had a wonderful experience. The food was very good and the wait staff was helpful. However, we were not...\n\n\nMore"], ["Horrific experience", 1.0, "November 12, 2013", "eli900", "Washington DC, District of Columbia", 1, 0, "Worst!!! My friend fell on wet floor - they said \"You didn't see the sign\" - Total lack of concern - then waitress was RUDE - food was awful - We spoke to manager upon leaving and she was RUDE and brushed us off - We were so upset leaving that I left my wallet and phone - called immediately...\n\n\nMore"], ["Run from this place", 1.0, "November 12, 2013", "Jan P", "Washington DC", 1, 0, "We will NEVER go there again! I never write reviews. This is the first. The service and attitude of the manager and staff were so bad I could not let it go. First, I walked in the door and my feet went flying out from under me on my first step. They had mopped the hardwood floors and had a...\n\n\nMore"], ["Closest Interesting place to eat south of the Mall/Air & Space", 4.0, "November 7, 2013", "heislog", "yardley,pa", 19, 8, "Dined there 2x in October 2013 while staying at Residence inn on E street south of the Mall. Interesting menu, generous portions of very good food. Several in our group had just appys & salads and felt very satisfied. Pizza was the weakest link in the menu. Lots of creative veggie options and fish, meats as well.\nVery enjoyable spot."], ["Best thing is closeness to Arena Theatre", 3.0, "October 21, 2013", "Debra13", "Toronto", 13, 25, "Needed a place for dinner before attending a play at Arena Theatre. This is a great location - right across the street from the Waterfront Metro station and a block from the theatre. Restaurant looks nice. Tables are close together so when it's busy, which it was even early on a Sunday night, it's noisy.\nIt's known for its crab...\n\n\nMore"], ["Great food at a wonderful price", 5.0, "October 18, 2013", "sandra105", "Tampa, Florida", 40, 27, "We went on a Monday and ordered the price fix menu. The salad was outstanding.\nThe red beet soup was the alternate appetizer selection which was as good. Most of us ordered the salmon dish which was fantastic The sorbet dessert tasted homemade.\nThis was a $50 meal at a $20 price tag. For Washington DC, this place is a...\n\n\nMore"], ["So-so food, disorganized, snobby, slow", 2.0, "October 14, 2013", "Chris E", null, 7, 2, "I went to Station 4 with a group that included a vegetarian. Our meals came out so sporadically that some of us were almost done while others hadn't gotten their meal yet. Their only vegetarian option is \"grilled vegetables.\" And that's all it is. No side to the vegetables, no seasoning, just plain grilled vegetables.\nPeople in their bar love...\n\n\nMore"], ["Two Brunches a Year Apart", 4.0, "September 23, 2013", "DKB127", "Bronx, New York", 36, 24, "I first went to Station 4 for Sunday brunch almost exactly 1 year ago when more than a dozen of us from different parts of the country in town for an event came here on the recommendation of the desk clerk at our hotel. The restaurant was very accommodating, seating us at two long table-runs side-by-side, allowing us to circulate...\n\n\nMore"], ["Good Pizza", 3.0, "August 17, 2013", "Gene K", "Salisbury, North Carolina", 322, 130, "Went here with some friends prior to a Washington Nationals ballgame. The services was friendly and prompt. While the menu is not particularly exciting, the pizza I had was tasty and interesting - featuring pork belly and blue cheese."], ["I'm surprised by the other reviews", 4.0, "August 7, 2013", "ToddW22", "Sandy Hook, Connecticut", 116, 34, "We went once for dinner and once for drinks, had a great experience both times, the service was fast and friendly, the food was very good. It was a tad loud, a little bit dark, a little pricey perhaps but overall we liked it very much. Maybe we just got lucky, based on what others had to say it seems...\n\n\nMore"], ["Ugh!!", 2.0, "July 20, 2013", "gkealy", "NYC", 183, 91, "We had reservations before the Janis Joplin show a couple of blocks away at the arena. Tried to have a relaxing drink at the bar..no seats and it was VERY loud. Decided to go to the table. Had reservations for at least a week..got a crappy table right by the front door..all the other tables were \"reserved\"..I said to the...\n\n\nMore"], ["Walk On By....", 2.0, "July 18, 2013", "Duvel11Frederick", "Frederick", 208, 154, "We had a stellar waitress. Let's hope she can find a job elsewhere.\nBeyond loud, walk on by if you want to be able to talk to your dining companions!\nPoor service, walk on by if you expect everybody's food to arrive at the same time. Even the people at the table next to me laughed when my sorbet fell...\n\n\nMore"], ["Good Eating at lunchtime on M Street at the Waterfront", 4.0, "July 12, 2013", "Rbrtgldstn", null, 54, 27, "Steel and glass bistro style eatery, so the atmosphere is good. It was Friday noon...not a big lunch crowd...so noise level was good also...There were 7 of us...orders were taken with efficiency...the waiter pleasant...although two of us came late, meals for all were delivered at the same time...Mostly sandwiches with either fries or side garden salad...cubans, ruebens, crab cake, brisket...\n\n\nMore"], ["What a surprise", 5.0, "July 8, 2013", "lkaplow320", "Bethesda, Maryland", 17, 6, "We happened to come across this restaurant after going to the theater a few blocks away. We were immediately taken by this restaurant based on its decor. It was very contemporary and chic- New York trendy which for us is a complement. The staff were friendly and welcoming. Our waiter suggested the sea food special and it was scrumptious. My...\n\n\nMore"], ["Near Arena Stage", 4.0, "June 22, 2013", "arlingt0n", "Arlington, Virginia", 7, 4, "We were going to Arena Stage and wanted to have a nice pre-theater dinner. Station 4 is about 2 blocks away, next to Waterfront Metro. They have a prix fixe pre-theater menu too - $35! I had an apple-spinach salad - tasty - with dressing that wasn't on too thick and the grilled salmon. Hubby had the crab cake and...\n\n\nMore"], ["Left Something to be desired", 2.0, "June 20, 2013", "JoJosontheroad", "Pittsburgh, Pennsylvania", 109, 58, "Beautifully decorated with a hopping bar on a Thursday evening. But really missed the mark as far as food and service. Our waitress was attentive at first but it took forever for our food to arrive. When it did, we were told that their ovens had broken. They could have mentioned this at some point or offered to compensate us...\n\n\nMore"], ["The hour glass ran out", 1.0, "May 20, 2013", "ghs1", "Rockville, Maryland", 16, 13, "This restaurant has the good fortune of being located within a short distance of the arena stage theater. This provides a captive audience of evening theater goers. This theater goer will never return, PB &J in the car will be an improvement. The incredibly slow service is the killer. We ordered and waited and then waited some more. A pleasant...\n\n\nMore"], ["Great food, lousy service.", 3.0, "April 25, 2013", "Samantha G", "San Francisco, California", 39, 31, "Was recommended by our hotel concierge, which was a nice 15 min walk to get to. We ordered the grilled squid, salad, soup of the day and shellfish. Me and my mom enjoyed and loved everything, and finish it all down to the last morsel. But the good ends there. The service was poor and I wish they could find...\n\n\nMore"], ["Best Sunday Jazz Brunch in DC", 5.0, "April 15, 2013", "Elysa J", "Washington DC, District of Columbia", 1, 0, "We love Station 4. It is by far our favorite place for brunch in Washington, D.C.\nEvery dish is amazing but the best treat is the Jazz Band. We always feel like we\nare getting something EXTRA when the band plays."], ["Mediocre Food, Poor Seating", 3.0, "April 15, 2013", "areview28", "Silver Spring, Maryland", 731, 296, "The best thing about Station 4 is its convenience to Arena Stage for a pre-theater dinner, or to the Nationals Stadium. Aside from the decor which is a bit gaudy we didn't enjoy dining at the miniscule cafe tables for two. At times we had to remove objects from our table and place them on the banquette in order to...\n\n\nMore"], ["Like great, tastes great.........", 5.0, "April 8, 2013", "DianeJaredHowie", "Winnipeg, MB, Canada", 18, 11, "On our first night in WAhington DC our hotel front desk manager gave us a recommendation to dine at Station 4, a 15 minute walk from our hotel. That was a good recommendation! The space is beautiful, with big windows, long flowing curtains, tables as well as curved banquettes. The good was delicious. I had the Rockfish and is was...\n\n\nMore"], ["Mediocre at best", 3.0, "April 8, 2013", "urbanwaterfall", "New York City, New York", 12, 2, "I made a reservation for Saturday morning brunch was was seated quickly by a lovely lady. My sister and I opted to sit outside as it was the first real spring day and, frankly, it was a little loud inside. The interior decor is trendy in a way that an out of touch person with an oversized wallet and something...\n\n\nMore"], ["Good restaurant for dinner or drinks", 4.0, "April 8, 2013", "Ron W", "Woodbridge, Virginia", 19, 18, "Let me start this review by saying if you plan on going to Station 4 on a Friday or Saturday evening get a reservation. I went on a Saturday evening without a reservation and was fortunate to get a table by the bar which are first come first served. The decor is very nice and the menu was great too,...\n\n\nMore"], ["Nice place, nobody home", 3.0, "April 3, 2013", "Traveling_Mammy_of_3", "Plymouth, Michigan", 73, 95, "Station 4 was within walking distance to our hotel in DC. We had 5:15 reservations upon recommendation of our concierge. Given that NO ONE was there at that time, I would've thought our party of five would've received better service. I would describe our waiter as 'low affect.' He seemed to disengage once he realized we weren't going to have...\n\n\nMore"], ["Horrible !Terrible! Embarrassing!", 1.0, "March 26, 2013", "Jim B", null, 14, 14, "This past Sunday, I took a friend from the State Dept. as well as my son and his girlfriend out for a reunion of sorts, for brunch at the Station 4 resturaunt. We made reservations for 10:30 and we showed up on time.\nIt featured a special brunch that included all-you-could-drink Mimosa's or Bloody Mary's. A perfect place to catch...\n\n\nMore"], ["A Good Arena Option", 4.0, "March 24, 2013", "Barbara M", "Fairfax, Virginia", 48, 20, "They must have listened to the last reviewer's comments--it was not as noisy as the 17 Mar reviewer noted. There was the normal resaturant din, but no loud music. That said...\nThe food was good. He had the $35 Pre Fixe. As one review noted, the portions on the pre fixe are small, but just right when you consider 3...\n\n\nMore"], ["We couldn't hear one another, neither could the waitress . . .", 2.0, "March 17, 2013", "Gabriel_Winter", "Washington DC, District of Columbia", 78, 59, "We were there for dinner before Arena Stage event, 5:45pm. Sound was pumped up, and so was the noise. Was so bad that the waitress couldn't hear what we were ordering and brought the wrong dish and the wrong wine. Not her fault. She literally could not hear us. We couldn't hear one another. They have a problem due to...\n\n\nMore"], ["If you want to feel unwelcomed come here", 2.0, "March 2, 2013", "Beakshire65", null, 1, 1, "My friends and I were staying in a nearby hotel and wanted a nearby bar to enjoy. We were told by the concierge that station 4 was the closest. Walking into the bar it was a very nice atmosphere but we received dirty looks from the bartenders when we arrived around 12:30am. The barback was extremely friendly but the bartenders...\n\n\nMore"], ["Mediocre food. Very crowded & no personal space.", 3.0, "February 28, 2013", "Samer16", "Damascus, Maryland", 11, 3, "If you like your personal space, Station 4 is not for your. This seems to be the only nice place to eat before a show at Arena Stage, so it's very crowded. We went on a Wednesday, so the restaurant is probably crowded every night there is a show (I can't even imagine what it's like on the weekend!). My...\n\n\nMore"], ["Bite before Arena Stage", 4.0, "February 24, 2013", "Clay W", null, 83, 14, "The only good place to eat around the theater. Had excellent pumpkin soup, and swordfish very lightly cooked, just the way I like it. Cheesecake desert was mediocre, but nice that they let you return after the theater to finish your prix fixe meal."], ["NEVER AGAIN Sun Feb 10th 2013", 1.0, "February 11, 2013", "josephandkari", "Bowie, Maryland", 27, 25, "We got there early 5:50 I explained we had a 7:30 show The seating was very tight almost like a cafeteria. Then I noticed that the table wear and wine glass were dirty and I was missing silverware. The server was very nice and replaced them but her supporting cast were HORRIBLE. When the bread came out ,they brought two...\n\n\nMore"], ["Finally! A great meal option near Arena Stage", 4.0, "February 10, 2013", "CDinDC20009", "Washington DC, District of Columbia", 90, 80, "We've been struggling with the food at Arena's Catwalk Cafe; it is both not good and overpriced. Someone mentioned Station 4 and we thought we would try it. As soon as we walked in the door, we knew our meal dilemma was over. Very obliging hostess. Terrific server -- Keera -- who managed to beautifully manage our questions and our...\n\n\nMore"], ["Great food quickly", 5.0, "February 8, 2013", "I_am_Lost_on_purpose", "Washington DC, District of Columbia", 31, 20, "My friend and I went to this restaurant for dinner. We were also going to a show at Arena Stage. We told them that we were going to the show and they made every effort to make sure that we would have our bill and be out the door in time to make it to the show.\nThe menu is...\n\n\nMore"], ["Good for lunch", 4.0, "February 1, 2013", "Tamaria", null, 57, 61, "Stopped by here today instead of Zburger, which is next door. Was seated right away as they weren't that busy. The hostess was really nice. Ordered our drinks and received them right away. About five minutes later the waiter returns for our lunch order. I must say I was getting a bit irritated at how long it took for the...\n\n\nMore"], ["Really nice find in a dining-barren area.", 4.0, "January 29, 2013", "duhgbert5254", "Allen, Texas", 3, 0, "Staying south of the Mall for the first time with my wife, I arrived in DC on my birthday. We're staying at the Residence Inn Capitol, and my trusty Google Earth showed tons of lunch stops, but few if any nice restaurants this side of the National Mall.\nLuckily I looked south from here and found Station 4, and I...\n\n\nMore"], ["Don't waste your time", 1.0, "January 24, 2013", "truth8", "Gainesville, Florida", 51, 9, "I dined here with a group of friends on a Friday night and should have known something was wrong because the bar was busy, but the floor was not. Our group frequents many restaurants quite often and are very understanding if things are slow or food come out wrong, but this time was an epic fail. After ordering drinks, we...\n\n\nMore"], ["A waste", 1.0, "January 23, 2013", "gatorj", "Tallahassee,FL", 93, 37, "We went to this restaurant with friends on a Friday evening. It was our first night in town and we were meeting up with friends. We walked in and there were a few people seated. We asked for a table for 7 and the hostess seemed annoyed that we did not have a reservation despite the empty tables. We were...\n\n\nMore"], ["Probably won't go back", 2.0, "January 22, 2013", "JED333", "Washington, DC", 24, 3, "These folks were totally ill-prepared for the onsalught of people coming in for the Inauguration and without reservations for brunch on Sunday. We did have reservations and got there 45 minutes early, yet people who were just coming in off the street were seated in front of us. After finally getting seated, our waiter, while a very nice guy, took...\n\n\nMore"], ["Friendly Service", 4.0, "January 10, 2013", "NMura", "Philadelphia, Pennsylvania", 22, 6, "The food isn't fancy but it is perfect for a relaxing meal. The decor is nostalgic of an old fire station. It wasn't busy so we had outstanding service."], ["Getting better every time", 5.0, "December 26, 2012", "Dnoveau", null, 30, 11, "Around the Arena stage, there is only one good restaurant for pre-theater dining that is convenient to the theater (One block away). Station 4 has been working that niche for a while now, so my wife and I , with our theater friends, are pretty regular customers. A year or two ago, the pre-theater dining at Station 4 was pretty...\n\n\nMore"], ["Tries hard but prone to kitchen meltdowns", 3.0, "December 20, 2012", "Lever212", "Washington, DC", 66, 40, "We have dined at this restaurant on multiple occasions, for lunch, brunch, and dinner. The food is generally quite good, and the waitstaff strives mightily. However, problems arise on occasion, especially when the kitchen is under pressure. This seems to be especially true when a pre-theater crowd is dining at Station 4 before attending a show at nearby Arena Stage....\n\n\nMore"], ["Close to Arena Stage & Metro", 4.0, "December 10, 2012", "Jinxs-Mom", "Maryland", 31, 22, "We went to a 2PM play at Arena Stage and chose this restaurant to dine at afterwards. The location was perfect, especially since it is located one block away from Arena Stage and directly across the street from the Waterfront metro stop.\nWe planned to order from the menu until we heard the specials. We ordered the cauliflower soup and...\n\n\nMore"], ["Cozy little urban eatery in SW quadrant", 4.0, "October 1, 2012", "AndrosBahamasBabe", "Washington DC, District of Columbia", 92, 34, "It was a last minute decision to walk to Station 4 for a late dinner. Even though they were setting up for a group of more than 20, we were seated quickly and the waitress took our drink order. With a nice wine list to choose from, I ordered a glass of the Northstar, a red of Washington state fame....\n\n\nMore"], ["Good Pre-Theater Option", 4.0, "September 30, 2012", "discopantsguy", "New York City, New York", 57, 18, "Place was stylish, and offered a 3 course prix fixe for $35 for the theatre crowd, which was a great option. The steak frites were excellent. Drinks were good, about $12 for the \"fancy\" cocktails. The food came out quickly, which was nice. Service was good, if a little inattentive. We never did get the water we asked for -...\n\n\nMore"], ["Good location, good food", 3.0, "September 24, 2012", "janebeard", "Churchton, Maryland", 165, 68, "I've had drinks here, and been to a fun wedding reception here. The other day, we had brunch here. Admittedly, we arrived within 15 minutes of the place opening. But they were not really ready for us. The service was inattentive and without thoughtfulness. The eggs benedict arrived hard boiled, not at all runny. I asked for new eggs. Fifteen...\n\n\nMore"], ["great place to eat", 5.0, "July 31, 2012", "debra m", "Killingworth, Connecticut", 2, 2, "great happy hour menu, drinks reasonable and help was great , friendly , helpful , great atmosphere,"], ["Good location and very nice decor", 4.0, "July 19, 2012", "CareInn", "Falls Church, Virginia", 151, 24, "I have been wanting to check out this restaurant since it opened and actually wanted to go for brunch but ended up spending my birthday dinner. Everything was good. They feature a lot of locally sourced items which I am always a fan of. I chose to eat two of the featured specials: a watermelon gazpacho and the swordfish. The...\n\n\nMore"], ["Way too noisy! Good location for Arena Stage.", 3.0, "July 14, 2012", "winelover34", "McLean, Virginia", 6, 0, "Attractive restaurant (the only game in town for pre-theater Arena stage dining) with small outdoor dining area that overlooks metro station and construction site. Inside the tables for 4 are fine, but those for 2 would only hold drinks; totally unsuitable for dinner plates, drinks, etc.\nThe lounge was very crowded, undoubtedly due to happy hour and proximity to metro....\n\n\nMore"], ["Great for post-theater dinner", 5.0, "June 21, 2012", "WashDCTravelGuy", "Washington DC, District of Columbia", 57, 75, "We had dinner here after seeing a show at the Arena Stage. Although I'm very impressed with their appetizers and entrees before and desserts after theater package, neither my boyfriend nor I can get to the restaurant early enough to take advantage of it, so we end up having to eat the entire meal after the show. That said, after...\n\n\nMore"], ["Should have been better", 3.0, "June 15, 2012", "beagle16", null, 28, 14, "I had dinner at Station 4 with a group of five friends. It was an okay experience, but not much more. The environment is attractive enough, with a nice setting and close to the DC waterfront. The food was an array of American foods. The prices are very high (a typical entree was in the 25 - 30 dollar area)...\n\n\nMore"], ["Interesting menu and good location", 3.0, "May 28, 2012", "antshe", "Herndon, Virginia", 116, 72, "I ate here before going to Arena Stage. It is a great location, right across the street from the Metro. The menu looked good but I wasn't overly hungry. I asked the waiter for his recommendation. He proceeded to recommend the most expensive and then the next most expensive item on the menu. When I said I wasn't that hungry,...\n\n\nMore"], ["Way Overpriced and Tiny Portions", 1.0, "May 22, 2012", "DCLastcolony", "Washington DC, District of Columbia", 27, 7, "I am a resident of SW DC, so I was looking forward to trying out this new neighborhood restaurant. However, although the food was okay, the portions were quite small and the prices quite high. My friend and I came away having to fill up with bread (which we had to ask for) and a $90 bill with tip for...\n\n\nMore"], ["our favorite eating place in d,c", 5.0, "May 4, 2012", "percygrate", "PA", 17, 32, "we come with no expectation besides were hungry we order our food & it arrived quick were so hungry our waitress is so nice very pleasant the food are delicious ,love there coffee happy hour & desserts as we love coffee,hope they gonna have a cocktail happy hour soon :)anyway its wonderful visits we have thank you so much for...\n\n\nMore"], ["Disagree with the criticism", 4.0, "April 19, 2012", "29Lorenzo", "Washington, D.C.", 92, 36, "I will admit to having been very apprehensive about dining here before an Arena Stage performance given the Washington Post and Trip Advisor reviews, but we had a very good dining experience. We had exactly one hour to dine to make it to the show. We communicated this to the waiter upon arrival; he promised no problem and is was...\n\n\nMore"], ["Good food and location for theatre but a bit loud for conversation", 4.0, "March 27, 2012", "KSB030", "Franklin, Tennessee", 30, 16, "Well worth the visit. My spouse and I went there for a pre-theatre meal. We ordered off the special menu which was a good deal, although not great, however if you are driving it includes valet which would make it better. The food was good and the atmosphere was nice, although the bar side was bit loud and that noise...\n\n\nMore"], ["Unbelievably slow!!!", 2.0, "March 22, 2012", "Debbie H", "Fredericksburg, Virginia", 37, 18, "I wish I could give this place a better review because the food I had was very good. It just took forever to get it. My co-workers and I went to lunch there and our first clue was that it took 15 minutes for a waiter to come to our table to take our drink order. 20 minutes later he...\n\n\nMore"], ["Huge Disappointment", 1.0, "March 18, 2012", "ECB2010", "Washington", 111, 61, "This was a huge disappointment and an embarrassment. Every month a group of friends and I pick a new restaurant to visit. We try to vary our selections according to cuisine and/or location. Tis month was my pick and I opted for Station 4. What.a mistake! Words cannot capture how bad the service is despite the fact that the restaurant...\n\n\nMore"], ["Going downhill fast", 2.0, "March 17, 2012", "stanpen", "Bristow, VA", 23, 38, "I was glad to see this upscale restaurant open up on the waterfront. As a season subscriber to Arena Stage it was welcoming to have a place to eat before the show. I have visited the restaurant three times and each time it has gone downhill.\nMy first visit was shortly after they opened and everything was great. The service...\n\n\nMore"], ["Varied Menu with Great Service", 5.0, "March 12, 2012", "paintermom", "Boston", 75, 37, "This is a great choice for people looking for a restaurant in SW DC. The menu offers a lot of choices and the restaurant has a new and lively feel to it. I imagine the bar scene at night is pretty busy. We came on an evening when it was packed with the pre theater crowd. We had a great...\n\n\nMore"], ["Brunch is a Treat", 5.0, "March 6, 2012", "SWN", "DC", 108, 52, "We had previously been to Station 4 for pre-theater appetizers and drinks, and were satisfied --- if not overwhelmed --- by our experience. But this was right after their opening and so when we were in the area last weekend, we decided to drop in for brunch. It was great. The room was over half-full, and we had no problem...\n\n\nMore"], ["pretty good", 4.0, "March 4, 2012", "TomBBaltimore_Md", "Baltimore,Md", 35, 26, "My wife and I dined at Station 4 on a Saturday night, pre- Arena Stage. Food was pretty good. I ate cobb salad, which was tasty and braised short ribs, which was also good, but a bit light on the meat and abundant on the pasta. Other people had beet salad. Everyone was pleased, nobody raved, nobody complained. Service was...\n\n\nMore"], ["good reasons to go...and not", 4.0, "February 6, 2012", "experimentaltraveler", "Richmond", 80, 49, "Great location, lovely atmosphere and efficient service (especially important for theater-goers). Salads are quite large and delicious, scallops were well-prepared but few, octopus tentacles can range in size...no guarantee that you'll get a large one...we got one large and one about half that size. Chicken OK. A bit pricey for what you get, but overall a nice experience. If you're...\n\n\nMore"], ["One of the best pre-theater dining experiences in Washington", 5.0, "January 5, 2012", "JerryM", "Falls Church, VA", 48, 35, "Excellent food, elegant atmosphere, and efficient, personable service make this an excellent choice for pre-theatre or anytime dining. The fact that it is a short block from the Arena Theater and offers convenient parking and an attractively-priced pre-theater menu is an added plus. All the dishes were well-prepared and creative. The tuna tartar and grilled octopus appetizers were outstanding, and...\n\n\nMore"], ["Deafeningly noisy, Confused service, Expensive, Small portions, Mediocre food - at best", 1.0, "December 19, 2011", "TomWall60", "Rockville, Maryland", 322, 189, "I was not sure how to approach a review of this restaurant. There are those that may be used to what this restaurant has to offer ( I did look at the most recent reviews as well as earlier reviews), but I guess that I expect a certain standard when I am going out to eat and paying a lot...\n\n\nMore"], ["Stop in Before a Show at Arena Stage", 4.0, "December 13, 2011", "trvladdict", "Washington DC, District of Columbia", 332, 282, "I've been to Station 4 several times for brunch, dinner and drinks at the bar and have always enjoyed my meal. They serve consistently good American food in a nice setting. They have a nice size bar, with regular happy hours and tasty appetizers. The dining area is pleasant, with lots of natural light from the large windows. The music...\n\n\nMore"], ["Elegant and Tasty but very comfortable", 4.0, "November 29, 2011", "powycommodore", "San Francisco, California", 54, 27, "Met 7 friends for dinner at our rather new neighborhood Station 4 last night for a wonderful meal. Conveniently located at the Waterfront Metro stop, it was a special limited menu night but you could order from the regular menu so there was something for everyone.\nAppetizers: turkey? and corn soup-marvelous; pepper with crabmeat-excellent--can't remember the other appetizers because most...\n\n\nMore"], ["Has potential to be great; service needs improving", 3.0, "November 25, 2011", "yobo94", "Boston, Massachusetts", 68, 35, "We stopped by one evening since it was near the hotel we were staying at. We were exciting to find this revitalized area in what seemed like an older, worn, nothing-there neighborhood. It was the only nice looking restaurant around, right by a new grocery store, CVS--just steps from the Waterfront Metro stop and bike-share rack.\nThe setup is nice...\n\n\nMore"], ["It's a jewel rising out of the dust", 5.0, "October 2, 2011", "mai2centsworth", "San Diego, California", 145, 71, "I used to live in SW on the waterfront and have grown up in the area, so I have watched the area go from good to bad and am now enjoying its renaissance. For many years, the area where the restaurant is located was in serious decline with an unbalanced mix between the have and the have-nots. But, now it...\n\n\nMore"], ["Can't beat the convenience for pre-theater eats", 4.0, "September 20, 2011", "travelingfun101", "Washington DC, District of Columbia", 180, 85, "We planned our dinner so that we'd have plenty of time before our 7:00 p.m. show at the Arena Stage. It's within walking distance in a well lit area. Because we were there at around 5:00 p.m., the service was very attentive. Two of us ordered the individual pizzas and they were huge! If you choose to do this, you...\n\n\nMore"], ["Great Food - Poor Service", 3.0, "September 6, 2011", "tvchase", "frederick, maryland", 35, 60, "This restaurant needs to realize many patrons are on their way to nearby Arena Theater and take it up several notches when it comes to service. While they held our reservation 30 minutes, when we arrived, tables outside were filled but the dining room was empty.\nWe told the waiter our time was limited. We ordered a round of drinks...\n\n\nMore"]]], ["Policy", [["Good ambience, underwhelming food.", 3.0, "August 30, 2015", "bethesda_fork", "Bethesda, Maryland", 6, 0, "Policy is located in the happening 14th St neighborhood where every block is lined with restaurants, bars and coffee shops. We had reservations for dinner and were seated by the hostess at a table outside. The patio was located alongside a quiet street and was a great dining spot on a pleasant Washington summer evening. Though we don't get too...\n\n\nMore"], ["Worth a second try!!", 4.0, "August 21, 2015", "rrupp1966", "Washington DC, District of Columbia", 29, 6, "Decided to give Policy a shot as it was close and we were hungry. After being seated next to the kitchen in an empty restaurant we waited 5-10 just for water. Thinking we were not off to a great start I was concerned about dinner. I chose the hand cut fries and they were delish!! The garlic got to be...\n\n\nMore"], ["Scrumptious but loud", 4.0, "July 19, 2015", "The_B2", "Arlington, Virginia", 60, 23, "I took my parents here over Father's Day. Food was fantastic, and our server was delightful. But it was *loud*. For such a small main floor, it's impressive how noisy it got - must have something to do with the accoustics of the place's set up. In any case, would come back for food, but perhaps not with the parents."], ["Unique and Tasty", 5.0, "July 13, 2015", "pegasus025", "Tampa, Florida", 33, 23, "I was visiting my daughter who lives in the Adams Morgan area and we decided to explore the U street and 14th st areas and choose a place that looked interesting. After passing a number of places with fairly typical fare, we stumbled upon Policy. The menu was very intriguing and quite different from anything I've seen before (and I...\n\n\nMore"], ["Happily Surprised", 4.0, "July 5, 2015", "nreyesok", "Potomac, Maryland", 246, 98, "Policy is definitely underrated. There are so many good restaurants along this corridor, that Policy was not even near the top of my \"to try\" list. But a bunch of us were eating dinner on a Saturday night and one of the group made reservations here. And I definitely want to go back after our experience. The service was great...\n\n\nMore"], ["Excellent service. Enjoyable meal.", 3.0, "May 9, 2015", "Keach", "Virginia", 16, 5, "Four of us went to Policy before a show at the nearby Black Cat. We had made reservations the day before through TripAdvisor, and I got a phone call the next morning to confirm. We were seated right on time.\nThe service was great. Professional but not stuffy. The food came out quickly (in small plates style, as it was...\n\n\nMore"], ["A Little on the Loud Side", 3.0, "April 1, 2015", "shoreylj", "Harrisburg, Pennsylvania", 102, 18, "Policy serves small bites for sharing. The restaurant has high ceilings and the space seems to expand the noise level. We had a hard time hearing the waiter over the music and conversations and the restaurant was just over half full. The food was good but the wine by the glass was not as good as similarly priced wine of...\n\n\nMore"], ["Small Plates Done Well", 5.0, "March 26, 2015", "Ron C", "San Jose, California", 30, 31, "Sometimes the \"small plates\" concept can miss the mark; not here at Policy. All dishes were really creative and well-executed, and we had 11 or 12 among the 4 of us. Great bar with a creative cocktail list. Just go and have a good time!"], ["Nice informal place in Washington, DC", 4.0, "December 4, 2014", "SerpaJ", "Chevy Chase, Maryland", 59, 19, "Had a very late brunch in here with a group of friends from the Washington DC area. I (& a few more in the group) picked the Shrimp & Grits. Another popular choice was the Crab & Eggs Benedict. By the end of the meal everybody seemed to be satisfied with their food. Both the service & the prices were...\n\n\nMore"], ["Wanted drinks & appetizers before the Lincoln Theatre.", 4.0, "November 13, 2014", "mlefler", "Conway, Arkansas", 57, 23, "We took a chance on Policy before a show at the Lincoln Theatre and I was very happy that we did. The drinks were great and the food was interesting. Some fun twists on american classics. I started to pass on the french fries but glad we got them. Oh my, they were good. Crab cake sliders, brussel sprouts, and...\n\n\nMore"], ["Pretty Good", 4.0, "September 26, 2014", "Chris Y", "Athens, Greece", 4, 0, "Interesting food and good music.Fun place for a bite in between bar hoping at 14th street. I would go again!"], ["Small plates- mediocre food and NOISY", 3.0, "March 28, 2014", "laughingtraveler", "Washington DC", 68, 66, "Everything was a disappointment on a Friday night. The chicken sitting on what seemed like a pool of Grey Poupon- overwhelmed it.\nMy friend had the scallops and they seemed to use the same approach there.\nWaitress interrupted us four times to check in but disappeared when we wanted the check. And she gave us bills for all her tables....\n\n\nMore"], ["I like this place!", 4.0, "September 3, 2013", "WashingtonJonDC", "Washington DC", 248, 109, "Came here for the third time recently and still enjoyed the food and the restaurant. They have tapas style food which are tasty and fairly priced. I like the atmosphere- which is casual, hip, bar-like, dark, and with booths, so you can concentrate with the food and your company. I've never had any problems with service; the service pair-up well...\n\n\nMore"], ["Truth Love and Liberty Prevail at Policy", 5.0, "August 25, 2013", "MaryJoTarallo", "Washington, District of Columbia, United States", 21, 10, "It probably was fitting that we dined at Policy on the 50th Anniversary March for MLK's \"I Have a Dream\" speech. The restaurant lives up to its slogan too - Truth, Love, Liberty - by displaying a friendly atmosphere and a love for culinary experimentation.\nWhile the decor is a bit on the dark side most probably would consider it...\n\n\nMore"], ["Pleasant Surprise!", 5.0, "August 13, 2013", "NaijaDiva", "Washington DC, District of Columbia", 57, 25, "My first time visiting Policy was for brunch. I went with a friend. She ordered the tuna tartare, which she exclaimed about, and I ordered the steak and eggs well done. I was so impressed by each element of the meal. My juice was perfect, and even though I ordered my steak well done, it was still tender. The best...\n\n\nMore"], ["Good food but not very good service", 3.0, "May 19, 2013", "skeepz", "Washington, DC", 9, 4, "Food was good. It took a long time to get some of the food. When I asked the waiter he was rude telling me it comes out when it is ready and it is small plates and not served in any order. I then asked for a manager and it turned out that some of the items was filed but...\n\n\nMore"], ["Small tasty plates in a bar-like atmosphere", 4.0, "April 26, 2013", "PrincessCT", "CT", 14, 8, "Beth was a very friendly server. Reception desk also welcoming. They say the restaurant is family style eating but that is misleading as one would expect large plates. It is actually a lot of small plates. We enjoyed the tuna tartar, beet salad, gnocchi , and creme brûlée. All were very good!"], ["Good atmosphere but food and service really lack", 3.0, "March 19, 2013", "LoveLifeAlways7", "Lansdowne, Virginia", 60, 17, "The restaurant is nicely decorated but a little harsh with the colors. It's feels very cold when you get in, it's not a fancy or cozy place. The food is overpriced for the small portions you get and mine was overcooked and burned. $12 just for two eggs and burned hash browns that had no flavor?! No thank you! I...\n\n\nMore"], ["Will never go back", 1.0, "December 9, 2012", "GtownWine", null, 42, 12, "Worst service I have experienced. Food was good and atmosphere was ok but because of the slow horrible service I will never go back."], ["Great place for drinks and a light meal", 5.0, "November 27, 2012", "WilmGirl", "Charlotte, North Carolina", 6, 1, "Great menu and eclectic vibe! Loved the tuna! The plates are a little bigger than tapas are good for sharing. The cauliflower dish was also delicious!"], ["Not recommended in any way", 2.0, "October 19, 2012", "Aramisa", "Stockholm, Sweden", 23, 11, "We were recommended this restaurant by our hotel concierge but it was a disaster. The food terrible, under/over cooked, weird flavour combinations (as if a chef was just trying, but not really knowing) and the drinks were nothing special. We would never go back, but were rather happy to leave. Service was not great, this seems to be a bar/nightclub...\n\n\nMore"], ["Never. Again.", 1.0, "September 18, 2012", "Blurryeuphoria", "Washington D.C.", 9, 1, "My first experience at Policy was a huge disappointment and will definitely be my last.\nThe evening was going well until one of the servers there (Monica) managed to spill a WHOLE BOTTLE completely upside down INTO my brand new Coach purse. How the neck of a bottle of liquor ended up INSIDE my clutch purse is a mystery to...\n\n\nMore"], ["Absolutely everything was good!!!", 5.0, "August 20, 2012", "CareInn", "Falls Church, Virginia", 151, 24, "We went for a birthday dinner and ended up taking advantage of the Restaurant week menu which I normally oppose. We had salted beets, cauliflower gratin, shrimp and polents, mussels, brussel sprouts, scallops, another fish dish and a tuna tartare. I was blown away!! I've never had scallops cooked more perfectly. Our service was great and the atmosphere is very...\n\n\nMore"], ["Went for a drink, stayed until closing", 4.0, "July 7, 2012", "Kobbi G", "North Bethesda, Maryland, United States", 19, 11, "I went to Policy on a Friday night.\nI just went to meet a friend there for a drink there even though I saw most reviews had to do with the quality food they serve on the ground floor. I went straight upstairs from the intended upstairs entrance (separate entrance from the restaurant).\nThe scene was very cool, good pop,...\n\n\nMore"], ["Nice Place", 3.0, "July 2, 2012", "AfricanVenus", "New Jersey", 68, 49, "We stopped here looking to eat a late dinner at Creme Cafe, but their kitchen was closed. I remembered seeing Policy on the way and also as a must-go restaurant when doing my pre-D.C. trip research. We stop in and are carded, as there is a club in the basement I believe. I asked if their kitchen was still open...\n\n\nMore"], ["Saturday nights", 3.0, "June 15, 2012", "ExPat0331", "Arlington, Virginia", 393, 122, "Saturday nights this restaurant turns into a club basically. You can buy tables (if you're goin gin a group, well worth it) you get bottle service if you buy a table."], ["Good place for a leisurely brunch", 4.0, "June 2, 2012", "paxa", "Washington DC, District of Columbia", 370, 207, "Policy is across the street from Café Saint-Ex where we had brunch last Saturday so decided to try it out this weekend. We sat in the outdoor patio, which is south facing so it gets a lot of sun during the day (the inside seems to be rather dark and noisy – not quite the right atmosphere for brunch). For...\n\n\nMore"], ["Fun for four", 4.0, "May 29, 2012", "wesglenfoodie", "Durham,NC", 11, 7, "Four of us ate here this weekend and really enjoyed it. The small shared plates allowed us to sample many dishes, including two desserts. The fresh, lightly dressed salads, one with duck and the other with poached pears, were favorites. The beef short ribs were rich and tender, and the melting pork belly was nice and crispy. We also really...\n\n\nMore"], ["Rude Service, Average Food", 2.0, "February 12, 2012", "trvladdict", "Washington DC, District of Columbia", 332, 282, "We decided to stop in at Policy since Cork Wine Bar just down the street was packed. It was very disappointing for a Saturday night out on the town. The waitress gave the impression that she could not be bothered and did not know anything about the wines on the menu, complaining that the wines are kept downstairs. Our first...\n\n\nMore"], ["Nice Location but Average Food and Service", 3.0, "January 31, 2012", "BFunk88", "Washington DC, District of Columbia", 27, 23, "This is a conveniently located restaurant in the U-street corridor that has a fairly nice vibe going on inside, but the service and food were a little lacking. The menu is not very large, which was problematic for me since I am a picky eater. My companion got the chicken (I don't remember the exact name) and I got a...\n\n\nMore"], ["Cozy atmosphere, good food, great cocktails", 5.0, "January 28, 2012", "Valux01", "London, United Kingdom", 346, 184, "very recommended for good bite / drinks with friends."], ["Average restaurant for DC", 3.0, "January 17, 2012", "Kaluah23", "Charlottesville, Virginia", 25, 4, "Overall, the food was good. However, it was just good, but not great. Maybe I went on an off night, but none of the dishes were great. I was hoping for more from this restaurant."], ["Fabulous Small Plates in DC's U St. Corridor", 5.0, "November 26, 2011", "TonyTrombly", "Arlington, Virginia", 3, 1, "A more complete review of this restaurant with details about ths food and pictures can be viewed on my blog, http://tonytrombly.wordpress.com\nRecently I had the pleasure to eat at Policy in DC's U St. Corridor. What a fantastic choice of a restaurant!\nIt is a \"small plate\" restaurant and thus very conducive to sharing with other people in your party....\n\n\nMore"], ["Great Sunday Brunch!", 5.0, "September 12, 2011", "Nana2AB", "Michigan", 7, 5, "My family enjoyed a wonderful brunch at Policy. The menu had interesting twists on traditional breakfast fare, as well as great lunch dishes, like the lamb sliders. Every dish was beautifully presented and delicious. The Bellinis were delightful too. Our waiter was attentive. A delightful experience all around!"], ["Fun small plates place with 1/2 price bottles of wine on Weds", 4.0, "September 8, 2011", "tikidream", "bethesda, md", 388, 110, "Keeping with the trend of small plates and sharing, unlike other places in DC, Policy does well and keeps its prices reasonable. While the menu is small, there are plenty of interesting and filling options for a vegetarian, and certainly plenty to choose from for meat eaters. Service was great, and the vibe was lively- but my group of 4...\n\n\nMore"], ["Delicious food, great ambiance", 4.0, "June 6, 2011", "Jgoldscher", null, 19, 14, "Terrific place. On 14th Street, about a block off U. Somewhat tough to find as it's just off the beaten path. Worth the 10-minute walk from the 9:30 club though. Short ribs were incredible, fries were awesome, scallops very good. Waygu beef was just okay, as were the scalloped potato cakes. Had the mojito - didn't seem very strong. Still,...\n\n\nMore"], ["Great food but the desserts steal the show", 5.0, "May 28, 2011", "DCskippy", "Alexandria, Virginia", 13, 7, "Like many popular restaurants in DC, especially the ones that turn into nightclubs, the dining experience is doing to diminish if you go later when it's killer crowded and hard to get a good seat. If you go early, the happy hour deals on the tapas and drinks are very good and you get enjoy an assortment of eclectic and...\n\n\nMore"], ["Interesting atmosphere, great food", 5.0, "February 16, 2011", "MikeMfromWashDC", "Washington, DC", 148, 89, "The decor is unique and very appealing at Policy. The food and service were also both above average. Right in the heart of the U Street Corridor."], ["Terrible service & atmosphere...overpriced!!", 1.0, "May 4, 2010", "KMinDC", "Washington DC, District of Columbia", 11, 3, "My friend from out of town came in to DC & we wanted to try out a new restaurant in our neighborhood. We had a reservation (I made weeks in advance) for 8:30 and they sat us at 9:00. Our party of 3 was sat at a two top booth (their \"policy\", ironically enough since that is the name of...\n\n\nMore"], ["Enjoyable Tapas Bar", 4.0, "January 24, 2010", "ggcaiazzo", "Conway, South Carolina", 262, 100, "Had a very nice dinner here last evening. It is restaurant week here in the DC area so it is a great opportunity to try new places. I had never been here and had heard mixed things about it.\nThe food was wonderful.... Started out with the Lobster Ravioli, followed by the Lamb Chops and the Sirloin and finished with...\n\n\nMore"], ["not too bad", 3.0, "December 10, 2009", "eslfoster", "Brooklyn, New York", 33, 24, "I ate dinner here last Friday night with a few friends before going to 9:30 club to see the Yeah Yeah Yeah's... it was OK. We got there around 8 and asked the hostess for a table for 4. She asked if we had a reservation (no) and then told us she would try and find something for us. She...\n\n\nMore"]]], ["Alero Mexican Restaurant", [["Above average food & Good service", 4.0, "October 15, 2015", "Kurt E", "Hoover, Alabama", 17, 3, "Stopped by on a weekday night so it wasn't very busy, but thankfully that wasn't an indication of the quality. Pretty good food, nice cilantro salsa, and prompt service. Hit the spot."], ["Great place, but probably like somewhere you go back home", 3.0, "September 10, 2015", "Delphine384", "Saint Louis, Missouri", 130, 50, "We had a really great experience at Alero, but there wasn't anything that really set it apart or wowed us. The restaurant reminded us of other Mexican restaurants back home or in other places that we visited. The menu was pretty standard Mexican fare - chimichangas, tortillas, enchiladas, etc. The menu did have a nice selection of ceviche which I...\n\n\nMore"], ["Cool Location, OK food", 3.0, "August 19, 2015", "littlebombs", "Rota, Spain", 75, 42, "Chose to sit inside at a table for two with a window overlooking the street below vs the very busy and loud outdoor seating. Service was quick and attentive. Salsa and chips were good but nothing to write home about. I ordered a cheese enchilada that was served with rice and refried beans. Again nothing spectacular. Enchiladas are made with...\n\n\nMore"], ["Great food and boisterous!", 4.0, "August 9, 2015", "Susan S", "Saugatuck, Michigan", 63, 23, "The service was good, food \"great\" and Margarita delicious. Very noisy! Could have been the Saturday crowd or just a happy atmosphere. As an older couple , we felt we couldn't hear each other but we're content to just have a tasty and filling meal."], ["Nice Mexican Meal. Interesting atmosphere and dedicated staff", 4.0, "August 2, 2015", "atarzia", "Belize District", 2, 1, "We enjoyed a nice meal here early in the afternoon on a Saturday. It was quiet so service was extremely efficient. The wait staff could not have been nicer. We arrived without our whole party and as we waited for other family members they brought drinks, copious amounts of chips and salsa, and tended to our every need. Once other...\n\n\nMore"], ["Keep walking", 2.0, "July 28, 2015", "DrDBoston", "Boston", 92, 28, "Willing to give it a try even though the interior looks like a Mexican souvenir stand blew up. The OK: cevicé mixto. The bad: lackluster service, bland food, stuffed shrimp that was not stuffed, and charging for extra fajita tortillas ($2.50). With all the great places around - several on this block - just keep walking."], ["Great Food and a lively atmosphere", 4.0, "July 18, 2015", "harry_martie", "Bangor, Maine", 22, 5, "This Restaurant has great Mexican food with a friendly lively atmosphere. (not a place for a quiet romantic dinner) all at a reasonable price. - what more can you ask for?"], ["Authentic", 4.0, "July 4, 2015", "Smith_HQ", "Southend-on-Sea, United Kingdom", 51, 26, "I love a good Mexican - and this is a very good one. I had a salad - it was crunchy and very fresh - with avocado, which if it's not fresh can be awful. It was very fresh. It was beautiful. OH had chilli - his staple of choice when visiting a mexican. It was hot (chilli and piping...\n\n\nMore"], ["B for bland", 3.0, "June 3, 2015", "GlesgaTours", "Glasgow, United Kingdom", 131, 83, "Little flavour. Grumpy service. Wobbly table. What happened to zing? Chilli?\nThe tacos Juarez lacked crunch and taste. No spice. It was all like baby food, didn't need much chewing and didn't really taste of anything!"], ["Great little place with good service", 4.0, "June 3, 2015", "TravelingEdwards", "Waterford, Michigan", 33, 12, "Came here for dinner after a business meeting at the Washington Hilton, which is just up the street a little. I was there during happy hour and had a couple of great Margaritas for only $5 each. The chips were great, although the salsa while good, was not my favorite. Had a steak Chimichanga which was very good. Reasonably priced...\n\n\nMore"], ["Food OK, Service Slow", 3.0, "May 25, 2015", "AisleSeatPlease", "Boston, MA", 48, 19, "Stopped in here for some \"Happy Hour\" apps and drinks. The service was incredibly slow. We were seated up the front of the restaurant and the staff was all mingling in the back and we were largely ignored. The happy hour discount drinks were nothing special, so we quickly changed to other drinks and these were better (stronger). The apps...\n\n\nMore"], ["Great service, yummy brunch", 5.0, "April 15, 2015", "SAkk427", "Philadelphia, Pennsylvania, United States", 26, 14, "My friends and I came here after experiencing horrible service from a restaurant across the street (Bistro Bistro), and I don't know if it was because the service at the other place was so bad, but the host and waiters at Alero were just amazing and so friendly. They had a great brunch special with bottomless mimosas/blood mary's, and the...\n\n\nMore"], ["Great food and drinks!", 5.0, "April 15, 2015", "Carrie B", "Saint Clair, Michigan", 44, 26, "We found this place by accident and are so glad that we did! We stumbled upon this place for lunch and it could not have been better. The food was outstanding and the drinks were even better! Margaritas are really good there. The outside deck is wonderful also, I cant say enough about this place , we really enjoyed it!"], ["Nice place to grab a bite..", 4.0, "April 12, 2015", "Scott G", "Martinsburg, West Virginia, United States", 118, 47, "Stopped here for lunch after a visit to the zoo. We decided to sit outside which was awesome. Our entrees were great and the chips and salsa was good as well. The service was a little slow. Would recommend this place."], ["Was good", 3.0, "March 24, 2015", "Matthew L", null, 9, 1, "It was good for just a quick stop over grab something to eat, but the red sangria will keep you here was amazing. the service leisurely not fast not slow just like being in the good old south"], ["Good for a quick bite", 3.0, "March 1, 2015", "Nathan W", "Logan, Utah", 19, 5, "The restaurant was mostly empty, so we were seated quickly and the staff was attentive. I had Chiles en Nagado. The flavor was good, but when they first brought it out it was cold. My wife had fish tacos and said that they were okay, but not spectacular. Her actual comment was \"these are better at Chili's\". It was reasonably...\n\n\nMore"], ["Just okay....", 3.0, "February 23, 2015", "Fred N", "Spearfish, South Dakota", 202, 70, "The establishment is small and simple. The staff provided quick and friendly service. I had chicken enchiladas. The presentation was nice. But the meal was just a meal. Travel safe..."], ["Family-friendly spot to eat after a trip to the zoo", 4.0, "November 21, 2014", "Thekateykatey", null, 18, 5, "We chose this restaurant based on its location near the Metro station that we took to the zoo, and because a friend raved about their pitchers of margaritas. Both are great reasons to go. The restaurant is very casual and friendly - no formality here. The food is authentic Mexican and there is a kids' menu that includes items for...\n\n\nMore"], ["Ok at best, won't retutn", 2.0, "November 1, 2014", "Jazer540", "Washington DC, District of Columbia", 114, 50, "Maybe we went on a bad night and maybe our group was too big (10) but nothing stood out as good or close to good out of 10 different entree selections. The beans were too watery the rice was dry the chicken had no seasoning the steak was overcooked and the tortillas were cold. Hard to recommend I'd go elsewhere."], ["Good value", 4.0, "September 25, 2014", "Amanda Y", null, 20, 3, "Awesome food. Decent service. The drinks were great and apps were also. We happened upon it when the taphouse down the road was closed. It was a lucky find!!!"], ["tourists be careful", 1.0, "August 28, 2014", "PouletteDC", "Washington DC, District of Columbia", 1, 0, "The boss saw we were tourists... we were 4 and he wrote on the bill that we were 7 to add 18% of tip... nice try ! It was disappointing because the food was pretty good !"], ["I thought the s at the end of the word meant more than 1!", 4.0, "August 5, 2014", "brake4bears", "Key West, FL", 49, 18, "Had been by this place a couple of times, always seemed busy so thought the food must be pretty good. Based on the menu they had posted outside, their prices seemed pretty reasonable too. The food WAS pretty good, but thought the portion size was a bit small,,,maybe tehy're trying to be more upscale on the cheap? Anyway, the chips...\n\n\nMore"], ["Pretty much a dud", 2.0, "June 22, 2014", "DCBoomer", "San Francisco, California", 88, 49, "This is for the Alero at 1724 Connecticut Ave. Mediocre Mexican food served in an aggressive \"build the sale\" atmosphere. We were badgered to order appetizers and drinks the moment we were seated and the suggestions to order more just kept coming. Food was heavy and bland. I ordered a mole dish that had no apparent mole sauce on it....\n\n\nMore"], ["Off the beaten path", 5.0, "May 29, 2014", "Gayle A", "Mobile, Alabama, United States", 14, 5, "We loved this restaurant! Felt like home and not so tourist. Food and service was good! It is not far from Dupont Circle and was recommended by a local."], ["Great food, great music!", 4.0, "May 28, 2014", "mickij3", "Southfield, Michigan", 98, 40, "Come here on a Saturday night and the place gets jumping! The food was really good, the Swirl Margarita is awesome, and the atmosphere was very cool. The DJ played a variety of songs, so you never got bored. All in all, a great time!"], ["Great Mexican food!", 4.0, "January 18, 2014", "CoolidgeCorner", "Rome, Italy", 50, 20, "We really like this place. The food is very good and the atmosphere is great. This place is good for young couples and groups of friends. We suggest the chicken and beef fajitas in particular. Quick service and kind waiters. Not expensive at all."], ["Not going back", 2.0, "January 13, 2014", "Shunnie", "Cambridge, United Kingdom", 67, 51, "This was my first meal in Washington this last trip and it was a mistake. Service staff were okay, but the food was a miserable disappointment. I ordered the chimichanga which is probably my favourite Mexican dish. What was served was the smallest chimichanga I have ever seen. I asked the waitress if perhaps they had given me the cheaper...\n\n\nMore"], ["Delicious, casual Mexican food", 4.0, "November 15, 2013", "Parker J", "Atlanta, Georgia", 3, 1, "Wandered into this place on a business trip. I was attracted by the funky Halloween decorations, but really enjoyed my tamales platter. Great location near Dupont Circle and good prices."], ["Food was awesome!", 4.0, "October 28, 2013", "cfam4", "Wilmington, North Carolina", 31, 5, "The food was fantastic! My husband & I both ordered fajitas (one steak & one pork). Both came with a good amount of meat, and the steak was fork tender. Also had the Cadillac margarita that was delicious & pretty strong. All together, it was $41. The server was not rude but not the most friendly we have ever had....\n\n\nMore"], ["OK food; terrible service", 2.0, "October 17, 2013", "Chris O", "Lawrenceville, Georgia", 158, 41, "Walked in at about 4 minutes to 7:00 pm and was greeted by wait staff dancing and yelling 'Happy Hour!'. Our waiter came to our table promptly at 7:00 (and they were far from busy) and when we asked about happy hour prices, we were told 'No'. Hmmm. Food arrived -- I split the combination fajitas with my adult daughter....\n\n\nMore"], ["Pleasantly Surprised", 5.0, "September 26, 2013", "BrianSydneyAustralia", null, 45, 24, "Dupont Circle is a very busy location and after walking past several restaurants that were overflowing with people we came across Alero, which was busy but had a couple of tables just become available.\nThe staff were very friendly, the restaurant was casual and fun.\nThen the best part - the food was excellent.\nThe wine list is cheap and...\n\n\nMore"], ["Very good food, service and value for money.", 4.0, "September 11, 2013", "reubenayres", null, 4, 1, "Good food at very reasonable prices. Good atmosphere and well patronised by locals. Charming, helpful waiters."], ["Only if you're desperate for \"Mexican\" food.", 2.0, "August 12, 2013", "bigmohank", "florida", 117, 43, "Other reviews have said it well...the service was bad and the food (at least what I had) would have real Mexicans hanging their heads in shame.\nI joined a group of my friends who had already been there awhile. None of the staff took note that another person had joined the table. I had to ask somebody to bring a...\n\n\nMore"], ["BAD food & BAD service", 1.0, "August 12, 2013", "BlondBlzr", "Chicago, IL", 27, 32, "Absolutely NOT! Horrible service and horrible food.\nOur server was AWFUL! He apparently forgot our second drink order (because he was too busy talking to other staff at the bar) and brought it to the table after we were done with our meals. We told him we didn't want the drinks at that point. Any decent server would apologize and...\n\n\nMore"], ["Terrific food,awful service", 1.0, "August 4, 2013", "Massivefaceni", null, 1, 0, "This restaurant is terrific food wise and can not be faulted. The service on the other hand is terrible. Our 'waiter' Marcus was a disgrace. Not being from the USA we are not used to the gratuity system that occurs within the country. Where I am from (ireland) you leave a tip depending on the experience you have. Having finished...\n\n\nMore"], ["Great!!", 5.0, "July 30, 2013", "krista s", "Brick, New Jersey", 12, 15, "We went to Alero's restaurant 2 weeks ago for our first time when we were visiting Washington D.C. Great food! Awesome atmosphere! Frozen margaritas are delicious and the chips with salsa are great appetizers For my dinner I ordered a vegetable fajita which was excellent. Staff was great and service was great. No complaints what so ever...we will most definitely...\n\n\nMore"], ["Great Margaritas!", 4.0, "July 16, 2013", "Lauren C", "Monticello", 9, 2, "Stopped here with friends after the zoo and was surprised by how good it was. We were just looking for a place to sit and visit for a bit more before I headed back downtown, but found much more. I got the regular frozen margarita and it was stronger than expected (YUM). My friend had a couple of mamacitas that...\n\n\nMore"], ["Tasty margaritas", 4.0, "July 9, 2013", "adharris0915", "Forest, Virginia", 207, 76, "We only stopped in for a drink and some chips and salsa. This is a neat little place. We sat at the bar and enjoyed a frozen swirl margarita (stronger than you think) and a HUGE regular margarita. Service was prompt and the atmosphere was casual. The salsa was very good. We would return to try the food."], ["Authentic - recommended by a local", 5.0, "June 29, 2013", "Susan R", null, 8, 1, "As we were discussing our options after leaving the zoo a local overheard us and pointed us to Alero's. Great food - party of 4 highly satisfied. Avocado appetizer with shrimp was my meal - so delicious. Grilled chicken burrito and quesadilla excellent too - great salsa!"], ["not worth your money and time- average food less quantities", 2.0, "June 10, 2013", "R S", "Princeton, New Jersey", 53, 28, "I summed it up- that's what I experienced in my visit for a take out on a rather quiet evening.Monday Night on a rainy DC evening in June, called in forst to see how late they were open. Went for a take out, because they wanted to close early due to lack of customers on a rainy evening.\nFood was...\n\n\nMore"], ["Walk on By", 2.0, "May 12, 2013", "BarbaraE5", "Philadelphia, Pennsylvania", 50, 47, "Good location, reasonably priced...I've had better Mexican food out of a box. When you need to add salt and pepper to salsa, there's a problem. The Margaritas were watery and bland. There are many better options in the area."], ["Good mexican food at reasonable price", 4.0, "May 9, 2013", "iLind", "Kaaawa, Hawaii", 63, 36, "This is our second visit to Washington and we paid another visit to Alero for dinner.\nIf you want a quiet romantic spot, this isn't it.\nAlero isn't large, but they manage to squeeze quite a few tables into the room. Service is a bit pushy, as they seem intent on turning the tables.\nBut the food is good and...\n\n\nMore"], ["Excellent mexican food!", 5.0, "May 9, 2013", "Ivonna02", "San Juan, Puerto Rico", 159, 54, "We discovered this restaurant so late in our trip. But enough to visit them in three occasions. Very good service, very good food.. ahhh and excellent margaritas!"], ["Strong drinks, awesome food, great value - a must try", 5.0, "May 6, 2013", "lcollens", "Dubai, United Arab Emirates", 241, 255, "I came here with work colleagues after a very long day's travel. For the seasoned Mexican food eater, this may not be what you were ideally looking for - I don't eat Mexican food frequently because it is not as ubiquitous in the UK as in the US.\nThe atmosphere is super casual - jeans a must. I wouldn't describe...\n\n\nMore"], ["Great food! Great service!", 5.0, "April 8, 2013", "Udi G", "Chalfont, Pennsylvania", 5, 3, "We found it with the help of TripAdvisor and the recommendations are right on the money. This is one of the best Mexican restaurants I've eaten in, everything was so good, and the service was superb. I warmly recommend."], ["Cute Place, Good Food & Drinks", 5.0, "February 3, 2013", "ABPtraveler", null, 47, 17, "I ate here with my sister on a Friday evening. My chicken tamales and margaritas were delicious. The staff was friendly and service was prompt. I'm from out of town, but if I wasn't I would eat here often!"], ["Great Mexican Food!", 5.0, "January 28, 2013", "MizLib", "Sedona, Arizona", 17, 10, "This small restaurant has the best chicken tamale and chile relleno EVER! The margaritas were OK, but the food was great! The chips were light and not at all greasy--and the salsa was one of the best we've ever tasted."], ["Recommend it", 5.0, "January 23, 2013", "vimapo", "Lincoln, Nebraska", 51, 46, "Friday night crowd so loud but fine since it was Friday night, short wait, very good fun, would definitely go there again"], ["Yummy Food", 5.0, "December 19, 2012", "BM041004", "Fort Lauderdale, Florida", 18, 10, "The food was great and inexpensive. The restaurant is a tad bit small but between the food and the music and good company you forget it very easily."], ["Muy bien!", 4.0, "December 9, 2012", "Blahblahb", null, 62, 26, "Surprisingly nice and tasty Mexican in DuPont. Reasonable prices. Fun decor. Mega margaritas. Interestingly it's owned by someone from Colombia we were told. Dinner for four with tip $60-$75. Good deals at happy hour til 7 if you time it right. They have a Frida Kahlo tribute wall."], ["Fuego salsa", 4.0, "November 18, 2012", "Patricio C", "Warsaw, Poland", 3, 0, "Excellent service. They have a really spicy salsa called fuego salsa, most try it. Prices are okay. Atmosphere is fine, but I liked the mariachi deco."], ["Fantastic food, fantastic atmosphere", 5.0, "November 3, 2012", "Gnomemother", "Leicester England", 84, 44, "This was our 2nd visit, and it didn't disappoint. We had a superb meal, the food was amazing and the service was excellent.\nHope I will visit DC again so I can enjoy another meal!"], ["Good Food", 3.0, "November 3, 2012", "Paul Y", "Moorhead, Minnesota", 56, 23, "We arrivd in DC and wanted someplace casual and inexpensive. Arrived at Alero at about 4 pm. We were promptly seated, and chips and salsa were brought to the table. The chips were warm the salsa was so, so. We had the chimichanga. The food was hot but not spicy, and the taste was average. Our bill was around $26...\n\n\nMore"], ["Pretty good Mexican food for DC!", 4.0, "October 8, 2012", "Lindsay B", "Washington DC, District of Columbia", 53, 25, "I live right around the corner from Alero and have eaten here twice. I am originally from the Philly area and have been spoiled by amazing authentic Mexican restaurants, so I was a little bummed when we moved to DC and I found out that there really is no large Mexican population and therefore not really any good Mexican restaurants!...\n\n\nMore"], ["Good people watching, terrible food", 2.0, "October 7, 2012", "badmas", "Washington, DC", 27, 11, "I live around the corner from this place and the food is truly terrible. Go here for the cheesy nightclub atmosphere or to sit outside and get drunk while watching people walk by this busy street corner, but eat dinner somewhere else."], ["Nice place for drinks after work", 5.0, "October 2, 2012", "Bankslady", null, 41, 14, "The hubby and I went here last Friday for drinks after work. A really nice place to hang out! It is right off of U street Metro (one block). Nice atmosphere, great food, and reasonable prices!"], ["food was average", 3.0, "September 2, 2012", "Nique536", null, 26, 10, "food was ok. The service was great. I had the seafood soup. I'm sure not what I should have ordered at a mexican restaurant. But I did want anything heavy. My friend had the pork fajita's which she stated were ok, but not the best she has tasted"], ["good food -- lousy service", 3.0, "May 13, 2012", "Frank R", "Bethesda, Maryland", 8, 0, "lots of confusion with service: brought appetizers with main course -- had to ask 3 times for salad dressing -- had charges on bill that were not correct"], ["A hidden Gem", 5.0, "April 10, 2012", "elphie1162", "Rochester, Mi", 170, 140, "We ate here after visiting the National Zoo on 4/7/12. Found it in a travel book and took a chance...SO glad we did. The food was outstanding and the service was impecable. There is a metro stop less than 1 block from the resturant, they have indoor and outdoor seating (we sat outside) and they do get busy. Definitely go...you...\n\n\nMore"], ["Great Mexican Food in Dupont Circle", 5.0, "February 21, 2012", "Steve F", "Gettysburg, Pennsylvania", 39, 19, "A real treat!! Whenever we are in the Dupont Circle area of Washington DC we stop here for dinner. Reasonable prices, great food, great service and great atmosphere make this an enjoyable evening out. This was our third visit to Alero and each time has been quite satisfying. Though we have looked at the other resurants in the area, we...\n\n\nMore"], ["Alero's food and margaritas set the highest standard", 5.0, "November 5, 2011", "Buddy S", "Washington DC, District of Columbia", 1, 0, "The best! Do not miss Alero! I've been dining here for more than a dozen years. The food and margaritas are consistently superb. Great flavors and wonderful, endless chips and salsa at every table. Much better food than ALL other restaurants with this cuisine. I usually go to the one in Cleveland Park with the sublime porch but the DuPont...\n\n\nMore"], ["Wonderful restaurant, and outstanding fish soup.", 5.0, "August 31, 2011", "Ivonenna", null, 11, 5, "The food is very good. The prize is also good and the service outstanding.. Our waitter a young man frin El Salvador was espectacular."], ["My favorite Mexican in DC. Great drinks and great food a good price. The service is always good - quick with the chips...", 5.0, "January 6, 2009", "Adam R", "Boston, Massachusetts", 332, 126, "My favorite Mexican in DC. Great drinks and great food a good price. The service is always good - quick with the chips and salsa, the key to a great Mexican place."], ["Terrible", 1.0, "September 11, 2008", "nyprnj", "nj", 1, 0, "as soon as we sat down we asked a waiter if he could adjust the AC because it was warm inside. He said it couldn't be adjusted. After about 15 minutes I had to ask an employee if we were going to be served. Someone immediately came out and took our drink order. A caucasian couple came in and were...\n\n\nMore"], ["great mexican, it's pretty simple really!", 4.0, "June 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "great mexican, it's pretty simple really!"], ["I liked the food....it was ok.....the location is charming though.", 3.0, "May 31, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I liked the food....it was ok.....the location is charming though."], ["nice day to sit outside...", 3.0, "May 3, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "nice day to sit outside under the umbrellas in Cleveland Park and have yummy tacos al carbon y cheese dip with friends..."], ["Overpriced for what it is...not the best mexican food, but decent atmosphere.", 2.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Overpriced for what it is...not the best mexican food, but decent atmosphere."], ["Old fave from my HZ days. Good margs and fajitas.", 3.0, "January 20, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Old fave from my HZ days. Good margs and fajitas."], ["good", 4.0, "January 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good"], ["I thought the food was delicious and the service prompt and courteous at this location. I prefer this location over...", 4.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I thought the food was delicious and the service prompt and courteous at this location. I prefer this location over their U-street one. Get the fajitas! YUM!"]]], ["Maketto", [["Good for small bites and a drink, but the entrees need work..............", 3.0, "September 27, 2015", "TW W", "Belle Mead", 52, 13, "This is one of many trendy restaurants on the H street corridor. On a weekend evening the wait can be quite long. You can wait upstairs where they serve drinks and items from the appetizer menu, including very good buns and spicy tofu. For now that may be a better option for dining at this restaurant, because when you get...\n\n\nMore"], ["Salt fest", 2.0, "August 24, 2015", "Girlseatworld", "Ellicott city, md", 88, 21, "I went to the one on H Street. The place is very trendy but if you go there for food, you may be disappointed. Our family tried one of every dishes basically. Overall the food was very salty. Out of all of sandwiches, the pork one was the best and we actually would not mind eating that again. The pancake...\n\n\nMore"], ["Great food, and a menu you won't find elsewhere in DC", 5.0, "July 29, 2015", "999BrianL", "Washington DC, District of Columbia", 9, 8, "Dinner on a Tuesday night, arrived around 7:30 not sure what to expect as far as crowds and wait but it was relatively open and we were seated outside right away. Only two of us so could not try as many things as I wanted, had the Pork Steam Bao -- amazing, could have put away a half dozen of...\n\n\nMore"], ["Wow", 5.0, "July 27, 2015", "nreyesok", "Potomac, Maryland", 246, 98, "Went here with another couple. After reading about this hopping new place, I was worried it would be packed. I guess on a Monday night in July, everyone else is on vacation. We had no problem getting seated and we had a wonderful server, Malcolm. We wanted to try everything and ordered way too much food. Now that I know...\n\n\nMore"], ["MMMM Maketto", 4.0, "July 2, 2015", "Charlotte H", "Washington DC, District of Columbia", 78, 18, "On our fried chicken tour through DC area we added Maketto for the Taiwanese fried chicken which was excellent but the star was the pork bun. Wow. Delish. Sweet with a redolence and a touch of heat. I could eat a million. Also the array of beers is fun. We tried two lagers which were perfect with our dinner when...\n\n\nMore"], ["Awesome Multi Use Space", 4.0, "June 9, 2015", "LaneeshaW", "Washington DC, District of Columbia", 7, 1, "This place was really cool because in the front there is a store, once you pass by that you see the seating area. I went on a beautiful Saturday afternoon and sat upstairs outside. There was no cover so the sun was beaming! lol I got a dessert which I believe was a lemon meregue pie (it looked so pretty...\n\n\nMore"], ["great! new! trendy!", 5.0, "May 8, 2015", "HAPPYNICKY59", "Montreal, Canada", 18, 9, "Very nice and trendy atmosphere. But the good news is that the food is very good as well. This a foodies place for sure. We tried different dishes and they were all very flavourful and interesting. The cocktail are unusual and very good."], ["Uniquely different", 5.0, "April 19, 2015", "talley01", "Washington DC, District of Columbia", 54, 24, "Maketto is a new concept by one the hottest chefs in the country, Erik Yang. Maketto is a blend of retail, upscale coffee, and Asian fusion. As you walk in, you will see the retail, which is composed of cool shoes and socks. As you continue back, Vigilante coffee and Frenchies pastries. Frenchies makes some do the best crossisant in...\n\n\nMore"], ["Disappointing", 3.0, "March 16, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "This place is owned by one of my fave ramen spots in DC, Toki Underground. I was very excited about it but I found it very average.\nWe ordered a bowl of Cambodian pho and a bao.\nThe baos ($3 each) are freshly made and they are pretty tasty.\nThe pho ($10) was good but it didn't have enough broth...\n\n\nMore"]]], ["Woodley Cafe", [["Don't go here", 1.0, "September 29, 2015", "J2theM", "Strasburg, Pennsylvania", 3, 0, "Pros:\n-The water was cold and refreshing.\n-The waitress was very nice.\n-I did not get sick after eating there.\nCons:\n-The food was not good. I'm not going to say it was terrible, but I definitely wouldn't recommend it.\n-The owner(who was acting as the manager this evening) was very rude and has no customer service skills.\n-The service...\n\n\nMore"], ["Breakfast", 3.0, "September 24, 2015", "TGH1954", "Tampa, Florida", 61, 40, "Service was slow, food was average and prices were reasonable. Nothing to write home about but adequate for a nice breakfast on the patio."], ["Reasonably priced not good service", 3.0, "September 20, 2015", "slsrb", "Pittsburgh", 39, 13, "Nice walk from the zoo to get here. The menu looked good. Service was slow. Food came out hot but incorrect order. And then we are. Food was average at best. Not horrible but not the best. However price was fair."], ["Can do better in the area", 2.0, "September 3, 2015", "BTD82", "Amsterdam, The Netherlands", 25, 7, "We went here for breakfast. Service was a bit disinterested, coffee was not great and the food was not bad but not tasty either. So for breakfasts I would not (and did not) go there again."], ["Great little restaurant!", 5.0, "August 31, 2015", "nanski3", "granbury, tx", 53, 43, "My husband & I ate here for 3 different meals while in the area. The food was good, & reasonably priced. The service was excellent. One evening while we were silting on the patio, a thunderstorm blew up. The owner was concerned about us, & found a table for us inside, and helped us to carry our belongings in out...\n\n\nMore"], ["Excellent Food, Pleasant Place", 5.0, "August 17, 2015", "beachNbuff", "Virginia, USA", 13, 8, "We had a late breakfast at Woodley Café. The staff was very nice and attentive, although some spoke no English. The food was excellent. All four of us completely enjoyed it."], ["Great food!", 4.0, "August 13, 2015", "AmiAma19", "United States", 5, 2, "First time in Washington and this place was close to where we are staying. The waiter was nice and answered our (a group of 7) questions on the menu. The food didn't take long and was really good (came on a Thursday around 5 pm)! Ordered the Woodley's calzone and it didn't disappoint! Owner was very friendly."], ["Good stop for lunch after the zoo...", 3.0, "August 12, 2015", "alliecat2842", "Olney, Maryland", 221, 88, "We recently dined at the Woodley Café after several hours at the zoo. It's a short walk downhill. We sat outside on a lovely day. My nieces had sandwiches. They reported they loved the pastrami. I had the Greek salad which was fine but not outstanding. It was a good choice to rest a bit before moving on. Service was...\n\n\nMore"], ["Horrible", 2.0, "August 11, 2015", "Chet B", "Bohemia, New York", 2, 0, "Went there for breakfast with family. Shocked at the lack of professionalism displayed by the waiters. Placed our orders and walked out after 45 minutes of waiting for scrambled eggs."], ["OK food", 3.0, "August 10, 2015", "SarahBSSE", "Cheltenham, United Kingdom", 51, 26, "We (a family of four) ate here during our stay in Washington but it wasn't anything special.\nI ordered the Mozzarella Moons (my daughter never finishes her meal so would be sharing some of hers! They were not good. The breaded costing was really thick so meant that the mozzarella hadn't melted sufficiently to be that lovely gooey, consistency I...\n\n\nMore"], ["Friendly Service, Good Meal", 4.0, "August 9, 2015", "RyryE", "Baltimore, Maryland", 209, 131, "Despite being full for the Sunday lunch crowd, the staff was very attentive and every person we encountered was very friendly. They made sure to pay attention to our four-year old son and make him feel special, and the food came out quickly, too.\nWe ordered a Cobb salad, a chicken quesadilla and the kids' chicken fingers. All were prepared...\n\n\nMore"], ["American food option amongst many", 3.0, "August 3, 2015", "Kyle_SD_308", "Rapid City, South Dakota, United States", 119, 18, "The area this restaurant is located has several different types of international choices. We had group eat there and service was good. Food quality was okay and atmosphere is okay."], ["Neighborhood restaurant serves the world", 4.0, "August 3, 2015", "thetravelingpoet2014", "Fort Myers, Florida", 20, 2, "Just one block from my home in Washington, DC sits a restaurant that serves great dinner food and good drinks. The service is quick and very pleasant. The help are as international as their clientele. Each time I go their for breakfast or launch, as a vegetarian, i am satisfied I picked the right place. My only request is that...\n\n\nMore"], ["Woodley Cafe", 5.0, "August 1, 2015", "rita042554", "Edgewood, Maryland", 6, 3, "This cafe was about a block from where we were staying. We found the restaurant on our way back from the zoo. There were four of us and we all enjoyed our food. My husband I had the talapia, and my granddaughter and her boyfriend had sandwiches. The service was great, I had mentioned when we were asked about drinks...\n\n\nMore"], ["Really?", 2.0, "July 25, 2015", "SongMan67", "Atlanta, Georgia", 69, 38, "We arrived about 7:50 p.m., got seated, and then waited about 20 minutes to be waited on. Had we not been famished, we would have walked out at that point. I wish I had. The restaurant had plenty of options for us, including a veggie burger, but $5.95 for macaroni and cheese for my kids that was Kraft Macaroni &...\n\n\nMore"], ["Forget fast food instead enjoy a great dining experience", 4.0, "July 21, 2015", "harry_martie", "Bangor, Maine", 22, 5, "Really good food that looks as good as well as it tastes all at a competitive price and topped by excellent service from friendly staff. It does not get any better."], ["Help Wanted", 3.0, "July 18, 2015", "Marianne T", null, 27, 6, "Went there for a late breakfast with my teen daughter. Sign on the window stated \"Help Wanted\". That is an understatement. It was not busy at the time we came but the services was nonexisting!!!! It appeared there were only two people waiting tables. Another women, ?owner wandering around. One server seemed to be on the ball. The table next...\n\n\nMore"], ["A Decent Breakfast", 4.0, "July 17, 2015", "smazu", "Barrington, Illinois", 5, 3, "We stopped here one morning during a visit to the D.C. area. We found the food to be generally good and the wait staff to be friendly and efficient."], ["Great value and good food", 5.0, "July 9, 2015", "familyOf4201024", "northern nj", 2, 0, "We ate here twice during our stay in DC. I had the burger the first night; it was delicious and cooked the way I ordered it. They have a children's menu with a good selection. Items are reasonably priced. The second time we had a meal at the restaurant I had the spinach salad with chicken; it was delicious. They...\n\n\nMore"], ["Quiet Lunch", 4.0, "June 29, 2015", "JayB1r", "Portsmouth, Virginia", 183, 44, "This restaurant is across from the Marriot. It has outside dining and a business associate and I enjoyed a nice lunch. The place has coke products.i had a good steak sandwich and it could have been great if they had not used American cheese. My associate had a burger which he enjoyed. My bill was under$15."], ["Nice spot for lunch after a morning at the Zoo", 4.0, "June 29, 2015", "nathanchase", "Winter Garden, FL", 27, 10, "We stopped in to Woodley Cafe for a bite after spending the morning at the National Zoo up the street. At our table, we ordered a chicken quesadilla, chicken parmesan sandwich, and a cheeseburger - all were pretty good - nothing spectacular, but tasty. The owner was particularly nice and handed free cookies to the kids on our way out...\n\n\nMore"], ["Wonderful Food at the Woodley", 5.0, "June 27, 2015", "Jacqueline S", "Westminster, Colorado", 3, 0, "I was visiting Washington and a friend and I went to the restaurant to eat breakfast. The service was good for a busy Saturday morning and the food was tasty. I returned the following Tuesday and ordered a salad with a grilled tuna steak and I was happy with the food. I would go back because the owner and people...\n\n\nMore"], ["Nice place for a quick drink at the end of the day.", 5.0, "June 26, 2015", "pandmg", "Swansea S.Wales", 67, 49, "We found this to be a good place to get breakfast every day before heading off for a hard days site seeing. The portions are good, freshly cooked and staff friendly. Reasonably priced too."], ["Nice place fort an afternoon on the patio", 4.0, "June 25, 2015", "Travelcritic78", "Tyler, Texas", 82, 55, "We stopped by for appetizers and drinks on a Wednesday afternoon, and sat outside watching the world go by with wine and crab/cheese bread with a nice marinara. Service was friendly, if a little goofy, and the whole experience was quite pleasant."], ["Decent but Nothing Outstanding", 3.0, "June 25, 2015", "Mark M", "Thurston, Ohio", 31, 11, "Had a decent Reuben with average corned beef. They ran out of the soda that I ordered so did not get a refill. We sat outside under the canopy, and the atmosphere was good but cramped out there; none of us went inside so no review of the inside seating from us. Service was good and prices pretty much average...\n\n\nMore"], ["Ate here twice, it was nice", 4.0, "June 24, 2015", "Deborah F", "Colonia, New Jersey", 6, 3, "1st visit was for a late dinner, 2 adults, 2 children - great weather so we were fortunate to get a table outside. Our waiter was brand new, and we were on vacation, so any shortcomings in service were forgiven since he was a pleasant young man. People who seemingly owned the place checked in on us a few times...\n\n\nMore"], ["They're open for breakfast", 3.0, "June 13, 2015", "Ferientraveller", "Ridgefield, Connecticut", 8, 1, "We arrived 9:00am for breakfast. You can sit outside. Great sine today was a no continued heatwave. Just had waffles and strawberries and eggs Benedict. Great service and food was plenty and good."], ["Woodley cafe", 4.0, "June 11, 2015", "Charles K", "Towner", 3, 0, "We had a very nice meal that was reasonably priced. service was ok. Greeted by the owner both on our way in and out. Would definitely go back if in the area again."], ["Breakfast!", 4.0, "June 7, 2015", "Nicole B", "Albuquerque, New Mexico, United States", 43, 9, "Great breakfast, resonably priced and very close the the metro. The service was good, the waitress helpful and polite. Great little find for breakfast."], ["Loved our dinner!", 4.0, "June 6, 2015", "4tolove", null, 10, 1, "The entrees were plenty big, especially after walking all day. I ordered the Shrimp Creole and it was AMAZING! If I had been staying another day, I would have returned. My kids and husband all loved their items as well. Hubby had blackened Salmon and it was good, but I liked mine better!"], ["Great lunch at reasonable price", 4.0, "May 24, 2015", "VNwildrose", "Ellington, Connecticut", 61, 35, "Our family ordered grinders and sandwiches for lunch. Service was great. And the food was delicious. We were very glad to have an early lunch before heading to the zoo. Their breakfast selection also looked very sumptuous. We returned the following day for breakfast....but was a bit disappointed by slow service. Overall, it is still a great place to grab...\n\n\nMore"], ["Simply delicious", 5.0, "May 17, 2015", "Julie H", null, 15, 9, "We ate here after visiting the National Zoo. There is inside and outside dining. The menu is a nice mix of sandwiches, dinner entrees, appetizers and salads. We ordered a chicken parm sandwich and the Woodley Wreck. Both were nothing short of delicious and reasonably priced. The atmosphere is comfortably simple and our waiter Edriss was awesome."], ["Good comfort food- Not a quick eat.", 4.0, "May 14, 2015", "Rita T", "Mission Viejo, California", 137, 28, "I went to this restaurant twice- once I ordered the Rueben- excellent- the others in my party ordered chicken ceasar salad. One liked it but the other did not (too much dressing)\nThe service the first time was wonderful- it was packed but very efficient.\nThe next time I hit this restaurant was in the off peak time, basically empty...\n\n\nMore"], ["Great food and friendly service", 4.0, "May 7, 2015", "Vicki H", "Adelaide", 8, 10, "This is a great cafe within easy walking distance from the Omni Shoreham. Staff are very friendly. Plenty of variety on the menu. We thought it was great had breakfast there both mornings we were in Washington."], ["Meh", 2.0, "May 4, 2015", "NotACowboy", "Billings, Montana", 26, 60, "Quesadilla lacking in taste and the guacamole reminded me of something obtained at a supermarket. Waaaaaaay too slow for lunch. My suggestion: dine elsewhere."], ["Not bad", 4.0, "April 29, 2015", "tinytrace", "Swansea, United Kingdom", 242, 102, "Stopped in here for cocktails one evening, they tasted ok. We went back the following day for breakfast which was pretty good, we had the spinach omelette and fruit salad. The only issue is the staff are really really soft spoken and very hard to understand, speak up please!! Would go back!"], ["Good food and extra helping of off the wall comments", 3.0, "April 22, 2015", "6grengs", "Voluntown, Connecticut", 24, 1, "We were looking for a lunch time experience! We found it, our waiter kept interjecting unknown facts about water on mars or if we had ever tried Distilled water. Kept us amused, food was good, a little $$. Heard breakfast was good from a couple in our group."], ["Not what we were looking for.", 1.0, "April 22, 2015", "David L", null, 15, 8, "OMG! The staff was rude. The place smelled like an old shoe store. The bar was uncomfortable to sit at. We drank our two very small beers and got out as fast as possible."], ["Good food at a good price", 4.0, "April 21, 2015", "Karen R", null, 10, 2, "I wanted to grab a late lunch after I got to town. The Woodley cafe had outdoor seating, the waiter was prompt and service was good. The tuna steak salad had a homemade vinaigrette dressing with capers. It was delicious. We went back for breakfast in the morning, and the food was good. This is a great place to have...\n\n\nMore"], ["McDonald's might have been better", 2.0, "April 20, 2015", "RamponaO", "Colorado Springs, Colorado", 147, 55, "My son loved the French toast. I ordered a Caesar salad w/ chicken. The chicken was inedible. I commented to the server. She offered to replace it but did not remove the charge from the bill. 18% gratuity too. Don't waste your time."], ["Breakfast", 4.0, "April 9, 2015", "number1daboysfan", "Honolulu, Hawaii", 23, 6, "Stopped in here for breakfast on the way to the zoo. Had the eggs benedict and it was great. The portion size was perfect and good price. Server was attentive and fast. Breakfast served all day which is great if you feel like eggs or pancakes in the afternoon."], ["Deceitful", 1.0, "March 29, 2015", "ROBERT S", "Fayetteville, United States", 4, 2, "My wife and I \"opened\" the restaurant at 0800, 29 March 2015. Despite our observations that they did not appear prepared, manager assured us all is well: chairs yet to be placed, cold temperature of the room, and so forth. He assured us the grill is ready to prepare our order. We received coffee and ordered breakfast. When asked about...\n\n\nMore"], ["Just don't", 2.0, "March 27, 2015", "bonnie h", "Brooklyn, New York", 22, 17, "Let me start off by saying our server was magnificent, very attentive and efficient and management was also concerned that we enjoyed ourselves. I wish they had invested this much into the cuisine.\nWe ate brunch there and surprisingly, everything was processed. Then eggs were from a box, the olives in my omelet were from a can, the hash browns...\n\n\nMore"], ["Good breakfast!", 4.0, "March 21, 2015", "Michael M", "Taos, New Mexico", 121, 81, "I had the eggs florentine which I highly recommend! This is a great place for breakfast at a third of what it cost at the Omni Hotel. Great service, good food. What else do you need. I understand that lunch and dinner is also good. I will try those as well soon. Thumbs up!"], ["Do not go! Terrible service/management!", 1.0, "February 7, 2015", "Liz D", null, 1, 0, "So, we get there and everything was alright, not much conversation from the waiter, no wait for a table (not surprising after we left) and we're served our drinks. I ordered the spinach and artichoke dip which I love at 99% of places I go to and it came out fairly quickly. After one bite I was disgusted. Sloppy, chunky...\n\n\nMore"], ["A hidden gem-Great food and outstanding service", 5.0, "February 2, 2015", "mattman36", "York, SC", 31, 7, "Fish and chips were incredible! Café was not busy and service was great. Was right across the street from Omni Shoreham hotel.\nI would ride the Metro a long way to eat here. A must eat if in Wash. DC"], ["Fav Breakfast Spot", 5.0, "January 24, 2015", "HoustonG4L", "Houston, Texas", 18, 10, "Nice spot for breakfast except on Sundays when there is like a two hour wait. That should tell you just how popular this spot is. Friendly staff, good location."], ["Feeding time at the Zoo", 3.0, "January 10, 2015", "Victor A", "Winston Salem, North Carolina", 245, 84, "Convenient Spot, just off the zoo and right outside of Adams Morgan this is a good spot. There are lots of other more trendy spots near; they were all jammed on the Sunday afternoon we were there but we were not disappointed by landing here. Very woody pub like atmosphere the service was excellent. My Ruben was delicious and everybody...\n\n\nMore"], ["Nice find", 4.0, "December 30, 2014", "dillyma", "Des Moines, IA", 96, 26, "During a recent visit to DC, my Mother and I stumbled on Woodley Cafe searching for someplace to have a late breakfast/early lunch. We were very glad we chose Woodley Cafe. The service was excellent. Very prompt and attentive. The food was really good. I had a burger, which was very flavorful and cooked as ordered. You can tell they...\n\n\nMore"], ["Drinks only", 4.0, "December 9, 2014", "Christie D", "Prattville, Alabama, United States", 50, 21, "We stopped here after a visit to the zoo to get some beverages. We sat at the bar and had some beer (small draft selection of typical stuff). They do have a full bar, and the bartender and staff that we interacted with were all very nice. The atmosphere was relaxed, and they had tvs so you could watch any...\n\n\nMore"], ["Good Food, Decent Service", 4.0, "November 5, 2014", "GeoffElliott", "North Canton, Ohio", 22, 21, "I don't understand the lousy reviews for Woodley Cafe in Washington, D.C. I've visited the city twice this year (April and October), staying at the Omni Shoreham Hotel. Woodley Cafe is within a short walking distance of the Omni.\nAfter trying a couple of other places back in April in that area, my friend and I tried the Woodley Cafe....\n\n\nMore"], ["Close to zoo with average lunch", 3.0, "October 12, 2014", "Sue T", "Cleveland, Ohio", 45, 10, "Stopped in afternoon after visiting zoo. Should have known the food would be just okay given we were one of two groups in the restaurant. Should have known better than to order a Reuben but did it anyway. Mediocre corned beef and not your usual thousand island dressing. Husband chicken sandwich was good, but did not appear to match the...\n\n\nMore"], ["Excellent American Food for reasonable prices", 5.0, "October 8, 2014", "TheMadHatter79", "Ulm, Germany", 14, 7, "We visited this place during a business trip to Washington, it was an absolutely pleasure: food was excellent, service was friendly and fast, beer on tap selection astonishing, and prices were just right. We sat outside until closure. Definitely recommended to anybody visiting the area!"], ["Hidden gem of a cafe", 5.0, "September 30, 2014", "Sue P", null, 13, 9, "Breakfasts were traditional American style, freshly cooked, additive free and delicious. Lots of coffee refills. Coffee and pancakes were delicious. Steak and eggs awesome. We ate 2 evening meals here. Both were freshly prepared, additive free and made with fresh foods. Again delicious. Service was quick, efficient, polite and friendly. Not seen many of this quality of restaurant this time...\n\n\nMore"], ["Good date spot for someone you are unsure about", 3.0, "September 22, 2014", "Travelergirl998", "Baltimore, Maryland", 189, 94, "This place has typical american food which is highly edible. It is not too expensive and the menu has something for everyone. Not gourmet or fancy or even the best food. But perfect for a date you may end up paying for with someone whose food choices you dont know"], ["Average food", 3.0, "September 22, 2014", "MichMooi", "Kuala Lumpur, Malaysia", 32, 15, "We did enjoy the breakfast in Woodley Cafe but dinner was a little disappointing, every dish I ordered just tasted salty and the waitress couldn't seem to get our orders right."], ["Average cafeteria food.", 3.0, "September 16, 2014", "Eileen K", "New York", 24, 9, "Nice menu, cafeteria style, great stop in between walking the National Mall. Chicken soup was made with beef broth, so that was a little confusing, but ok. Soup and a sandwhich to split with two people were satisfying."], ["Great service & great food", 5.0, "September 3, 2014", "lollipop3694", null, 47, 11, "From the drinks to appetizers & entrees. The gentleman was very considetate and kind. I sat and waited for hubby to run an errand. He brought my drink and water , so when he returned and took time to decide he had something. The calamari , fish & chips and Cobb salad were awesome."], ["Not bad, just not great", 3.0, "September 3, 2014", "Andy A", "Minneapolis, Minnesota", 101, 20, "Decent food, average service, reasonable prices. Another average restaurant around the Woodley Park metro stop. If you're looking for a reasonably-priced burger, this wouldn't be a bad choice in the area."], ["We love it!!!", 5.0, "August 30, 2014", "SusanS2250", null, 2, 0, "We were approached quickly, served quickly and were even given two drinks on the house. The fish and chips were to die for, as was the crab bread appetizer. My 11 year old had waffles and practically licked his place. My 9 year old had chicken strips and also left nothing behind. My husband enjoys his meal also. It escapes...\n\n\nMore"], ["Great Breakfast option 1 block from the Omni", 4.0, "August 29, 2014", "wysfam", "Ada, Michigan", 144, 201, "Great eggs and bacon breakfast, quick, friendly, delicious stop on the way to the zoo or before your trolley or bus picks you up. Reasonably priced, quick service. Enjoy."], ["Not bad, could be a bit better", 4.0, "August 28, 2014", "newadventure53", "Macomb, Michigan", 239, 113, "Wife and I stopped in here after a long day at the zoo. Food was good, but nothing special. I had a parm chicken sandwich & it was good with fries. Wife I think had the turkey burger. We ate inside by the window for the AC and to people watch. If you are in the area I would recommend...\n\n\nMore"], ["Good food but slow service.", 3.0, "August 27, 2014", "fairytoes", "NC", 121, 38, "Went there for breakfast and lunch. Breakfast was pretty good but staff seemed unhurried. Returned another day for lunch, had to wait a long time for service and the food. The veggie burger was delicious though!"], ["Nothing Terrible, but not great", 3.0, "July 26, 2014", "Stormtracker365", "Virginia Beach, Virginia", 17, 6, "Food was good...My biggest gripe was that they brought everything out at the same time.. (salad, entree, etc)...also, we ordered an appetizer and they simply forgot it...just a mistake and we all make them, but the next time we are in the area, we will go elsewhere.."], ["Favorite place to eat during our Washington visit", 5.0, "July 20, 2014", "Whitt", "Kansas City, MO", 18, 6, "With a good variety of restaurants near our hotel, we chose the Woodley Cafe the first night because of its sign noting that breakfast is served all day. My granddaughter likes pancakes and waffles so that was the deciding point. I went for the omelets and since we went there numerous times during our week in Washington, I had a...\n\n\nMore"], ["A Perfect Finale' to a Day at the Zoo!!", 4.0, "July 20, 2014", "Saskheat", "Saskatoon,SK Canada", 300, 794, "This hidden gem is just steps away from the Woodley Park / Zoo Metro Station. We stumbled upon this place after a hot 4th of July in the Zoo. After musing over all the competitions menus on both sides of the street we chose this place. What an absolute delight. We ate Al Fresco in the shade of their canopy,...\n\n\nMore"], ["Gear breakfast", 5.0, "July 8, 2014", "Monica F", "Philadelphia, Pennsylvania", 76, 26, "The service was wonderful the breakfast delicious and the waiters were very friendly. Walking distance to omni shoreham hotel."], ["Worst experience I've ever had", 1.0, "July 5, 2014", "Lfzimak", "Silver Spring, Maryland", 3, 3, "We had a party of 3 sit down and ordered two teas and a water with lemon, the water came with no nice and no lemon and tasted horrible and the tea was undrinkable. So my dad ordered a duet coke and after 10 mins it was still\nNot brought and we had to go to the bar and get...\n\n\nMore"], ["Terrible Brunch", 1.0, "July 4, 2014", "Heather H", null, 5, 1, "With the plethora of great places to eat in the city, there is no excuse for this place to still be in business. The service was not good and the food was worse. Save yourself the money and head to McDonald's."], ["Excellent breakfast", 5.0, "June 27, 2014", "rayjo", "Essex, England", 5, 6, "Large choice for breakfast with happy, friendly and helpful staff.\nDelicious ! Loved going there and easy walk from Omni Shoreham"], ["Food was fantastic", 5.0, "June 24, 2014", "kary84", "Connecticut", 47, 22, "Great location, right across street from hotel. My husband and I had a late night food craving and made our way there. We were not disappointed."], ["Surprise find just by our hotel", 4.0, "June 15, 2014", "Meg107", "Aberdeen, United Kingdom", 140, 74, "This is an unassuming little place amongst a load of restaurants just off Calvert Street.\nHim indoors spotted seafood at reasonable price so in we went.\nWe didn't intend to have soup but the waiter pointed out that it was free with a main course so we did. Tomato and basil-good. He had crab bread as a starter, loads of...\n\n\nMore"], ["Fine option", 4.0, "May 28, 2014", "LauraAHA", null, 99, 30, "We were looking for a local breakfast experience, and we found what we wanted here. The interior offers historical restaurant décor and a genuine neighborhood feel. There were few other customers at the time we arrived, and our waiter was attentive, friendly, and chatty. The Mediterranean omelet was available with egg whites and included feta, black olives, tomatoes, and a...\n\n\nMore"], ["A neighborhood cafe with reasonable food", 3.0, "May 27, 2014", "Cha0tic", "Haifa", 60, 25, "Crispy calamari and tomato sauce - very nice. Minestrone soup - reasonable. Steak and burger - OK. Dated decor."], ["okay", 2.0, "May 26, 2014", "Danielle7260", "Walpole, Massachusetts", 23, 10, "The children's macaroni and cheese was kraft, asked for no fries with the burger due to allergy. Got fries. Chicken Cesear salad- chicken had no flavor."], ["OMG", 5.0, "May 17, 2014", "Brett F", "Marlboro", 26, 48, "Been to this café half dozen times and it is fantastic comfort food at the right price. Greeted with a smile, served with a smile and just nice. Have the mashed potato omelet it is fantastic."], ["One of many", 4.0, "May 8, 2014", "Retired T", "Brookings, Oregon", 52, 22, "We ate at several restaurants while in DC lately. This was one of the better ones. Window washer invited us in while we were contemplating our options in the area. Great staff --- came to the table several times to ensure we had everything we needed. (no name tags)\nFood was good, not exceptional but very good. We would go...\n\n\nMore"], ["It's a basic diner", 3.0, "April 28, 2014", "Robert S", "Livingston, New Jersey", 182, 59, "Look, it is a diner. Service was a little off. Eggs, basic chicken were ok. Saw some other dishes walk by, happy we stuck with the basics.\nPrices were very reasonable. Considering the other food choices in the area, this should be a fall back."], ["Poor Service Killed Experience", 2.0, "April 27, 2014", "ThatTeowonna", "Columbia, South Carolina", 6, 1, "Just brunched at Woodley's. Super busy! That's when good service is most important. This was horrible. Food ok but won't go back."], ["One of my favourite places to eat in D.C.", 5.0, "April 20, 2014", "RockyK90", "London", 4, 3, "On our week holiday in D.C. I ate in the Woodley Cafe 5 times (that how much we loved it!) The food was amazing and my personal favourites were the Steak and Cheese Sandwich and the Cheeseburger! The food was lovely and very tasty and fresh. At times the service could be a little slow and the good was not...\n\n\nMore"], ["Friendly Staff", 4.0, "April 16, 2014", "SandraLanglinais", "Southeast Texas", 52, 47, "They serve breakfast at all hours and it was good. Generous portions of food at a reasonable price. They have daily specials and a varied menu including pizza, sandwiches, steak, pasta, etc... Very convenient to the Omni and a great place to relax after a day of sightseeing. Our waiter was very friendly and attentive."], ["Great for Sunday Brunch", 5.0, "March 17, 2014", "DrBob41", "Detroit, Michigan", 70, 24, "My friend & I had a little time before heading to the airport, so we dropped into this cafe & enjoyed it for brunch on a Sunday morning. The food & the service were great, great selections on the menu.\nIt is near the zoo & a couple hotels, along with other stores."], ["Great breakfast spot", 4.0, "February 24, 2014", "ptw88", "New Hampshire", 48, 11, "Recommend for a great start to the day, wonderful omelet selection as well as other specials. Service was stretched the first day but.help arrived day 2. It is a bar by night so the tv seems to be always on, but somehow that tends to add to the ambiance"], ["Good food and good service", 4.0, "February 17, 2014", "Viajeroconbuengusto", "Washington DC, District of Columbia", 163, 37, "The atmosphere in this restaurant is not the best but the food compensates it. I tried the veggie omelet with hash brown and wheat toast and my husband the fried eggs with bacon and toast. All was really good, but the best thing it was the service. It was very nice and attentive. I appreciated it."], ["Just Ok", 2.0, "January 30, 2014", "KansasStateWildcats", "Topeka, Kansas", 25, 10, "Visited DC and went to the Woodley Café because another restaurant had a 30-45 minute wait and we didn't have much time. Restaurant only had a few patrons which surprised us, but we went ahead and sat down for lunch. The food was just ok and the service was about the same. Seems to be a little run down. It...\n\n\nMore"], ["Woodley Cafe - Would be better to go elsewhere", 2.0, "January 5, 2014", "Erik C", "Houston", 136, 49, "They tried. I will give them that. A long established place, but they must exist on location because the processes are broken and the food marginal at best. There was one waiter and he was frazzled. He gave us free salads because of the wait and there were only 5 tables used from a large restaurant. The burger was forgettable....\n\n\nMore"], ["Delicious Brick-Oven Pizza", 3.0, "December 24, 2013", "Ramesh P", "Princeton, New Jersey", 87, 35, "Purely Italian Cafe with booze,beer with Pasta,Pizza etc.We had three type of Pizza all Vegetarian with different topping.It was so awesome and weather was good like 65 F on Dec.21st night so have fun eating outside on street."], ["Good food that's reasonably priced", 4.0, "December 9, 2013", "Mary L", "Indianapolis, Indiana", 53, 11, "I ordered food for carryout, during a recent business trip. Portion size was generous, food was good, & price was reasonable."], ["First Meal in DC", 5.0, "November 24, 2013", "tjj123", "Algona, Iowa", 10, 3, "Flew into DC on a Saturday morning. Checked into the Omni hotel early and walked over to the Woodley. French Toast, Breakfast burrito and Eggs Florentine were delicious. Great service and welcoming environment."], ["Good for a quick meal", 4.0, "November 1, 2013", "barnowlKent", "kent", 52, 61, "Visited this place tonight, should have been busier but good value well cooked meal .\nPlenty of choice, good service."], ["Tasty brunch", 3.0, "October 30, 2013", "bmachale", "Baltimore, Maryland", 16, 5, "Decided on this restaurant, once we discovered a huge crowd outside Open City. Standard brunch items, but very friendly service, and good prices. And very close to Woodley Park Metro, so also very accessible."], ["Fresh fish and vegetables!", 5.0, "October 21, 2013", "tripper123", "Saugus, California", 73, 50, "I popped in for dinner a week ago on the last night of my trip. I went with my waiter's recommendation for the tilapia. It was divine! The sauce was so tasty and the steamed vegetables hot and crisp. I chose the salad over the soup and it was very refreshing. The service here was very attentive and when I...\n\n\nMore"], ["Gave it 2 chances", 2.0, "October 16, 2013", "vjl330", "Oviedo,FL", 14, 16, "I went for lunch. Someone led me to my table,and one of the servers,maybe a manager, was sitting at a table watching TV. Not a good sign.After reading the menu for a few minutes I was wondering if anyone was going to take my order. There were only 2 other tables occupied.Finally the guy who appeared to be in charge...\n\n\nMore"], ["Decent Experience", 3.0, "September 27, 2013", "Jessica E", "Seattle, Washington", 6, 1, "Food was fine - diner style with large portions and they have a kids menu. We had a very friendly server. Atmosphere is ok - a little dark and needs some updating. Prices were decent. Overall, there are better places to eat in this immediate area, but this is a good option if you want something quick and simple."], ["Good breakfast", 4.0, "September 18, 2013", "Nancy43_9", "North Aurora, Il", 29, 16, "Enjoyed breakfast here on two days while staying at the Omni. Very good, reasonably priced food, and freiendly service."], ["Decent, but not consistent", 3.0, "September 15, 2013", "ramius44", "Jacksonville, Florida", 85, 29, "We dined here for breakfast during Labor Day weekend, and the service and food was good. However, the next morning we ate here, the service was not as good and we were not nearly as satisfied."], ["Wonderful place for breakfast!", 4.0, "August 25, 2013", "Martha A", "Pittsburgh, Pennsylvania, United States", 16, 7, "I was looking for a place to have breakfast with my daughter and my grandson. We were driving south on Connecticut Ave., headed for DuPont Circle when my daughter spotted the Woodley Cafe on the other side of the street. It was Sunday morning so I did a quick U-turn and pulled into a parking space right in front of...\n\n\nMore"], ["Pretty good", 3.0, "August 9, 2013", "Richard P", "Schenectady, New York", 14, 6, "For dinner we neglected to mention kid's portion and our 11 year old got an adult meal. (He is a small 11 year old; so I think they should have figure that out) Food good but took a while. For breakfast, service was good but again it took a while for our meal to arrive. Waiter gave us a free...\n\n\nMore"], ["Excellent desserts", 5.0, "August 7, 2013", "Jolanda v", null, 1, 0, "Excellent service since it wasn't really busy. Waiter was friendly and the televisions weren't as present as in other restaurants. While the quality of the entrees is nothing special we really enjoyed the desserts. I've tasted multiple desserts and especially the Woodley's messy sundae and the Chocolate cake were of high level."], ["Poor service", 3.0, "August 6, 2013", "Evy530", "State College, Pennsylvania", 2, 0, "The service was poor, the beer was good and the food ok. The waiter didn't seem to like he had to make 2 trips to bring something we feel like having at the time. He wanted us to tell him all we wanted at once so he only had to make one trip. He was disgusted picking the napkins, so...\n\n\nMore"], ["Not Sure Why They Bother", 2.0, "July 30, 2013", "JohnEGraf", "Pittsburgh, Pennsylvania", 170, 108, "If you don't really want customers, why open the door. We stopped in on a Friday evening with a group of about eight. While the Woodley Cafe's patio was crowded, the dining room was not. We stepped in to the hostess station, and proceeded to wait a good long time . When the hostess finally got to us, she mentioned...\n\n\nMore"], ["Good lunch", 4.0, "July 1, 2013", "NettyA", "Brisbane, Australia", 209, 124, "We were staying in the area and looking for a late lunch, so decided to try this place. It wasn't busy, so service was good, though I felt a bit forced.\nWe started with three pink lemonades which arrived promptly and were very much appreciated on this hot day.\nI had a chicken and spinach salad which was excellent and...\n\n\nMore"], ["Be careful", 1.0, "June 29, 2013", "M M", "New York City, New York", 3, 2, "If you pay by credit card please be careful as we thought we had a nice waiter who we tipped well and a week later 1500 $ was rang up on my credit card at Home Depot, walmart and Macy's near this establishment."], ["Solid food but slipshod service", 3.0, "June 23, 2013", "avidbeader", "Durham, NC", 112, 38, "While on our way from the Zoo to the Metro, we wanted a place for a late lunch that wasn't a chain or too expensive. The descriptions of the day's specials on the sandwich board lured us in.\nThe food itself was good, with generous portions - both my husband and son left food on their plates that they just...\n\n\nMore"], ["Don't go", 1.0, "June 15, 2013", "Guz V", "Cuenca, Ecuador", 128, 59, "I asked for a chicken salad with spinach - it took almost 25 minutes. The service was really slow and then at some point of my meal some bug falls from the ceiling into my shirt. I didn't know what it was, a cockroach, a spider, I didn't see. Unfortunately it was just after paying my check so I couldn't...\n\n\nMore"], ["Not for one looking for a quick breakfast.", 3.0, "June 12, 2013", "JohnInHvl", null, 41, 15, "Outdoor seating was a plus, but kitchen service was very slow, wait staff was ok, not always attentive. At least they were cordial and not rude. Eggs Benedict were fine but no better than average...the english muffins took it down a notch and were nothing to right home about. The McDonalds, across the street, has better hash browns.\nFor DC...\n\n\nMore"], ["I don't know", 2.0, "June 5, 2013", "Teguzco", "Teguzco", 72, 28, "what it is about the restaurants on this block, but service was an issue with every one I tried. The Woodley Cafe had the honor of providing not only the worst service, but snotty service to boot. (No, no noses were running.)\nI first tried the Woodley for breakfast, it being one of the two cafes in the immediate area...\n\n\nMore"], ["Food average, service terrible.", 3.0, "June 1, 2013", "dregnichols", "Springfield, MO, US", 81, 48, "We ate here for breakfast, basically because there were few other choices open for breakfast. We waited quite a while to be served, and even longer for our drinks.\nWhen the food finally arrived, it was ok, just nothing special."], ["Great if you are lucky", 3.0, "May 30, 2013", "Retired_Boater", "Greater Detroit Area, MI", 53, 28, "Our first night in Washington, we were out for a walk and decided to have dinner at the Woodley. The place was almost empty, but we were in a hurry so that worked for us. My steak was fantastic and my wife's fish was very good. We enjoyed the meal enough to go back the next day. The following day,...\n\n\nMore"], ["Owner yelled at us!", 1.0, "May 25, 2013", "Laurie417", "Burke, Virginia, United States", 4, 0, "Service was quite atrocious. Restaurant was not very busy (we were there around 3 pm after a day at the Zoo), but service problems for our party of four children and five adults included: did not bring a soda we ordered; took a long time (~15 to 20 mins) with two cocktails that were then bitter and truly undrinkable; we...\n\n\nMore"], ["Decent", 3.0, "May 13, 2013", "Sarah M", "New Jersey", 114, 44, "Not great, but we had simple breakfast here one morning before heading out to tour some museums. Nothing special about it - just decent."], ["Go to the McDonald's Across the Street", 2.0, "May 2, 2013", "NorseBride", "Philadelphia, Pennsylvania", 38, 8, "This place had passable food. The food would have been as good and the service definitely would have been better if I had gone across the street to McDonald's. It was tortuously slow. My companion asked for cheese in her omelet and got a slice of swiss thrown in."], ["Should have gotten the clue from the empty dining room.", 2.0, "April 29, 2013", "Fred Z", "Somersworth, New Hampshire", 10, 20, "Not very good. Slow service, below average food. No atmosphere. Too bad. With its location near the Zoo and the Metro, it could be a gold mine."], ["Go here after a day at the zoo", 4.0, "April 22, 2013", "GGraessle", "Cape Elizabeth, Maine", 23, 16, "We stopped in after visiting the National Zoo and were very pleased. The service was quick. The food was very good; my wife and I had the Chicken parm sandwiches. Very reasonable prices, especially given how the zoo can charge you so much for so little."], ["A great place for breakfast", 4.0, "April 16, 2013", "L_Fenton", "Worcester", 68, 55, "If you are staying in the neighbourhood I would recommend you have a meal at the Woodley Café, I went for breakfast. The service was a little slow on the day I visited as there was a sudden rush of people, however, this was quickly resolved. The food was great, good value for money and in a lovely interior."], ["Somethings are a hit, others a miss", 4.0, "April 13, 2013", "laineypants", "Newport News, Virginia", 27, 18, "I went here with some friends after sight seeing in DC. Some of the food items were a total hit (nachos, pizza, Greek salad, and tomato basil soup) and some were a hot mess (burgers not cooked to specified order, iced latte that was served watery and warm). Overall, it's good for a quick bite--the menu has sufficient variety that...\n\n\nMore"], ["The worst service ever!", 1.0, "April 13, 2013", "food4thoughtnyc", "NYC", 3, 2, "Went to Woodley Cafe this morning with a friend. All we wanted to do was take out some food for breakfast. We arrived at 9:25 am, sat at counter to place our order and after waiting 5 minutes had to ask for menus. At 9:35 our order of 2 bagels with cream cheese and two teas,on decaf and one chamomile...\n\n\nMore"], ["Chicken Caesar Salad, good", 3.0, "April 11, 2013", "brain o", "Humble", 4, 4, "For $11 (which is a tad cheaper than elsewhere in the area), I bought a pre-packaged Chicken Caesar salad. Big slices of what looks like roasted chicken, not too dry. Big slices of parmesan, so you can crumble or eat them. Dressing of various kinds you can choose separately.\nFresh iceberg lettuce, not Romaine or the fancier other kinds.\nIt's...\n\n\nMore"], ["Quick and tasty", 5.0, "April 3, 2013", "morena5561", "Westchester, New York", 18, 12, "If you need a cup o joe or tea. That's the place to get it. A quick sandwich, some milk or chips... no problem. Pricey, but a dependable night time snack."], ["Good Lunch Spot, Busy Place!", 4.0, "March 31, 2013", "Reed123", "Baltimore, Maryland", 23, 31, "Had a good experience here for lunch. Attended a conference at a local hotel. Was seated promptly and served without delay. Great Greek Salad! Good menu selections. Not fancy but a great place to eat. Would go here again. Good quality and reasonable prices."], ["Breakfast Before Leaving D.C.", 3.0, "March 25, 2013", "Rick H", "Reedsville, Wisconsin", 11, 0, "We stopped here for a nice breakfast before leaving Washington D.C. later in the day a couple of weeks ago. This is a nice spot; good food, good atmosphere, great service (but there were not many diners when we were there). It was nothing out of the ordinary or outstanding, but a good quality breakfast. Price was was about average...\n\n\nMore"], ["Wow... but not a good wow!", 2.0, "March 14, 2013", "BeingFrankWithU", "Seattle, Washington", 32, 6, "I was attending a meeting nearby and found my way here form lunch. I had read some reasonably positive reviews but was ultimately drawn in by the Daily Special chalkboard outside touting a veggie burger with fixings. My server was prompt and friendly but not so well informed. As more people wandered over from the conference hotel, the two servers...\n\n\nMore"], ["Good food, slow service", 3.0, "February 22, 2013", "RCMoeur", "Phoenix, Arizona", 164, 89, "Ate here with co-workers as part of a meeting. Ordered a big burger, which was entirely good (but not superlative), but service for our group was rather slow. Prices aren't cheap, but very reasonable for the Woodley Park neighborhood. Good ambiance."], ["Good food; slow service", 3.0, "December 20, 2012", "BeachBumm16", "Harrisonburg, Virginia", 43, 22, "I came here for Sunday brunch and I guess that wasn't the smartest decision because the service was extremely slow. Even when the restaurant emptied out, our server seemed to take forever to do everything, and wasn't the friendliest either. The food was good though - pancakes were delicious! - with the exception of my scrambled eggs which weren't all...\n\n\nMore"], ["Service Should Be Better", 3.0, "November 21, 2012", "Mike A", "Tecumseh, Michigan, United States", 54, 10, "Waiter did not know if food prepared without nuts or seafood cross contamination. Took too long to get food. Portions were big and food was decent"], ["A good alternative", 4.0, "October 23, 2012", "Steven W", "Washington DC, District of Columbia", 187, 64, "My wife and I were staying at the Omni Shoreham but did not want to spend the outragous prices they were charging for breakfast. Knew that Woodley Cafe served breakfast so we went there. When we got there about 9:30, the place was relatively empty. By 10:00 it was packed. The food was pretty basic breakfast fare, but pretty good...\n\n\nMore"], ["Great value!", 4.0, "October 9, 2012", "narrow56", "Potsdam, New York", 79, 36, "My husband and I decided to eat here after walking all day and ending at the zoo. It was just down the street from the zoo. I was pleasantly surprised at how cheap the food and drinks were. $3 for a beer is cheaper than in my small hometown! Our waitress wasn't very friendly but she wasn't rude. The food...\n\n\nMore"], ["Good place, close to the hotel", 3.0, "August 24, 2012", "Phylandria H", "Jackson, Mississippi, United States", 8, 3, "Nice place, good service, reasonably price(for DC), nice menu variety. Eat here if you're staying at the Wardman Park Marriott and want a place you can walk to.(5-10 min walk)."], ["Good, simple cuisine", 3.0, "June 29, 2012", "PVBfoodie", "Ponte Vedra Beach, FL", 56, 18, "Menu is decent with simple foods. had a business lunch and everyone enjoyed their meal. You can get breakfast all day. Big portions."], ["Great location, good food", 3.0, "June 25, 2012", "juhse", "Boston, Massachusetts", 19, 8, "In a strip of restaurants right on Connecticut (just past the metro as your walking back from the zoo). Many of the restaurants nearby are Italian, but this one has decent food and great service. I would be more impressed if they had a better beer selection, especially since they boast their beer during happy hour."], ["I ate where?", 2.0, "June 25, 2012", "dianeri123", "Montana", 53, 37, "The experience was so average that I can't even remember what we ordered. I just remember we were very unimpressed and did not bother to go back during the six days we stayed at the Omni across the street. The service was lack luster...which I can forgive if there is a crowd or the food is great; neither which was...\n\n\nMore"], ["Good Basic food served with a smile", 3.0, "June 23, 2012", "Kazlet", "Ashford, United Kingdom", 127, 129, "The prices are good and the portions are large. Friendly staff ( and I liked the 1990s Brit Pop CD playing in the background ). Could do with a bit of a decor facelift (and ditching the tired plants), but fine for a breakfast or quick lunch."], ["Nice Food", 3.0, "June 21, 2012", "TinaRosea_10", "Berwick upon Tweed", 5, 0, "Food was nice, however service was strange, Husband got his meal and he was half way finished before I got mine, he would normally wait but then his would of had to be sent back as would of been cold."], ["Can I get a seat", 1.0, "June 16, 2012", "bcw12109", null, 4, 1, "After waiting for a table for 30 minutes, couldn't get anyone to even talk to me,I gave up and my family left. There were many tables available, but the staff was so intent on ignoring us, even after asking them directly. They would just put their heads down and look away. Quite rude and I l would not attempt to...\n\n\nMore"], ["Good Food, reasonably priced", 3.0, "June 5, 2012", "dr_evil_dad", "Dallas", 87, 38, "Service was a little slow but the food more than made up for it."], ["Best Brunch Yet", 5.0, "May 27, 2012", "Turdle", null, 1, 0, "I couldn't find a good breakfast for 3 days. We stumbled in and was pleasantly surprosed. Very friendly and attentive staff. Very family friendly!"], ["Great comeback on a slow start..", 4.0, "May 26, 2012", "KWFANS", "New England", 86, 114, "My wife and I hit her around 9 am on Saturday of Memorial Day weekend. The line was 4-12 people and the staff was not interacting with us. Only when one had an opening would they give an update. Having a hostess would have been nice.\nOnce we got seated there was a mix up with waiters and after 15...\n\n\nMore"], ["Good quick burger", 4.0, "May 24, 2012", "MarkAW-GRMI", "Grand Rapids, MI", 48, 10, "Stopped in for lunch on a beautiful sunny afternoon burger ordered medium but came well done with fries. Good waiter attention."], ["Great breakfasts", 5.0, "April 23, 2012", "Gills23", "Brighton and Hove", 50, 24, "This is a cheaper alternative to eating in the hotel, as its great value, large breakfasts are delicious. With free coffee refils."], ["Perfect breakfast spot", 5.0, "April 14, 2012", "vafedtraveller", "Williamsburg, Virginia", 49, 15, "Looked for alternative to cost of hotel breakfast. Found this spot on Saturday night, had breakfast on Sunday. Wish we had stopped here earlier for dinner- menu and specials looked good, will visit again. Place is small and outside was not available for breakfast when we got there so there was a waiting line. Had mashed potato omelette, eggs florentine,...\n\n\nMore"], ["Fair", 3.0, "March 31, 2012", "Consultanttraveler55", "Englewood", 100, 56, "Good news, not expensive for the neighborhood. Bad news the food is not great. Staff are very nice."], ["Long wait, but good food.", 4.0, "March 23, 2012", "wps24", "Springdale, Arkansas", 58, 10, "We had a late lunch at Woodley Cafe. I am a little torn on how to rate it. We were seated immediately, but waited a very long time before any one came to even take our drink orders. We had been there a little over an hour by the time we got food. No one was rude, but they were...\n\n\nMore"], ["Low Key and Inviting", 5.0, "March 13, 2012", "Artbrut", "CT", 36, 15, "Casual and delicious food, a neighborhood favorite."], ["Better Quality Food", 5.0, "February 22, 2012", "joby3858", "East Sussex England", 7, 3, "We ate at Open City several times and then found them Woodley Park diner for a breakfast. We found it to have better quality of food. It was also quieter in atmosphere. Very close to the Omni where we were staying."], ["Excellent local diner", 5.0, "February 22, 2012", "Craighigg1959", "Northampton, United Kingdom", 103, 62, "Great pace for breakfast or a snack in the evening with a beer\nService is really friendly and the breakfast was really a good way to start the day"], ["Very good sandwiches!", 5.0, "January 26, 2012", "Multimodal", "College Station, Texas", 3, 0, "Try the Rueben! It was very tasty and delicious for a quick lunch during a big conference."], ["Poor food and bad service", 1.0, "December 9, 2011", "Cincy45209", "Cincinnati, Ohio", 69, 13, "I went for brunch with a friend who has Celiac disease and was assured by the restaurant that she would be fine and they would not give her anything with wheat. After we ordered and my food arrived, the waiter comes out and says that they can't guarantee her meal will be safe. To add to this, my omelet was...\n\n\nMore"], ["Good simple food", 5.0, "November 8, 2011", "Tankie0", "Preston, United Kingdom", 74, 39, "Ribs were great and breakfast was filling.\nVery good service"], ["Good food quick service", 4.0, "November 6, 2011", "Anon58759", "Spokane", 139, 62, "We took a chance on this restaurant after reading noting it in the Washington Post. We don't live here, but we decided to walk down after visiting the zoo. We sat outside; the waitress took our order quickly, and our food was delivered quickly. My husband had not eaten more than 2-3 bites of his meals during the week, but...\n\n\nMore"], ["Good Food. Great Service. Great alternative to that popular place around the corner.", 5.0, "October 9, 2011", "CaptiveGuru", "Orlando, Florida", 59, 18, "Had Sunday brunch here while staying at the Omni. Sat outside. The location is far enough from the corner so as to make the noise level quite low (especially compared to Open City around the corner). The menu is interesting. I had the Mediterranean omelet (olives, tomatoes, and feta), while my wife had the eggs Benedict. Good food. Not as...\n\n\nMore"], ["Make this a first choice to eat when in the area", 5.0, "October 6, 2011", "canewbee", "east moriches", 91, 53, "There were a lot of resturants to choose from in the area. Not knowing anything about any of them we took a shot on this quaint open air cafe. Wow.. that's all I can say. Cold beer, awesome food, excellent service and nice atmosphere. This was so good we came back another night during our stay. The owner was around,...\n\n\nMore"], ["Unexpectedly good", 4.0, "September 19, 2011", "Swl781", null, 211, 59, "We stopped here for drinks and stayed for dinner. Wonderful pizzas and pasta were sampled, but the menu is quite extensive. Food and service were very good."], ["Decent breakfast, decent service, affordable", 3.0, "May 3, 2011", "VegasLovr", "Boston, Massachusetts", 62, 18, "After reading the other reviews on this site, I can understand people's frustrations with the slow service. It was the only con for us. We arrived for breakfast in the morning. We were seated promptly and pleasantly. We both ordered the pancakes (one with hash browns and the other with bacon). The coffee was very good and hot (some places...\n\n\nMore"], ["We wanted a decent variety of foods for...", 5.0, "June 13, 2010", "Honest100", null, 5, 1, "We wanted a decent variety of foods for our picky daughter & son. We were very pleased with the quick seating, menu variety and attentive waitress who took care of us very well. Our son had chicken pasta w/marinara sauce and delicious salad. Our daughter had a full size cheese pizza she enjoyed. As for the wife, she had a...\n\n\nMore"], ["What a wonderful secret with parking, terrific food for everyone and great prices", 5.0, "April 25, 2010", "SkippingTown", "New Jersey", 5, 1, "My husband and I found ourselves on Connecticut Avenue near the zoo this morning and decided to stop for breakfast. We parked in a garage around the corner for $15 for the day and walked into the Woodley Cafe. Greeted with a smile and seated right away we knew we had stumbled into someplace good.\nThe menu had an extensive...\n\n\nMore"], ["decent", 3.0, "April 12, 2010", "Geert-Hilde", "Belgium", 222, 124, "After some days of Chinese and Italian food, I wanted a real Fish and Chips, with a salad and a cold beer. And that is exactly what I got here. Nothing to make any fuss about, but I tasted like it should."], ["Great food service & all", 5.0, "October 29, 2009", "jtrm_stephens", "Millsboro, Delaware", 22, 13, "The food was excellent. Great family/casual atmosphere. the waiter was really nice and my friend thought he was pretty cute. Definetly get your money's worth at this one compaired to the other restuarants in DC that are way over priced."], ["Apparently they only do breakfast on the weekends.", 3.0, "October 1, 2009", "TahitiDreaming10", "Gardner, MA", 33, 16, "This is a typical college restaurant. It's not bad but it's not great. Our food was overcooked. It wasn't horrible but it was less than great and we were on vacation. We are both past college. We ate here twice because it was close to the Omni Shoreham where we stayed and Open City was jammed. Service was ok. Coffee...\n\n\nMore"], ["Would give it no stars if we could", 1.0, "September 3, 2009", "UK_Manchester", null, 36, 57, "Our experience was so bad we don't even like recalling it. Suffice to say NEVER NEVER NEVER EVER EAT AT THIS HELLHOLE. Shame for the waitress who was nice. We should have known better because all tables were vacant."], ["Decent food, one of the least expensive places in the area", 3.0, "August 16, 2009", "scp5421", "Colorado", 33, 31, "I was looking for a place for dinner after a visit to the Zoo a few weeks ago, and passed many restaurants heading back to my hotel (Wardman Park). Woodley seemed the best option for a solo diner, and the price range was about half what other restaurants in the area offered.\nI had a glass of white wine and...\n\n\nMore"], ["Avoid At All Costs", 1.0, "May 4, 2009", "Gusterlover24", "Washington, DC", 1, 0, "Do not go to this restaurant under any circumstances. We came here out of desperation after a long day at the zoo and were subjected to the most horrible restaurant experience of our lives, bar none.\nService was excruciatingly slow, and when we finally got our food, it was nothing like what was described in the menu. Spicy, succulent porkchops?...\n\n\nMore"], ["Better off at Open City or McDonalds", 1.0, "April 13, 2009", "Skier-Pecos-Bill", "Centennial, Colorado", 8, 7, "Horrible service. We couldn't wait to get a table at Open City nearby so we went wandering. Others at our convention had eaten there but we either missed their informal reviews or we were too tired to remember. At 10:15am on a Monday, we thought they were closed as it seemednobody was inside. That should have been our first clue....\n\n\nMore"], ["The Waitress Yelled at Me", 1.0, "November 10, 2008", "ijustwantthecheck", "Washington DC", 1, 0, "I live close to Woodley Cafe, and liked the convenience. However, my last time at the Restaurant one of the waitresses yelled at me. I couldnt find my waitress and asked another one for the check. I asked two different times, and both times she just stared at me and walked away. The third time she yelled across the restaurant...\n\n\nMore"], ["Ok, pretty good for breakfast", 3.0, "September 28, 2008", "jsb712", "Raleigh, North Carolina", 14, 1, "Not bad, my girlfriend liked her omellette, I only got fruit and an english muffin. Service was slower than I would have expected, given the circumstances. Only went for breakfasy, but walking across the street I noticed I could have paid 3 bucks for my mimosa at the Irish pub (on sunday), as opposed to 6 at Woodley."], ["Worst Restaurant Experience In My Life!!!!!!", 1.0, "May 27, 2008", "JBWash", "washington,dc", 1, 2, "Great place, IF YOU LIKE RACEST MANAGERS!! As many others my boyfriend and I were tricked by the lovely outside seating and good prices. Our first clue that something was seriously wrong was when the table next to us told us to order as fast as possible. When we asked why they told us of their monumental wait for Bloody...\n\n\nMore"], ["Nothing fab at this place. But if you are in the area on your way to or from the zoo, you can stop at this restaurant...", 1.0, "February 14, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nothing fab at this place. But if you are in the area on your way to or from the zoo, you can stop at this restaurant for burgers or breakfast food. Do not make a trip make a trip just for this place though."], ["Could NOT have been more perfect", 5.0, "January 19, 2008", "hlghmalntenence", "fort lauderdale", 3, 5, "We visitied here last week for a small family trip. Spent the day at the zoo. We left the zoo just after luinchtime and my 4 year old daughter was famished. We walked to the Woodley Cafe and discovered there was a big convention going on nearby and we just happened to walk in with probably about 50 businessmen. Argh!...\n\n\nMore"], ["Best of Woodley Park Area", 5.0, "January 6, 2008", "kathoove", "Virginia Beach, Va", 1, 0, "We were here for a weekend getaway the end of October. AFter our first visit to the cafe, we ate no where else. The service was excellent, the owner was fabulous, talked to us every time we were in , and our waitress a newcomer from Russia was charming. The 3rd time we were here we were greeted by other...\n\n\nMore"], ["I love breakfast food. It is rare that I don't clean my plate when it holds eggs and hashbrowns. The Woodley Cafe...", 1.0, "December 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I love breakfast food. It is rare that I don't clean my plate when it holds eggs and hashbrowns. The Woodley Cafe served me and my dining companion what were possibly the worst meals we ever ate."], ["No joke: The worst meal...", 1.0, "December 11, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "No joke: The worst meal I've ever had in a restaurant. And we got sick. So not cool."], ["So-So", 3.0, "December 20, 2006", "BeingGreen", "Georgia", 203, 235, "While staying at the Marriott Wardman a short walk away I ate at almost restaurant in this block and this one was just average.\nI had breakfast here one morning and the timid waitress seemed very uncomfortable. She did not check on my coffee but once and I found myself looking for her several times.\nThe omelet I ordered was...\n\n\nMore"]]], ["Potbelly Sandwich Shop", [["Awesome Subs", 5.0, "September 24, 2015", "Mariawrn", null, 28, 10, "This is a small shop on 3rd St. And it was right around the corner from our hotel. Delicious subs on toasted rolls. I had the Italian and my husband had The Works. It was so good, we went back a second time after the Pope'svisit."], ["Washington, DC - Potbelly Sandwich Shop (Union Station)", 4.0, "August 31, 2015", "Ben B", "Hackensack, New Jersey", 54, 15, "Excellent quality of sandwiches at the Potbelly Sandwich Shop which is located in the Union Station building. I had a chicken sandwich on whole wheat bread roll with a little bit of mayonnaise, lettuce and onions."], ["Ok, nothing spectacular", 3.0, "August 12, 2015", "Terah2011", "Heber Springs, Arkansas", 18, 8, "We stopped in for lunch. It had very little seating, the staff was rude and short, the sandwich was 'ok'."], ["Great simple sandwich shop for people on the go", 4.0, "June 25, 2015", "nicky h", "London, United Kingdom", 62, 15, "Tasty sandwiches in the middle of the university campus. Great for a quick lunch or just a take away."], ["Consistent! 100x better than Subway or Quiznos", 4.0, "March 17, 2015", "iStefPayne", "Washington DC", 126, 58, "Potbelly is my go-to in DC for takeaway sandwiches (other than So's Your Mom, the best of the best, only in Adam's Morgan.)\nThe menu is consistent across stores, the staff is friendly and fast and it's cheap. Can't go wrong. Soup, sandwiches, salads, chips, shakes... and the hot peppers are crazy good."], ["Lunch in Chinatown", 3.0, "December 3, 2014", "Ronald B", "Arlington, Virginia", 184, 35, "While taking a class in DC, I went to Potbelly's for lunch. Quick service. Since space is limited in DC, this Potbelly's has to use a second floor for eating space. There is outside seating on a second floor porch, but it was too rainy and cold to use."]]], ["Potbelly Sandwich Works", [["Very quick duing lunch hour", 4.0, "September 3, 2015", "gdgraph", "Washington DC, District of Columbia", 70, 18, "Great place to go to for lunch, there are a lot of buildings around it with people going in on their lunch break. The lines can get long but they are very quick for the amount of people coming through, they bring around an extra person with an ipad and speed up the ordering process during lunch time."], ["Good sandwiches, Better shakes", 4.0, "April 12, 2015", "Catherine M", "Richmond", 41, 25, "Dropped in while touring the museums. Food is good and reasonable. Banana shake was awesome and the chili is really good too."], ["Good food, good price for DC", 5.0, "June 21, 2014", "TheTumbleweed63", "Moore, Oklahoma", 15, 12, "We were happy to find these on corners throughout DC, food is great and reasonably priced compared to many places in DC."], ["Nice Salads", 4.0, "June 3, 2014", "JLHoz", "Honolulu, Hawaii", 85, 43, "I had a very good farmstand salad at Potbellys. It was quite large, filling and tasted really good for only $7.30. They also have these nice big and fat dill pickles for $1.00 before the salad. I also had a smoothie after the salad. Nice and thick with loads of berries and flavor. All for $12.00 - $13.00."], ["A Small Step Above Subway", 2.0, "December 27, 2013", "NadoMamma", null, 71, 26, "So there is a much better sandwich shop just three blocks away, Cornercopia. This place does have the advantage to be fast and cheap - but what's that saying \"You get what you pay for\"? It's very true here. So if you are looking for very fast and very cheap and aren't concerned about quality or taste - this is...\n\n\nMore"], ["Fantastic", 5.0, "August 13, 2013", "Angie118", "Toronto, Canada", 11, 7, "Fantastic quick healthy sandwiches and salads. I had the mediteranean salad and loved it. Will try to make it at home ;)"], ["Yummy and cheap", 5.0, "August 12, 2013", "hrp963", "Virginia", 5, 2, "While visiting DC for a combination business/pleasure trip, my family (husband, myself, and toddler) dined at PotBelly. My husband and I each purchased a full meal with a sandwich, drink, and cookie and the total was only barely over $20! Not bad at all for a filling meal in DC. The food was absolutely delicious. I had the Toasted Turkey...\n\n\nMore"], ["PotBelly here is PotBelly everywhere", 3.0, "July 29, 2013", "onethousandanswers", "Virginia", 119, 22, "This is a chain fast food restaurant which I prefer to a number of others. That said, if you've been to one PotBelly you pretty much know what to expect (in terms of their sandwiches)."], ["Enjoy, But Count the Calories and Sodium", 4.0, "July 8, 2013", "Jonathan R", "Washington, District of Columbia, United States", 196, 62, "One of the consistent \"go-to\" places for lunch near my office, even with competition from nearby food trucks and other fast-food places and more formal restaurants, is PotBelly. For some time, PotBelly has been delivering (at high speed and with cheerful service) a variety of sandwiches and salads that won't break the bank.\nWhether they also stretch your waistline depends...\n\n\nMore"], ["Great Takeout", 5.0, "July 6, 2013", "KAG724", "Indiana, Pennsylvania", 39, 12, "We decided to stop and pick up something light. We got their salads. FANTASTIC! Made while you wait. Staff was very friendly and made the experience positive."], ["Great quick subs, better than subway by far", 5.0, "July 5, 2013", "Melmel79", "Bethesda, Maryland", 88, 52, "Choice between subway and potbelly? Of course potbelly, better ingredients more imaginative options, still as quick and convenient as subway but with better atmosphere so if you want to stay and eat at their place you feel like you are actually eating at a restaurant rather than eat and go franchise which is nice. Little bit pricier, though worth it."], ["Fresh chain.", 5.0, "March 21, 2013", "batsnapper", "Natchez, Mississippi", 51, 16, "As far as chain sandwich shops go, this is my new favorite. Try the skinny for a lite, inexpensive, but filling meal."]]], ["Pret A Manger", [["Fresh", 5.0, "September 10, 2013", "aileenTorontoCanada", "toronto canada", 25, 8, "They have good coffee and delicious almond croissants that are fresh,fresh,fresh. I never had time to try the other food but if they can serve a good croissant the rest of their menu must be good. Prices were reasonable and the staff always had a smile."]]], ["Italian Gourmet and Deli", [["Better deli than the Italian Store", 5.0, "June 26, 2015", "ExRIGuy", "Virginia", 199, 184, "So this is a nice Italian deli that offers up a choice of hard or soft rolls and all kinds of Italian subs and a bunch of cheesesteaks and burgers, one popular one being called the Bacon Bomb. I prefer the Italian subs here over the Italian Store and they have far more hot food options, including chicken parm, and...\n\n\nMore"], ["The best French Fries in DC", 5.0, "November 10, 2014", "cdllj", "Lawrence", 20, 12, "Do NOT try to save calories by settling for packaged baked chips - get the fries and plan to split the order with a friend. Sandwiches are share-able too and it all adds up to a reasonable meal in the middle of the City. If you are in the neighborhood, well worth a stop for lunch."]]]]