[["Chipotle Mexican Grill", [["Chipotle is quick and reliable", 3.0, "August 5, 2015", "Laura10510", "New York City, New York", 15, 6, "A little small, and could have used a cleaning, but otherwise the food was fine and exactly what you'd expect from Chipotle."], ["One of the Best Chipotle's I've Been To", 5.0, "July 16, 2015", "Cindy B", "Bethpage, New York", 50, 25, "I came to this Chipotle not expecting much. First, they didn't have half of the meat types advertised on the menu, so I ended up getting the steak on my tacos, but besides that, it was really great. The customer service is amazing; it's so friendly there and the food was fresh and delicious. I would love to return!"], ["Always my favorite", 5.0, "May 29, 2015", "Jay E", "Abilene, Texas", 18, 21, "I love chipotle wherever I am but I was pleased that this place had outdoor eating areas and the server gave a good amount of guacamole! Thanks!!"], ["Just about average", 3.0, "March 14, 2015", "TristansFar", "Odense, Denmark", 12, 5, "Of course it is not fine cuisine, but if you are hungry and in a hurry, Chipotle will do the trick. It is, however, just about average. 10 minutes after you've finished your meal, you have forgotten about it. Yet my students went there twice - bless them..."], ["Great value Meals", 5.0, "December 13, 2014", "jpjnewpost", "Washington DC, District of Columbia", 11, 5, "Great Value Meals, The Chipotle Mexican Grill in Wisconsin Avenue, Glover Park, DC, THOSE GUYS REALLY WORK HARD. Top customer services. They are great even under the pressure of the long lines. I never seeing a Chipotle so friendly and I had have visit many. Outstanding staff, the food always fresh."], ["As Good as ever", 5.0, "December 5, 2014", "Stephen M", "Midlothian", 6, 1, "Chipotle is good in any city, and this is no disappointment to their track record. The sore could be a bit bigger but they work with what they have"], ["Le gusta?", 5.0, "November 16, 2014", "elaine s", "Missoula, Montana", 495, 103, "Yes, this is a great eatery offering tasty dishes cooked in the authentic style served pronto and reasonable enough to take the entire family out to eat. Always reliable and a fun visit knowing you can visit the grill and will enjoy your meal 100%."]]], ["Paolo's", [["Fantastic lunch", 5.0, "October 10, 2015", "Carrieg72", "Port Charlotte, Florida", 24, 9, "This was such a nice surprise. The wait staff was very friendly. Had the fettuccine Alfredo with pancetta. Amazing the best I have ever had!! My husband had spaghetti with a meat sauce I forget what they called it. He said it was full of flavor and just about licked the bowl. This is a must go in Washington."], ["Very good salad", 4.0, "October 2, 2015", "Keyfalcon", "Riehen", 35, 9, "If you are looking for a restaurant serving other meals than burgers an french fries your are right at Paolo's. Especially the salads are recommended for diner! Wines also very good and service personal is very friendly ( Sandra)."], ["So Very Pleasant", 4.0, "September 16, 2015", "PlatinumHoney", "Washington DC, District of Columbia", 510, 198, "A blue sky, warm sun, a light breeze and delightful French food and service al fresco (or in) in Georgetown, sort of anchors the retail experience. Service was splendid. Food OK, not phenomenal or anything, but good. I had grilled salmon, which was perfectly cooked, excellent truffle French fries and fried brussels sprouts (a bit dry but tasty) followed by...\n\n\nMore"], ["Drinks & Appetizers", 4.0, "September 14, 2015", "jlcauser", "Sterling, Virginia", 151, 52, "We stumbled upon Paolo's a few months ago while walking off the main strip of Georgetown. While staying in the area, we decided to give it a try. We sat at the bar before the dinner rush. Even though the bartender was alone and busy, she still gave us plenty of attention and our drinks were delicious. We decided to...\n\n\nMore"], ["Horrible staff, average food, good location", 1.0, "August 20, 2015", "picalexandre", "Washington DC, District of Columbia", 57, 55, "The staff is obviously poorly trained. I had lunch there and the waitress Jessie W was not only rude and unpleasant but unprofessional. I told another waitress that this was not acceptable and she couldn't care less ... The food was ok, nothing great, just your average Italian restaurant. Location is great and the terrace would be enjoyable if it...\n\n\nMore"], ["Average safe", 3.0, "August 11, 2015", "Tony Y", "Singapore, Singapore", 98, 35, "We had the mains here as part of our progressive dinner tour. Modern cafe style, predictable. Had the wild mushroom risotto, a bit salty but tasty. Others in our group had the Strip Steak and that was tasty and nicely done. Nothing special but safe"], ["Perfect", 5.0, "July 30, 2015", "Basics100", "Bristol, UK", 92, 155, "I stumbled on this place whilst doing a self-guided walk around Georgetown and it was a welcomed break.\nThe hostess was most welcoming (and even gave me some tips on where to go and what to see in G-Town) and I had a seat in the open window, which was great as I could people watch Wisconsin Avenue. It was...\n\n\nMore"], ["Great restaurant in georgetown", 4.0, "July 21, 2015", "Pierre-olivier R", "Trois-Rivieres, Canada", 13, 2, "Our dinner at paolos was great, we tried the calzone and the carbonara and both were really good! Beware as the cocktails are pretty strong, but still very good!"], ["High on taste and ambience", 5.0, "July 21, 2015", "FoodieFrom20147", "Ashburn, Virginia", 39, 12, "Family of four vegetarians ended up eating here after. The dishes are all very well done and we're pretty tasteful.\nIt was quiet when we visited this place. The waiter and other staff members were very friendly and professional.\nGeorge Town cup cake is 3 blocks from here and we found parking on Prospect street.\nWe will sure visit this...\n\n\nMore"], ["Potential to be Better", 3.0, "July 15, 2015", "HinghamPonch", "Hingham, Massachusetts", 67, 47, "This place COULD be a home run. Great open-to-the-outdoors atmosphere, great music and TVs in the bar dining area. The food is really good too. What killed it...waiting so long for drink service from the not-so-busy bar that our waitress, after being reminded 2x, finally had to go behind the bar and mix the drink herself. Bartender WAY too comfortable....\n\n\nMore"], ["Good food and service", 4.0, "July 13, 2015", "Marlonbir", "Washington DC, District of Columbia", 3, 1, "Had a nice family dinner. Nice surroundings, good service and very good food. A \"place to get back to\""], ["You'll have a good time", 4.0, "July 12, 2015", "HotelDeal", "Washington DC, District of Columbia", 76, 18, "Nice menu and pizza offerings. Relaxed atmosphere in the bar and restaurant. You can hang for drinks or get appetizers or pizza or sit down for a full meal. Food is very good. Added benefit is it's in a good location and right on the street so you get the feel of a cafe in busy Georgetown."], ["Small, but very good!", 4.0, "July 8, 2015", "Paulo_JAM_05", "Sao Paulo, SP", 20, 8, "I had a lunch there last january.\nIt was very nice, the enviroment is beautiful and the waiters are care and have attention."], ["One of my hot spots in G'town", 5.0, "July 8, 2015", "Emil R", "Baku, Azerbaijan", 80, 27, "No matter how busy I can get in DC, there is no way for me to skip Paolo's! The food is beyond delicious - the dips, appetizers, pastas, pizza, seafood salads, risotto, drinks, steaks and it can go on...service is excellent, location is vibrant G'town. Luv it!"], ["Stay away", 1.0, "July 2, 2015", "Mike G", "Providence, Rhode Island", 6, 3, "Fortunately or unfortunately depending on where you're sitting at the time, I happen to live In a state known for its restaurants. The cultural diversity of our restaurants are second to NY and Boston, and there lies the rub. My family and I attempted to find an Italian restaurant in the DC area and stumbled upon Paolo's. My daughter wanted...\n\n\nMore"], ["Great Food, Affordable prices", 4.0, "June 30, 2015", "Aprilr88", "Baltimore", 33, 18, "We went to Paolo's and we are so glad that we did. The food was so delicious and they gave you good portions. The service was ok, but what was nice, was that each waiter or waitress helped each other even if it wasn't their table. Teamwork goes far for me and I'm so glad that I witnessed it. Would...\n\n\nMore"], ["Underwhelming", 3.0, "June 30, 2015", "TMPAFT", "Canberra, Australia", 22, 8, "Cocktails were ordered and we waited and waited.\nA margarita was served 'on the rocks'. No salt, in a tumbler, full of ice cubes. Rates as the worst I have ever had. Drinks arrived only a couple of minutes before the food. So much for pre dinner drinks.\nThe complimentary tapenade and bread sticks were very good but dinner was...\n\n\nMore"], ["Save yourself the trouble", 1.0, "June 27, 2015", "Geoff P", "Boynton Beach, Florida", 49, 12, "If you look hot food, served within a reasonable time, tasty and fairly-priced, go somewhere else.\nRequests for explanations for the long, long delay in even getting a drink were met by shrugs, and the pointed and loud comment by our waiter to the neighboring table that they were being given a complimentary dessert as they didn't complain.\nAvoid this...\n\n\nMore"], ["Average fare, average place", 3.0, "June 23, 2015", "MRL217", "Greenville, South Carolina", 97, 52, "Been here many times with work related groups. Dinner is usually average; menu is standard fare. Wine list mediocre. All in all, it's an okay place to eat but if you're looking for something out of the ordinary, this isn't it. It was convenient to our hotel and the food was always okay, just okay."], ["Amazing deal for brunch", 5.0, "June 17, 2015", "Kait_De", "Boston, Massachusetts", 77, 28, "For a mere $30, you get an appetizer, entree, and bottomless alcoholic drinks for brunch. Such an amazing deal!! The food was also delicious, and our waiter was very attentive in making sure our drinks were refilled at all times. The restaurant itself is really cute and in a great spot for after brunch shopping."], ["Italian food in Georgetown", 3.0, "May 16, 2015", "GuiaRay", "New York City, New York", 4, 0, "It was my wife's dream to have food here, so many times we'd drive by but never had a chance, late Saturday one of the last tables to sit... Waiters not happy. Food was average but nice Georgetown vibe. Would i come back? Nope."], ["Not impressed!", 2.0, "May 14, 2015", "VITTY306", "Miami Beach, Florida", 25, 11, "I have ordered pasta Carbonara-my favorite and i was so dissapointed to find that it was sweet.It was very heavy and sweet.My appetizer was Burrata Mozzarella which was great!The service was good as well."], ["Great Place for an Upscale Lunch", 5.0, "May 14, 2015", "Greg A", "Manassas, Virginia", 19, 9, "Paolo's is a unique place for a great lunch. In the winter you can dine by the fireplace in the Spring and Summer you can grab a table by the windows that open to the street. A great spot to just people watch. They offer special pizzas and pasta dishes and good wine. Their olive spread and bread sticks are...\n\n\nMore"], ["Great brunch and people watching....", 4.0, "May 12, 2015", "Bornabrit", "Richmond, Virginia", 745, 427, "Of all the times I have eaten at Paolo's this was the first time for \"Brunch\" almost every other time its been for dinner of lunch ( Chicken pizza is incredible)\nMy husband and I decided to stop by for \"brunch\" He ordered the Caesar salad with chicken and I ordered the egg white frittata, which had spinach and red...\n\n\nMore"], ["Decent Brunch on Wisconsin", 4.0, "May 10, 2015", "Alyssa A", "Washington DC, District of Columbia", 9, 3, "Ate here for brunch one Sunday morning with a couple friends. Set menu for $30 including an appetizer, entree, and bottomless mimosas/bellinis. The french toast was amazing (having a creme brulee custard topping), but a little warm. I've had better french toast up in Van Ness at Furst's bakery. Entree of steak and eggs was very good. Nice presentation and...\n\n\nMore"], ["Not to be missed! And, you will LOVE happy hour!", 5.0, "May 1, 2015", "Lynnesjackson", "Chicago", 98, 57, "The restaurant is lovely and has outside seating and also door/ windows that give the feeling of sitting outside.\nWe arrived before our 7:00 reservation and found out that you can order, at the table, from the happy hour menu\nSo, we had four of the incredible appetizers ( wonderful smoked salmon, cheese and arugula flat bread , two orders...\n\n\nMore"], ["Cute place", 5.0, "April 29, 2015", "francetravel", "harrisburg, PA", 170, 101, "We only stopped for drinks but despite not ordering food, the service was outstanding. I had a very unusual drink called something like Gin citrus ginger collins on the $5 Happy Hour menu. It was gin, mint, ginger, black pepper agave and something else I forget, and had a bit of a bite to it. It looked more like iced...\n\n\nMore"], ["disappointed", 1.0, "April 23, 2015", "Moe T", "West Chester, Pennsylvania", 56, 14, "Decided to give this restaurant a try on a recent visit to Georgetown expecting a good meal we craved for all day. The location was on the main drag pretty much on the main drag.\nThe decor was more of a sports bar than that of an italian dining establishment .\nOur hostess was pleasant to us but turned away...\n\n\nMore"], ["Super Italian Fare", 4.0, "April 19, 2015", "R K", "Woodbridge, Virginia", 200, 64, "Nice bar as you come in while waiting for the rest of your party. Good dinner wine list... and by the glass too. Mussels Arrabiata and Calamari were perfect appetizers (along with the breadsticks)... I had Fettuccine Carbonara and it was excellent. Prices were reasonable and staff friendly and attentive. There is outside seating which looked inviting if it had...\n\n\nMore"], ["Very fairly priced delicious stone hearth pizza!", 4.0, "April 12, 2015", "Jersey D", "Washington DC, District of Columbia", 28, 13, "I thoroughly enjoyed the stone hearth pizza with sausage and meatball. The pizza is filling, fairly priced, and as long as you don't bring anyone with you - you'll have some to heat up for breakfast the next day. Sometimes it's tough to get the most food-bang for your buck here in Wash., DC and of course Georgetown, but Paolo's...\n\n\nMore"], ["Not Italian, not even tasty", 1.0, "April 6, 2015", "216Alexander", "The Hague, The Netherlands", 3, 2, "The restaurant looks alluring enough. Once you have entered the trap you get served the most tasteless and bland food ever, that has nothing to dowhatsoever with fine Italian cooking. There was no Italian in sight."], ["Tourist Trap with Lackluster Food & Poor Service", 2.0, "March 29, 2015", "jcfphf", "Chicago, Illinois", 25, 17, "Dined here after we were unable to get into Filomena's. Waste of money. The meatball appetizer was cold & tasteless, the minestrone soup was worse than Campbell's, the bolognese sauce had pieces of cold meat in it & my child didn't even eat his spaghetti. The calamari appetizer was good, not great. Asked for & never received water, server never...\n\n\nMore"], ["Sat there 15 minutes no service", 1.0, "March 25, 2015", "windycross", "seattle", 16, 19, "sorry, but when 4 Italian men, are talking about how we are dressed, and their servers ignored us, after 15 minutes we got up and walked out. We were in an airbnb on same street and were looking forward to eating here. Went to Martin Tavern 3 times."], ["Consistently Amazing!", 5.0, "March 12, 2015", "Cesscr2003", null, 17, 8, "We've been to Paolo's many times when visiting Washington. We love it! Their marguerita pizza is so yummy! It is what we compare all other marguerita pizzas to but none compare. The Caesar salad is so fresh. We also look forward to the complimentary dip and breadsticks. We will absolutely return, soon I hope!"], ["Go. Eat. Go again.", 5.0, "February 12, 2015", "janicewriting6", "Winston Salem NC", 144, 56, "Ate here after a college visit. Service was exceptional. Menú nice, but not large. Wine list very good. Had minestrone and bruschetta. Wow. Daughter had special with gnocchi. An entree with meat BUT they made it vegetarian for her. Husband had bolognese and it was fabulous. Each of us was asked about allergies. Dessert tiramisu was very good."], ["First time won't be the last", 5.0, "February 4, 2015", "Jane V", "Atlanta, Georgia", 3, 0, "Although I've spent a lot of time in G'Town over the past several years, I hadn't been to Paolo's. We went there on our last visit - at Christmas time. It was fabulous!\nThe food was amazing! The bread was delicious, the calamari was one of the best I've ever been served, and the red sauce on the past was...\n\n\nMore"], ["Nothing exceptional", 3.0, "January 19, 2015", "Yorkiemom19", "Manassas, Virginia", 201, 77, "Have never been to this restaurant although a couple people in our party had been there. The food was okay, service was on the slow side but the server was friendly. The lunch special was $15 which was a good price for the amount of food we got. I had the caprese pizza and it was loaded with cheese and...\n\n\nMore"], ["Truffle Egg Risotto", 5.0, "January 12, 2015", "spotontruth", "New York City, New York", 14, 5, "Stumbled into Paolo's for my first meal in Georgetown, and I consider myself lucky. The food was downright yummy. It was Sunday brunch. They offer a 25 dollar all you can eat small plate option, but I found their small plates to be generous, and my two plate ala carte bill, with a hot tea, came to a total of...\n\n\nMore"], ["Tourist trap", 2.0, "January 2, 2015", "afrhoades", "Washington DC, District of Columbia", 14, 13, "There is a good reason why DC residents don't frequent Georgetown restaurants, save a few exceptions. Paolo's is a case in point. Friendly but not very professional service, and just about average food. When you don't care if patrons make return visits, there is little incentive to keep up standards. There is little excuse for this attitude. Even one-time tourist...\n\n\nMore"], ["New years evev dinner", 4.0, "December 31, 2014", "NanolaMarie", "Hornell, New York", 48, 39, "We were traveling to see family and stopped in Georgetown for the night. We often stop here as it a good stopping point when traveling to see family members. We decided to try Paolo's as we were staying across the bridge in the Key Bridge Marriott and would not have to drive or take a cab. It was a very...\n\n\nMore"], ["Excellent choice", 5.0, "December 19, 2014", "Arievilo", "Porto Alegre", 61, 49, "I was in Washington already for a week and had decided to go to Paolo's but had not decide when. The day I was leaving was the last oportunity. It was Saturday and it could not be a better day. They have an asorted offer of meals: you can have all menu dishes at 25$ in small plates and repeat...\n\n\nMore"], ["Wonderfull service", 5.0, "December 16, 2014", "Alexandra G", "Sarajevo, Bosnia and Herzegovina", 34, 22, "It is a nice place with great, friendly service. Great location. The food is very good and prices reasonable. We will be back for sure on our next visit!"], ["Back again and still as good.", 4.0, "December 15, 2014", "Johngpsysmith", "London, United Kingdom", 121, 51, "I have used this restaurant for some years on visits to Washington. I have always found the staff friendly, courteous and efficient and the food has always been sensibly priced and well cooked. Sometimes there is a little too much of it for English tastes but that's not uncommon in the US. It must be good as keep coming back...\n\n\nMore"], ["Service wonderful, food is wanting", 2.0, "December 6, 2014", "Amierosehill", null, 18, 4, "The Service was wonderful but they seriously need to up their food game. I ordered three dishes because I was starving and non of the three were above average. If your going to order order the simplest thing. Pizza margarita. The staff are all super friendly and nice but it's a shame the food isn't the same standard. I wouldn't...\n\n\nMore"], ["So amazing!", 5.0, "November 4, 2014", "Rachel S", "Greensboro, NC", 43, 28, "We came hoping to go to Martin's across the street. But the staff at Martin's were absolutely evil to us, the food was overpriced, and we were placed in a back room.\nBut then we crossed the street to Paolo's and were treated like old friends. Our table was lovely outside, we felt relaxed and appreciated, and the food was...\n\n\nMore"], ["Good Italian in Georgetown", 3.0, "October 26, 2014", "burakida", "Istanbul, Turkey", 38, 11, "We were in Paolo s yesterday. Food is good. We payed 75 usd for two persons. We had all you can eat menu (small plates) and two beers. food is good. All you can eat concept is also good. Location of the restaurant is in the heart of Georgetown. Overall , I am satisfied with the lunch ."], ["Not worth the money", 3.0, "October 21, 2014", "VrmSjm1018", null, 72, 27, "I was attracted to the restaurant because of the cute outdoor seating area and being a nice day, I wanted to take advantage of it. The staff was friendly and I trusted my order to the waiter, what do you recommend off the lunch menu - the white pizza and house salad. Ok. I also ordered a glass of Pinot,...\n\n\nMore"], ["small plates", 4.0, "October 19, 2014", "James B", "Lovingston", 43, 12, "This restaurant has adopted the small plates format, and the food is quite good. A good spot to bike to for lunch when visiting Georgetown."], ["Italian in Georgetown.", 4.0, "October 5, 2014", "travellersfootprint", "Mumbai (Bombay), India", 44, 19, "Located in the M section of georgetown this Italian place also has good drinks.Staff friendly with good service, would recommend as a good dining option."], ["Bottomless Small Plate Brunch", 4.0, "September 23, 2014", "Dan_Jen10", "Collinsville, Illinois", 30, 8, "-September 2014-\nDined with 5 adults, 1 child. They gave us a large booth in the back, which was perfect for this bottomless brunch. We all shared everything. Our server was fun and helped us navigate the large menu. The bottomless drinks for $10 more was a great touch as well.\nSome of our favorite dishes included:\nTuna Tartar\nCayenne...\n\n\nMore"], ["Yummy", 4.0, "September 17, 2014", "njs1062", "Germantown, Tennessee", 64, 18, "In the heart of Georgetown I found this lovely gem of an Italian Restaurant. Fresh flowers and candle on every table. Beautiful atmosphere spoiled by the extremely loud music and poor acoustics otherwise this could be a very romantic dinner spot. The server was attentive and friendly. The chef hand delivered my entree with a big bright smile. I love...\n\n\nMore"], ["Hoped it was better", 3.0, "September 10, 2014", "Barnetjb123", null, 119, 41, "After a long walk on the main street in lively Georgetown, we were happy to find Paolo's. The atmosphere was interesting, loud, lively, eclectic, etc. The server was attentive recommending appetizers but forgetting a few items. The food was excellent and came quickly, but overshadowed by the really, unpleasant bathrooms, ugh."], ["Bellissimo!", 5.0, "September 9, 2014", "recallruch", "Pune, India", 5, 2, "We chanced upon this restaurant while walking towards the Waterfront on Wisconsin Ave and decided to give it a try because it looked like a fairly popular place.\nWe were seated in the outdoor area, where we were given the menu promptly and served with some bread sticks and dip.\nWe ordered the Special for the evening - which was...\n\n\nMore"], ["Very Good Italian", 4.0, "September 3, 2014", "FoodieAB", null, 77, 18, "Came upon this place while in DC for a conference and decided to go in because the menu looked ok and they had outdoor seating. Service was very good and food was very good. Three of us shared the Merquez flatbread and the mozzarella caprese, both things common to many restaurants and Paulo's did a very nice job with them....\n\n\nMore"], ["OMG!", 5.0, "September 2, 2014", "Leonard2013", "Houston, Texas", 55, 19, "We stumbled upon this place and we loved it! We stumbled in door right at happy hour (my favorite)!!! The food, atmosphere and service was great! They had a great happy hour selection! We did not even have to order entree because happy hour food was so good we just ordered several items and shared! Drinks were great! Would highly...\n\n\nMore"], ["Awful food, terrible service!", 1.0, "September 1, 2014", "PamperedBackpacker", "Los Angeles", 25, 25, "Went recently during our vacation in the Nation's Capital. We were in the area and this restaurant seemed like a good idea. The hostess was nice and friendly. The waitress, Bella, seemed nice and friendly but told us that she was very tired. We asked her to recommend something and she told us the chicken was the most popular item...\n\n\nMore"], ["Good lunch", 4.0, "August 13, 2014", "Charlie M", "Knoxville, Tennessee", 21, 5, "We had a very good lunch at Paolo's in Georgetown. The service was excellent and the salad greens were very fresh. Portions were generous."], ["20+ Year later", 5.0, "August 12, 2014", "Gary O", "Creve Coeur, Missouri", 12, 9, "It has taken us twenty plus years to return...The menu, food and service has not changed...great as ever. Brought back many great memories. We shall return sooner."], ["Order Chicken Milanese", 5.0, "August 4, 2014", "kkclardy", "Greenville, South Carolina", 168, 58, "My son and I stopped in for dinner and it was delightful. The Service was great and the Chicken Milanese was so good! I highly recommend ordering it!!"], ["It was good to be out of the rain...", 4.0, "July 31, 2014", "DonLynski", "Winnipeg", 110, 42, "The restaurant is very noisey, so noisy in fact the server thought I said \"seafood salad\" when I had said \"Caesar salad\" didn't get what I wanted and did not want to send it back, my husband and I switched lunches. We were okay with it, and it was delicious, but will double check next time with my server whenever...\n\n\nMore"], ["Great food and good service", 4.0, "July 30, 2014", "Nate D", null, 8, 2, "We had dinner out without the kids and it was amazing. Flatbread. Dinner. Fantastic. Dessert was almost as good."], ["Average - with a twist", 3.0, "July 29, 2014", "kimjdenny", null, 25, 8, "Location - good - near shops but off main drag.\nPrice - high\nFood - average\nService - average to slow\nWine glass $16 for 10oz of Sauvignon blanc was dirty. Had to go get new one at bar.\nThe twist - we sat at a table for 2 - at the open door - so we were inside -...\n\n\nMore"], ["small servings", 4.0, "July 20, 2014", "MamaG3", "Munster, Indiana", 257, 81, "Six of us enjoyed the meal, but even the youngest of the group could have had more pasta, which looked like an appetizer portion for that price. The food was delicious."], ["Great Italian restaurant in Georgetown", 5.0, "July 8, 2014", "AndrewJ4673", "Washington DC, District of Columbia", 2, 1, "My friend and I found Paolo's while out on a stroll from our hotel. We glanced at the menu and decided to give it a try. We were not disappointed. I enjoyed the veal scallopini and my friend had a fish entrée that was very nice. The pino grigio was lovely. Our server Christian was very attentive and recommended some...\n\n\nMore"], ["Took a chance and were rewarded", 4.0, "June 29, 2014", "CandCTn", "TN", 70, 22, "Flipped a coin between here and Martin's Tavern and we did good. Mussels were fabulous as was the Shrimp Risotto, with scallops added. More than enough to share. Server was outstanding and the cost was not out of line for what we had. Would we go back? So many choices in Georgetown and DC so probably not for us, but...\n\n\nMore"], ["Completely rude and overpriced", 1.0, "June 26, 2014", "Kelly V", null, 1, 1, "My boyfriend and I stopped at Paolo's this afternoon because I wasn't feeling well and we needed to find somewhere to grab some food and water. We were seated immediately, but the moment our server arrived he was completely cold, rude, and unhelpful. He did not ask what we wanted to drink but rather literally and loudly threw bread plates...\n\n\nMore"], ["Good Value and Great Service", 5.0, "June 24, 2014", "Chris S", "Fairview Park, Ohio", 16, 12, "My husband and I recently were in Georgetown. It was a beautiful day and it was quite crowded. There were many restaurants to choose from, but we were told that Paolo's would be a good choice. We were seated on the side patio and it was quaint. Our server, Josh, was quite good and helped us to select two fabulous...\n\n\nMore"], ["Surprisingly small pasta portions", 2.0, "June 14, 2014", "SwissTraveler1977", "Cincinnati, Ohio", 58, 47, "My wife and I went in for a quick Saturday lunch and both had pasta dishes. While the quality was 3-4 out of 5 the portions were ridiculously small (and we are not big eaters i.e. the Cheese Cake Factory is not our standard) especially for the price charged. Wine was also way over priced. Location and overall quality is...\n\n\nMore"], ["Loved It", 5.0, "June 3, 2014", "Daniel M", "Washington DC, District of Columbia", 28, 10, "Food was good and service great. My wife and I shared a pizza on a wonderful late afternoon. will definitely go back!!"], ["excellent seafood", 5.0, "May 28, 2014", "Alexander B", "Washington", 13, 0, "Their seafood dishes are excellent. I've had several over the past few years. They also make very good pizza with very thin crusts and good choices of toppings."], ["Poor quality food at a high price", 2.0, "May 11, 2014", "Stefan I I", "Vienna, Austria", 15, 4, "Everything we tried from salads to pasta and calamari was very low quality. The only thing that was high were the prices."], ["Cozy and Good", 4.0, "May 11, 2014", "MariuPR", null, 3, 0, "I was in D.C. on business last November and walked around Georgetown with friends to find this cozy and charming restaurant. The service was good and the food delicious. I really enjoyed having dinner with beautiful Georgetown at night as the view. We ordered different dishes and they were all delicious. The pizza was incredible!\nI would definitely go back...\n\n\nMore"], ["Average", 3.0, "April 30, 2014", "Robert M", "Boston, Massachusetts", 42, 23, "Ok quality food, ok service, goodish location within Georgetown.\nwe found it funny that when we asked for something as Italian as Oil with spices to dress our pizza, the waiter, who did not seem junior at all, did not know what we meant.\nFood came quick, which was nice."], ["Salmon was excellent", 3.0, "April 29, 2014", "Karen F", "Naperville, Illinois", 55, 23, "My husband had the salmon and was absolutely\ndelighted with it. On the other hand, I had the shrimp risotto and was disappointed. It was OK. I'm from the Midwest and do prefer my shrimp slightly cooked. These were not. However, my biggest complaint is that in today's world, a restaurant should have a gluten free selection noted on the...\n\n\nMore"], ["Charming & Welcoming", 5.0, "April 23, 2014", "mcole29", "Baltimore, Maryland", 2, 1, "My boyfriend and I took a weekend trip to DC recently, part of which included a Metro Food Tour of Georgetown. Paolo's was actually the first of the four restaurants that we stopped at with our group, and I really couldn't have liked it more! They were very acommodating of our large group (about 10 people, all couples.) Our entree...\n\n\nMore"], ["Little plates; big taste", 5.0, "April 22, 2014", "JWP8", "San Francisco, California", 93, 51, "Arrived starved after a red eye; had brussel sprouts and polenta side dishes. They were huge and extremely good. My host had a more complicated pasta dish which he devoured. The food, ambiance, service -- all exemplary. I'll come back."], ["A Super Find - Great Atmosphere", 4.0, "April 22, 2014", "Deborah A", "Houston, Texas", 3, 0, "What a great way to spend the afternoon, eating a super meal and drinking some fantastic Cherry Blossom Drinks! Paolo's is on the Georgetown Food Tour and it was absolutely fantastic. The wait staff was very attentive and the special drink to celebrate the Cherry Blossom Festival brought us back later that afternoon to try another. It appears that this...\n\n\nMore"], ["Horrible service, OK food", 2.0, "April 15, 2014", "memtxrn", "houston, tx", 10, 6, "We went to Paolo's last Saturday night with a group of 4 people. We had made reservations and were promptly escorted to a cozy booth. We waited a good 20-30mins before asking someone if we actually had a waitress. The tables around us were sat after us and began to get appetizers before we even got water!!! Finally we get...\n\n\nMore"], ["just as great as it always was..YUM", 4.0, "March 27, 2014", "Bornabrit", "Richmond, Virginia", 745, 427, "I don't think I have ever been to DC without going to Paolo's.Its been well over 20 years! Its a great place to \"people watch\" the crowd while a little noisy ( at times) is fun, energetic and a combination of everybody from everywhere.\nThe salads are great and fresh. The chicken pizza is my all-time favorite though with chicken,...\n\n\nMore"], ["A great family restaurant", 4.0, "January 30, 2014", "MLE91", "San Francisco, California", 98, 66, "I have been to Paolo's many times and it never disappoints. The food is great, the drinks are great and the atmosphere is always rowdy and fun. I highly recommend the penne a la vodka and the pizzas. Sometimes the service can be a bit spotty, but usually it is great. The bread they serve is so fantastic as well....\n\n\nMore"], ["Pricey for what you get", 2.0, "January 19, 2014", "Scott S", "Morrisville, North Carolina", 74, 25, "We ordered pizza margherita, meatballs, truffle pasta, and grilled salmon. We felt the pasta and salmon were small portions and pricey, $18 and $22 respectively. We got bigger portions for a lower price down the street. The salmon was tasty. However, the pasta was too saucy. Even though they only gave you three meatballs for an appetizer, they were tasty....\n\n\nMore"], ["Still as good as I remember", 4.0, "January 1, 2014", "bondoobay", "San Carlos, CA", 121, 40, "After twenty years, I did not know what to expect when eating at Paolo's, but it was just as good as I remember. The waiter was friendly and helpful, and the food very good. They were very accommodating to my husband, who is a vegetarian."], ["still as good", 4.0, "December 19, 2013", "rufkdlk_10", "Washington DC, District of Columbia", 50, 13, "as when Gary Hart met Donna Rice here in the 80s, they still have the same breadsticks with eggplant dip, same oven fired pizzas, more healthy salads than anyone eats and no desserts so far as i can tell. They do have a new addition that every restaurant should have, \"Kate,\" someone who makes sure diners are happy and the...\n\n\nMore"], ["Good Italian when in Georgetown", 4.0, "November 10, 2013", "MTorre", "Mexico City, Mexico", 497, 183, "Nice place with good appetizers and average pasta. Try the burrata, best in the menu, with a variety of tomatoes and flat bread. Meat balls and fried calamari are also very good. The pasta and salads are average, better to stay with the first course."], ["Great find", 5.0, "October 31, 2013", "CatherineF2012", "Manchester, United Kingdom", 45, 43, "Ate here a couple of days ago at lunchtime. Super Italian food. We sat outside and had a wonderfully relaxing meal. Service was attentive without being pushy. Would definitely recommend."], ["the best steak salad", 5.0, "October 25, 2013", "John G", "Sarasota, Florida", 3, 0, "i always come here with friends for the expresso rubbed steak salad, it is one of a kind. the fingerling potatoes are awesome. i've also had their pizza which is really good. the atmosphere is really cool too, you feel like you're in italy and its in a good spot in the heart of georgetown."], ["Disappointed and very upset--beware if you're a vegetarian", 1.0, "October 18, 2013", "CGriffiths", "Rockville, MD", 39, 42, "We just came back from Paolo's from having dinner with a group of friends. The variety of pastas on the menu was very limited and since both my husband and I are vegetarian, I mentioned this to the two waiters taking our orders. I asked if I could have the cheese tortelini with a different sauce that wasn't tomato and...\n\n\nMore"], ["Paolos is still excellent", 5.0, "October 17, 2013", "auntj", "arlington, VA", 10, 46, "Glad to see that the food is still excellent. A perfect respite from poking around Georgetown. This trip: the eggplant appetizer was unbelieveablly tasty: lightly breaded, crisp but inside eggplant moist -- all on a bed of marinara and chopped tomatoes. Delicious, and with a salad more than enough for a meal (though their pasta and pizza entrees are also...\n\n\nMore"], ["Pleasant evening", 4.0, "September 10, 2013", "Stuart L", null, 16, 3, "Stunning food, expensive wines! Good service, pleasant venue on an autumn evening. Seemed well supported by locals"], ["Good food not excellent", 3.0, "September 10, 2013", "aandj7", "Maidenhead, United Kingdom", 94, 42, "The food choice and quality were good and service was acceptable. Nothing bad but nothing outstanding"], ["Best Seafood Salad Around!", 4.0, "September 4, 2013", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "Try Paolo's on a nice fall evening and eat outside. It is such a pleasant experience. We love to order the seafood salad for a nice light meal. The service is always very good as well. It has a nice relaxing atmosphere after a long day. I don't however like tables by the bar area. If you want to sit...\n\n\nMore"], ["First dined here in 1984", 3.0, "September 4, 2013", "M K", "Bellevue, Washington", 58, 14, "We stumbled upon Paolos back in 1984 while on our honeymoon. Periodically we have returned to DC and have always eaten there at least once per trip and often twice. This time, I am sad to say that we feel like the place is losing its edge and sliding by on reputation and popularity. We still had a good meal...\n\n\nMore"], ["Saturday Afternoon Delight", 4.0, "August 12, 2013", "lmalek4", "Rochester, New York", 14, 11, "We biked to Georgetown from Arlington VA while on vacation experiencing some of the sights of the area. In Georgetown we searched for a place to eat, drink and rest. Paolo's seems to be the ideal place to quench our thirst and appetite. Upon entering we were immediately seated and at our request seated in the perfect spot of our...\n\n\nMore"], ["Trendy Italian in Georgetown", 4.0, "August 8, 2013", "pmr2", "Washington DC, District of Columbia", 145, 51, "I went with a group and wasn't exactly in the mood for Italian so maybe that colored my opinion. Excellent spinach salad, somewhat overpriced Virginia strip steak, delicious desserts, all nicely presented. The 1/2 priced wine on Wednesdays was a plus because the place seemed a tad pricey for this retiree. No problem splitting my salad with a friend--they brought...\n\n\nMore"], ["Scrumptious!", 4.0, "August 5, 2013", "Jen T", "winnipeg", 22, 8, "Food was absolutely delectable! I had the french toast, my husband had salad and bruschetta. Both were incredible! The French toast came with custard and a fruit spread. It was very rich. The service was good. Very fast (maybe too fast). We couldn't believe how quick our food came out. We were in and out. Service was very nice. Loved...\n\n\nMore"], ["My second time at Paolo's: The Burrata salad is heavenly!", 5.0, "August 2, 2013", "aphoenician", "Denver", 111, 51, "Super efficient staff, great and generous portions, fresh produce, what's not to like! I have tried (through personal orders or through \"assisting\" friends with lesser appetite) the pizzas, pastas, calamare, seafood salad, burrata salad, Paolo salad, cold cuts appetizer ... All outstanding! Would go back in a heart beat during my next trip to Georgetown."], ["Great place!!", 5.0, "July 21, 2013", "Zan11", "Niagara Falls, Canada", 53, 22, "Paulo's was great, my pizza was nice and tasty and the service was quick and personal. My glass of coke was never empty before it was refilled! The atmosphere was great, we sat in a quiet little corner which was nice. Definately will come back if I am in the area"], ["traditional place to eat", 3.0, "July 15, 2013", "Matthias L", "Germany", 68, 25, "nice food, nice tables at the outside, rather importunate service, intransparent billing system. Easy to reach with Circular bus just for 1 $."], ["Respectful Italian-style food in Georgetown", 3.0, "July 5, 2013", "FrancescoLoi", null, 12, 9, "Fresh baked grissini and tapenade are offered by the house.. very good!\nThe pizza margherita was surprisingly good. (served on a wooden plate)\nThe Burrata is a very good lunch choice (it comes with a generous slice of Pesto Pizza)."], ["Brined and definitely not al dente", 2.0, "June 26, 2013", "Pinkwasabi42", "Roswell, Georgia, United States", 33, 9, "If its one thing an asian can't stand, its uncooked rice. There's a huge difference between al dente and rocks. I ordered chicken arrabiata, and the chicken was brined wayyyyy too long. Talk about salty... The \"smashed\" chickpeas were not smashed and the basmati rice was not even close to being cooked. I sent the dish back, but when it...\n\n\nMore"], ["Delicious but pricey lunch", 4.0, "June 20, 2013", "KK80439", null, 70, 29, "A friend and I were window-shopping in Georgetown, looking for a place to eat lunch. Paolo's looked inviting, so we stopped in. We sat at a window table in the bar area so we could watch the passers-by. Very large bar and large restaurant as well. The outdoor seating area in the back looked very nice. We both had risotto;...\n\n\nMore"], ["decent food in a noisy well located restaurant", 3.0, "June 17, 2013", "ronald s", "New York City, New York", 46, 13, "Paolo's serves decent but not memorable food in a noisy atmosphere in the heart of Georgetown.\nThe service was good but the food is not inspiring. The good news is that the price is decent too, not nearly as expensive as many of its neighbors"], ["Great happy hour food specials!", 4.0, "June 2, 2013", "Trojan96", "Santo Domingo, Dominican Republic", 24, 24, "If you're in Georgetown before 7 pm on a weeknight, I highly recommend Paolo's for an inexpensive dinner in a lively setting. My husband and I ordered the pesto pizza, asparagus fritti and shrimp scampi (each $6 or less) and filled up nicely. Bonus - the food was really good, especially the pizza. There are at least 8 appetizers on...\n\n\nMore"], ["Pizza & People Watching", 5.0, "May 29, 2013", "Jack1941", "King of Prussia", 41, 24, "Walking up Wisconsin Ave. on a Saturday afternoon, we noticed this attractive corner restaurant, spotted a table in the shade of its patio, and popped in for a leisurely lunch. The thin crust margherita pizza ($16) was big enough for two; the Caesar salad ($10), particularly after we doused it with extra dressing, was delicious. Several beers on tap and...\n\n\nMore"], ["Middling", 3.0, "May 21, 2013", "TwoSheds57", "Melbourne, Australia", 301, 138, "Fairly standard Italian fare. My companions had a gourmet pizza. I had a grilled chicken salad. The pizza was somewhat unsatisfactory and was left unfinished. My salad was small and especially light on chicken. That said it was quite tasty and had some nice finely chopped ingredients. The service was variable throughout particularly as our waiter exuded hostility probably because...\n\n\nMore"], ["The waiter above all", 5.0, "May 16, 2013", "Johnny G", "Dayton, Ohio", 18, 15, "While walking through Georgetown with my partner we eventually wanted to find a perfect little lunch place and tripped upon this jewel. It looked like a wonderful place replete with al fresco dining. The menu was vast and hard to choose with what appeared to be a luxurious Italian selection. An eggplant and green olive tapenade with fresh seeded breadsticks...\n\n\nMore"], ["Average at best", 3.0, "May 8, 2013", "Londonwalker2009", "Southern New Jersey", 23, 15, "Don't order the steak salad, you will be dissapointed. Gorgonzola cheese in the salad? Okay, well technically, a slight teaspoon of Gorgonzola would qualify as \"in the salad\" The steak part is not cooked to order, as one is led to believe,and it's more of mystery steak than really good beef prepared, spiced and sliced then folded into the greens....\n\n\nMore"], ["Gone downhill", 2.0, "May 3, 2013", "dcoalr", "Atlanta, Georgia", 90, 42, "What a bummer! Used to be a nice choice for Italian, but the service this time was terrible, and the food was boring. My steak salad, which was ordered medium, came with raw cold steak. Don't bother. G'town is losing the food and pub market bigtime."], ["Swift service and delicious food!", 4.0, "April 29, 2013", "GAMIS", "Cumming, Georgia", 78, 20, "When our party of 6 arrived at 8PM on a busy beautiful Saturday evening, we were told that it would be about a 30 minute wait.\nSince it had been a long day of sightseeing with 4 high school students who were all famished, we decided to split our group up, 2 at one end of the bar and the...\n\n\nMore"], ["Great Place", 5.0, "April 27, 2013", "GQGQ", "London", 50, 30, "Lively atmosphere, nice opening of doors to create that al fresco feel and one of the best pizzas I've ever eaten"], ["great lunch with my daughter-in-law", 4.0, "April 24, 2013", "libbie5", "omaha, ne", 243, 73, "What a fun-cute restaurant--many happy lunch people--we shared a pizza -and it was more than enough to satisfy both of us--loved the bread they brought out--warm-fresh & really good. The vibe was ecletic--"], ["Absolutely delicious! Hit the spot!", 5.0, "April 22, 2013", "Mayalou", null, 2, 3, "This is one of the best restaurants I've been to. We were looking for some good pizza and happen to stumble upon Paolo's. My group and I ordered the Sicilian pizza, steakhouse pizza (special on menu) and the tortellini rose pasta dish (waiter said this had been on the menu for 25 years). All dishes were phenomenal! Delicious mixture of...\n\n\nMore"], ["Fun spot in Georgetown on Wisconsin Avenue......", 4.0, "April 19, 2013", "Cooper1941", "Oregon", 95, 43, "Enjoyed lunch here after visiting the National Catheral, Sunday, April 7, 2013. Four of us had different lunches and all were very good. Shared Calamari it was the second best of our tries in DC - only problem with theirs was the sauce was too spicy! Wait staff was attentive and fun and we certainly enjoyed ourselves. Would go again...\n\n\nMore"], ["great palce to meet friends and relax", 5.0, "April 8, 2013", "theislanddog", "Pittsford, New York", 213, 68, "drink specials, great table staff. the place gets crowded, but we really didn't wait long for anything. awesome appetizers specials, really reasonable. variety of beers and whatever you drink. they do full dinners too. very nice. have been here a number of times. great shopping and many restaurants and bars nearby. great area. you could spend a lot if you...\n\n\nMore"], ["Interesting, delicious food at moderate prices", 5.0, "April 7, 2013", "McGillMomAlbany", "Coupeville, Washington", 97, 49, "Our waiter went through the menu, explaining the most popular dishes as well as his favorites. I decided on the eggplant appetizer, which was a lot of food. It was fantastic. Slices of sauteed eggplant with a tomato coulis and fresh mozzarella. I also had the watermelon salad at his recommendation which was tiny cubes of watermelon with cherry tomatoes...\n\n\nMore"], ["Wonderful (late) brunch", 5.0, "March 25, 2013", "CTnutmeggers", "Alexandria, Virginia", 51, 14, "After stopping in a nearby shop where a staffer recommended Paolo's, we (an out of town friend and myself) walked over on beautiful sunny day to enjoy a very late (3:30pm) brunch. What a great find. On a busy early evening we were seated quickly in a nice booth that allowed us to survey the restaurant and the busy foot...\n\n\nMore"], ["Yummiest Food", 5.0, "March 25, 2013", "aiiikkiiid", "Dallas, Texas", 4, 1, "My gosh their food is AMAZING. We had, steack and eggs, steak salad and their tapenade as a side order. My mouth is watering as I am writting this! Just EXCELLENT!"], ["Cozy place with good food and good service.", 5.0, "March 4, 2013", "GailCrockett", "Reston", 224, 59, "Met with 6 other gals for a BD celebration. The food was excellent and our server was fantastic. She kept it all straight and reminded us that she overheard that it was someone's BD and offered suggestions. She was great at her job!!!!! Also the restaurant has locally changing artists exhibiting which makes it more interesting. Only negative is the...\n\n\nMore"], ["Mediocre food, but great service", 3.0, "January 25, 2013", "swtnpetite", "Atlanta, Georgia", 43, 14, "Some friends and I were in Washington, DC for the inauguration weekend and wanted a nice meal away from the crowds. The place had a handful of patrons for such a busy day. The bar looked enticing, but we decided to just enjoy the meal. The drinks were awesome, but did not make up for the mediocrity of the food....\n\n\nMore"], ["Good fun, nice bar", 4.0, "January 24, 2013", "misskelly1010", "Pennsylvania", 21, 5, "stopped by in the afternoon. Drinks were good and the food was pretty good too. Ordered a pizza - HUGE! Crispy Eggplant appetizer was pretty delish as well!"], ["AVERAGE", 3.0, "January 18, 2013", "pot2x", null, 111, 52, "it was okay nothing great. I think there are better restaurants around the area. food was okay a little lacking in taste. For the food that you get i think its a little over priced."], ["Not upto expectations", 3.0, "January 17, 2013", "yvschua", null, 9, 1, "The food was okay, presentation was okay generally an average restaurant. A little over priced for the food they serve you. The lamb, ceasar salad and atlantic salmon could have been tastier. The seafood salad wasnt bad. Over all the food could have been better."], ["Not impressed", 3.0, "January 3, 2013", "Magbox", "Naugatuck, Connecticut", 132, 68, "Came here NYE with friends who knew the area and was very disappointed. While the neighborhood and service was great, the food is overpriced and average at best. The portions are insanely small and not what you would expect."], ["Fantastic meal", 5.0, "December 26, 2012", "glacierapm", "Alexandria, Virginia", 41, 12, "We happened to be passing through Georgetown on the way to the National Cathedral for Christmas Eve service. The BF found Paolo's online and we decided to give it a try. The food was FANTASTIC! The service was OUTSTANDING. Our server was the most friendly and helpful man I've met in a very long time. It was a bit spendy...\n\n\nMore"], ["Dissapointing experience in a nice neighborhood", 3.0, "December 14, 2012", "Marina C", "Hamburg, Germany", 64, 16, "The quality of the food is not bad, but just average .Way too expensive for what you get!\nA disapointing experience while being in a nice place."], ["Appetizers", 4.0, "December 7, 2012", "Frank-Staunton-VA", "Staunton, Virginia", 90, 45, "Four of us stopped in for a drink and the prosciutto-wrapped mozzarella appetizer. It was mucho delicioso!"], ["Late lunch", 4.0, "November 8, 2012", "Cate019", "Edinburgh. Scotland", 105, 132, "Stopped here for a late lunch. It was very busy so we we were seated and served quickly\nOnly complaint - I like it's cheeky to put bread stick on the table and then charge for them - $5\nWe didn't ask for them but of course you always nibble on them!\nHad a nice goats cheese pizza\nService was...\n\n\nMore"], ["Not a fan", 2.0, "October 26, 2012", "John M", "Kansas City, Missouri", 27, 23, "Went here with my son who is at Georgetown. He loves the place. I found the food average at best and the service was nothing special."], ["Great food, friendly environment", 4.0, "October 10, 2012", "kinzan", "Kuala Lumpur", 34, 21, "I find the food pretty good and the service excellent. I had the risotto and absolutely loved it. If you check in to foursquare, you can get a good discount!"], ["Ceasar salad", 5.0, "October 3, 2012", "MarianaFM5", "Puebla, Puebla", 27, 27, "The best ceasar salad EVER!!! Great place for dinning! It has a bar on one side but the other part of the restaurant is very intimate, I had dinner there and it was very romantic."], ["Great and bad", 3.0, "August 16, 2012", "Sarah D", "Hobart, Australia", 13, 25, "Went there with our two year old in tow which is never easy. First night was amazing service and really excellent food, so memorable we were last and decide to go back the next night for more. This was totally different. Service was average and obviously a different chef on. Staff took the feedback very well. Would go again just...\n\n\nMore"], ["Great brunch!!", 4.0, "July 31, 2012", "Literarytravels", null, 44, 46, "Nice cool place to have brunch on a hot Saturday. Had eggs Benedict and it was lovely. Also accommodated my diet restrictions (Celiac) with no problem. It is casual and as an added bonus we ordered before 1:00 and got early bird prices (8.00). Also offer $3 mimosa, bloody Mary, and Bellini. Overall great experience. I only gave a 4...\n\n\nMore"], ["Excellent Salad", 5.0, "July 23, 2012", "Preston F", "Jupiter, Florida", 16, 1, "This restaurant was very crowded on Saturday evening; however, the hostess was able to find a table for four. The food was very good and varied. The cayenne and espresso steak salad was awesome."], ["Always a very good restaurant.", 5.0, "July 12, 2012", "stevelaw4269", "Saint Paul, Minnesota", 3, 1, "Minestrone. Do it! Menu says made to order and it's perfect."], ["Great place to stop and relax", 4.0, "July 11, 2012", "NRPNewJersey", "Fort Myers, Florida", 156, 98, "Stopped in for a little lunch with a friend as we shopped our way down Wisconson Ave. The sevice was prompt and our waiter brought a delicious concoction of homemade hummus and warm breadsticks. The kitchen was awfully slow, especially since there were few diners, but when it arrived the food was delicious. Crispy eggplant has paper thin slices sandwiching...\n\n\nMore"], ["Order the scallops", 5.0, "July 10, 2012", "aspine67", "United States", 58, 43, "My colleague suggested this restaurant, which had been recommended by a cousin. The scallops are delicious - that was a standout for me. Tiramisu was not good;I make better ones at home. Good service staff. Grat place for people watching. Overall a pleasant meal.I don't remember the rest of the meal so much."], ["quite good", 3.0, "July 5, 2012", "PaiMeiLi", "Washington DC, District of Columbia", 54, 17, "Price is not bad, not the best but they have good calamari. Nice outdoor seating on a good weather."], ["Paolo's", 4.0, "July 5, 2012", "docjose", "Evans, GA", 11, 6, "Very good food. I was worried when the 3 pizzas and one pasta dish for our table were delivered less than 5 minutes after we ordered, yet all was fresh, hot and delicious. Will go back."], ["Yikes", 1.0, "June 15, 2012", "onthefly49", "OR", 2, 3, "Concierge suggested this spot and it is hard to grasp why. Calamari was good , but everything else was mediocre.\nThe noise level was unbearable between busboys crashing plates into bins and loud texans behind us.\nVery disappointing."], ["I love this place", 4.0, "June 15, 2012", "Sgjenn", "Phoenix, Arizona", 12, 7, "I was in DC on business twice in the last 2 months. I made it a point to go to Paolos twice during my last visit. I love the Lemon Breeze cocktail and the free range chicken. I have never had chicken so perfectly golden brown and tasty. The gnocchi was so great, my friend ordered an extra side. During...\n\n\nMore"], ["Lovely experience", 5.0, "May 29, 2012", "Cindi51058", "Alexandria, Virginia", 43, 12, "My husband and I had dinner at Paolo's this past weekend. We sat outside on the quaint patio and enjoyed incredible service and excellent food and drink. We enjoyed the fresh bread sticks with our wine and then ordered pizza. I was surprised how quickly they arrived. Both mine and my husband's were perfect...crispy with melty cheese and fresh toppings....\n\n\nMore"], ["Solid food, Fun atmosphere, Friendly staff", 4.0, "May 27, 2012", "nange25", "New York City, New York", 43, 16, "Good solid food, not high end Italian, that is consistent from visit to visit. Fun atmosphere with friendly, attentive staff. Caters to a mixed crowd so the over-20's don't feel out of place. Pastas and meat dishes are good, and the fried calamari appetizer is great. Ate here 3 years ago during Passover and they had Passover-friendly dishes and matzoh...\n\n\nMore"], ["Excellent italian restaurant in Georgetown!", 4.0, "May 13, 2012", "aphoenician", "Denver", 111, 51, "Especially try the Burrata: It is an Italian cheese made of a fresh Mozarela stuffed with fresh Ricota and served on a plate drizzled with oil and basil: I am salivating just remembering the taste of this sinful dish!"], ["Great outdoor patio, great drinks", 4.0, "April 21, 2012", "Recent_TravelerCinci", "Cincinnati", 50, 97, "A friend and I spotted paolo's on a beautiful afternoon while shopping in Georgetown. It was just what two shoppers were looking for. We ate outside and I had the most amazing frozen Bellini! Our food was very good - I tried a watermelon salad that was refreshing and light. I would recommend this spot for sure."], ["Paolo's Ristorante of Georgetown", 3.0, "April 13, 2012", "GardeningMom42", "Philadelphia, PA", 68, 16, "My husband and I went to Paolo's in Georgetown during a recent business trip. We had fond memories of Georgetown and wanted a nice dinner out there. What we hadn't anticipated was the cockroach that crawled up the wall behind my husband. The food was just ok and the parking and traffic were a nightmare. Not exactly how I remembered...\n\n\nMore"], ["charming", 3.0, "April 11, 2012", "jccminden", "Minden, LA", 22, 16, "charming corner restaurant in Georgetown.\nThe food is just above average and the service is solid.\nI'll go back.... good value"], ["Great way to finish our day", 4.0, "April 10, 2012", "Joyce F", "Eastern Shore Va", 39, 19, "We spent time visiting a sick friend and wandered down to Georgetown for a bite to eat. Came across Paolo's and we delighted with our choice. The windows were open giving us a bit of that warm spring air. Food was very good, wait staff attentive without being intrusive. We ordered two different pasta dishes and one veal dish. Only...\n\n\nMore"], ["Great location, great service, great location, fantastic experience.", 5.0, "April 2, 2012", "helenwattie", "Reading, United Kingdom", 92, 33, "We popped in for a very late lunch around 4.30pm and they didn't blink an eyelid about it. In fact, the place was humming! We were shown to a lovely, sunny table outside in the spring sunshine. The Waitress recommended a couple of Chardonnays based on my request, and promptly provided some tastings before I ordered. She then recommended dishes...\n\n\nMore"], ["Careful with the hostess!", 3.0, "March 31, 2012", "linda L", "San Antonio, Texas", 3, 0, "We went for Friday dinner and the place was relatively busy. We were second in line to get seated. The hostess sat 5 parties ranging from 2-5 guests before finally sitting our party of two and that was after reminding them! Once seated the server was friendly and attentive, the food good."], ["Fabulous restaurant in charming Georgetown", 4.0, "March 23, 2012", "TeeniKS", "Boston, Massachusetts", 12, 6, "Went for dinner to Paolo's on the recommendation of the concierge at the Marriot at Metro Center. Lovely place with outdoor seating option also. We were seated promptly & after some suggestions regarding the menu with the hostess, we ordered a scampi shrimp pasta in Saffron cream sauce, porcini mushroom risotto, caramelized cauliflower as a side & a margherita pizza....\n\n\nMore"], ["Rude Service", 1.0, "March 5, 2012", "cindym57", "Philadelphia, Pennsylvania", 62, 22, "We were going to have dinner at the bar on Friday night. The bar wasn't very busy. The bartender -Karina- was more interested in flirting with the 2 guys at the bar, rather than waiting on us. We ordered a drink and she charged us $17. for a Dewer's. Outrageous!! we asked for menu's and she never checked back with...\n\n\nMore"], ["Excellant Georgetown restaurant", 5.0, "March 5, 2012", "Cranium", "West Chester, Pa", 99, 44, "Good location right on the corner of Wisconsin and N streets. Bustling Georgetown outside and a warm delicious meal inside. Perfect for people watching and eating"], ["A must every summer", 5.0, "February 22, 2012", "Traya", "Bethesda, Maryland", 40, 11, "Known this restaurant since college times x10 yrs ago. Have a great dinner everytime. Cheap. Not alot of choices on menu; simple dishes. But i like that. Love the pizza's and all sea food they have. Best part is seating outside; in the summer they open the doors to the street so inside tables have a nice street view. Whenever...\n\n\nMore"], ["Really Outstanding Sunday Brunch", 5.0, "January 30, 2012", "dennisfr", "Chicago, Illinois", 108, 89, "The four of us agreed this was a terrific brunch. They were offering $3 Bellinis and Bloody Mary's and $8 for meals that are normally priced around $12. Two of us had eggs and hash, which was made with short rib meat and was a stand-out. One had a scramble of some sort, which she thought was excellent. I had...\n\n\nMore"], ["Quite a Great Dining Experience", 5.0, "January 26, 2012", "Mitch B", "Raleigh", 28, 6, "We happened upon Paolo's during D.C. Restaurant Week. So my partner and I enjoyed a three course meal for just $25 per person. I had the greatest, most tender, and flavorful duck confit with a side of lentils. For dessert, the panetonne bread pudding; I'm still having wild dreams about that stuff. Definitely check this place out if looking for...\n\n\nMore"], ["Delicious spaghetti pomodoro, excellent service, delightful welcome.", 5.0, "January 8, 2012", "apronstrings", "virginia", 11, 14, "I went to Paolo's with my husband and daughter for a late lunch on Saturday 1/7. We were greeted at the door by David, a most delightful and pleasant man who made us feel welcome. Our waitress was nice, efficient and non-hovering. I had the spaghetti pomodoro, which is what I have ordered the past three times I've been there,...\n\n\nMore"], ["Why bother; so many other better choices in the neighborhood.", 2.0, "December 31, 2011", "noneemac", "Los Angeles, California", 24, 5, "The good: nice patio from which to take in the street scene; lots of space between tables inside.\nThe bad: weak drinks, hapless service, uninspired food.\nStopped in for brunch on 12/31. $3 bloody marys sounded inviting, but they were weak, and it took monumental effort to procure horseradish, Tabasco, and an extra shot of vodka. Our server seemed listless,...\n\n\nMore"], ["Great Food and Drink, But a Bit Noisy", 4.0, "December 29, 2011", "Chris C", "Naples, Florida", 45, 20, "We had apps and a couple wines by the glass. Very good wine list and food menu. Innovative and well-thought-out menu. Very well-trained staff. Floors and walls have nothing to absorb noise, so it can get pretty loud when the place has more than a few people in it.\nIt's not Paolo's fault, but the 10% DC tax on restaurant...\n\n\nMore"], ["Terrible Food & Terrible Service with Cool Decorations", 1.0, "November 30, 2011", "Lucy W", "Washington DC, District of Columbia", 3, 3, "I've never written a bad review on a restaurant in my life, until now. The decor inside Paulo's was cool, but the food was the worst and the service wasn't great either. It was a little busy but we waited a long time for our bad food. The girl seemed new, however, and was very apologetic. I got simple spaghetti...\n\n\nMore"], ["Not again", 2.0, "November 28, 2011", "Robbie_P0", "Breda, The Netherlands", 49, 28, "When we arrived the person that our contact made all the arrangements with had left the company and nobody was aware of our arrival. We were seated somewhere in the back. the food was soso."], ["love love love.", 5.0, "November 18, 2011", "mdubbwashdc", "Washington DC, District of Columbia", 6, 0, "love it every time I go! pizza is amazing, breadsticks/tapenade fabulous, salads and entrees, brunch (benedicts, bloody marys, etc.) - excellent!\nthe atmosphere can't be beat - well-designed restaurant and cutest patio area.\nservers could use a refresher course (it doesn't hurt to check on your tables every now and then), but no major complaints.\nmy local go-to for any...\n\n\nMore"], ["All around great lunch experience.", 5.0, "November 12, 2011", "Tennygirl", "Washington, DC", 2, 2, "We lucked into this fab find while wandering through Georgetown on a beautiful November afternoon. Wanting to dine alfresco, we asked for an outside table but none were available. We probably looked disappointed and our server offered a table by the window near the outside area. Noting that there were french doors next to the table, we asked if they...\n\n\nMore"], ["Fantastic food, great service. Don't miss this great place to eat in Georgetown!", 5.0, "November 12, 2011", "Oriolezgurl", "Waynesboro, Virginia", 120, 33, "This is a great little restaurant at the corner of Wisconsin and N Streets in Georgetown. The food was fantastic. My colleague (who is a vegetarian) had the crab and corn dish, which she raved about , and I had the penne pasta with marinara and meatballs. As a meatball snob, I was worried that I would be disappointed. I...\n\n\nMore"], ["Great Tiramisu", 4.0, "November 7, 2011", "K1962", "Ventura, California", 9, 5, "Located in Georgetown across the street from Martin's Tavern, this a neighborhood restaurant with typical Italian food. They have a great Tiramisu! However, I ordered Char and they delivered Salmon and kept trying to tell me it was Char! Since I don't like Salmon, I knew right away what it was! I had just recently had Char in another restaurant...\n\n\nMore"], ["Good for people watching and nice ambience", 4.0, "November 1, 2011", "RSC", "London", 88, 55, "Good selection of food and the complimentary fresh breadsticks with houmous are welcoming.\nWe sat outside and the service was friendly and the atmosphere relaxed.\nI would go back and recommend here."], ["Dinner before Marine Corp Marathon", 4.0, "October 31, 2011", "Kcavs", "Buffalo, New York", 43, 34, "Made reservations with the idea of carbo-loading before marathon. It is a great restaurant right in the heart of Georgetown. Our food wasn't as hot as we would have liked, but everything else was good. Lovely atmosphere and friendly staff."], ["Great food. Service okay.", 4.0, "October 18, 2011", "vbtourist2004", "Virginia Beach", 34, 15, "We had dinner here on a Saturday evening. 4 in our party. The service was okay, not very attentive. The food was excellent and worth the wait. The place was very crowded as Georgetown is on weekends. The cost was $40 per person for salad and main course. No wine. Would go back but only for special occasion."], ["BRUNCH-- FABULOUS!", 5.0, "October 3, 2011", "lauren C", "Morgantown, West Virginia", 6, 2, "We went on a saturday morning around 11:15am. $3 Mimosas!!!\nI had the stuffed french toast with strawberries and blue berries!\nMy fiance had the scramble which was just as good if not better than my french toast! :)\nOverall experience was wonderful!"], ["going downhill", 1.0, "September 12, 2011", "Marilyn1601", "Los Angeles, California", 23, 9, "My husband started going to Paulo's in the 1980's and it was one of his favorite restaurants. He gets back to DC once or twice a year and has always gone back to Paulo's for a meal. last year he had a horrible waiter - acted like he was doing him a favor bringing my food after 1/2 hour wait,...\n\n\nMore"], ["Great neighborhood gem", 4.0, "June 13, 2011", "J M S", "Toronto, Canada", 81, 56, "I've been visiting Paolo's for 11 years now and never got disappointed. Solid Italian-American menu, decent prices, improved service, and great location. Can be very noisy, but the knowledgable bartender makes up for it. Great for your \"every day\" Italian fix."], ["Delicious Italian", 4.0, "April 28, 2011", "Michelmas62", "Windsor, Canada", 15, 8, "A great spot for a nice meal. Had the 8 hour lamb shank and it was beautiful! Also had a creme brûlée with coffee for desert. Other people at the table had steak or pasta dishes and all were very happy with their meals. Service could have been a little more attentive and glasses of water would have been good....\n\n\nMore"], ["A cut above--way above--your average pizza and pasta joint", 5.0, "April 5, 2011", "Valvefloat", "Valvefloat", 26, 14, "My family stumbled into Paolo's while searching for a lunch spot between college visits with our daughter in the Georgetown area. Just a glance at the menu revealed that it was a quality restaurant with an emphasis on flavor and presentation rather than mass quantity. We tried two different thin-crust pizzas, as well as a risotto and all three were...\n\n\nMore"], ["Great food, very loud atmosphere", 3.0, "October 29, 2010", "TheFlyingMommy", "Ann Arbor", 84, 86, "I ate at Paolo's Georgetown at 7p on a Thursday evening. It was packed, loud, and chilly. The restaurant sits on a corner and has large windows and french doors so that customers can dine al fresco in nice weather. It was getting pretty chilly by 7p on October 28, but the doors were wide open and the interior ceiling...\n\n\nMore"], ["Not Bad", 3.0, "September 27, 2010", "ph7719", "Valhalla, New York", 95, 34, "Paolo's has a nice enough atmosphere, but the service is slow and not too attentive and the food is decent but not spectacular. One member of my party ordered meatballs but did not receive them. Portions aren't too small but certainly aren't generous either, and the breadsticks served in place of bread were pretty disappointing, tasting more like soft pretzels....\n\n\nMore"], ["Good Casual Place in Georgetown Not too Pricey", 3.0, "July 2, 2010", "rocknroll52", "Philadelphia", 125, 131, "We found Paolo's on Wisconsin Ave as we were walking around/shopping in Georgetown. It was a Thursday night and the place was jumping. No seating available outside so we sat indoors.\nSome yummy apps included calamari and some kind of fried eggplant stuffed with cheese that was soooo good! Pasta dishes were decent. Service was not great but overall my...\n\n\nMore"], ["Worst service EVER. Food ok.", 1.0, "March 9, 2010", "chloe_c7", "nyc", 1, 1, "I grew up around the corner from this place, but am rarely back home. This past weekend the family went to Paolo's out of nostaliga, as we used to go there occasionally back in the day. Sadly it was a mistake, as the service was shockingly poor. Although the waitress brought us water and a few drinks in short order,...\n\n\nMore"], ["Horrible food, horrible service.. and got sick after!", 1.0, "December 8, 2009", "whoopsjenny", "Pittsburgh", 11, 17, "We were on a recent trip to DC and planned to eat at Filomena. They were booked for the night when we arrived so we tried to find another good Italian restaurant nearby. Paolos came up with having pretty good reviews so we figured we would give it a try.\nWe were seated near the front window/door and there was...\n\n\nMore"], ["Good italian cuise", 4.0, "October 30, 2009", "FerreeFlowers", "Fairfield, New Jersey", 5, 3, "Good Italian cuisine, but not the best, 4 stars fits the bill. Wait took a little long but it was well worth it. Staff was pleasant but a bit overwhelmed and forgetful at times. Nonetheless I would recommend this place."], ["The worst service I have ever had, anywhere, period.", 1.0, "October 15, 2009", "sgw57", "michigan", 46, 28, "I waited on tables to pay for my college education and ALWAYS leave a tip. However, for the first time EVER, I did not when we tried to have dinner at Paolo. The waiter appeared to be high and clearly forgot about our table when the restaurant was not even busy. I spent 20 minutes trying to get the attention...\n\n\nMore"], ["A Treat in Georgetown", 4.0, "September 28, 2009", "VABFB", "Northern Virginia", 34, 17, "Ate here for the first time a few days ago, and I was pleasantly surprised. Lately I've been a little disappointed with the restaurants I've been choosing in G-Town, and Paolo's blowed them away. Good italian food, and a nice atmosphere."], ["No complaints!", 4.0, "August 14, 2009", "melieux", "Pennsylvania", 21, 15, "Great, casual place to relax with a group of friends, with seating inside or out. My group tried the white pizza, paolo's salad, homemade pancetta & cheese tortelloni, tortellini rose, meditteranean salad & what may be the world's best brioche french toast. Paolo's frozen bellini is reason enough to stop in!"], ["Great, Cozy Italian", 4.0, "July 25, 2009", "5Carrolls", "Redmond, Washington", 27, 18, "I was impressed with the nice outdoor seating in the shopping area of Georgetown. The food was great, as were our drinks. We had my 10 year old nephew along and he enjoyed it as well. Maybe not for smaller children <5yo. Our server was very attentive."], ["Nice spot in the heart of Georgetown. Their food is quite good for a chain.", 4.0, "October 28, 2008", "EvinOK", "Cork, Ireland", 307, 138, "Nice spot in the heart of Georgetown. Their food is quite good for a chain."], ["Pesto had too much oil, medeterranean chicken salad was good but skimpy on roasted eggplant. I would never go to...", 3.0, "August 25, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pesto had too much oil, medeterranean chicken salad was good but skimpy on roasted eggplant. I would never go to Georgetown just to eat here, but if you're alreadyout, why not."], ["it is ok, not some place...", 2.0, "July 9, 2008", "jonesiedc", null, 58, 2, "it is ok, not some place i would need to go to"], ["Oh the memories associated with this place. I can remember when a weekend started and ended at Paolos, and the week...", 5.0, "June 10, 2008", "Dubaiguy11", "Dubai, United Arab Emirates", 56, 32, "Oh the memories associated with this place. I can remember when a weekend started and ended at Paolos, and the week was peppered with visits. I havent been in years but I hear the food quality has slipped, and the crowd has completely changed. I still remember the Paolos Salad, extra gorgonzola, no pine nuts and the medium rare fillet....\n\n\nMore"], ["Nice place....good food...", 4.0, "May 31, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice place....good food. It's been a while so I don't recall the details now..."], ["Decent Italian fare.", 3.0, "March 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Decent Italian fare."], ["Another restaurant i used to go to often. In the spring and fall, the dining outdoors is pleasant ... watching...", 3.0, "February 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Another restaurant i used to go to often. In the spring and fall, the dining outdoors is pleasant ... watching pedestrians is part of the entertainment (reminds me of France). Food is good (It used to be better - before the expanded), yet not fantastic and not always consistent in quality. Noisy in the evenings."], ["Good steak salad.", 3.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good steak salad."], ["Love the pizza and the olive tapanade they give you for your bread!", 5.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love the pizza and the olive tapanade they give you for your bread!"], ["Nice location. Some dishes are nice. Bistroish. Relaxed.", 3.0, "February 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice location. Some dishes are nice. Bistroish. Relaxed."], ["Good lunch while shopping.", 3.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good lunch while shopping."], ["Kuddos for the Calamari!", 5.0, "February 1, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Kuddos for the Calamari!"], ["better for the drinks then the food", 3.0, "January 28, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "better for the drinks then the food"], ["Food is average and service can be slow", 3.0, "January 23, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Food is average and service can be slow"], ["always a good bet", 4.0, "January 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "always a good bet"], ["Weak menu, and the food...", 2.0, "January 13, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Weak menu, and the food was just not that great. Nice martinis though."], ["Love to stop in when shopping in Georgetown. Food is consistent and reliable, tons of choices from salad to pizza and...", 4.0, "January 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Love to stop in when shopping in Georgetown. Food is consistent and reliable, tons of choices from salad to pizza and more. Bonus outdoor seating and people watching."], ["Overrated...", 2.0, "January 6, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Overrated..."], ["Really overrated", 3.0, "January 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Really overrated"], ["It's innovative. But not...", 4.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It's innovative. But not really in a tasty way. High sentimental value though."], ["Went here last summer - pasta was not so good... i can't remember anything else C-", 2.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Went here last summer - pasta was not so good... i can't remember anything else C-"], ["eh.", 2.0, "December 31, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "eh."], ["Fun cocktails. Not bad... (we just had salads). Couldn't comment on the entrees.", 3.0, "December 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fun cocktails. Not bad... (we just had salads). Couldn't comment on the entrees."], ["I always get their Mojitos. One of the best mojitos ever. And they make a great filet mignon with fingerling potatoes.", 3.0, "December 10, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I always get their Mojitos. One of the best mojitos ever. And they make a great filet mignon with fingerling potatoes."], ["Great food, great place...", 4.0, "November 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great food, great place for a date."]]], ["West End", [["Good value, good food, good service!", 5.0, "August 5, 2015", "Susan M", "San Jose, CA, United States", 21, 14, "I was staying at the Ritz Carlton, co-located with the restaurant. The wine list was quite nice too! I found Westend to have a nice food selection, attentive staff, and reasonable pricing. I would definitely eat there again, even if I wasn't staying at the Ritz Carlton."], ["Great food, ok ambiance.", 4.0, "July 11, 2015", "Beata M", "Warsaw, Poland", 390, 155, "Had dinner with friends and the food didn't disappoint. Excellent halibut (in an Asian broth), good salmon, very tasty chicken my husband says. The Malbec was also very nice!"], ["Don't go if you're hungry", 3.0, "June 16, 2015", "jjgasman", "Fort Lauderdale", 85, 75, "The food was quite tasty and well-prepared, but the portion size is miniscule. This explains why the prices aren't astronomical considering it's a Ritz-Carlton restaurant. The portions are really 1/2-2/3 sized as compared with most others. The service was kind and nice, but glacially slow. We were there nearly 2.5 hours, and there was nothing complicated. For some parties, this...\n\n\nMore"], ["Group Dinner", 5.0, "June 3, 2015", "RDR1050", "Los Angeles, California", 16, 10, "Located in the Ritz Carlton DC it is a quite and nice place to grab a cold beer or a glass of wine and of course a bite to eat. Jeffrey Barrientos and his team helped me to create a solid casual meal for a small group to"], ["The Food was Great the Service was Average.", 3.0, "May 11, 2015", "SheriBobLove2Travel", "Liverpool, Pennsylvania", 403, 126, "We ate outside and there was a bit of a garbage smell. The service was average I think there were not enough waiters for the amount of customers. The food was outstanding, flat iron steak, ribs, and halibut, we shared the coriander ice cream dessert. The setting is nice to sit out on the sidewalk but check for the smell...\n\n\nMore"], ["Nice friendly atmosphere", 5.0, "March 10, 2015", "Alice H", "West Orange", 26, 12, "The West End Bistro is a very nice little Bistro. One can access it directly from teh Lobby of the RItz Carlton on 22nd Street. The menu was not huge, but had a good range of food. The salad was fresh and the short ribs were delicious. If you are staying at the Ritz Carlton , I would surely give...\n\n\nMore"], ["Vibrant atmosphere and delicious food", 4.0, "March 9, 2015", "Mark D", "East Windsor, New Jersey", 93, 42, "I dined with three colleagues. I've had lunch here before and this was my first dinner. Excellent: I had short ribs (one of my dining rules of thumb is always have short ribs if they are on the menu; this cuts down on time spent staring at the menu). With a mussels appetizer, this combination was a nice surf-and-turf. And...\n\n\nMore"], ["Below Expectaions", 3.0, "February 15, 2015", "Mikedac", "Hanover, New Hampshire", 6, 7, "Expected to have a good breakfast at the Ritz Carlton Hotel and was unfortunately disappointed. Upon walking in you could tell then restaurant was behind. Heard a couple of staff members saying\n\"Can you believe this\". The buffet was nothing special. All hot food was cold the Steno was not burning. No plates were available at the buffet until we...\n\n\nMore"], ["Very nice night with great company.", 5.0, "November 17, 2014", "Gregory F", "Arlington, Virginia", 117, 35, "We had a very nice night at West End. All courses were outstanding. No complaints or regrets. I ordered the autumn vegetable soup which was prepared as a bisque. I love bisque, and thus I'm picky. I really enjoyed this bisque. The pork chop was perfectly prepared as well. I can't recall the name of the desert, but it was...\n\n\nMore"], ["We like the west end alot", 5.0, "September 24, 2014", "Domi", "vancouver", 16, 31, "The West End area of DC is really cool - because it's like the\nWest End in Vancouver BC.....where I used to live. It has great residential areas and eateries and it's close to the T and all the Embassy buildings"], ["Nice bistro", 4.0, "September 7, 2014", "BLKSQ", "Edinburgh, United Kingdom", 38, 22, "Close to a number of hotels and a very convenient place to eat. Nice bistro menu with fast and efficient service."], ["Good hotel bistro", 4.0, "July 22, 2014", "Camwas", "Washington, DC", 249, 115, "The food at this Ritz-Carlton restaurant is much better than some others in the chain. Nice welcome, friendly wait staff, decent bistro fare and worth visiting in its own right, not just as a hotel restaurant. Tuna carpaccio, a work of art; braised duck pasties; good soups; seared skate wing; fish burger; wonderful shrimp and grits. The fish dishes seems...\n\n\nMore"], ["Just Drinks and Appetizers", 3.0, "June 17, 2014", "m w", "novi", 302, 280, "Nice restaurant tucked into the Georgetown area...convenient for drinks, and appetizers....or just a quick stop.\nGood service great location."], ["Just dessert", 3.0, "June 9, 2014", "GianniB", "Annapolis", 81, 22, "We stopped in for a drink and dessert about 10pm. Lovely night on the patio. Hostess was rather cold - at best, but I guess it was getting late. Excellent service. Desserts were OK, but nothing to write home about...for 1 wine, 2 desserts and a water...$50..."], ["Awesome food!", 5.0, "June 2, 2014", "RozanaK", "Tampa, Florida", 47, 24, "Nothing to dislike! Had two wonderful breakfasts here and drinks in the evening. If you like salmon, the smoked salmon platter is great and so is the BLT w/egg!"], ["Mac and Cheese and Brussel Sprouts....can't go wrong", 5.0, "March 19, 2014", "BossHog0113", "Knoxville, Tennessee", 83, 36, "Since eating there the first time, I have gone back. I have had the shrimp and grits and beef ribs. Both were spot on but couldn't compare to the Mac & Cheese and the Brussel Sprouts. I would recommend a reservation as some nights it can be fairly busy."], ["Not the place we remembered", 2.0, "January 3, 2014", "Fernanda P", null, 7, 5, "We came to the Ritz Carlton for breakfast and were very disappointed to find that they had changed the gorgeous restaurant we remembered for this very modern and simple cafeteria looking place.\nWe didn't even stay. We went to the Four Seasons instead.\nI hope this is not a permanent change."], ["Surprisingly good for a hotel restaurant", 5.0, "October 29, 2013", "Mark S", "Hereford, United Kingdom", 241, 120, "3 of us popped in for a last-minute supper and were not disappointed. Service was very good, and the food was excellent. My steak was cooked to perfection and the vegetables were very good. Wine was also very pleasant. Atmosphere was lively, despite the layout being very modern and somewhat spaced out. I would return and it is suitable for...\n\n\nMore"], ["Casual bistro at ritz Carlton prices", 4.0, "August 4, 2013", "Lucymilby", null, 37, 23, "This was a very nice casual corner bistro, no need to dress up; some diners were in suits, others in shorts. Big bar, good selection on the menu. I had the roasted chicken with a side salad. The chicken was nicely seasoned, cooked through with crispy skin but not dry. Very tasty. It was served over a bed of celery...\n\n\nMore"], ["Delicious", 5.0, "June 25, 2013", "MeredithDC", "Washington DC, District of Columbia", 2, 3, "Dinner at the Westend Bistro was outstanding. Loved the Halibut special with gnocchi. The calamari was a great start to the meal. Dessert was smores and it was unbelievable. The weather was ideal for the patio. The wait staff was quick and very nice. We liked our server Ted."], ["Lovely new addition to the neighborhood", 4.0, "May 31, 2013", "BuffCrone", "AZ", 437, 255, "There are a lot of mediocre restaurants and a few great ones in this neighborhood and this one, in the Ritz, is terrific. The food was excellent, the service attentive and prompt (for lunch, which is important) and when I pointed out an error in my bill, they not only corrected it but took an additional 10% off for my...\n\n\nMore"]]], ["Daily Grill - Wisconsin Ave NW", [["Good happy hour", 4.0, "October 13, 2015", "paganwoman", "Sedona, Arizona", 37, 20, "We were staying at the Georgetown Inn so had breakfast here every day. Always was served quickly and with a smile. We also ate in the bar area three times (where you can order off the dinner menu) The happy hour prices are really good and the bar tender was quick to tell us to get a three glass carafe...\n\n\nMore"], ["eat elsewhere", 1.0, "October 7, 2015", "Mark N", "Ithaca, New York", 3, 0, "Terrible service, not good food. Delivered without a smile! If you are coming to Georgetown for enjoyment, this will dampen your day."], ["After 3 visits, I'm advising to skip", 1.0, "October 4, 2015", "Maxwell C", "Washington DC, District of Columbia", 23, 13, "Over the past few years we have gone to Daily Grill three times and all have been poor experiences. For instance, today we started by waiting to be seated for 15 minutes when half the restaurant was empty. When we were finally seated it took 20 minutes to get a waiter; which we had to get up and ask for...\n\n\nMore"], ["Georgetown oasis", 5.0, "September 27, 2015", "286solotraveler", "Washington", 41, 4, "Having had many breakfasts here, and a few lunches, I always feel welcome and comfortable at the Daily Grill. An American menu, free valet parking, open early and late, cozy booths, cheerful staff, not too loud, fresh seafood and a good burger...you can settle in and enjoy your meal in the heart of Georgetown in a quiet room."], ["Another enjoyable stay at the Georgetown Inn", 5.0, "September 24, 2015", "Richard D", "Palo Alto, California", 2, 0, "A very friendly, pleasant eatery. I love it for breakfast. It has excellent service and a handy location."], ["Breakfast on Sunday morning", 4.0, "September 18, 2015", "Michael R", "Glastonbury", 9, 0, "We had breakfast here. GOod food and lot's of nostalgia to talk about in the different booths. Food good and serviec a little slow."], ["Nice ambience, food and service mediocre", 3.0, "August 18, 2015", "bkcarolina", "Vienna, Austria", 130, 86, "This is a nice place to sit in an afternoon, with large windows looking out over Wisconsin Avenue, and a classic feel to the bar/restaurant area. Service is generally non-attentive but not offensive--bartenders and waiters need to realize why they are there and look around a bit to see how it's going. I was there with people who are 3-4...\n\n\nMore"], ["Daily Grill Georgetown is great for dinner.", 5.0, "August 13, 2015", "Lerxst15", "Lauderhill, Florida", 3, 0, "I enjoy visiting the Daily Grill in Georgetown when I am in DC because they have a menu large enough to satisfy a picky eater like me. I love the sense of a complete meal I receive when dining there because of the large entrees and nice selection of vegetables and other sides. The atmosphere is pleasant, and the staff...\n\n\nMore"], ["Basic", 3.0, "August 11, 2015", "Cher215", "Chicago, Illinois", 58, 29, "We had breakfast here... It was just ok. They have a basic menu and seem a bit overpriced. Staff was friendly enough."], ["disappointed.", 2.0, "August 10, 2015", "lorrainew2015", "Durham", 3, 0, "I do not like to leave poor reviews, but I would not return to this bar area- not even for free. Quite a surprise since the Inn associated with this grill is 5stars. Room service was excellent!!"], ["Fabulous Food in Georgetown!", 5.0, "July 22, 2015", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "We are neighbors of this restaurant so we have been dining here for many years but the food and service have been stepped up considerably. Tonight our dinner was fabulous. I can recommend specifically the skirt steak and the blue cheese crusted filet mignon. Both entrees were outstanding. Our server, Jorge, did a fabulous job. We appreciated his hospitality and...\n\n\nMore"], ["Great for lunch or drinks", 4.0, "July 12, 2015", "HotelDeal", "Washington DC, District of Columbia", 76, 18, "They have a decent menu for lunch and I highly recommend the Salmon Burger if it's on the menu. You can't go wrong with that, but there are many other good items. The service is always good here and you'll get to relax and have a good meal."], ["Excellent Service, Good Food.", 4.0, "July 4, 2015", "Jennifer T", "Burlington, North Carolina", 72, 25, "Today we had lunch at the Daily Grill in Georgetown. The experience could have been a terrible one, as there was a very large party there that was SO loud that we couldn't carry on a conversation, but our waiter did his best to make things right. And, he did so BEFORE we had a chance to complain about anything....\n\n\nMore"], ["consistently delicious", 5.0, "June 15, 2015", "nomadnordstroms", "St. Petersburg, Russia", 12, 4, "Breakfast, lunch, and dinner are reliably good; prices are consistent with location and a 15% discount is offered to hotel guests for B-fast and Dinner. Excellent steaks and seafood; omelettes perfect; blueberry/cornmeal pancakes great. Even the coffee is good."], ["Great breakfast!", 5.0, "May 27, 2015", "Karen S", "Hamilton, Bermuda", 16, 4, "We had breakfast there and were really pleased with the quality of the food and the service. The only downside - it was quite expensive but we enjoyed it. Staff were very professional and courteous, the restaurant itself was nicely decorated and clean."], ["Terrible Service", 1.0, "May 16, 2015", "patmac61", "Lansdale, Pennsylvania", 33, 32, "Just finished eating here and this place was terrible. We sat at the bar for a few drinks and a lite lunch and while the food was not bad , the bartender Chenee was rude, unfriendly and just plain nasty . I ordered a Captain and Diet and when I was served my drink , I said this tastes funny...\n\n\nMore"], ["good selection", 4.0, "May 12, 2015", "Tac113", null, 23, 34, "a good selection of food on the menu for all times of day and good wait staff to make you feel welcome. be warned the chicken pot pie is huge!"], ["Club sandwich from heaven!!", 5.0, "April 21, 2015", "Paul M", "Chicago, Illinois", 152, 62, "We ordered the club sandwich and were amazed by the taste. Tandoori spiced chicken and cranberry sauce with bacon and all the other fixings. Great, great sandwich. Service was perfect and seat by the window gave us a view of all the action in Georgetown."], ["Sunday Brunch in Georgetown", 4.0, "April 19, 2015", "AlexAW2011", "London, United Kingdom", 80, 18, "Amid the hustle and bustle of Georgetown, it was a pleasant surprise that we were able to get a table at the Daily Grill for Sunday Brunch.\nWe hadn't reserved but were shown to a comfortable booth in a surprisingly quiet restaurant. They have a good brunch menu - most of the standard specials with a southern twist. All brunch...\n\n\nMore"], ["OJ", 4.0, "April 16, 2015", "Gary2m", "Harrisonburg", 4, 1, "great fresh-squeezed OJ was terrific great fresh-squeezed OJ was terrific....great fresh-squeezed OJ was terrific"], ["Great service and great food !!!", 5.0, "March 24, 2015", "BobbyNfromWF", null, 43, 11, "What a wonderful little restaurant in Georgetown. We went their for breakfast and were warmly greeted. The decor was charming and reminiscent of an 1920s restaurant. The food was tasty and fresh and the service was exceptional !!! I will absolutely be back !!"], ["Mediocre", 3.0, "March 24, 2015", "BlessMySoul", "Locust Grove, Virginia", 13, 13, "The food was mediocre and there were so many people at the bar laughing and carrying on. When I mentioned it to the waitress, she brushed it off as \"oh, they're our regular customers.\" I would have preferred a quiet dinner."], ["Overpriced", 3.0, "March 20, 2015", "NYeNY", "New York City, New York", 5, 6, "Typical hotel restaurant where the prices are a little too high for the quality of food being offered."], ["Nice Eatery in Georgetown", 3.0, "February 18, 2015", "APaul_9", "Des Moines, Iowa", 12, 11, "A nice restaurant for us when we didn't want to look to hard or stray too far from our hotel. The staff are very friendly. Breakfast was very goo, the evening meal was just fine but nothing special. Worth a visit."], ["Excellent, local flavor", 5.0, "February 4, 2015", "Jane V", "Atlanta, Georgia", 3, 0, "A busy, pleasant G'Town atmosphere - with great food and good value. Best breakfast / brunch on a Sunday morning!"], ["Great Steak", 4.0, "October 22, 2014", "BreakawayHoliday", "Surfers Paradise, Australia", 30, 16, "Great spot for a bite - and easy to get in - great team on service and meals were excellent. Steak was fantastic!"], ["Very nice", 4.0, "October 4, 2014", "Cmp1130", "Powder Springs, Georgia", 142, 27, "Staff was great, the bar food is very good. From fresh French fries, to the wings, the chicken pot pie had very good flavor and good flaky crust on top."], ["Delicious food and great service", 4.0, "September 26, 2014", "CruGS", null, 36, 3, "Recently went here for dinner. The server was very friendly. He recommended a few of his favorite dishes. We got our food in a timely manner. The server was very attentive. Great food and would definitely recommend."], ["Fantastic staff and food", 5.0, "September 20, 2014", "Nann H", null, 35, 14, "I have eaten at the Daily Grill the last two times I stayed at the hotel. The food and service were excellent. If I were in Bethesda for another reason and not staying at the hotel, it would be worth the trip just to eat at the Daily Grill."], ["Better than home cooking", 5.0, "September 18, 2014", "DThomasX", "Dallas, Texas", 46, 19, "I had dinner and breakfast at the Daily Grill, which is in the lobby of the Georgetown Inn. It was like home cooking, but much better. The fish tacos were spicy and tender, served with some of the most tasty beans and rice that I have had in a long, long time...and I live in Texas, where Mexican food is...\n\n\nMore"], ["Day by Day", 4.0, "August 12, 2014", "TMarchives", "New York City, New York", 56, 21, "A friend dines here every Saturday and Sunday. He likes the restaurant very much and is always graciously received by the staff. I accompanied him one evening. The waiters were indeed attentive and helpful. The service proceeded at a pace established by us. I thoroughly enjoyed the gazpacho and liked very much the simple grilled salmon with grilled asparagus. It...\n\n\nMore"], ["Excellent Food and Service", 5.0, "August 4, 2014", "kkclardy", "Greenville, South Carolina", 168, 58, "The Cobb Salad is delicious and so is the Wedge Salad. All of the food here looks amazing and the staff couldn't be any nicer! They even packed a box lunch one morning for my son who was attending a baseball camp at Georgetown and he said it was great!"], ["Great food, great service!", 5.0, "July 5, 2014", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "We come here occasionally but this visit was better than usual. We both had entree salads tonight. My husband started off his meal with a bowl of gazpacho which he really enjoyed. I got the skirt steak salad which was perfectly prepared. My husband had the rare tuna salad and he said it was delicious. Our service was also really...\n\n\nMore"], ["A good, hearty Breakfast in a Pleasant Setting", 4.0, "June 9, 2014", "jbgshrink", "New York City, New York", 126, 49, "While we were very disappointed in the Georgetown Inn, our breakfast at the Daily Grill was successful. The place is attractive and we were comfortable in a booth. My smoked salmon plate was delicious and my spouse's pancakes were also very good. The service was just fine and we enjoyed out first meal of the day in a quiet setting."], ["Throwback Thursday's", 4.0, "June 1, 2014", "Janeen M", "Bethesda, Maryland", 9, 6, "I've been coming here for over 12 years and this is the 1st time I've seen the bar so lively. The food is always good but the atmosphere has improved and there's a variety of patrons from young professionals to older couples looking for a good meal."], ["nice food, good value, good chat around dinner", 4.0, "May 22, 2014", "transnick", "San Francisco Bay Area", 74, 57, "We made reservations for prime time dinner and got a booth with enough privacy to have a decent conversation over dinner. That's a good start.\nService was prompt and friendly.\nAppetizers were reasonable overall but the seared ahi tuna was very generous and very tasty. Highly recommended.\nEntrées were ok: codd, fancy burger, trout. Nothing extraordinary but solid dishes at...\n\n\nMore"], ["Wonderful Experience", 4.0, "May 18, 2014", "Mike G", "East Marion, New York", 52, 39, "We had 9 adults, one toddler and one baby in our group for an early dinner after a noon graduation and reception. My nephew and I both ordered the charcoal broiled skirt steak, his with brown rice, and mine with mashed potatoes. We were both very pleased. My wife ordered the sea scallops over salad. She was pleased as well....\n\n\nMore"], ["wonderful food", 5.0, "May 10, 2014", "Kim M", "Madison, Wisconsin, United States", 8, 2, "Had the most amazing meal grilled shrimp was perfect. The wait staff was pleasant and funny. She even offered to take our photo's. I highly recommend."], ["Extremely disappointing...", 2.0, "May 9, 2014", "JTGnyc", "New York, NY", 33, 24, "I have eaten many times at four other Daily Grill venues, all in California. I have always found the food to be quite acceptable and the service prompt and professional. So, while recently in DC, I invited two old friends to lunch at the Georgetown restaurant. What a mistake. We had a 1 PM reservation on a Thursday. The receptionist...\n\n\nMore"], ["OK but overpriced food, appalling service", 1.0, "May 5, 2014", "MerryDevil", "Washington DC, District of Columbia", 163, 107, "We dropped by for dinner and drinks on a Sunday night, hoping for a new \"local.\" Tried the sliders and the spinach and artichoke dip: not bad, but nothing you couldn't get at Applebee's for half the price.\nDaily Grill's service, however, leaves everything to be desired. The bartender would disappear for ten minutes at a time, guaranteeing that our...\n\n\nMore"], ["Daily? Probably not. From time to time? Fine", 4.0, "April 19, 2014", "John G", "Alexandria, Virginia", 54, 23, "We came for Sunday brunch / lunch and liked it a lot. Our reservation gained us access to a comfortable booth with ample seating for 4. Receptionist was welcoming and efficient. My partner and I each had bagel and lox, which we enjoyed. The lox was fresh and served in a generous portion, bagel pleasantly chewy. We were pleased with...\n\n\nMore"], ["Great lunch spot", 4.0, "April 1, 2014", "libbie5", "omaha, ne", 243, 73, "My daughter-in-law and I had lunch here last week. The wait staff was professional and friendly. I enjoyed my \"mini\" pot pie-it was delicious. The vibe is casual but hip."], ["Quite Pleasant Actually", 4.0, "January 13, 2014", "HowardB118", "Hastings on Hudson, New York", 48, 27, "I liked the broad selection of food and drink. Also liked the mixture of locals and hotel patrons served by a very friendly, professional staff. Try the skewered chicken and rice .Delicious and less than 600 calories."], ["Not a diner - but stylish", 4.0, "January 12, 2014", "Cakebreadt", "London, United Kingdom", 159, 44, "I was told this was a diner which it is not! It I is a old school stylish restaurant that I visited for breakfast. It is part of the Georgetown Inn & was not cheap $30 for one inc tip & coffee. The eggs were great but the cappuccino average."], ["Old school Georgetown charmer", 4.0, "November 26, 2013", "Caren P", "Boulder", 1, 0, "Great lunch salad and cool clubby ambience. Service was impeccable and friendly. Would have stayed for a drink, but had to catch my flight!"], ["Average Food-Service slow on one of two visits", 3.0, "November 18, 2013", "buckeyetravel", "Dayton, Ohio", 111, 156, "A co-worker wanted to try this place as it was close to our hotel and he liked the menu.\nWe did breakfast first and I was not impressed. The service was really slow and I think we were lost in the shuffle as it took a long time for a waiter to come to the table and then refills were...\n\n\nMore"], ["Really yummy!", 5.0, "November 15, 2013", "amarinesmom226", "Spring, Texas", 81, 34, "My experience at the Daily Grill was wonderful. The crab cake appetizer was just delicious but the entree...SUBLIME! I ordered the chicken potpie after a friend highly recommended it. I was NOT disappointed. Comfort food at its very best! The chicken and vegetables were perfectly cooked, the gravy was smooth and flavorful but the crust...WOW! You'll just have to try...\n\n\nMore"], ["Dinner in Georgetown", 5.0, "September 23, 2013", "jessicamadelin", "Washington DC, District of Columbia", 11, 4, "Amazing! Loved the location, the menu, the food. Perfect for a date. Great service. Overall, incredible."], ["Great Wedge Salad and Burger!", 4.0, "September 22, 2013", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "We enjoy the Daily Grill because it is right in our neighborhood. We enjoy the wedge salad and the skirt steak as well as the the burgers. There are many other good choices on the menu. The service is always good. One thing I don't like about the restaurant is that you have to leave the restaurant and go into...\n\n\nMore"], ["Too noisy !", 2.0, "September 10, 2013", "aandj7", "Maidenhead, United Kingdom", 94, 42, "Didn't actually eat here as just entering was enough. Its very noisy and lots of eflective surfaces so not a place for a quite meal with friends."], ["Lunch", 4.0, "September 3, 2013", "CRB50", "Washington DC, District of Columbia", 15, 3, "I've always liked the Daily Grill, the service is always great and enjoy the eating there. My fav is the chicken pot pie!"], ["Georgetown Inn", 4.0, "August 18, 2013", "mjbxyz", "Singapore, Singapore", 20, 2, "The food and service were great while we stayed in the hotel upstairs. We had three meals and all were very good.\nOne of the customers got a bit snooty about my two-year old who was got excited and started shouting at the sight of city buses in front of the restaurant. He complained that to my wife about our...\n\n\nMore"], ["The cuisine is consistent quality and the location is key!", 5.0, "August 5, 2013", "NancyLCarpenter", null, 14, 10, "I have to start out by saying the crab cake appetizer is one of the best in town hands down! (If I could figure out how to make the sauce...I will have achieved culinary success.) My son loves the meat loaf (I cannot compete) and the chicken pot pie and he prefers to sit in a comfy booth. This is...\n\n\nMore"], ["Great Restaurant", 5.0, "May 28, 2013", "jrschwank", "Bluffton, South Carolina", 84, 16, "This stop in Georgetown turned out to be the best move we made in DC. The food was delicious and the service couldn't have been better. We tried the restaurant for lunch on a Thursday and returned for dinner on Friday. The Tuna was absolutely delicious. I think we had four different dishes all of which were great. A definite...\n\n\nMore"], ["Worth a visit", 4.0, "April 5, 2013", "Judy M", "Nashville, Tennessee", 29, 7, "Stumbled on this restaurant while just walking around. The service was good, and the food was delicious. Great accidental find!"], ["Yummy", 5.0, "April 1, 2013", "JudyKB", "Michigan", 4, 1, "Went here as a last minute decision for Easter Sunday after mass a Georgetown univ. loved the bloody Mary's and yummy monkey bread. Loved the atmosphere and cost comparable to other georgetown restaurants. Would recommend."], ["Average food", 3.0, "February 21, 2013", "Judge_Smails-BR", "Basking Ridge, New Jersey", 123, 52, "We tried this chain restaurant for the first time while visiting with friends and the quality was average to slightly above average. I had the scallops special which was good but by no means spectacular. Everyone else had a regular menu item and no one was really wowed."], ["Good experience overshadowed by mgmt deceit the next day", 1.0, "February 3, 2013", "MomMarietta_GA", "Marietta, GA", 32, 14, "On Sat Feb 2 my husband & I had a very nice late night dinner at the Daily Grill. Unfortunately I left an expensive fur hat and didn't realize until we were back at our hotel. I immediately called, and they found it and agreed to hold it for me until the next day. They were very nice & helpful...\n\n\nMore"], ["Reliable, good menu, great service", 5.0, "January 23, 2013", "Alexandra S", "New York City, New York", 111, 62, "Daily Grill offers standard American cuisine three meals a day, but does so with attentive service, and you can tell the chef takes pride in his presentation and taste. There is also a diverse wine selection and also a \"600 calories and under menu\", with delicious options. I tried the grilled salmon and asparagus. Felt so good about it, I...\n\n\nMore"], ["Great food and service!", 5.0, "January 22, 2013", "HighCountryAZ", "Prescott, Arizona", 38, 26, "While visiting DC we just happened to choose this restaurant. What a wonderful surprise! My husband had the fish fry, I had the chicken meatballs and my son the Mac and cheese. All of our meals were outstanding. I also completely enjoyed the creamed spinach. I highly recommend The Daily Grill."], ["Don't always need a review", 4.0, "January 10, 2013", "vimapo", "Lincoln, Nebraska", 51, 46, "Decided to pick a restaurant in Georgetown without using Trip Advisor or any other service. Instead did it the old way of walking around, looking thru the windows and checking the menu. It was aMonday night so knew that reservations would not be an issue. The Daily Grill had a good look to it, menu seemed fine and it turned...\n\n\nMore"], ["The Food Was Mediocre and The Service Inattentive", 3.0, "December 26, 2012", "TexMomx3", "Dallas, TX", 20, 20, "We arrived on Christmas Eve about a half early for our reservation and were told there would be a 15 minute wait. We were fine with waiting since we were early, although somewhat puzzled since the place was only about 1/3 full and the table they eventually sat us at was already set.\nOur waiter promptly took out drink and...\n\n\nMore"], ["Great food, slow service", 4.0, "October 21, 2012", "Gigglebelly", "Annapolis, Maryland", 124, 35, "Due to traffic we were running late and called to let them know we were going to be 10 minutes late. No problem. We arrived and were seated promptly. We sat for almost 10 minutes before our waiter arrived. We were waiting on another friend and asked for our water, which was brought and then our friend arrived. We waited...\n\n\nMore"], ["Great selection, great food", 5.0, "September 20, 2012", "InternatTraveller", "London", 20, 11, "As the title says, great selection, great food -- and, best of all, just off the lobby in our new favourite DC hotel, the Georgetown Inn"], ["Start your day with an outstanding brunch in Georgetown!", 5.0, "September 5, 2012", "Steve G", "Parkland, Florida, USA", 72, 23, "We were visiting family in DC and made a reservation for brunch. The menu ranged from eggs to French dip to tuna and crab cakes. The food was outstanding, service was exceptional and surprisingly the prices were very reasonable. Made for a great beginning to a Sunday in Georgetown and a terrific visit with family. We will definitely come back...\n\n\nMore"], ["Surprisingly fresh", 4.0, "August 23, 2012", "beachbum6517", "Clarksville, Maryland", 16, 15, "Great local seafood. Had pan seared rock fish from the Chesapeake Bay. Food was cooked to perfection. Wait staff was very attentive. Drinks were refilled promptly and were not watered down at all. You certainly got a cocktail worth what you paid for it."], ["Better for dinner", 4.0, "August 14, 2012", "bwack", "London", 58, 16, "The dinner was excellent and not too expensive but the breakfast was slow and not worth the money. The service was likewise efficient and friendly at dinner and terrible at breakfast. A bowl of cereal was $6!"], ["Excellent Breakfast", 4.0, "July 13, 2012", "luv2travel23451", "Virginia Beach, Virginia", 37, 35, "My husband and I stopped in for breakfast and were very impressed by the quality of service and food. My husband had the granola and fruit and said it was delicious, but it was my breakfast that I rhapsodized about for the rest of the day. My egg white omelette was generously stuffed with spinach and onions and mushrooms and...\n\n\nMore"], ["GREAT SPOT FOR WEEKEND BRUNCH", 4.0, "July 8, 2012", "Foodie33140", "Miami Beach, Florida", 74, 20, "If you stop in for brunch of Saturday or Sunday, don't be surprised to bump into a congress member, senator or other DC power broker. Try to get a window table in the bar area, where you can watch the Georgetown street life. The food is good American fare, unpretentious and well-prepared."], ["Great Steaks", 4.0, "June 28, 2012", "dlennp", "New Jersey", 112, 26, "The service was great and the food better. Each of our steaks were cooked just right. It is in a great location of DC. You should try it."], ["Ate here twice and loved it!", 4.0, "May 30, 2012", "2worldtravelersnj", "NJ", 222, 98, "Had both lunch and breakfast here, can't say enough good things about this place. It saved our trip, literally! After bad meal at hotel this renewed our faith that we made the right choice in coming to DC for the weekend!"], ["Great Breakfast", 4.0, "May 15, 2012", "DUCK38", "Boston, MA", 18, 5, "I had a cocktail here in the afternoon and breakfast the next morning. Service was very good and waitress was pleasant."], ["Good food - mediocre service", 4.0, "April 27, 2012", "Ellehoj", "Washington DC, District of Columbia", 132, 65, "The food itself is good, especially the grill. Service is however slow and not very attentive"], ["Hidden Gem", 4.0, "April 11, 2012", "jccminden", "Minden, LA", 22, 16, "You'd be surprised at how good the food is at the Daily Grill.\nIt appears to be nothing more than a bar and coffee shop in the Georgetown Inn.\nThe food is very good. The club sandwich is one the best I've had."], ["below average.", 2.0, "March 17, 2012", "CharlesSteele28970", "Washington DC, District of Columbia", 31, 15, "very slow sevice, mediocre food, no atmosphere. Try the far superior Martin's Tavern a half block away."], ["Great HH (4-7pm)", 4.0, "February 24, 2012", "BobKop", "Baltimore, Maryland", 167, 284, "I can only speak to the HH of the Daily Grill, but I could not complain at all. The prices are great (between $4-$6 for nice size appetizers, and good beers/wines/cocktails). The service was good, but I sat in the bar area, which is why my experience might be different from others'. But I can definitely recommend the crab cake...\n\n\nMore"], ["Just had breakfast, but it was very good", 4.0, "February 14, 2012", "LeslieRMH", "Northborough, MA", 119, 61, "My mother stayed at the Georgetown Inn, so we met for breakfast one morning. We had eggs Benedict, and it was wonderful. It was served with nice fresh fruit, and we thoroughly enjoyed our short time there. THe restaurant seemed to be a bit understaffed, so we had to wait a while for our check. Otherwise, it was a good...\n\n\nMore"], ["Fine DC dining", 5.0, "January 17, 2012", "aekbabe", "Washington DC, District of Columbia", 55, 72, "Spinach dip was fantastic, all dishes are great - I can't say enough good things about Daily Grill. Great place for business lunches."], ["Fair food, poor service...eat elsewhere...", 2.0, "July 11, 2011", "RStraveler1", "Nashville, Tennessee", 78, 24, "Visited Georgetown today with my family and stopped in the Daily Grill. Menu prices were reasonable (for DC area) and interior appearance was pleasant. Once seated our waitress, Katie, took our order...Caesar Grilled Chicken Salad, BLT with fries and a plain hamburger with no bun...pretty simple. She brought us water and then disappeared for at least 25 minutes, never checking...\n\n\nMore"], ["Don't go...", 1.0, "March 26, 2011", "milliePortland_OR", "Portland,OR", 19, 13, "The place looked nice, but that's about it. Party of 4, one didn't get his food until the rest were almost done eating. Went to pay the bill with our credit card. Told it was declined. We have excellent credit, gave 2nd credit card. Told it was declined. Paid in cash. Called both credit card companies to see what was...\n\n\nMore"], ["not very good", 3.0, "September 18, 2010", "parmesan_10", "Vancouver, Canada", 53, 12, "The food and service weren't very good... We were looking for lunch on Sunday and all fo the pubs in the area had a gross smell to them so we ended up here and I wouldn't recommend it!"], ["A refuge with very good food, equally good for families and business.", 4.0, "August 4, 2010", "ADGrantley", "Westborough, Massachusetts", 96, 84, "We had made reservations a few weeks ahead of time for dinner at this Daily Grill restaurant in Washington, thinking that it was closer to the National Zoo than it proved to be. By the time we reached it, we were near the end of our rope--tired, hot, and thirsty after a full day of sight-seeing in Washington, DC. We...\n\n\nMore"], ["Annoyed", 3.0, "November 24, 2008", "twintrotter", "Maryland", 1, 1, "bill was 107, paid w/ two credit cards and cash. one credit card was charged 130ish the other 30ish and the cash must have been pocketed plus the tip. the charges on my credit statement are also different than what is on the receipts and had a transaction time earlier than the receipt i signed. pay attention at this place...\n\n\nMore"], ["I wasn't impressed - I've had better homemade lemon chicken, and my creme brulee dessert was still cold when served...", 2.0, "July 15, 2008", "smanette", "Washington, DC", 14, 2, "I wasn't impressed - I've had better homemade lemon chicken, and my creme brulee dessert was still cold when served. Had a descent steak though."], ["Never Again", 2.0, "June 14, 2008", "onevagrl", "onevagrl", 1, 0, "The menu presented what seemed like good dinner choices, but the food had absolutely no flavor. The four people in my party all agreed this was a place we would not be eating at again."], ["The prime rib was good. Service was slow.", 2.0, "February 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The prime rib was good. Service was slow."], ["The waitresses are horrible...terrible service in general. The cinnabons are massive, but tasteless. The food is bad...", 1.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The waitresses are horrible...terrible service in general. The cinnabons are massive, but tasteless. The food is bad, and I don't enjoy seeing homeless crazies slapping the window while I brunch. X-nay."], ["A good place for Brunch...", 4.0, "December 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A good place for Brunch after church!"], ["It was nice.", 4.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It was nice."], ["I didn't like the food at all. Very bland, ordinary.", 2.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I didn't like the food at all. Very bland, ordinary."], ["not what it was", 1.0, "December 16, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "not what it was"], ["Not as good as last time...", 2.0, "November 3, 2005", "Azuremeg", "Washington, DC", 12, 21, "I have been to this Daily Grill a couple of times and the service has noticeably declined. I was greeted by a rude host...I was meeting someone there and apparently I didn't warrant his attention or energy. Once seated, we were ignored and when I finally signaled for a waiter, he just approached our table and stood there. Assuming he...\n\n\nMore"], ["rude waiters, bad service", 2.0, "October 31, 2005", "Laurie2525", "Illinois", 4, 7, "I stayed at the adjacent hotel, The Georgetown Inn for four days. I had my daughter and son-in-law meet me for breakfast. I had a screaming baby in the room next to me, so decided to wait for them in the adjoining restaurant. It was not busy yet. I had a newspaper. I waited so long for someone to bring...\n\n\nMore"]]], ["Coppi's Organic", [["Great food, great people", 4.0, "September 21, 2015", "Steven S", "Santa Cruz, California", 77, 58, "Visiting DC I had asked a former native where to eat and the first recommendation was Coppi's Organic. This is a delightful place with friendly service and fantastic food. We ran through appetizers, salads, mains and desert eating more than we should have, but we had to experience it all. The wine list is adventurous (who knew red wine could...\n\n\nMore"], ["Cozy Coppi's--Very fresh and yummy with an old world charm", 5.0, "September 16, 2015", "Grabes", "Asheville, North Carolina", 45, 11, "Right on Connecticut Ave. in Cleveland Park area, we almost walked past it since it is in a new location there. This place has been around for awhile but moved. It has excellent and very fresh food. Awesome pizza, pasta, gelatos and much more, and is a place that knows how to create atmosphere. Great for families or couples, it...\n\n\nMore"], ["Great place, food and service", 5.0, "September 16, 2015", "Maria P", null, 1, 0, "The ambience is pleasing. I really loved the food is very tasty. One's of my favorite is the Shimp Pasta and definitely the \"Pizza\" making with wood-oven.\nCarlos (The Owner) is amazing. Very friendly and always pending of his coustomers.\nI recommend Coppi's Restaurant"], ["Good food and friendly bartenders.", 4.0, "July 25, 2015", "LeeHyde", "Austin, Texas", 14, 2, "Taking advantage of the happy hour special, (5 dollar personal pizza and 4 dollar house salad) we popped in and decided to sit up at the bar. We found the bartenders very friendly, the service quick and the food delicious for a great price. There were lots of vegetarian pizza options that I saw on their menu as well. I...\n\n\nMore"], ["Fresh, tasty and friendly.", 5.0, "June 28, 2015", "Jiev16", "Washington DC, District of Columbia", 194, 74, "Organic Italian food that it's just yum! Great wines and dishes. Service is very good and the manager is very attentive. I had the lasagna with bechamel sauce and I, just thinking of it, want more! We also ordered ravioli and they were amazing!! They also have a bar area with weekday happy hour! Will go again."], ["Really pleasant meal", 5.0, "June 3, 2015", "gypsumm", "eastcoast", 42, 11, "Had an extremely good personal pizza, salmon, capers, goat cheese and lots more things. Excellant crust, tasted really good. Service excellant. Made me feel like a friend visiting. Little pieces of dipping bread. Freshly baked with a touch of tomato and seasonings with a delightful olive oil. The coffee was particularly good, and I appreciated it because I'm usually disappointed....\n\n\nMore"], ["Nice ambiance, Great service, Excellent food", 5.0, "May 5, 2015", "1JessicaElle", "Sumerduck", 6, 4, "This has very quickly become one of our favorite restaurants. There are less than a handful of all organic restaurants in the DC Metro area. I was very pleased to find this spot. We are so delighted with the menu, that we will often eat here 2-3 times a week, choosing multiple items from each category. The specials change often...\n\n\nMore"], ["Hit then miss", 4.0, "April 26, 2015", "iStefPayne", "Washington DC", 126, 58, "I really want to give Coppi only three stars because I feel that's what my most recent visit deserved, but I had to bump it up because the quality of food, atmosphere and wine menu are all really good.\nWhat's not so awesome is the strange \"team\" service (fine if explained well), and the food is inconsistent in my opinion....\n\n\nMore"], ["New old place", 4.0, "March 5, 2015", "Aburel", "Bucharest, Romania", 574, 271, "This brand was in the neighborhood in the past. Themed after a famous biker, the place is homey, noisy and the food is great. Good wine list, daily specialties, good service. Gamberi pasta and endives salad were great. Good coffee. Parking is a problem in the area but a valet is nearby for 15$."], ["Great Service, Food and Atmosphere!", 5.0, "March 1, 2015", "kgpena", "Arlington, Virginia", 63, 34, "Coppi's has become one of our favorite restaurants! Some of the best pizza in the DC area!\nWe are fans of the Salmone Affumicato (smoked salmon, sheep’s milk feta, ricotta, greens, capers, parsley)\nand the Genovese (basil pesto, shrimp, fresh mozzarella, pine nuts).\nThe pasta choices are equally delicious!\nBut you have to save some room for the Calzone Di...\n\n\nMore"], ["Large group dinner was definitely a success", 5.0, "February 2, 2015", "TravelingPalina", "Washington DC, District of Columbia", 122, 56, "As a former resident of Florence, I tend to avoid Italian restaurants in DC until my husband promised me Coppi's Organic was the one to visit - and he was right! We went there on a Saturday night with a group of 9. Our server was fantastic and very attentive. The portions are fairly large so we ordered appetizers and...\n\n\nMore"], ["I love this food!", 5.0, "January 26, 2015", "Alisa J", "Washington DC, District of Columbia", 1, 1, "I can truly say that I have had some of the best meals of my life at Coppi's. I love that everything is organic and local whenever possible (not possible for wild salmon), but what makes the place really shine is that everything is as fresh as possible and expertly prepared. The lasagna is the best. So is the gnocchi....\n\n\nMore"], ["Wonderful New Venue in Cleveland Park DC", 4.0, "January 16, 2015", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Visited Coppi's on New Years Day with friends and we were charmed by the service and food. Try the Lasagne (half portion would suffice for normal eaters-the full portion is huge). Pasta special was to die for. Calamari is delicious as are the salads. Full wine list and the usual suspects in beers and spirits. Can be noisy. Recommend reservations...\n\n\nMore"], ["If love good organic Italian food (and a cycling buff) pedal to here!", 4.0, "January 9, 2015", "drsoozie", "Arlington, Virginia", 35, 14, "We met some friends for dinner. One of our party lives in the neighborhood and recommended it.\nWhen we first walked in the first thing I saw was a picture of Fausto Coppi.(For those who aren't Bicycling fans we was the first cyclist to win both the Giro d' Italia and the Tour de France in 1949 making him the...\n\n\nMore"], ["Not worth a detour, but okay if you are in the neighborhood", 3.0, "December 20, 2014", "Wolfgang3002", "Washington", 56, 18, "Some weeks ago Coppi's replaced a longtime local favorite, Lavandou. The menu is small but interesting, unfortunately not always matched by the food itself. It is difficult to ruin pasta but Coppi;s managed to do so. On the other hand, my wife's fish was excellent. The noise level is high. The service is friendly but disorganized--perhaps this will improve over...\n\n\nMore"], ["Not perfect, but well worth considering!", 4.0, "December 16, 2014", "KJA3", "Washington, DC", 205, 186, "Coppi’s is well worth considering for the quality of its food – my companion and I were both very well pleased with our meals! (We both had the delicious warm apple / gorganzola salad; for our entries, I had trout, my friend had lamb.)\nThe rest of our experience was a bit more mixed. Service was attentive, but a bit...\n\n\nMore"], ["Nice Local Restaurant", 5.0, "November 25, 2014", "mullenbeg", "Dublin", 77, 67, "Having just opened recently, I was looking forward to giving this place a try. The service was good (though the focaccia bread we were told we would be served didn't arrive!). There was a nice varied wine list though I thought the options for wine by the glass was too limited. The first selection (squid salad) wasn't available, but the...\n\n\nMore"], ["Really Disappointed", 2.0, "November 17, 2014", "medc123", "Washington DC, District of Columbia", 2, 1, "We tried Coppi's last night after hearing good things about it on a local listserv when it was learned that the restaurant was moving back into the neighborhood. The salad lacked any flavor and tasted as though the dressing was made predominantly of water. The pizza had a doughy, undercooked crust. The toppings were similarly flavorless, which was really surprising...\n\n\nMore"], ["The Return", 5.0, "November 9, 2014", "Kelvin R", "Washington DC, District of Columbia", 1, 4, "THE LEGEND HAS RETURNED.\nGreat service. Better food.\nI can't begin to express how excited I am that Coppis is back. I absolutely love what they do with food and the service, contrary to the multiple negative reviews, is top notch. They have very high standards of service and every employee is held to those standards. Any complaints or problems...\n\n\nMore"], ["Organic food!!!!", 5.0, "November 8, 2014", "Janeth F", null, 16, 6, "Great service, awesome fresh food! Everybody must try! 👍👍👍... Glad that Coppi's Organic is back after 2 years. God Bless this place!!"], ["Good Food, Interesting Decor", 4.0, "March 10, 2014", "Horton-SFO", "San Francisco, California", 79, 29, "Coppi's gets it name from legendary Italian cyclist Fausto Coppi. The walls are adorned with photos and memorabilia dedicated to bicycle racing. I've visited four times now and find both the pizza and pasta to be pretty good. The service is top notch. Prices are pretty reasonable for the area. A nice place to go when lingering is not high...\n\n\nMore"], ["Organic Pizza! Wow!", 4.0, "January 24, 2013", "janeg99", "Takoma Park, Maryland", 75, 31, "Nice to find a place that serves organic pizza in the middle of a very busy area full of all kinds of other foods. Easy to get to from the metro. Fun to see the bicycles and photos of famous cyclists. Good beer too."], ["Great service, disappointing food", 3.0, "June 18, 2012", "lovetravelfoodwine", "Lincoln, Nebraska", 27, 12, "A U Street pizza and pasta place with a great old style Italian bar atmosphere and wonderful, smiling service. (Loved Sarah who was in training!!)\nHowever, our food was mostly average to disappointing. The fish was overcooked, the salad tasted as if it came from a bag, and the pasta with meatballs nothing special. The one bright spot was the...\n\n\nMore"], ["Awesome", 5.0, "May 15, 2012", "Lainie54", null, 7, 2, "What a find! The food is so fresh and delicious and different preparations than typical Italian fare. We sat at the bar and Adrian the bar manager was a great host, very funny and personable! He made recommendations, matched wine with the food order and was beyond knowledgable about his place. Overall a fantastic dining experience. Loved it!!"], ["Fantastic Food and Atmosphere", 5.0, "April 23, 2012", "labrescue", "Washington, DC", 6, 4, "Really enjoyed drink and dinner. The manager, always at the bar, really knows his wines as well which I appreciated. He gave me a few samples to ensure I like the wine I eventually ordered. Food was great. Warm and cozy feel. Can't wait to go back"], ["good food, nice atmosphere", 4.0, "April 8, 2012", "yaeliam", "Los Angeles, California", 20, 14, "I came here with a large group and we had a great time. They have a nice selection of pizzas and some great appetizers. Also, excellent desserts"], ["Top spot. Well done in terms of welcoming a small family and accommodating a hip crowd.", 5.0, "March 7, 2012", "Picardyplace", "Washington DC, District of Columbia", 1, 1, "We walked in and were warmly greeted ( our family of four) by a special very special staff. Our boys made their own mini pizza's and we were treated to a gourmet feast...lovely wine and ale and made to order pizza. The boys fell asleep in our laps, full,content, and happy. What more could a parent want? Many thanks to...\n\n\nMore"], ["Totally dull", 2.0, "February 21, 2012", "megwalker87", "Washington DC, District of Columbia", 46, 18, "Food was average - nothing interesting on the menu, and nothing particularly well prepared.\nService was below average - despite the fact that very few people were in the resturant, we hardly ever saw the server - except when we didn't need him!\nI do like the decor - I like that there are hat stands right by the table...\n\n\nMore"], ["Underwhelming", 3.0, "January 25, 2012", "Paul S", "DC", 38, 33, "I really wanted to like Coppi's. Nice atmosphere, but the sad reality is that the food was just average, at best. My pasta was oversauced, while my wife's was sitting in a pool of water. Once upon a time, Coppi's may have been fine, but in a neighborhood with a growing list of alternatives (Al Crostini, Posto, etc.), I don't...\n\n\nMore"], ["brunch was delicious! More impressive than I remembered", 4.0, "November 7, 2011", "tw6937a", "UAE", 112, 72, "Friends suggested this place for brunch - i had been there years ago but it wasn't too memorable - so I wasn't too thrilled about returning. BUT what a surprise - we really enjoyed the food. And I really liked the quaint, rustic, casual atmosphere. My husband had the calzone - and it was very delicious. Food is not only...\n\n\nMore"], ["Outrageously overpriced pizza joint", 2.0, "March 15, 2010", "Moitessier", "USA", 6, 29, "It's small, crowded, funky. The service can be uneven. The food is good. But the prices are sky-high for what amounts to an upscale pizza joint. $26 for a bowl of plain spinach pasta, $34 for the cheapest wine on the list (an unremarkable pinot grigio); add an appetizer or dessert and the bill for two will easily top $150."], ["So amazing!", 5.0, "March 28, 2009", "Westigail", "Maryland", 13, 9, "We just had the best time at Coppi's. Not only is the food and service great, the idea that an organic/sustainable restaurant is kickin' is wonderful! We will definitely be back and enjoyed everything - the wine, appetizers, entree, desserts... it was all great."], ["5 for the food, 2 for the service, definitely worth a try", 3.0, "December 12, 2008", "SRKBC", "Wisconsin", 2, 1, "I visited Coppi's alone on a Thursday after a very stressful day of travel. The food was outstanding & was the high point of my day. Service started strong, but finished weak & on an odd note with the bartender, as he REFUSED to make change for me! I have never had that happen ANYWHERE before!!!\nI had a seared...\n\n\nMore"], ["They have great pizzas to pick from...if you can read the menus. It's so dark these days that you'll have to ask for...", 4.0, "July 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They have great pizzas to pick from...if you can read the menus. It's so dark these days that you'll have to ask for more candles. One waiter told us (you can't make this stuff up) \"Sorry about that, the regulars usually bring their own flashlights!\" Despite the darkness we continue to go back for the pizza."], ["I had heard so much about their pizza's and went there one night to try-- I was mad I spent more than double for a not...", 3.0, "July 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I had heard so much about their pizza's and went there one night to try-- I was mad I spent more than double for a not great pizza (at all) when busboys was right around the corner -- I wish had skipped trying their pizza. The random, limited pasta items they have on their menu are fabulous though."], ["Small restaurant, but great pizza! I often pass this up because it is packed.", 4.0, "July 10, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Small restaurant, but great pizza! I often pass this up because it is packed."], ["Coppi's is a tried & true neighborhood joint...pizza can't be beat and you've gotta love that everything is organic...", 5.0, "March 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Coppi's is a tried & true neighborhood joint...pizza can't be beat and you've gotta love that everything is organic and so fresh. Because it's so tiny, it's always super-packed (so make reservations if you can) but the fun bike-themed decor and random music mix make for a fun meal."], ["like Cheers...", 5.0, "January 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "like Cheers..."], ["Pizza is excellent, but...", 4.0, "January 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pizza is excellent, but small dining area means this is an off-peak location, or a crammed seating space."], ["want to go back! great pizza!! wish i saved room for dessert - the pasta dishes looked yummy too... plenty of options...", 5.0, "January 9, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "want to go back! great pizza!! wish i saved room for dessert - the pasta dishes looked yummy too... plenty of options for vegetarians"], ["yummy dessert.", 3.0, "December 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "yummy dessert."], ["Pretty good pizza, more...", 4.0, "December 7, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pretty good pizza, more unique types of toppings - great atmosphere."], ["Healthy food approximates the real thing, but way overpriced", 2.0, "May 12, 2005", "Laura H", "Seattle, Washington", 31, 89, "My husband and I visited this restaurant in April '05 in our quest to find sources of Ligurian cuisine in the long stretches between our trips to Genova. While we enjoyed the food we ordered it is not likely that we will return. The person who greeted us looked puzzled when I mentioned we had a reservation, and with no...\n\n\nMore"]]], ["Chop't Creative Salad Co", [["Great chopped salads and Wraps", 5.0, "October 7, 2015", "DougTMesa", "Mesa, Arizona", 205, 60, "The steak and blue cheese can be enjoyed as a salad or in a wrap. Very fresh and chopped as finely as you would like"], ["Yummmmmm!", 5.0, "September 17, 2015", "Sue E", "Boston, Massachusetts", 6, 1, "Amazing salads. So many great options that is took me a while to choose. Great for lunch or dinner! Yummmmmm!"], ["Quick in and out!!!", 5.0, "May 29, 2015", "Will J", null, 20, 6, "Post workout meal!! Great food and healthy!! Totally recommend and the crew will help with recommendations. Create your own or go with the classics either way you can't go wrong!!!"], ["My Go-to Place for Lunchtime Salad", 4.0, "October 7, 2014", "offthewalls", "Washington DC, District of Columbia", 93, 38, "They have a nice selection of pre-selected salads, in case you're feeling indecisive--or you can pick your own toppings and have them toss it for you. They're quick. They're friendly. They're fresh. Not exactly cheap, but they'll make as healthy (or un-) a salad as you want . . . to order."], ["We had mixed experiences between stores", 4.0, "August 5, 2014", "DougTMesa", "Mesa, Arizona", 205, 60, "The chopped salads are great and you can get them in a wrap to eat on the go. The steak and bluse cheese was my favorite. One store on 18th by our hotel had a lot of things out of stock on a Friday afternoon. We found out it was closed on Saturday, which might have been part of the...\n\n\nMore"], ["The Un-Salad Lover's Salad Shop", 4.0, "June 17, 2014", "Gerson S", "Washington DC, District of Columbia", 74, 45, "Let it be clear that I am not a salad lover. I cannot stand chasing clumps of wilting leaves around my plate. If I have to have a salad, I like one with substance, with crunch, that's easy to eat. My ideal salad is what Mediterraneans simply call \"salad\" - diced cucumber, tomato, onion, parley, oil and vinegar, maybe a...\n\n\nMore"], ["Good lunch spot", 3.0, "May 20, 2014", "offthewalls", "Washington DC, District of Columbia", 93, 38, "My go-to salad spot. Less expensive than the pay-by-the-pound places and the menu salads are great. You can also make your own custom salad as you'd expect, but the menu options are good and the combinations are creative."], ["Good Lunch", 4.0, "December 31, 2013", "offthewalls", "Washington DC, District of Columbia", 93, 38, "Good, quick chopped salad options for a quick lunch. Plenty of healthy options and about standard fare for a Chop't."], ["Super salads!", 4.0, "September 27, 2013", "FloridaFamilyofFive", "Viera, Florida, USA", 155, 70, "This is a concept that can only work in a large city: fast, fresh salads. I stumbled on this place while jogging and went back the next day. All fresh vegetables and salads made according to your specs while you wait. Very nice staff. Not gourmet but still very good. I will go back next time I am in town."]]], ["Devon and Blakely", [["Impressive array of well priced food", 4.0, "September 10, 2015", "Lesley D", "Gateshead", 114, 42, "After 6 hours of walking around monuments we decided to try to find somewhere reasonably priced to eat. Not easy in the heart of DC. Came across this restaurant/fast food outlet that served amazing smoked salmon and cream cheese sandwiches. Also ordered iced coffee which wasn't as nice, but it was cold and hit the spot. Service was good too."], ["Tasty Food", 4.0, "September 1, 2015", "Murtuza S", "Shoreview", 5, 2, "Excellent food and good service. It can get get very spendy for a lunch if you get a cookie, pop, and a sandwich - almost $17!"], ["Quick lunch stop", 3.0, "August 22, 2015", "reroh21", "New Egypt, New Jersey", 27, 6, "I honestly thought the food was ok, just kind of a normal deli to me. If you stop in you MUST try their rice crispy treats. We got the s'mores one and it was awesome."], ["Affordable healthy choices; soup, salad and more", 5.0, "May 17, 2015", "Rene K", "Philadelphia, Pennsylvania", 36, 8, "It's the wide variety of soups and chili that draws me in. I love the vegetarian lentil, the tomato bisque, and the lobster chowder. I usually get a salad too, thinking I'll save the soup for dinner because they close at 4:00PM. The salad bar is a model of efficiency. You point to what you want in one of the...\n\n\nMore"], ["Great place! 18 varieties of soup!!!", 5.0, "March 15, 2015", "Yulia_Yakoveleva", "Bora Bora, French Polynesia", 67, 40, "I will recommend this place for having a lunch! Delicious clams chowder!!! Very tasty salads, pies & burgers (DIY). I did not like plastic cup for my soup, all other things were really great! I will definitely come here again!"], ["Nice sandwich place...and more", 4.0, "January 6, 2015", "AshevilleTourists", "Asheville, NC", 101, 32, "We were just walking around and happened onto this place. We split a delicious chicken salad sandwich (with nuts, grapes...and other things), added a bag of chips and some delicious iced tea...and had a great lunch. We didn't want to eat too much since we had dinner planned for that evening. This was plenty...maybe even too much. The salads we...\n\n\nMore"], ["Great For Soup, Salad & Sandwich", 4.0, "September 26, 2014", "Wayne W", "South Windsor, Connecticut", 308, 206, "My wife and I were in the mood for a good sandwich and I love soup. This turned out to be the right place with many varieties of sandwiches, wraps, salads and 18 varieties of soups. The sandwiches were delicious and the pasta fagiole soup was good. We had desert too. There is outside dining and was a perfect day...\n\n\nMore"], ["Expensive and Buyer Beware but a good place to eat and quick also!", 4.0, "June 23, 2014", "jdreynoldsjr", "Arlington, Virginia", 310, 188, "First time here. I had lunch with 10 people from my class that had a meeting at the DOS. Lots of choices for salads, sandwiches, wraps and especially soups! My three issues with this place but still worth a weekly visit is the following:\n1). This place is expensive and if you are not careful with building your salad you...\n\n\nMore"], ["Awesome!", 5.0, "May 18, 2014", "Jcskinaz", null, 54, 27, "We stayed at the Sofitel across the street on 15th st, but didn't go into D & B until our last morning in DC. We were driving up to NYC and wanted to grab lunch for the drive, and this place hit the spot.\nVery friendly staff make you feel appreciated, which isn't a common experience these days in most...\n\n\nMore"]]], ["The Big Board", [["Good food and service", 5.0, "September 15, 2015", "PJ_Cummings", null, 4, 2, "The Big Board was recommended by a friend. Decided to try it when visiting DC with my family (party of 7, with kids) on a Sunday afternoon.\nBurgers were fantastic. Service was also great, even at a busy time.\nWould go again, no hesitation."], ["Good Burgers", 4.0, "July 3, 2015", "Dave R", "Salt Lake City, Utah", 32, 17, "This restaurant is just down the street from my client, so the location is very convenient for me for lunch. I had the blue cheese burger, and it was very good. I'll be back next week to tick off the other three burgers that sounded good to (mushroom, bacon, bbq)"], ["My Go-To Neighborhood Burger Joint", 4.0, "July 1, 2015", "33Tracy", "Washington DC, District of Columbia", 19, 5, "I'm always happy with my burgers here! The idea behind the restaurant is fun - the price of the beers on tap operate on a stock market concept and depending upon what people are ordering, the prices go up or down. I had a friend who moved away - and when she came back to visit we could have eaten...\n\n\nMore"], ["Average food, worse service", 2.0, "June 8, 2015", "Marylebone007", "Washington DC, District of Columbia", 13, 3, "No one in my party of 5 was impressed. I had a burger and it was only mediocre. It was not cooked to temperature appropriately nor was it garnished attentively. The fries were tasty, but they arrived from the kitchen at a temperature that was less than fresh from the deep fryer.\nThe real let-down, however, was the inattentive and...\n\n\nMore"], ["Great food", 5.0, "June 6, 2015", "Melinda F", null, 13, 3, "My cousin wanted his college graduation dinner celebration here. He goes there often and I know now why. We reserved the room upstairs for our party. The Hamburgers were amazing long with the sweet potatoes fries. Casual atmosphere and their prices won't break the bank."], ["Great bar", 4.0, "May 10, 2015", "Kevin A", "Columbus, Ohio", 58, 16, "This place is fashioned as a market driven beer place so supposedly the beer prices can vary based on demand. But the beers and the atmosphere are why you should go there. The bar tenders are on their game and the cross by 7 is a great cross between locals and young professionals--and a few older professionals like me and...\n\n\nMore"], ["Great Burgers!", 5.0, "April 17, 2015", "Ellie B", "Martha's Vineyard, Massachusetts", 228, 92, "We came here with friends and our teenaged grandson and everyone was happy! The burgers were GREAT! The 6 oz is probably okay if you aren't that hungry but the burger is so good, I'd recommend the 8 oz. Lots of toppings to choose from. The salmon burger was also excellent. They have Happy Hour until 7 which made the...\n\n\nMore"], ["What a Treat", 4.0, "March 13, 2015", "ssap01", "Washington DC, District of Columbia", 25, 21, "This is like a hidden Gem within the city. The burgers in this place are flavorful, juicy and well-seasoned. I had the Memphis Blues and my dinner companion opted for the Big Apple and we shared a large order of fries. The service was great also. They displayed great team work because everyone worked together. If you are looking for...\n\n\nMore"], ["Great Burgers!", 4.0, "October 2, 2014", "Jennifer N", null, 38, 16, "This is great place to grab a juicy burger. I like the Jalisco Frito chicken sandwich. It's delicious and spicy. The sweet potato fries are to die for. The place is kind of a dive but don't let that scare you away."], ["Better than most", 5.0, "September 18, 2014", "Erik M", null, 12, 1, "Walked nearly a mile because I was trying to find a good burger and beer. I was not disappointed. Not sure why some reviews rate the burgers low or average. The burger I ordered was better than most. The selection of beer/ale was also very good...couple that with friendly service and I would say this is a great place to...\n\n\nMore"], ["Best Burger & Beer in DC", 4.0, "September 5, 2014", "Brett L", null, 3, 2, "My family and I were only off the plane from Australia an hour when a nice man by the name of Jose thought we looked lost and suggested the The Bill Board. We walked several blocks and the place was full but after a quick beer at the bar one if the owners Eric seated us. The meal and service...\n\n\nMore"], ["Awesome", 5.0, "September 4, 2014", "Traci L", null, 6, 6, "Great beer and delicious burgers. Well worth a visit - great atmosphere inside and out. Loved it. Couldn't Fault the service even though they were really busy. A great feed"], ["Three stars for friendliness", 3.0, "August 9, 2014", "Didi L", "Annapolis, Maryland", 30, 10, "Two stars for food, unfortunately. These are the nicest people! The burgers are good, at medium well, not at all dry. Downhill from there: The onion shreds were greasy and not hot, tasted like they were warmed up from lunch. Not good. The fried pickles were greasy and so thin they didn't, not one of them, taste like pickles. (I...\n\n\nMore"], ["Great Burgers", 4.0, "August 5, 2014", "Steve H", "Miami, Florida", 177, 50, "Service was slow but the food and the beer made up for it. Be sure to have a burger if you go. They are great. Nice selection of beer. Was there at Happy Hour and all drafts were $5.50."], ["Bacon!", 3.0, "May 24, 2014", "Puppet G", "Ottawa, Canada", 12, 2, "Not the most exciting patty but really good bacon. I also really enjoyed the fries. But the other sides were lacking. Check out my full review here! http://thegluttonouspuppet.wordpress.com/2014/05/24/ode-to-d-c-part-2/"], ["haphazard service, but it's just a drinking spot anyway", 3.0, "January 2, 2014", "jg325", "WashingtonDC", 489, 320, "My parents and I originally went to The Big Board for drinks and to try out their \"Foie La La\" offerings in December. (With the Foie La La promotion, there were seven different restaurants on H St. having seasonal foie gras dishes in somewhat of a competition, and this was the main reason we came that night. Since my parents...\n\n\nMore"], ["Adequate burger, convenience only", 3.0, "October 11, 2013", "CJunker", "Washington DC, District of Columbia", 58, 10, "Nothing special but if a beer and a burger is what you want this is good enough. Good beer selection"], ["Great food!", 4.0, "October 6, 2013", "LaurieSC54258", "Greenville, South Carolina", 22, 22, "This place is in what I read was described as an \"emerging\" neighborhood. Definitely felt more neighborhood-y than touristy. Cool TATOO parlor across the street. Food was really good. All four of us had a burger of some sort and an order of the season sweet potato fries. Good (and interesting) beer menu. Atmosphere cool - it is something of...\n\n\nMore"], ["Support Local", 5.0, "August 29, 2013", "shihtzumomof3", "Oklahoma City, Oklahoma", 15, 10, "Met new friends here for the first time and had a great experience with our party of five. Staff was very friendly, knowledgable, and accommodating. Very pleased with the salmon salad and the strawberry banana bread pudding was fabulous. So an order of fries is $5 but I never mind paying for quality. Glad to know this great local spot...\n\n\nMore"], ["Great burger", 5.0, "April 15, 2013", "PJ C", "Virginia Beach, Virginia", 2, 0, "Was referred to here by a friend. Was in DC with the family (4 kids: 13yrs - 20 months) and a friend.\nStaff:\nWe were quickly accomodated by our waitress (Melanie) who, despite the Sunday crowd, sat us at two, clean tables she arranged to fit our large group. Very attentive and helpful. Thanks, Melanie.\nAmbiance.\nLively and diverse crowd....\n\n\nMore"], ["Tasty Burgers", 4.0, "April 4, 2013", "Kristopher M", "Chicago, Illinois", 32, 38, "Went with my 8 yr old son on a recommendation. Food was great, very chill place -- we sat afterwards and played cards while we had a few beers and cokes. Staff was very nice, other diners even better. Beer selection was good. We had a basic cheeseburger (freakin awesome) and the \"Ciao Bella\" which had a really good flavor,...\n\n\nMore"], ["Fluctuating Beer Prices!", 4.0, "November 1, 2012", "TandemBikeRider", "Marietta, GA", 196, 58, "So the premise here is that the beer prices fluctuate by demand. The slower selling beers drop in price while the hot beers go up. A fun concept, but the prices never changed the whole time I was there.\nThere are six beers a day on the big board. My burger was good and the sweet potato fries were excellent....\n\n\nMore"], ["Amazing burgers", 5.0, "August 24, 2012", "Lemon B", "Tampa, Florida", 4, 0, "I came here with my childhood friends. The waiters were nice and funny and the service was great. My friends and i made are own burgers. Omg it was the BEST BURGER in the world."], ["Delicious Burgers", 4.0, "August 1, 2012", "AuntieMRA", "McLean, Virginia", 59, 21, "A group of four families tried the Big Board. We all ordered burgers and fries. Everyone agreed that the burgers were cooked well and had a great flavor. My teenage son and I tried the spicy Great Chicago Fire burger. The server suggested we put the sauce on the side and I'm glad we did. It had a real heat...\n\n\nMore"], ["Neighborhood hangout", 2.0, "May 18, 2012", "reddheaddc", "Washington, DC", 20, 1, "Burgers and fries are decent but service all three times we've been there has been horrible. Be prepared to wait over 1/2 hour for a simple burger. Longest we waited for two burgers was 40 minutes -- and this was when the place wasn't even full at 6:30 pm. Not sure of their business model but it's not winning any...\n\n\nMore"], ["Not worth the money", 2.0, "May 6, 2012", "follybeachsc", "Folly Beach, South Carolina", 1, 0, "Great concept in an up and coming DC area. Fried onions were on par with Capital Grille...the second time around. The first time we got them they were cold. Burger was small for a 10 dollar burger. The beer selection was good and it is really neat to watch the beer that you like go up or even better than...\n\n\nMore"]]], ["Jetties Something Sweet", [["No more bakery", 3.0, "August 31, 2015", "286solotraveler", "Washington", 41, 4, "Jetties used to have a bakery here, as well as sandwiches and housemade ice cream. Alas, the bakery is gone. The sandwiches are Ok and the ice cream is still first-class."], ["Thanksgiving. Sandwich.", 5.0, "February 18, 2015", "thecapitaltraveler", "Washington DC, District of Columbia", 58, 13, "After trying 5 crowded area restaurants, we stumbled across Jetties before a concert at the National Cathedral. All 3 of us ordered the Thanksgiving sandwich. It was seriously fantastic. Service was quick and very friendly. Little seating, but we snagged it."], ["Amazing sandwiches and Sweets!", 5.0, "March 28, 2014", "Jo Ellen N", null, 16, 2, "Jetties has a amazing sandwich called the nobadeer! It is like eating Thanksgiving dinner in a sandwich. It is Roasted turkey and stuffing with cranberry sauce and mayonnaise on sourdough! I have not tired any other because we only visit DC about twice a year. Something sweet that is in the same place has wonderful cupcakes and cakes! We always...\n\n\nMore"], ["Let Us Eat Cake", 5.0, "February 23, 2014", "pebblesandshush", "Alberta", 35, 25, "We recently spent two months in Washington visiting family. I know, I know visitors and fish smell bad after 3 days. But anyway, Jetties Something Sweet quickly became a favourite. The sandwiches are outstanding. They are fresh and well made. But the cake! They have a rotating list of cakes that change over the week. What ever you get, at...\n\n\nMore"], ["Perfect for a quick lunch", 5.0, "August 16, 2013", "Kmonson01", "Charlotte, North Carolina", 32, 7, "We didn't get to try out the amazing-looking cupcakes, but were very pleased with sandwiches for a quick lunch. Great kids menu and some outdoor benches. Limited indoor seating, so on a bad weather day, should be limited to take out."], ["Mediocre (sweets review)", 3.0, "July 5, 2013", "g-raterr", null, 166, 104, "Pros: Has fresh baked sweets. Ice cream can be put in a freshly made cone.\nCons: Minimal variety in ice cream flavors and sweets choices.\nSummary: I did not try their salads or sandwiches but this place is not worth going out of your way for if you want something sweet. If you are already nearby it's good enough to...\n\n\nMore"], ["Some of the best sandwiches in town", 5.0, "July 5, 2013", "B G", "Washington, DC", 74, 32, "the Thanksgiving sandwich called the Nobadeer (turkey, stuffing, cranberry) is wonderful. I get it at least once a month."], ["Best sandwiches in area", 5.0, "June 6, 2013", "Alice P", "Washington, District of Columbia, United States", 66, 34, "So if you're in the neighborhood -- say touring the national cathedral -- and it's a beautiful day. Get a picnic lunch from something sweet/jetties. Huge sandwiches and salads, limited sit down space. Great cupcakes. Reasonable kids menu. Much better than fast food."], ["My favorite cupcake", 4.0, "April 8, 2013", "maryann_and_jay", "Egg Harbor City, New Jersey", 22, 6, "Stopped here for a little 'something sweet' after lunch. Hubby did not like the brownie but my pink lemonade cupcake was my favorite cupcake ever!"], ["Worth a stop", 5.0, "January 3, 2013", "bikinchris", "Brousssard, LA", 78, 19, "We decided to stop by after touring the National Cathederal (again). Well, it's not a fancy place to eat. The selection is small, but you have the option of designing your own, so that's not a problem. I had the one with turkey, stuffing, cranberry spread and mayo. I really enjoyed it. My wife made a custom tuna and she...\n\n\nMore"], ["Charming retro space, food is average", 3.0, "November 19, 2012", "TheNorsk", "New York, NY", 61, 43, "We grabbed a quick lunch here with friends who live in the neighborhood on a Saturday afternoon. We had just spent some time touring the National Cathedral.\nSandwich choices are limited, and I was not impressed with the turkey sandwich I shared with my wife. Desserts definitely had eye appeal, but neither the vanila cake nor the cookie we sampled...\n\n\nMore"], ["Something Great", 5.0, "August 29, 2012", "Nick N", "Washington DC, District of Columbia", 11, 1, "We eat regularly at this sandwich/ice cream/cupcake emporium. The generous sandwiches are made with fresh ingredients. The cupcakes and baked goods are top notch."]]], ["The Greene Turtle", [["Good sports bar", 4.0, "October 14, 2015", "BuckiNut76", "Columbus Ohio", 11, 4, "Really enjoyed this sports bar. They have nice choices of beer on draft, plus they brew their own that is pretty good. The menu was reasonably priced, and the bartenders were fun to chat with."], ["Great place for food & drinks before, during, or after a game.", 5.0, "October 7, 2015", "Paul N", "Washington DC, District of Columbia", 3, 0, "The atmosphere is electric at game time - Wizards or Capitals. Staff is friendly and part of the party. Of course, they have some of my Capitals artwork behind the bar, but that notwithstanding, it's a great place to be in DC!"], ["Great Sports Bar", 4.0, "October 1, 2015", "Jane B", null, 32, 10, "Wow! If you want sports, and lots of sports, this is the place to go. They show every football game, fans are loud and boisterous in support of their team, and you really get into the vibe.\nAnd yes, the food is quite good, a good value, and the staff are good as well. It is well run, and they...\n\n\nMore"], ["Convenient, inexpensive place to eat in downtown DC", 4.0, "August 12, 2015", "HunkyJoe", "Daytona Beach, Florida", 141, 63, "My daughter, grandson and I were visiting DC for the Police Memorial Services this year.\nWe stopped for dinner and the restaurant was filled. We were waited on pretty quickly and had a decent meal. By the time we left, the line was out of the door, mostly visiting police officers from all over the US.\nThe food was typical...\n\n\nMore"], ["4th of July weekend", 4.0, "July 2, 2015", "buddiespac13", "Tualatin, Oregon", 29, 7, "Over all good. This is a sports bar type at the Verizon Center. Burgers and such. Had to eat there because my wife love's turtles."], ["Amazing food and beer", 5.0, "June 2, 2015", "Michael S", "Luton, United Kingdom", 24, 6, "Had the PB&J Bacon Burger.....amazing!! The food was outstanding and the beer was great too. Every table has it's own TV to watch sports on."], ["Dinner with the group", 5.0, "May 25, 2015", "Lou1941", "Winston Salem, North Carolina", 22, 12, "Considering we were a large group, service was extremely efficient and quick. Food was the usual sports bar fare but was done well."], ["The Slow Turtle", 3.0, "May 21, 2015", "Bruce H", "Roseville, California", 82, 25, "Walked by the place during lunch hour so thought we'd give it a try. Sat at the table for about 5 minutes before the waitress showed up. Drinks too awhile too, but the food came within a reasonable time."], ["Great bar and grill in DC", 5.0, "May 18, 2015", "Hockeymom9093", null, 6, 2, "Staff was excellent. Went during National Police week (They are close to Police Memorial) and they handled the crowds wonderfully. Liked it well enough that we went back a second time."], ["Sports bar", 3.0, "May 15, 2015", "simon g", null, 13, 6, "Food is what you'd expect.. Burgers fries etc. Good friendly staff with reasonable waiting time for food / drink."], ["Average sports bar", 3.0, "April 30, 2015", "SCOTTSROSE", "Ontario", 61, 44, "Basic decor, missing a large big screen TV for the major games. Not fancy, not rundown. Food was average. Basically this restaurant is just average in every way. A little disappointed considering they are in a great location, this bar would be hopping if they just kicked it up a notch."], ["Good food, nice place to rest when walking DC...", 4.0, "April 21, 2015", "Reneeandsean", "Mt Holly Springs, PA", 106, 32, "Viisited on 4/18/15 in the afternoon with a group of 10. We got seated quickly and our server was awesome. We did have a little wait, but not too bad. The food was good and the portions were huge. I would definitely go back!"], ["Lovely burgers!", 4.0, "April 13, 2015", "LindyLou854", "Plymouth, United Kingdom", 42, 18, "Visited here after watching the Wizards play. Decided it was better to have something to eat and let the Metro crowd disperse and we were glad we did. It was busy and full of atmosphere. We chose the burgers and they were absolutely delicious. Cooked to perfection and reasonably priced. Would definitely go again"], ["BEER!", 4.0, "April 10, 2015", "darkhelmet03", "Austin, Texas", 31, 11, "So the food was excellent; extensive menu with all the typical stuff. Although my wife had some crab cakes the she said were quite good. But the beer selection was a pleasant surprise. There were quite a few beers on tap which included a seasonal rotation of various brews. This is a great stop after a day of touristing in...\n\n\nMore"], ["Not bad, but not running back", 3.0, "April 6, 2015", "Christirdh", "Port washington, NY", 51, 23, "i will start by saying, we were a party of 12 that walked in...so we did have a larger party. We were able to sit right away, and they have a lot of televisions around, which was nice since the basketball game was coming on. This is typical sports bar food, wings, burgers, etc. they have a decent selection of...\n\n\nMore"], ["Average at best", 3.0, "April 2, 2015", "Jolanda D", "Jacksonville, North Carolina", 127, 48, "The food was nothing special and our waitress was nice but not attentive. I did like that you can go back and forth from the Washington Wizards game to the restaurant and there are loads of tvs playing including 13inch hdtvs on your table. I probably won't be visiting here again but honestly if I just had to I would...\n\n\nMore"], ["St. Patrick's Day at the Green Turtle", 4.0, "March 20, 2015", "Teacheragent101", "Hyattsville, Maryland", 92, 45, "This restaurant is in a great location, in walking distance of the Verizon Center and numerous museums and attractions. The prices are reasonable and there is a burger for almost every taste. I highly recommend the Crab Dip and the Bourbon Burger, although the menu is loaded with lots of good things to eat. For groups a private dining area...\n\n\nMore"], ["Nice sports bar, decent food", 4.0, "March 18, 2015", "Bill A", "Alexandria, Virginia", 28, 6, "I was looking for a good bar and grille for a solo dinner on a business trip. Airy sports bar ambience, good beer selection and great crab cakes! I would recommend it for a casual dinner."], ["Awsome place to eat !!!", 5.0, "February 22, 2015", "pleasantplace2010", "Lakeville,MA", 2, 3, "Loved the place, it's food, and the prices were reasonable. Loved how you could walk to the Verizon Center right from the restaurant inside. No complaints or dislikes. Check it out !!"], ["Soo nom nom!!!", 5.0, "February 14, 2015", "aliciafurrow", null, 33, 14, "Came to meet some friends for a beer and snack ate pretzels boneless wings and a cowboy burger! Food as outstanding ! Great bartender!! Loved it!"], ["Meh....", 2.0, "February 8, 2015", "lenflady", "Columbia, Maryland", 97, 36, "We chose this place due to proximity to the Verizon Center as we had a BB game that evening. When we arrived, we had to get the attention of the hostess to get on the seating list. Two seats opened in the bar area so she suggested that if we didn't want to wait - there were four parties ahead...\n\n\nMore"], ["Chain, great location", 4.0, "February 7, 2015", "Greg F", "Pittsburgh, Pennsylvania", 198, 85, "Its a great location. Large and lots of options to eat and drink. However you feel like you in a chain. Everything is just a little better than average but nothing special."], ["Great food! Great location!", 5.0, "January 15, 2015", "ChrisC300", "Anniston, Alabama", 36, 32, "I had dinner at The Greene Turtle one evening. The location was in a very convenient location. The staff was extremely friendly and attentive. The food was very delicious. Great job!!"], ["Excellent Grub Food!", 4.0, "November 19, 2014", "Yasi N", "San Diego, California, United States", 24, 4, "After touring DC with my girlfriend, we decided to stop at this place which is vegan-friendly. It's a sports pub with the walls covered in LCDs showing different baseball/footbal/basketball games. A lot of business-type people also tend to lunch here during their break. My favorite thing about the place, probably, is that it is very lively without being intrusive.\nThe...\n\n\nMore"], ["Nice Bar", 4.0, "November 3, 2014", "KCS1958", "Alexandria, Virginia", 107, 24, "Connected to Verizon Center, you can get to it after or during a show, and from the street side too. It's really nice, a bit loud sometimes, but it's a nice place."], ["Now I understand the title", 4.0, "October 4, 2014", "EIKOOC", "Boston,MA", 102, 40, "Good food but service was slow. Two 4-year olds were having a difficult time being good. The food was tasty."], ["Nice sports bar", 4.0, "September 30, 2014", "bigredCincinnati", "Cincinnati", 29, 10, "My guys (3 of them) were looking to take a break mid afternoon from site seeing at a sports bar. We ended up here by recommendation a taxi driver. We all had great food and the service was good. We ordered the crab dip and potato crab appetizers, had burgers, fish tacos, and a flat bread and beer. Everything was...\n\n\nMore"], ["Average Food and Average Service", 3.0, "September 27, 2014", "ManhattanVasya", "New York City, New York", 74, 48, "Stopped in for a late lunch. Wasn't impressed. Debated for along time between wings and a burger. May be I should have ordered the burger. The wings came cold and dry. Service was spotty. The server was friendly, but things either came out late or did not come out at all. Probably better at night after you've had a couple...\n\n\nMore"], ["A nice sports bar", 4.0, "September 20, 2014", "warrendcc", "Dania Beach, Florida", 12, 8, "I came to the Green Turtle Sports Bar & Grille in August 2014. I brought my daughter,her mom & my mom here. We had a nice time. The Green turtle has TV's at each booth! You can watch your fav.sports event! Plus the Green turtle is right in the middle of downtown Washington DC! My daughter said she likes the...\n\n\nMore"], ["Found by accident, glad we stopped", 4.0, "August 18, 2014", "Aschlo10", "Buffalo, New York", 12, 4, "Found this restaurant by accident after getting off the Metro and looking for a place to eat. Jay our waitress took great care of us!! Food was excellent, especially the crab dip. TVs adorn every nook and were tuned into every sport. My sports fanatic son requested we come back for his birthday!!"], ["Nothing Special and Poor Customer Service", 2.0, "August 13, 2014", "TBaytrippin", "Thunder Bay, Canada", 23, 24, "The server forgot salad dressing for salad, we were also not offered refills continuously. My pasta got cold fairly quickly. Probably would not dine here again. Server did not check in with us throughout our meal at all even when the restaurant was empty...no excuse for this."], ["Good Service and Good Food", 3.0, "August 8, 2014", "D C", "Oakton, Virginia", 14, 1, "First visit to the DC (F Street/Verizon Center) Green Turtle. The food (veggie wrap) was good. Likewise, the service was good."], ["Customer Service", 1.0, "July 29, 2014", "Joi J", "Durham, North Carolina", 8, 1, "I wish I could say more about the food but my co-workers and I were in town for a conference and noticed the menu in the window. The window was so dirty, they could not see the menu after I suggested the restaurant. When I asked a server if we could get one menu, I was told \"it's in the...\n\n\nMore"], ["Okay food. My service was bad", 3.0, "July 26, 2014", "Dominic9705", "Uniontown", 1, 0, "Server was not aware of menu. Was not visible and we constantly ran out of drinks. Crab cakes were just okay and steak was over cooked. Fried pickles and the strawberry lemonade were great! That was the best part of our visit."], ["Good sports bar", 4.0, "June 23, 2014", "Robert H", "Washington DC, District of Columbia", 82, 39, "Many, many big screens around the whole restaurant and bar. Great spot to watch all World Cup games, particularly the US games."], ["great service", 4.0, "June 17, 2014", "Curt H", "Happy Valley, Oregon, Usa", 28, 6, "food was really good but the service was fantastic. Our waitress was personable and professional. Nice place."], ["World Cup soccer", 4.0, "June 16, 2014", "Temple_Mike", "Plymouth Meeting, Pennsylvania", 69, 31, "on a business trip I stop by for a beer and had a great time watching the World Cup. Great beer prices good atmosphere I recommend it"], ["decent food, weak service, fair prices", 3.0, "June 14, 2014", "Matthew F", "Northbridge, Massachusetts", 88, 35, "Came here before going to a WNBA game, 5:45 pm, weeknight. Food was pretty good, and the pricing was certainly fair. The service was .. perfunctory: covered all the bases, but, certainly not enthusiastic or energetic or all that interested. I paid cash, which seemed to be a challenge, since I was slightly shorted when my change was returned. I...\n\n\nMore"], ["Join Greene Turtle Rewards and save....", 4.0, "June 6, 2014", "72Ang069", "Coffs Harbour, Australia", 59, 18, "Fried pickle with ranch dressing is a nice snack if you like pickles. Good service and nice meals while you wait for your flight."], ["Very good food and Terrific bartenders", 4.0, "May 28, 2014", "MadDog17", "Richmond, Virginia", 18, 5, "A group of us met here for drinks and snacks/meals and we were all pleased with the quality and variety of the food. The chicken tenders are wonderful and they are served with sauces of your choice (big selection). My husband was quite pleased with his wings. The drinks are quite good and the beer selection is as well. The...\n\n\nMore"], ["Superb customer service", 4.0, "May 21, 2014", "dyann66", "London, United Kingdom", 100, 42, "We called in here on a whim to escape a downpour and needing an early evening meal. The young lady who greeted us was delightful, as was our server (Kevan?). Nothing was too much trouble for him and we appreciated his friendly, efficient and courteous approach. At 6 pm it was fairly quiet which suited us fine. The food was...\n\n\nMore"], ["Wicked Good staff", 4.0, "May 19, 2014", "CherylBoston", "Boston, Massachusetts", 108, 44, "While in DC for an event, stopped in here and the staff was friendly, funny, and couldn't do enough to make sure our visit to DC was welcoming. The bartender, Lynn, was efficient, excellent memory, and had fun meeting her customers. The manager, Joe, couldn't do enough for everyone. One night an event was postponed due to sever thunderstorms, the...\n\n\nMore"], ["Well run restaurant", 4.0, "May 11, 2014", "Mike S", "Lampe, Missouri, United States", 35, 14, "The staff was well trained. They were very attentive and the food was good. The setting was relaxed as expected. The staff had a good sense of humor."], ["Better than Expected", 4.0, "April 22, 2014", "Navarath", "Binghamton, New York, USA", 106, 54, "This place can get very busy before an event at the Verizon Center, so check the schedule. The restaurant looks like an applebees\\TGIFridays type place on the inside. The menu was small but had a good variety. The food quality was very very good. I was pleasantly surprised and would definitely go there again. Seems like a great place for...\n\n\nMore"], ["Maryland Crab Cakes were just alright!", 3.0, "April 18, 2014", "Fal L", "Atlanta, Georgia", 66, 27, "I ate at the Greene Turtle at BWI Airport yesterday and it was just okay. Nothing to write home about. My drink had a bug in it, which they replaced. The crab cakes tasted like the Atlantic Ocean, while the fries were the ends of the potato, not actual fries. I would only recommend this place because it is fast...\n\n\nMore"], ["I feel like this place is only open because it's connected to the Verizon Center!", 3.0, "March 16, 2014", "JBHatfield", "Falls Church, Virginia", 182, 58, "I feel like this place is only open because it's connected to the Verizon Center, which is why I ate here. Our server was friendly and the food was ok. The atmosphere was ok. The bathrooms were dirty both the men and women's. I probably will choose another area restaurant next time I attend an event in the area."], ["Awesome food, awesome atmosphere", 5.0, "March 12, 2014", "Breezer2535", "Simcoe, Canada", 9, 6, "Visited here prior to going to a Capitals game. The location was excellent being attached the Verizon Center. The service was excellent even though the place became extremely busy before the game. The food was excellent and had great flavour! Definitely a place to go before an event at Verizon Center."], ["Good casual lunch spot", 3.0, "February 1, 2014", "handpickd", "Annapolis", 197, 135, "I regularly eat at the Greene Turtle for lunch. This is a casual eatery and bar with sandwiches, salads and a few full meals. Lots of drinks and appetizers. Since it is located right next to the Verizon Center, it gets crowded right before and after events there. Most of the time, lunch service is ok. But if they have...\n\n\nMore"], ["For Younger Crowd", 3.0, "January 17, 2014", "GrandeSanJuan", "San Juan", 215, 47, "Looking for a sports bar to watch the football play-offs I was sent to this place. It is loud with pretty uncomfortable stools and looks sort of run down. Nothing wrong with any of that for a young crowd and I would have loved the place some years back. But now older, I did not particularly like it and maybe...\n\n\nMore"], ["Chicken Tenders", 4.0, "December 31, 2013", "pillowandfork", "Reston, Virginia", 201, 59, "Chicken tenders are a standout on the pub food menu. Bloody Mary's at the bar are tall glasses at the table rocks glasses. Either way ask for the rim with Old Bay."], ["For a sports bar, it's very good. Exceeds expectations.", 4.0, "November 23, 2013", "Advisor58", null, 77, 56, "Visited the Green Turtle with two coworkers while in town for business; we came for Monday night football, and ended up staying the entire game. Bottom line, if you are expecting a sports bar, the venue will likely exceed your expectations (or at least meet them). There are a lot of reviews claiming that there is better food in DC;...\n\n\nMore"], ["Great Time!", 4.0, "October 26, 2013", "MsCarolinaBella", null, 26, 14, "After eating (expensive) small plates and (expensive) drinks at a restaurant around the corner my cousin mentioned there was a Green Turtle near by...I was excited to check this bar out after learning the history and how it got started! It was a hockey game night so it was packed with local fans however we wanted to watch our local...\n\n\nMore"], ["Unfortunately, our waitress spoiled our visit.", 1.0, "September 22, 2013", "Iris981", "Morley, Michigan", 121, 59, "We were seated and waited 15 minutes before our waitress arrived to take our drink order, then waited another 15 minutes until she brought our waters. She was going to walk away without taking our order and seeing how the timing had been so far we asked to order right away. Almost 30 minutes later a separate server brought our...\n\n\nMore"], ["Best attribute was the service", 3.0, "September 12, 2013", "w0rkt0travel", "Dairyland, USA", 74, 60, "Food was decent, atmosphere was decent and the service was fantastic. Super friendly waitress, who was efficient helpful and just plain good."], ["not surprised at how it was", 2.0, "September 12, 2013", "GingerSfromMD", "Odenton, Maryland", 121, 50, "So, it's concert night and upon arrival at the concert venue, I know there's a Green Turtle to stop in and have a quick bite to eat. Me, my adult daughter and friend were seated by our server. We order 3 chilled Patrol SIlver shots, 3 waters with lemon and 2 unsweetened iced teas. We get 2 waters no lemon,...\n\n\nMore"], ["never got served", 1.0, "September 9, 2013", "WVUMary", "Ashburn", 11, 9, "we thought this would be a place where we could have dinner prior to seeing a show across the street from the Shakespeare Theater. We walked in and the girl who appeared to be the hostess had no idea how to seat people. She got someone else and we were seated.Several minutes later another family was seated next to us,...\n\n\nMore"], ["Good time", 4.0, "September 3, 2013", "maryann_and_jay", "Egg Harbor City, New Jersey", 22, 6, "Two kids and three adults ate here for lunch. We all enjoyed it and would definitely go back again. Staff was extremely friendly."], ["Great meal for the price!", 5.0, "August 15, 2013", "Amy-Jo W", "Fayetteville, North Carolina, United States", 6, 5, "While walking down the street, we saw a sign for a lunch deal for $6.99. In DC, you can't beat that price! We definitely had to check it out. We got half a sandwich and a yummy salad for only $7.99. The service was great. Everyone was friendly. Clientele appeared to be a mix of locals and tourists. The food,...\n\n\nMore"], ["Good food", 4.0, "July 17, 2013", "mousala", "Atlanta, Georgia", 3, 0, "Ate at The Greene Turtle for the first time on a recent family trip to DC. Loved it! Good food...good prices. Will definitely eat the again on our next visit to DC."], ["Good food...", 3.0, "July 11, 2013", "KNM2014", "Weatherly, Pennsylvania", 6, 1, "I had always wanted to visit a Greene Turtle and seized the opportunity while visiting DC this summer. Upon entering the restaurant it was unclear if they were even seating people - no one at the hostess station or a sign directing us anywhere. After a few minutes of looking around cluelessly with no help a gentleman, who I assumed...\n\n\nMore"], ["Awesome food!", 4.0, "July 8, 2013", "MamaPearl", null, 49, 21, "This sports bar/restaurant was an awesome place. The food was exceptionally good and the prices very reasonable! Just don't be in a hurry as the service was horribly slow!"], ["Great food, service was terrible.", 3.0, "July 8, 2013", "Wildjamers", "Virginia Beach, Virginia", 10, 2, "I went in this restaurant with some friends and we walked in and were seated immediately. So we sat down and was passed by multiple waiters who did nothing but just stare at us and walked off. Finally after being in here for 10 minutes we had a waiter give us the \"just a minute\" finger and walked off and...\n\n\nMore"], ["Great food, Poor Service", 3.0, "July 2, 2013", "Darci T", "Bridgeville, Pennsylvania", 8, 1, "We enjoyed the food here but unfortunately our server gave us poor service she only checked on us once throughout the whole entire meal and I asked for a side salad and it was brought with my meal?? This is sort of strange so I had to eat my main meal and my salad at the same time. !! Luckily...\n\n\nMore"], ["Average bar/pub", 3.0, "July 1, 2013", "JajulVA", "Salem, VA", 18, 6, "The atmosphere was really good considering we went with children. It did have a \"bar\" crowd at that time and which made for a very nice dining experience.\nThe appetizers were delightful and enjoyed by all (Fried Pickles and Buffalo Chicken dip) - I would encourage others to try them! They brought the kids food out before the adults which...\n\n\nMore"], ["Manners Amongst Madness", 5.0, "June 30, 2013", "Lucinda D", "Falls Church, Virginia, United States", 24, 8, "I arrived early for a concert at the Verizon Center and it was so extremely hot out that I was just looking for a cool place to pass the time and get something to drink. The place was a madhouse but I was quickly given admittance (as I was not looking for dinner or a table) and after ordering a...\n\n\nMore"], ["A nice sports bar", 3.0, "May 27, 2013", "buddabella", "Racine, Wisconsin", 28, 17, "The restaurant is great for those who like sports with the booths having televisions turned to sports channels. It offered both inside and outdoors dining, which is nice.\nThe night that we picked to go was not too busy so we were able to get seated right away and received our food promptly.\nThe server did not accurately take our...\n\n\nMore"], ["Typical Sports Bar", 4.0, "May 9, 2013", "Keith M", "Washington DC, District of Columbia", 1, 0, "Food is pretty standard and they have a great happy hour and game day specials. Can get pretty crowded during game days, but the best part is you can enter the Arena from the restaurant to avoid line entrance outside. Burgers are great, so is crabby melt, make sure you get the tall domestic beer specials! Service could be a...\n\n\nMore"], ["Nice Sports Bar!", 4.0, "May 7, 2013", "DB2499", null, 21, 5, "The Turtle is located in the Verizon Center. Nice atmosphere reasonably priced drinks and food. Next time in DC I will definitely head back."], ["I love the logo!", 3.0, "April 25, 2013", "Jurassika", "Casco, Maine", 115, 54, "The food was your average pub fare. Good, but nothing outstanding or above par. The service, on the other hand, was outstanding. They were helpful, attentive, and knew what was going on! Great service is hard to find, but not at this Green Turtle. Someone has to fix the smell in the hallway going to the bathroom though. Ugg times...\n\n\nMore"], ["Average pubfare, nothing special", 3.0, "April 12, 2013", "Melissa H", "Indianapolis, Indiana", 218, 73, "We went here for dinner because it is directly across the street from the Shakespeare Theatre Company. The food is pretty good, a bit pricey, and they have a good selection of beers on tap. This is the only Greene Turtle I've been too, so I can't compare it to others. But it's safe to say it's pretty average all...\n\n\nMore"], ["The worst Greene Turtle around.", 2.0, "February 17, 2013", "Brine6415", "Warrenton, Virginia", 30, 43, "I've been eating at various Greene Turtle restaurants in this area for the last 20 years and this experience was so bad I felt writing this review was necessary. To put it into context my wife, 3 year old and I had just been to the \"Disney on Ice\" show at the Verizon Center and were trying to grab a...\n\n\nMore"], ["Family friendly and good food", 4.0, "January 4, 2013", "EastCoastCanada", "East Coast Canada", 155, 99, "We had just finished a busy day of sight seeing in DC and were looking for anywhere to grab a bite. Stopped here and it was great. Food was tasty. I had the crab Mac and cheese with side garden salad and loved it. Others in the family found the food tasty too. We were seated right away and the...\n\n\nMore"], ["Very Average, Not Worth the Money !", 3.0, "January 4, 2013", "Mike Y", "Cape Town Central, South Africa", 61, 29, "The Green Turtle has so many TV screens showing all the different re-plays of all the recent sports games, that I didn't know where to look. The place was dead when we visited in Jan. The manu is large and there is great choice, but the food wasn't great for what we paid. AVOID THE BURGERS, the one we had...\n\n\nMore"], ["Good place for a bite at the Verizon Center", 4.0, "December 30, 2012", "luv2ride", "Maryland", 62, 12, "Since this Greene Turtle is attached by the shell to the Verizon Center, it is a great option for a quick(ish) pre-event meal.\nWe often go to one of the growing number of Greene Turtles in Maryland, and this location keeps up the same standard of good, reasonably priced food, consistently prepared.\nThe typical sports bar food - wings, burgers,...\n\n\nMore"], ["Sports Bar connected to the Verizon Center", 3.0, "November 23, 2012", "GCheek", "Stuttgart, Germany", 29, 15, "I visited prior to a Georgetown basketball game and I enjoyed my experience. The food was much better than the average sports bar. Very good cesar salad I like the booth's equiped with small flat screen's and hooked up to all the sports networks. I like the convience of walking from the turtle directly into the game."], ["Typical Sports Bar", 3.0, "November 10, 2012", "Qmis", "Boston, MA", 112, 51, "My colleagues for some reason really like having lunch on this place. I however, do not look forward to eating here.\nThis is a typical, run of the mill, eatery that offers a never-changing menu, and is a step above fast food with a lot of fried dishes. It has a sports bar kind of atmosphere with TVs everywhere. The...\n\n\nMore"], ["Avoid if possible", 1.0, "November 5, 2012", "GlobtrotterMom", "Virginia, USA", 19, 15, "My husband and I attempted to eat a light dinner before a horse show at the Verizon Center. When we entered, the restaurant was mostly empty, including the host/ess stand in front. A man standing nearby (identified himself as \"a friend\" of the manager), seeing us looking around for someone to seat us, offered to find us a table. After...\n\n\nMore"], ["Average sports bar in DC", 3.0, "October 18, 2012", "Nads82", "Falls Church, Va", 423, 110, "The food across all Green Turtles has improved in the last couple years. Still not much better than any other bar/restaurant at its price point. Friday's is about the same. I liked the TV in the booth. The place was empty. The service was good but not great. I came here for lunch and to watch some college football and...\n\n\nMore"], ["Decent Lunch", 3.0, "September 26, 2012", "ROCtraveler30", "Fort Collins, Colorado", 395, 187, "We were looking for some place close to the National Building Museum and stumbled on this Greene Turtle location about a block away. The generously-sized pulled pork sandwich and fish tacos were both tasty, and off the 2-for-$15 menu they were a good value for the city location. Service was prompt and friendly. Sunday lunch was fairly quiet here but...\n\n\nMore"], ["We saw a rat", 1.0, "September 10, 2012", "Phillip34", "Farragut, Tennessee", 8, 16, "I was with a friend watching the Steelers game and having dinner when we both saw a rat run across the floor behind the bar. He notified the bartender, but he was just told they would call pest control the next day."], ["cool bar scene", 4.0, "August 10, 2012", "Nicole L", "Exeter, Rhode Island", 21, 14, "We ate here on our last night of a three night stay in DC. My husband and I are in our 30's and were looking for a fun place to have dinner and a few beers. We stumbled upon the Greene Turtle which is located just next to the verizon center (I think it is actually part of the verizon...\n\n\nMore"], ["Good selection and family friendly.", 4.0, "August 8, 2012", "firegirl11", "Beaver Falls, Pennsylvania", 4, 1, "Even though it says sportsbar on the outside, it's very family friendly. There is a bar area, but a separate eating section in the front keeps you away from the college crowd. We had the pulled pork and the ham and cheese melt with green apples- both were excellent! The wings were very very hot (spicy!) but good. Beer is...\n\n\nMore"], ["I'm a caps fan what can I say!", 5.0, "July 2, 2012", "Robert H", "Nottingham, United Kingdom", 25, 16, "Great place to eat, staff are very helpful and friendly, I'd you can't get a ticket to a capitals hockey math this is definately the next best thing, with the locals and fans high fiving with strangers for a goal! Everyone was great one of the most welcoming places I have ever been! Would highly recommend the food an Sam...\n\n\nMore"], ["lively sports bar...ok food", 3.0, "June 21, 2012", "Uwe R", "London, United Kingdom", 20, 13, "good beer & atmosphere...food is ok nothing special"], ["Good quick lunch- service with a smile!", 4.0, "April 22, 2012", "Kristy L", "Sydney, Australia", 37, 23, "My husband and I ate lunch here last week, before heading off to the airport. We needed a quick lunch in order to get to the airport on time and we both had salads which we enjoyed. My chicken, cranberry, blue cheese and walnut salad was fresh and tasty! Our server was friendly and understood we were in a hurry....\n\n\nMore"], ["Average food but good little pit stop.", 3.0, "March 28, 2012", "Sarah T", "Greenville, North Carolina", 72, 48, "It's a sports bar. Chicken tenders were okay. Boyfriend got a burger that was just okay also. Fries weren't our favorites either. They were too thin to us for a sports bar. Good atmosphere though and looked like they had good specials for Happy Hour. There were families in there as well."], ["Solid lunch or pre-game spot", 3.0, "December 17, 2011", "KWLV", "Virginia", 102, 66, "Typical sports bar. Some interesting food selections...pretzels were good, choices for sliders. Very hectic prior to a hockey game."], ["Right next to the Verizon Center.", 4.0, "November 29, 2011", "zjxtinpusher", "Jacksonville, FL", 134, 99, "Great place to watch a game. Decent prices, and occasional drink specials. There were a few seedy types panhandling on the street. Get a booth with it's own television if you are watching a game for other than DC teams."], ["Exceptional Smiles for Service!!!!", 4.0, "November 16, 2011", "Alexa8776", "Houston, Texas", 337, 153, "No kidding - the service is packed with bright smiles and happy faces. What a novel idea!\nJust a nice easy lunch before hiitting the Newseum...exceptional Reuben and fries; husband had a pulled pork and loved it. Great menu selection overall.\nPerfect spot to run in before a show - perfect place to watch a game as TV screens are...\n\n\nMore"], ["This is a fantastic place to eat!", 5.0, "August 10, 2011", "kk729", "Confluence, Pennsylvania", 2, 0, "My boyfriend and I went here for lunch. We were greeted by a friendly staff and were sat immediately. Our waiter was friendly and patient, as it took me a little while to finally decide what I wanted. The food was brought out quickly and it was fantastic. We loved the atmosphere and the price was good. Definitely eat here...\n\n\nMore"], ["Food was ok, service was much better", 3.0, "August 10, 2011", "Jessica S", "Pittsburgh, Pennsylvania", 8, 4, "The green turtle has a relaxed atmosphere and the service was great. The server was very helpful in recommending dishes and knowing the menu. The food however was not the best and upset my stomach.\nIt is a good value because kids eat free with an adult meal (at least on the day we went.) I would try it again;...\n\n\nMore"], ["Excellent food at reasonable prices!", 5.0, "July 18, 2011", "Angelfish999", "North Carolina", 7, 0, "We stopped in for a late lunch on a Saturday and was able to be seated right away at an outdoor table that we requested. We were all pleasantly surprised at the variety of food offered on the menu as we were only expecting standard sports bar grub. I had the raspberry turkey flatbread sandwich and it was outstanding--don't let...\n\n\nMore"], ["Beware of Waiters Changing Tip Amounts!", 1.0, "April 27, 2010", "SuzeQFlorida", "Florida", 36, 27, "The food here is very forgetable, but what we won't forget is discovering that the waiter changed the tip from $4.80 to $24.80! Unfortunately, my husband didn't discover this until it was too late to do much about it. After reading the previous review where the customer had the same experience, I would caution people to check their credit card...\n\n\nMore"], ["don't go here", 1.0, "July 17, 2009", "kaykow", "Virginia", 13, 11, "A friend and I ate here on 7/16/2009. Food was mediocre. I got the chik-n-ranch which is a chicken sandwich with cheese, bacon, lettuce & tomato. It wasn't very good.\nOur bill was a little over $25.00 and was to be paid by credit card. When the waitress brought the form for the tip to be added to the bill,...\n\n\nMore"], ["this place is awesome. it's my FAVORITE place to eat. the food is fantastic and the atmosphere is awesome. sports...", 5.0, "July 12, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "this place is awesome. it's my FAVORITE place to eat. the food is fantastic and the atmosphere is awesome. sports, food, friends--what more can you want?? the service is great too!"], ["There are much better options", 2.0, "March 24, 2008", "ala117", "ala117", 1, 0, "The servers and bartenders were decent and very friendly, but the food was less that adequate: soggy wings and sub-par sandwiches. However, my main beef with the place was that the manager refused to even listen to requests to change television channels during the NCAA tourney. And this is a sports bar? Despite the fact that no one was watching...\n\n\nMore"]]], ["Potbelly", [["Really good sandwich", 4.0, "September 21, 2015", "KathrineChristian", "Fredericia", 94, 24, "If you are in the states, don´t cheat you self for a good sandwich in potbelly, fresh topping good bread, chocolate smoothies is really good.\nWe highly recommend this place and they have not seen us for the last time.\ncounting days to we are going to potbelly\nMayby open one in Denmark:)"], ["Very tasty sandwich, with perfect combinations.", 4.0, "September 6, 2015", "FDW87", "Sembach, Germany", 110, 50, "I visited this Potbelly's because it came free with the Big Bus tour. I'm glad that it did. I ordered a pulled pork sandwich which comes with coleslaw if you like it and while I'm not a fan of coleslaw, it was the perfect combination.\nThe free ticket comes with a sandwich, chips and a drink. I would definitely return...\n\n\nMore"], ["Blocks from Whitehouse and excellent price", 4.0, "September 4, 2015", "slowee08", "Vancouver, Canada", 138, 114, "This particular Potbelly does not serve breakfast sandwiches. Menu offerings included sandwiches, homemade soups, salads, and smoothies. I opted for a small Mediterranean sandwich with chicken on flat bread for $6.50 and it was large enough to share. The restaurant was clean at 11am."], ["Great location", 5.0, "September 2, 2015", "Ada478", "Bethesda, Maryland", 8, 0, "If you find yourself in the area visiting, this is one of the few places you can stop for a sandwich and return to sightseeing in no time."], ["Budget friendly option for lunch", 5.0, "August 19, 2015", "NorthernSpy", "New York City, New York", 52, 48, "This is near several pricey hotels just east of the White House and other attractions, so it offers a reasonable option for quick eats. Has outdoor seating on New York Ave. Staff is friendly. Finding the entrance door is a challenge since it is totally unmarked and around the corner from the outdoor seating and signage- not sure what they...\n\n\nMore"]]], ["Petworth Citizen", [["Nice & cozy", 4.0, "September 10, 2015", "Carolin W", "Darmstadt, Germany", 20, 2, "Me and my mother went here on our first night in DC for drinks and some small snacks. The food was good and the staff was really nice.\nWould definitely go again although it was a little pricey."], ["Great meal and super service", 5.0, "August 18, 2015", "Holly P", "Sartell, Minnesota, United States", 13, 10, "We stopped in on a Friday evening about 8:00 and were seated right away. Our server was very nice and attentive. He mis-heard my husband's drink order and quickly offered to fix it, but my hubby just drank what he'd brought by mistake (a Chutes & Flutes, which was good). I had the shrimp & grits (awesome, but you have...\n\n\nMore"], ["These bartenders know what's up", 5.0, "August 7, 2015", "Ana V", "Washington DC, District of Columbia", 21, 3, "Great place for fancy/quality drinks! I'd say it is one of the best bars in petworth, if not the best. The ambiance is also great to sip on a great old fashioned, that is seriously amazing. I've only had a few appetizers there, so I cannot comment on the food, just how great the drinks are. Good place for a...\n\n\nMore"], ["Dinner", 3.0, "July 11, 2015", "CaymanGreg", "Cayman Islands", 279, 93, "Staying locally and tried this place out. It is nice inside and we managed to wait for a table of four. The queso is amazing and highly recommend it. The remainder of the food was good. Service was friendly but a little off hand and limited knowledge of drinks available."], ["First Experience in Petworth", 4.0, "April 20, 2015", "Khyati D", "Washington DC, District of Columbia", 74, 30, "My husband and I took a friend here last night for his birthday and had a great overall experience. It was raining and a Sunday night so the place wasn't very packed. We wanted to get nearly every appetizer on the menu but ended up getting the mac and cheese, carnitas spring rolls, wings, and the beet salad as appetizers....\n\n\nMore"], ["Very Good , Good Bargain", 4.0, "February 8, 2015", "sjtam", "silver spring", 136, 148, "A freshly made daiquiri for $5? I'm in. Happy hour specials include decent pork taco, spicy chips- everything is cheap, divey but friendly, neighborhood feel, nothing to complain about here."], ["A neighbourhood gem - simple food with good atmosphere", 4.0, "January 31, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Had not been back since it first opened in 2013. In a cold windy winter night, I decided to return. If I had not mention in my last review that this place is child friendly, bear that in mind. OMG! There are babies and children at one and other table, so if you do not want to squeeze yourself in...\n\n\nMore"], ["An ideal bar.", 5.0, "December 30, 2014", "CaptainAwethume", "Hyattsville, Maryland", 262, 85, "I'd heard about this place through a source that's usually got some pretty corny recommendations, but this one turned out to be..well...not. I am rating this place as a bar, as I had no food. The menu, however, looked decent; and some of the food that I saw people around me eating, looked great. And I hear that it's as...\n\n\nMore"], ["Gastropub with an independent book store next door", 4.0, "November 16, 2014", "Krainone", "Fort Worth, Texas", 17, 3, "We stopped here our first night in DC for a bite to eat and a few cocktails. The pub is small and intimate, the food tasty, and the cocktails interesting. The best cocktail for me was the airmail, a mix of champagne, lime, and honey. I had the chorizo burger which had just enough spice to make it interesting without...\n\n\nMore"], ["Welcome Addition to the Neighborhood", 4.0, "April 5, 2014", "nsp19", "Washington DC, District of Columbia", 66, 31, "this relatively new bar and restaurant on Upshur St sells very good and reasonably priced food. There are many vegetarian options-we tried the butternut squash salad and roasted beet sandwich. the food is simple, but creative and deliciious. Service was excellent and staff very friendly. they have a nice reading room/meeting room in the back where one can browse for...\n\n\nMore"]]], ["Donburi", [["Love this place!!", 5.0, "September 22, 2015", "Sean M", "Shalimar, Florida", 23, 5, "Legit Japanese food, reasonably priced, small, sit at the counter as your dish is prepared..four in our group, I had the eel for the first time....I'm definitely a fan....fun place, good food and saki selection"], ["A regular", 5.0, "August 16, 2015", "Pandu_9", "Jakarta", 24, 8, "Donburi serves simple food with serious thoughts behind it which make them good. The concept of serving simple daily food (rice bowl) but it is clear what will be served has undergone much thought. Per June 2015 they slightly changed the menu and also starts serving alcoholic beverages."], ["My favorite secret restaurant", 5.0, "July 14, 2015", "Albert L", "Atlanta, Georgia", 97, 66, "I almost don't want to tell folks how good this place is, because I don't want to have to wait in line. This is on par with a \"good\" donburi in Asia, which is just phenomenal by American standards. It also has a relaxed, hipster vibe which is actually refreshing. You'll be distracted, and then blown away by the karaage...\n\n\nMore"], ["Downhome Japanese food at a nice price", 5.0, "July 9, 2015", "ferdtelvin", "Montreal, QC", 38, 20, "I loved this place. Very minimalist, with the hostess/cashier taking your order when you come in the door. If you’re lucky, like we were, you’ll get a seat at the long bar where you can see the cooks prepare your meal (there are no tables, so if you get a seat, you’ll get a seat at the bar). I ordered...\n\n\nMore"], ["So so", 3.0, "May 3, 2015", "Pam B", null, 7, 0, "My friend and I had dinner there this evening. The system they have up front was confusing they took our order at the front door other guests came in to order but they only had two menus. The dish my friend ordered they were out of. She then asked about other menu items but the guy had no idea about...\n\n\nMore"], ["Nice lunch", 4.0, "April 26, 2015", "annapolis123", "Annapolis, Maryland", 89, 31, "Had the mixed domburi - chicken and pork. Nicely assembled bowl with onions, pickles, seaweed and half cooked egg. Rice was well prepared. Staff was engaging and friendly. Free cold tea. No line when I was there. Good value at a little over 10 dollars with tip."], ["Limited menu but great care of food", 4.0, "April 4, 2015", "Girlseatworld", "Ellicott city, md", 88, 21, "They have limited menu but do their food right! Their katsudon, chicken and shrimp ones are equally dilicious with the right amount of sauce and eggs. And don't forget to order their salmon sashimi. They taste different from the sashimi at sushi place. BETTER. Buttery and not fishy at all. The only negative if you have to ask me will...\n\n\nMore"], ["Potentially good but really unorganized", 3.0, "March 15, 2015", "Matthew S", "Harrisonburg, Virginia", 41, 23, "Had dinner here on our last visit to DC on a whim. The atmosphere is cool and so are the chefs, however, there isn't really a system they work by with orders. Seems like a fun place, but it's really easy for them to lose orders. My girlfriend had to wait about 30 minutes for her food after I got...\n\n\nMore"], ["Best katsudon I've had outside Japan", 5.0, "March 11, 2015", "leb08", "Arlington, Virginia", 8, 5, "Donburi is one of those wonderful restaurants (like Pho 75) that keeps its menu narrow but does its thing amazingly well. It's slightly unfortunate that the place is so small, as I've had to grab a beer next door while waiting for a seat, but it's worth it for the atmosphere (and the entertainment of getting to watch the artists...\n\n\nMore"], ["Cozy, Intimate Rice Bar", 4.0, "February 8, 2015", "Derek F", null, 150, 57, "Cozy, intimate rice bar with a variety of rice bowl options. Try the delicious uni-sakedon if you like eel or the sakedon if you prefer just salmon sushi. Order and pay first before taking your seat. Bar seating is limited. Best for parties of one or two."], ["Awesome!", 4.0, "January 7, 2015", "Rachel N", "Washington DC, District of Columbia", 72, 20, "We had a great dinner at Donburi. It's super small, but fast. They're really efficient!\nI had the sakedon and would definitely recommend it! My boyfriend had the fried chicken one (can't remember the name) with the Donburi special sauce... Even better than mine! I will definitely be going back!"], ["Lunch", 2.0, "November 17, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "2nd time and maybe the last one. I stopped by to have lunch. I got the sakedon. It was just ok. Low quality fish.\nNice staff."], ["If you love real Japanese food stay clear...", 1.0, "October 24, 2014", "jtet2014", "New York City, New York", 13, 9, "So the good:\nThe place was very cute. Very sweet and pleasant attentive staff. Nice atmosphere- reminded me of little restaurants in Japan.\nThe Bad:\nSo, let me start off by saying, while I lived in Kobe, Japan I ate a TON of donburi. I loved this stuff. It was sweet and salty. Whatever was fried on top was light,...\n\n\nMore"], ["Good food, trendy locale", 4.0, "October 14, 2014", "Just M", "Vero Beach, Florida", 18, 6, "We had the unagidon, sakedon and an order of salmon sashimi. The food was good, the chefs were entertaining and the restaurant was quaint."], ["One of the better restaurants in AdMo", 4.0, "August 16, 2014", "iStefPayne", "Washington DC", 126, 58, "Adams Morgan has, in my opinion, only a handful of fairly good restaurants and this is another to add to the \"will go again\" list.\nI've only been once, ordered food to go at the entrance and waited there. I asked the hostess what the large jugs on the bar were, she said barley tea. Two minutes later I had...\n\n\nMore"], ["Japanese Comfort food at its best", 4.0, "August 10, 2014", "ac804", "VA", 18, 13, "Donburi is a small restaurant with counter seating. No tables, but that means that you get to watch the theater of your meal being prepped, cooked and finished.\nThe menu is small and focused, that way, you can decide what to have at the register, pay for your order and then take a seat and watch the show. Chef Jang...\n\n\nMore"], ["Pricey", 3.0, "July 20, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "There are several new and better quality restaurants opening in Adams Morgans.\nThis one is very recent, it's Japanese style. The menu is very limited. The base is a rice bowl and basically you can choose between meat (chicken or pork), eel or shrimp.\nWe had the unagi don (eel) and katsu don (pork). Both were good but we have...\n\n\nMore"], ["Love the concept", 4.0, "May 16, 2014", "Tunaidi", "Baltimore", 760, 280, "Great new restaurant. Love the concept -- it's simple and tasty.\nAt Donburi, it's order/pay first, then sit down and eat. Tip is optional, but be nice. Donburi offers a variety of rice bowls, which are a Japanese staple, but with a hint of Korean fusion. Prices are very reasonable, especially since some of the ingredients are naturally expensive. Loved...\n\n\nMore"], ["Excellent, Piping Hot, Donburi", 5.0, "January 10, 2014", "NorthWoodsWanderer", "Wisconsin", 43, 21, "Although not the dish you will always find at fancy, expensive Japanese restaurants, donburi is kind of 'home cooking' that is one of my favorite Japanese meals. I was pleased to discover this new little restaurant while visiting DC. If I lived here I'd be a regular. I think it has been open only a month or so. Like donburi,...\n\n\nMore"], ["Best donburi dishes in downtown Washington DC", 4.0, "January 2, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "There was no other donburi restaurant in downtown DC, when I found out this was going to open in Adams Morgan, I can't wait to try it. Donburi is a Japanese \"rice bowl dish\" consisting of fish, meat, vegetables or other ingredients simmered together and served over rice. It has sweet savory soya sauce.\nThen I heard that there was...\n\n\nMore"]]], ["Le Bon Cafe", [["Quaint Breakfast local", 4.0, "October 8, 2015", "Khopper4", null, 11, 2, "Good breakfast, quick service. Had the Belgian waffle with fruit, delicious, fresh. The Latte was made well."], ["close to the Capitol and very good!", 5.0, "September 29, 2015", "Jman1142", null, 4, 1, "We needed breakfast before listening to the Pope address congress. This was the only place we could find open and close by. I got the bacon egg and cheese on wheat sandwich. I was very happy with it."], ["Fresh, interesting combinations", 4.0, "September 15, 2015", "Sintita", "Michigan", 162, 88, "We ate here two days in a a row for an outdoor lunch. Good salads, soups and sandwiches. Generous portions for the price and coffee drinks, too. Something for everyone. It is self-order and pick-up with a mix of real and plastic plates and silverware, so not a place for sit down service."], ["Very tasty sandwiches close to the Capitol", 4.0, "September 10, 2015", "AdventurousTraveler6", "Laramie, Wyoming", 97, 77, "This little hole-in-the-wall cafe features delicious sandwiches with fresh and flavorful ingredients. The dining space is quite small, so keep your group size small too. The serving sizes also are definitely on the small size; if you're eating out a lot anyway this can be a blessing in disguise when you get back home to your scale."], ["Delicious and fresh food.", 4.0, "August 10, 2015", "Elizabeth B", "Gainesville, Virginia, United States", 2, 1, "After a fun outing to the Library of Congress reading and viewing exhibits, it is right across the street! The food is wonderful, and it is high class French cuisine.\nIf you want to get out of the old and dark library, this place is a must."], ["Great lunch", 4.0, "August 1, 2015", "NebraskaFan71", "Kansas City, Missouri", 188, 45, "We had a late lunch here on a Friday afternoon. The place still had a busy rush of people and all tables were full. We had salads and sandwiches and no one was disappointed. Very small seating area is about the only negative. Had a brownie for dessert and it was wonderful."], ["Charming", 5.0, "July 4, 2015", "patjhu", "Ann Arbor, Michigan", 11, 2, "Very charming little cafe. Delicious pastries. Blueberry scones are not dry! Conveniently on the way from the Folger Shakespeare Library to the Metro."], ["Welcome on a hot June morning", 3.0, "June 11, 2015", "MadCityGranny", null, 4, 2, "Great little cafe near the Capitol Building. Stopped in for an iced latte and wonderful quiche mid morning. Glad we found this place!"], ["Perfect morning cafe", 5.0, "June 4, 2015", "J R", null, 10, 3, "This gem is tucked into the Capitol Hill neighborhood, an authentic French cafe in menu and spirit. Delicious quiches, amazing orange scented french toast, wonderful pastries, great coffee. Don't pass it by."], ["Hit this Sunday morning before you hit the mall...", 4.0, "May 17, 2015", "JCHILLTOPPERS", null, 33, 23, "New, improved menu. priced right. near the mall. Very few Hill places feel authentic - Le bon cafe does. It's the right place to hit before you hit the mall...or i suppose you can get the starbucks down the block...you know, if you want to do something new while you are in DC....just saying.\ntry the fruit crisp."], ["Cute spot near the Capitol", 4.0, "May 3, 2015", "Kim A", null, 38, 20, "Went in search of breakfast on a Saturday morning before our tour of the Capitol. We were actually following GPS to a Starbucks when we saw this place. Oatmeal was great, as was the yogurt parfait and Americano. Kids ate their waffles in record time. We were in a hurry which was too bad or we probably would have enjoyed...\n\n\nMore"], ["Cozy caffe", 5.0, "April 1, 2015", "mmsswkm", "Shizuoka, Japan", 23, 11, "I liked the handmade scorn and muffins. It's just one block from the library of congress, so it is good and cozy to take a break or have a lunch when you visit to the library. This caffe serves a glass of water with a slice of lemon. I like that! The cafe is small. There are small numbers of...\n\n\nMore"], ["To. Die. For.", 4.0, "January 5, 2015", "tracysnell", "Schaghticoke, New York", 51, 24, "Coffee served in true European style, freshly-baked pastries of every imagineable variety prepared before your eyes...the tastiest soups and sandwiches served on the freshest bread imagineable. And while service was iffy in many other places, they were spot-on with us...I could eat here every single day."], ["Could I have Breakfast here every day?", 5.0, "December 4, 2014", "BeulahBehemoth", null, 19, 12, "Walking into this sweet little cafe is an instant treat - the smells of fresh baked goodies simply makes you float to the counter. One day I had their baked oatmeal loaded with baked apple slices and almond slivers. Delightful! The next morning was their Egg Strata which was a pillow of egg, cheese, with tastey morsels of sausage folded...\n\n\nMore"], ["Good coffee, Aweful food!!!", 1.0, "October 20, 2014", "Oldbackpack", "Vancouver", 118, 106, "We ate here after reading a recommendation on the 10 best things to do in DC. After visiting the Library of Congress eat here! What a mistake! I did notice the place next door was packed, and this place was empty and should have clued in right then. To their credit, the coffee was good, but we ordered some eggs...\n\n\nMore"], ["Fresh sandwiches and salads with good ingredients", 3.0, "August 31, 2014", "dharmamaster61", "Ancona, Italy", 123, 78, "Conveniently located near the Library of Congress and the Capitol, it is a small, bistro-like sandwich bar. American food but very good quality, fresh ingredients."], ["Nice setting, convenient location", 3.0, "August 22, 2014", "HotelCalifornians", "London, United Kingdom", 218, 111, "The latte seemed a little standard-issue, and the chocolate croissant was neither here nor there. But the glorious morning muffin was excellent, and the sidewalk tables are a pleasant place for a coffee break."], ["Okay", 3.0, "August 1, 2014", "T2a2014", "Washington DC, District of Columbia", 57, 28, "Resonable prices. Suppose to be French but it is more of a fast food frenchie stop with sandwiches, soups and salad. I would try the soup, skip the salad. Bread is good. Croissants are the same as grocery store."], ["Super size cappuccino!!", 5.0, "July 21, 2014", "aazonemaster", "Estes Park, Colorado", 50, 33, "We were looking for good cappuccino on the hill and found it here! Small place with good pastries and superb Illy cappuccino. The \"biggest\" surprise was that the large size was served in a cup the sixpence if an oatmeal bowl!!! Limited outdoor seating available!"], ["Lovely bread", 3.0, "July 10, 2014", "Victoria P", "Exmouth, England, United Kingdom", 58, 46, "We stumbled on this cafe by accident and ordered two of thier sandwiches. The tomatoes and mozzarella was nice but I wasn't expecting the pesto. My parter had the chicken sandwhich and it was delicious. Very fresh food. The staff were friendly enough but didn't tell us we had to get our drinks out of the fridge ourselves and weren't...\n\n\nMore"], ["Excellent Sandwich", 4.0, "June 19, 2014", "Judy H", "San Diego, California", 34, 15, "I happened upon Le Bon Cafe quite by accident, but was very pleased with the delicious mozzarella, basil, tomato, and pesto sandwich I had for lunch. It was served with a side of potato salad, which won't rock your world, but it was good. I did pick my order up at the counter, but noticed some orders were delivered to...\n\n\nMore"], ["Small, crowded but much better than a chain.", 3.0, "May 23, 2014", "Karl W", "Oaxaca, Mexico", 73, 35, "A small, neighborhood cafe on Capitol Hill, a few blocks from the Capitol. Decent lunch menu. Cute. Outdoor dining. No wait staff, counter order. For a quick lunch, fine."], ["All a little plain", 3.0, "May 7, 2014", "Sam R", "London, United Kingdom", 26, 5, "We stumbled across this French-inspired bistro cafe while wandering in DC. The breakfast options were simple though nothing to write home about. The decor was, however, pleasing, and the coffee came in a bowl. The service would have been warmer with a smile!"], ["Great lunch", 5.0, "April 2, 2014", "faxEvesham", "evesham", 31, 24, "Fresh sandwiches and good choice of fresh salads. Weather too cold to sit out so rather squashed because such a popular lunch spot."], ["Forgot order, microwaved Croque Monsieur", 1.0, "March 9, 2014", "MsfabulousNY", "New York City, New York", 39, 22, "Ordered breakfast with my husband, 20 minutes later, we inquired about it to find out no one had bothered to put in the order after they took our money.\nWas it so busy that it got lost in the crowd? No. There were no customers after us, so it's not like they were busy doing something else.\nI said I...\n\n\nMore"], ["Good food near the Capitol", 4.0, "February 17, 2014", "Parr0theads", "Lincoln, Nebraska", 87, 32, "There didn't appear to be many quick and cheap dining options on Capitol Hill, but our guide book pointed out Le Bon Cafe. I'm glad it did, we probably wouldn't have noticed this small cafe otherwise. It was crowded inside, our family of four had to eat at different tables. The menu was simple and not too fancy. The sandwiches...\n\n\nMore"], ["small, cozy with good sandwiches", 4.0, "January 26, 2014", "Sujata410", "Columbia, Maryland", 185, 64, "We there on a Sunday just before they closed so it wasn't crowded which a lot of people have complained about. Food was freshly prepared and tasty. No complaints."], ["Simple Easy Relaxed Fresh Tasty Efficient Friendly", 5.0, "December 13, 2013", "bb231", "Melbourne, Australia", 28, 16, "We stopped by to rest our weary feet and ended up with great home made food. Nothing too Posh , No Nouvelle Quisine, No Oily Burgers, Just great sandwitches our pannini soups and drinks etc. Free WiFi just easy and muchbetter than attraction Cafeterias. A welcome place to stop at."], ["Delicious", 5.0, "August 5, 2013", "jhop321", "Madison, Wisconsin", 1, 0, "Quaint little cafe for a nice affordable breakfast. The omelette was delicious and the streetside seating is picturesque. Best breakfast in my trip to DC."], ["Don't Go.....they're happier if you don't go....", 1.0, "July 2, 2013", "StephenM465", "Toronto", 229, 116, "The menu looked promising -- a small French cafe located in a charming side street, with lovely sidewalk seating. What could be wrong?\nLots.\nIt all boils down to management -- and their inability to carry it out. My wife's breakfast showed up. My daughters and mine didn't. We weren't the only ones. The waffle my wife had was undercooked...\n\n\nMore"], ["Good food", 3.0, "May 20, 2013", "ryan61562", "Hyattsville, Maryland", 101, 101, "The food is very fine. The only negatives are that it's always crowded, and for what you get it's a little expensive."], ["Not impressed", 2.0, "May 13, 2013", "Ange516", "Rome, Italy", 206, 87, "We came here for a quick lunch and had a salad, a wrap and coffee. The wrap and the salad were ok but did not impress me. I had ordered a cafe latte and what I got looked like dirty dish water - and almost tasted like it, I left it behind. It was disappointing also because when we entered,...\n\n\nMore"], ["cute cafe close to the capitol", 3.0, "April 7, 2013", "WisconsinDiver54937", "Fond du Lac, Wisconsin", 32, 13, "We had to wait a long time for our meal, and the food was just okay. The cafe is a cute French atmosphere (although the staff spoke Spanish)."], ["Nothing spectacular, but good location", 3.0, "March 25, 2013", "101jumper", "Kansas City, Missouri", 146, 103, "Touring the National Mall area in Washington, DC is exhausting. Lots of time in lines, and lots of walking. The Le Bon Cafe is located near the US Capitol building and its location is great for those needing a break from the demands of a vacation in DC. The food is average - nothing great, but still palatable. Seating is...\n\n\nMore"], ["This is a fine place for a very good lunch!", 4.0, "March 13, 2013", "jimsky", "richmond va", 15, 3, "I was walking up Second Street from my hotel before crossing the US Capitol and came upon this small and charming cafe with excellent sandwiches, side dishes (a good potato salad) and pastries. It is an excellent alternative to the large cafeterias in government buildings and museums, and a relaxing place to catch your breath while sightseeing."], ["Lucky find", 5.0, "January 8, 2013", "Katduke", "Virginia Beach, Virginia", 24, 11, "I was desperate for something warm and healthy for lunch before heading to the Library of Congress. This little cafe was close to the LoC and I ducked in. Tiny place, with just a few tables. Had one of the best lentil soups ever w/ a half sandwich. Great deal for delicious food."], ["Nice for a quick bite", 5.0, "December 18, 2012", "Gabigabs", "Seattle, Washington", 135, 61, "Less than 5 minutes walk from the Library of Congress. Nice small bakery to grab a quick bite. Reasonably priced. Portobello Panini that came with a scoop of tasty potato salad and a pot of tea (about 3 small cups) came to $10.00\nDon't expect a luxury dining experience with a full service, this is a typical bakery where you...\n\n\nMore"], ["Cute French style cafe with nice menu for a snack or light meal", 5.0, "December 4, 2012", "Erik A", "Scotch Plains, New Jersey", 15, 11, "We had breakfast here with 5. Fresh pastry and great egg sandwich. Behind the capital, so not many other tourists. Try the mocha!"], ["Pleasant unrushed breakfast", 4.0, "December 3, 2012", "pmr2", "Washington DC, District of Columbia", 145, 51, "Had brunch here--the food seemed fresh, reasonably priced, in a pleasant, casual setting. Good place to catch up on the newspaper, or your email, undisturbed. I had quiche and a salad, the former had fresh, quality ingredients, the crust was good, but they somehow missed on the seasoning and, as a result, didn't quite get the taste right. The vinaigrette...\n\n\nMore"], ["convenient fresh food", 4.0, "October 18, 2012", "Zanzibar07", "Oakland, California", 36, 11, "Neighborhood cafe serving very fresh homemade food. there are tables outside when the weather is good very casual atmosphere can sit without being rushed free wi-fi breakfast wonderful till 11 during the week all day on the weekends though they were closed on sunday when i tried to go"], ["Good Food and Nice Outdoor Seating", 5.0, "October 10, 2012", "Karen A", "Bowie, Maryland, United States", 31, 28, "Close to the Library of Congress, Le Bon Cafe has good food at decent prices. When the weather is nice, you can sit outside to eat which is always fun.\nThere aren't lots of tables, but for some reason you can always find a place to sit. It can get busy, so if you are visiting with kids try to...\n\n\nMore"], ["Cute Place to Dine", 4.0, "August 2, 2012", "Amy C", "Virginia", 32, 1, "Such a great atmosphere & it took me so long to finally decide on something to eat! I got an egg sandwich and it was divine, but everything looks great on the menu so I don't think you can go wrong."], ["Little Bit of Paris in A Cup", 5.0, "June 18, 2012", "Saffy2", "Auckland, New Zealand", 98, 76, "This place serves the best coffee I have ever tasted in the US. Their oatmeal was only ok but the waffles were great."], ["About like any other place in DC.", 3.0, "March 19, 2012", "flounder08", "Holland, Michigan", 68, 48, "The place is fairly close to the Capitol building and almost directly behind the Library of Congress. There are a few sandwiches to choose from ranging in price from 5 to 7 or 8 dollars. I want extremely impressed with those but heard the soup was good. Also they have amazing cookies. Overall you might find something better."], ["Great Little Cafe", 4.0, "March 13, 2012", "jgweston", "Washington DC, District of Columbia", 42, 12, "Le Bon has fantastic soups, sandwiches, and salads - a great little stop - although there is limited seating, that is part of Le Bon's charm."], ["close to our hotel", 3.0, "January 25, 2012", "jette78", "Chicago, Illinois", 4, 2, "cute place with fresh breakfast and lunch fare. a little pricey but nice atmosphere."], ["Nice local dive", 4.0, "November 21, 2011", "Andrewblaylock", "Amory, Mississippi", 12, 8, "It's a great place to get a bite to eat if you're visiting the Library of Congress. The food was tasty and the atmosphere was unique. I don't think the portions reflected the prices. My wife and I got a bowl of soup, two sandwiches, and two drinks for $20. Not bad, but not a great deal either.\nI might...\n\n\nMore"], ["Croissants ... I could have been back in...", 4.0, "October 11, 2010", "NigelMA", "Boston", 154, 94, "Croissants ... I could have been back in Paris! Coffee to match. Don't miss this!"], ["Great little gem!", 4.0, "June 29, 2008", "JennyMod", "Marietta, Georgia", 32, 36, "We noticed a recommendation from Frommer's in our 2008 D.C. travel guide and happened to be in the area after visitng the Library of Congress so we gave it a shot. Boy are we glad we did - nice prices and terrific food.\nLe Bon is in the Capitol Hill area and is close to Senate/House office buildings and the...\n\n\nMore"], ["The Best inexpensive Breakfast and Lunch in DC", 5.0, "April 17, 2008", "cmegee", "Florida", 1, 0, "We have been going to the wshington, DC area in the spring time for several years, so beautiful. When ever we visit we always go to a small Cafe on Capital Hill called Le Bon Cafe. It is not a chain Cafe and everything is freshly made. We probably eat there at least 3 to 4 times during our week...\n\n\nMore"]]], ["Glen's Garden Market", [["Excellent discovery!", 5.0, "October 4, 2015", "Gary J", "Doncaster, United Kingdom", 4, 0, "An excellent discovery with a great selection of Oktoberfest beers and wines resulting in a very enjoyable few hours with excellent service from our excellent barman Miles. We purchased takeaway sandwiches, cheeses and cooked meats which we enjoyed back at our hotel.\nWe would highly recommend a visit if you enjoy great food, beer and wine!!!"], ["Little hidden gem.", 5.0, "September 20, 2015", "david717", "Washington DC, District of Columbia", 73, 13, "Glen's was hosting a beer release event, so my wife and I decided to swing by. What a great little place. Note, the service at the deli counter was VERY slow and the food isn't cheap. I had a sausage, egg and cheese on a local Bullfrog Bagel. Very tasty, and the amount of sausage was incredibly generous. The best...\n\n\nMore"], ["Addictive \"Locavore\" Sandwiches", 4.0, "September 17, 2015", "Julia1992", "Centreville, MD", 8, 6, "Glen's is first a market, featuring locally sourced products, in addition to just a few not-so-local staples. It offers house-made charcuterie, sandwiches, pizzas, and salads. Local cheeses. A busy bar area serves craft beers and regional wines. But what Glen's thrives at is The SANDWICHES. Fresh, local, seasonal ingredients. You really taste the quality. You'll pay for it to, as...\n\n\nMore"]]], ["Madhatter", [["So much fun for brunch", 4.0, "October 4, 2015", "Madison T", null, 8, 3, "This place was a lot of fun. Sunday has $12 bottomless mimosas, which were great! And then we all ordered a breakfast entree. Our average bill was $22, which is very affordable for DC. The staff is friendly and fun! When you order a certain drink package on the menu, a dancing panda comes out to deliver it, which is...\n\n\nMore"], ["Cute place, great food", 5.0, "September 18, 2015", "meli25x", "Hamburg, New Jersey", 5, 5, "We found this place wandering around DC looking for a brunch spot and were pleasantly surprised. It does not look like much from the outside but the decor on the inside is a must see for any Alice lover and the food was great."], ["Wonderful restaurant in Wonderland", 5.0, "July 9, 2015", "Steven V", "Valparaiso, Indiana, United States", 28, 8, "We went to this restaurant after I found it on trip advisor and hotel staff said it was very good. The restaurant offers great comfort food in large portions at excellent prices. The nachos were larger than expected and very good. Just come as you are and very hungry and you will not be let down."], ["Simple but very nice", 4.0, "June 30, 2015", "CRJ1726", "Washington DC, District of Columbia", 32, 13, "This is a great place for a business lunch. They have a great daily lunch menu that is inexpensive. They also have a great happy hour daily and not terrible for dinner. I have taken clients there, interns and friends. I have never been disappointed."], ["Busy happening place but ok service", 3.0, "June 29, 2015", "Miusa", "Northborough, Massachusetts", 194, 64, "Lots of activity and lively music, the bartenders were more than a bit arrogant and it always seemed like they were doing me a favor when they took my order. Fun happening place though"], ["Alice would love it here!", 5.0, "May 8, 2015", "BuffyMaryland", "Maryland", 63, 14, "The service and the food were both awesome! I love the \"Alice in Wonderland\" decor. I was a bit disappointed that the \"tea party\" on the ceiling was in a separate dining area that appeared to be used for private parties. However, it wasn't being used and I was able enter and view the ceiling. The “tea party” is 3-D...\n\n\nMore"], ["Good Place for Brunch", 4.0, "April 21, 2015", "Marty T", "Indianapolis, IN", 41, 16, "We went to Madhatter for brunch and had a great two hours. The food was good and our service was extremely good. Our waitress was very attentive, yet not overbearing. They do have a great patio if you can get a seat out there. They have a wide range of food and everything was good. The two-hour bottomless brunch is...\n\n\nMore"], ["Watch those portions", 3.0, "March 12, 2015", "Maria P", null, 20, 9, "I don't take doggy bags and am not used to the big American portions I had a great salad, but had to send at least half back. Big waste of a tasty lunch. Loved the tea. Serve half, I would still pay the same price.... And for your American customers give them the option to order more. Will do wonders...\n\n\nMore"], ["Alice through the toilet", 2.0, "March 6, 2015", "uwman", "Laurel, Maryland", 132, 109, "Went for group business dinner. Food, service mediocre. Bathroom adjacent to private room was appalling -- think dive bar mens room at midnight on weekend. Only this was a Tuesday night with few customers. Thank goodness I didn't see the kitchen."], ["Best Clam Chowder!", 5.0, "February 18, 2015", "Maggy M", "Toronto, Canada", 26, 22, "as very pleasantly surprised, I though it would be your regular fried, flavorless tavern food, what we got could have been served in a fine dinning restaurant. They started us with this fried bread, it reminded me of the beignets you can get in New Orleans, then a thai shrimp appetizer, and the fish and chips that comes with a...\n\n\nMore"], ["Birthday", 3.0, "January 17, 2015", "Agahp", null, 6, 0, "So it was my first time going here and I have to say I expected more. It was my husbands birthday and his coworkers chose this place based on the location near their job. I was not impressed and highly doubt I will set foot in here again. My experience wasn't bad nor good just bland; like if I walk...\n\n\nMore"], ["Poppin Brunch", 4.0, "January 16, 2015", "YoungThev", "Jamestown, New York", 5, 0, "This was a great place for brunch. Decently priced. My friends and I were given a semi private room as we were a large party which I feel enhanced the experience since we were having a girls weekend and celebrating a birthday. Great service. my only issue, as with most bottomless brunch places is there was no bottomless Bellini. I...\n\n\nMore"], ["BOTTOMLESS MIMOSA'S", 4.0, "August 30, 2014", "Kelly T", "Little Rock, Arkansas", 141, 119, "Okay so a friend told us about this place and their bottomless mimosa's. We stopped in for brunch a few Saturdays ago and the food and drinks were spot on. However, our waitress was less than desirable. She was never around when you needed her, and she kept mentioning she usually works the patio. We were on a time crunch...\n\n\nMore"], ["Packed", 4.0, "August 17, 2014", "Ana G", "Houston, Texas", 83, 15, "It was hard walking through with so many people going in and out of the place, but that's to be expected at a bar. Took a while to get some drinks and definitely took longer to find a place to hang out and dance a bit, but I enjoyed everything about it.\nSide note: if you're going to be ordering...\n\n\nMore"], ["Cute Themed Restaurant", 4.0, "August 12, 2014", "EVal19", "Tallahassee, Florida", 5, 1, "I loved the Alice and Wonderland Theme of this restaurant. The menu selection was extensive, and the food was to die for! My friends and I even ordered the signature cocktail (The Hatter's Punch) for at least three people which came in a giant top hat. Although I don't believe the waiter that it was 2.5 drinks per person, I...\n\n\nMore"], ["So Good I Visited Twice in the Same Week", 5.0, "August 5, 2014", "S G", "Hampton, Virginia", 6, 0, "My husband and I visited on a Thursday and loved it so much, we returned the day after next with six friends! On our first visit, my husband ordered the Mediterranean combo containing fish, shrimp, Basmati Rice, and mixed vegetables and I ordered the skirt steak, broccolini, and Basmati Rice. It was unbelievable and they gave you so much. I...\n\n\nMore"], ["Decent Burgers and Beer", 4.0, "August 3, 2014", "areview28", "Silver Spring, Maryland", 731, 296, "Decor at Madhatter is your active bar with an attached restaurant that largely focuses on burgers and sandwiches. For what it is, Madhatter is pretty good. Decor is Alice in Wonderland with a focus on hats. Even the Cheshire Cat has a hat. Service is somewhat slow, but when you get the attention of a waiter things happen. The beer...\n\n\nMore"], ["Average place", 3.0, "June 5, 2014", "siunal", "Istanbul, Turkey", 81, 21, "The service and the place are not the best ones but you can go there for a drink if you are closeby and have no other plans. I can suggest sandwiches which are very tasty."], ["bad dinner, but probably better for just drinks", 2.0, "January 15, 2014", "jg325", "WashingtonDC", 489, 320, "My friend and I went to Madhatter for dinner, and overall, I felt that it was a boring choice with bad food. At the same time, I realize that Madhatter is primarily a drinking establishment, and while I had been here for drinks, this review is *only* for dinner/food I had.\nEven though we were here relatively early in the...\n\n\nMore"], ["Great bargain for brunch", 4.0, "December 19, 2013", "Francisco M", "Arlington, VA, USA", 169, 71, "Bloody Mary's here are good; they have a Bloody Mary bar, too, but who wants to pay to make their own drink at brunch? Food-wise, the spinach and artichoke dip is fairly standard. The French toast, however, is fabulous, easily one of the best I've had. You can pick between baguette or wheat with nuts and raisins (I chose the...\n\n\nMore"], ["Good lunch stop", 3.0, "November 13, 2013", "Fremdenfuhrer", "Boulder, CO", 108, 39, "I stopped here for a quick weekday lunch and ate well but not too quickly. Service seemed more distracted than slow and it took several requests to finally get the beverage I ordered. The meal order came quickly however, so I enjoyed a good chicken gyro. I'll return for the food and the friendly waitstaff, but I'll wait for an...\n\n\nMore"], ["great brunch/ fun atmosphere", 5.0, "September 6, 2013", "Dbauer123", "Melbourne, Florida", 3, 0, "Our group was looking for a great place to have a fun but casual brunch. We found it!\nFood was great and reasonable. Waiter was fun...he actually seemed happy to be at work.\nHalf of our party chose the bloody mary bar....NICE..and the other did the Mimosas. Waiter\nactually left the entire bottle of champagne on the table.....very convenient!\nThis...\n\n\nMore"], ["excellent burgers", 5.0, "May 29, 2013", "Cindy B", "Pittsburgh, Pennsylvania", 81, 26, "Ate there (take out) memorial day weekend, 2013,,, had a burger and fries,, and the burger was excellent!!\ncool environment, ,,ordered at the bar an the female bartender was very nice\nbought my son a shirt , think was 21$ , nice and soft"], ["Great for a casual low-key dinner out", 3.0, "May 27, 2013", "IshDewyn", "KL, Malaysia", 382, 260, "Went for dinner once, the food was good, especially since it was relatively cheap. The service could've been better but nothing major to complain about. Loved the decor and atmosphere. I'd recommend it for a casual, no-fuss night out."], ["Worst Brunch Ever!!!", 1.0, "May 9, 2013", "Aprilerain", "Waldorf, Maryland", 33, 12, "My friend and I go to brunch every Sunday when I’m home. We have been to places all over the DMV. We had reservations and was seated promptly. My waiter Taylor was terrible and he didn’t even invoke any confidence that he knew what he was doing. We ordered drinks and before we could say another word. He walked off....\n\n\nMore"], ["Great Pub", 4.0, "April 24, 2013", "Mark190562", "Canberra, Australia", 32, 9, "While staying in D.C this was my favorite pub to go after work. I always found the staff friendly. I occasionally snacked on bar food after a few drinks and it was always went down well. If you are after fine cuisine, go to a restaurant. I occasionally went in there for lunch and I enjoyed their well priced lunch...\n\n\nMore"], ["AVOID AT ALL COST - WORST EXPERIENCE EVER", 1.0, "April 1, 2013", "grindjv", "wetumpka,al", 19, 8, "Wish I would have read some of the other reviews on here before going. Restaurant was dead, family and I were seated quickly.. Took about 10 minutes for the server to show up and take our drink order, another 10-15 minutes before he took our food order. 30 minutes for the for to actually come to the table. The food...\n\n\nMore"], ["Great Pub Food just south of Dupont Circle", 3.0, "March 14, 2013", "rhackley", "Cicero", 40, 15, "With a Alice in Wonderland decorating décor, first time patrons will enjoy the tea set on the ceiling and the other memorabilia and pictures throughout the restaurant.\nMostly a sandwich, burger and light dining selection featuring a full contingent of micro brews and vodkas.\nWorth at least one visit if you are in the area and more if the establishment...\n\n\nMore"], ["Great Sports Bar!!", 4.0, "January 21, 2013", "HonduranHoustans", "Houston", 92, 22, "Good atmosphere for a sports venue. Liked the Old Bay Wings. Enjoyed the hot dog. Husband had the turkey burger but said that the bun was not tasty. Great wine list for Sauv. Blanc. Not so good for the Chard."], ["Great for Happy Hour", 4.0, "December 15, 2012", "Meg02", "Washington, DC", 42, 19, "Madhatter has great decor and a huge bar. it is a great place for happy hour, or a quick sit-down lunch. The $5 cheeseburger lunch special is as good as any other burger on the block, but the rest of the menu is pretty so-so."], ["Excellent bar service and best chicken fingers ever", 5.0, "December 9, 2012", "DCJD2012", "Washington DC, District of Columbia", 131, 71, "I think that the Madhatter is a forgotten gem. Great food, drinks and the service is great. I've only eaten in the dining room once and our server was really good. The bartenders are also great.\nThere are some reviews on here that's find unfair. If you're looking for fine dining, then this may not be what you're looking for....\n\n\nMore"], ["AVOID the Madhatter in Dupont Circle!!", 1.0, "November 23, 2012", "LexingtonKristi14", "Lexington, Kentucky", 24, 15, "I am a big fan of the food scene in DC and my experience at the Mad Hatter will go down as my worst experience ever in the city!\nNeglectful service, leaving drink glasses empty for more than 15-20 minutes and our server only had one other table, - the place was dead. The appetizer we ordered came out extremely...\n\n\nMore"], ["Amazing burgers! Go there if you're hungry!", 5.0, "September 14, 2012", "lumpy1092", "Singapore, Singapore", 107, 47, "Absolutely amazing burgers! I had the BMF Burger (BMF means \"Big MotherF*****\", the waiter told me), so you can imagine...it wasn't small! Check pictures, you'll quickly know what I mean. This burger was not only big but just so delicious! I haven't been to any other burger place in Washington DC because I only stayed a few days but believe...\n\n\nMore"], ["Young, loud bar", 2.0, "September 4, 2012", "ALubov", "Washington DC, District of Columbia", 49, 15, "Great space to dance and decent drinks, but the crowd is always massive and sweaty. Could be fun if you get there early, but make sure to scope out a space to stand/dance - and stay there!"], ["Great service and fun atmosphere", 5.0, "September 1, 2012", "Stacie D", null, 4, 2, "We had great service at this restaurant and it was a great atmosphere! They also have a great bar with a decent amount of beer choices!"], ["Great lunch spot during day, great bar at night", 4.0, "July 17, 2012", "Jim L", "Baltimore, Maryland", 37, 44, "On M Street between 18 and 19th, This basement bar is a few steps down, easy to miss. Long and skinny, with a front bar and back. Business types tend to eat there during the day more than tourists. The bar scene on some nights is pretty hopping. 20-30 somethings, up scale business types. Good old joint on the local...\n\n\nMore"], ["Best deal for lunch!", 4.0, "July 10, 2012", "Girlseatworld", "Ellicott city, md", 88, 21, "Madhatter has these lunch specials. You can pick a burger and side dishes with one side of your choice from sweet potato fries, madchips, mac and cheese to cole slaw for ......$5!!!! You can't beat it. They also offer make your own pasta lunch for $7. They are also generous in their portion and the food taste great."], ["Great place to go", 5.0, "June 23, 2012", "Basbabru", null, 34, 9, "Best Prime RIb I've had in a long time.\nService was very nice.\nDesserts were very good"], ["Top notch atmoshpere, decor, food", 4.0, "May 31, 2012", "C and K", "Raleigh, North Carolina", 44, 20, "Beautiful restaurant and bar (half and half) in downtown DC, and the Alice in Wonderland decor is done just right - that may sound weird, but just trust me. They might have had a second floor of seating, but I didn't see it.\nWe went there since none in my party were on the adventorous side (nothing foreign, no seafood)...\n\n\nMore"], ["Great Service, Huge Portions", 3.0, "May 29, 2012", "jf329", "Cleveland, Ohio", 33, 8, "We had a really fun server who took fantastic care of us and made our experience fun. The portions here are huge - you can make a meal out of any of the appetizers and be completely satisfied. Decent drinks. Definitely more of a bar feel."], ["Best Omelette Ever", 5.0, "April 21, 2012", "Vermont95", "Vermont", 55, 48, "Excellent omelettes for brunch - made to order (you go to the omelette station and the chef prepares just for you). I had tomatoes, red peppers, broccoli. Wonderful - served with fruit on side. Best omelette I have ever had, asked for well done and cooked to perfection. There is a Bloody Mary \"bar\" - they give you a glass...\n\n\nMore"], ["Delicious food, wonderful wait staff make for a great experience!", 5.0, "April 20, 2012", "NaylaA", "USA", 17, 3, "In DC over the Easter weekend, Madhatter was the perfect place for our Sunday Brunch. Even though we had late seating, Blair our cute, energetic waitress, went out of her way to make our experience memorable.The food was great- Chef Raoul's made to order omelette was beyond expectations. Bottomless mimosas added to the fun.The weather was beautiful, so sitting on...\n\n\nMore"], ["Yum!", 5.0, "March 21, 2012", "cc2hou", "houston", 9, 21, "I ordered the veggie pasta and added grilled shrimp. Outstanding. And the bread with the citrusy butter was to die for! Great find for me as this was my first experience here for dinner. Friends tell me they have an awesome brunch. I'll be back....soon!"], ["Great Prices, Amazing Customer Service, & Delicous Food!! Highly Suggested!!", 4.0, "September 1, 2011", "bp567924", "Cherry Hill, New Jersey", 60, 47, "This restaurant and bar was a great place to drink and eat. The bartenders are very happy and attend to you in a timely fashion. We liked this place so much that we ended up staying there the entire night the first night and breakfast the second. The \"bar\" food was tasty. I would suggest the wings and white pizza....\n\n\nMore"], ["nice surprise!", 5.0, "May 14, 2011", "orbit04", "Cleveland, Ohio", 11, 3, "In town for a convention and was walking the streets looking for lunch. Stumbled on the Madhatter and had a great chicken gyro lunch for 9 dollars. Nice place, great drink selection. Unique and a good place to eat."], ["A delicious and fun eating experience.", 5.0, "February 18, 2011", "trisket1", "Fargo, ND", 3, 0, "Madhatter is a restaurant that is based from Alice in Wonderland and it a great place to eat. Everyone is given free tea which is a fun way to start your meal. The menu is very diverse and everything I tried was great! The food had great presentation and tasted just as great. The restaurant had a nice bar and...\n\n\nMore"], ["Really fun for Brunch, cute decor, great location, good price", 4.0, "April 13, 2010", "SanDiegoMom08", "San Diego, CA", 88, 98, "We ate here for Easter Sunday as we had to find a place last minute and they had spots on opentable.com.\nApparently this is a newer location (dupont circle area) and for us from California, didnt dissapoint with great dark wood classic decor complimented with Alice in Wonderland art and prints.\nWe were lucky to be seated in the back...\n\n\nMore"], ["its a good place to drink", 3.0, "August 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "its a good place to drink"], ["Great brunch on Sundays.", 4.0, "April 17, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great brunch on Sundays."], ["Fun for happy hour, pretty decent bar food.", 3.0, "February 5, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Fun for happy hour, pretty decent bar food."], ["What a nice place!", 5.0, "January 19, 2008", "hlghmalntenence", "fort lauderdale", 3, 5, "My husband, 4-yr old daughter and myself were looking for a decent meal on a Monday night in DC last week. We happened to stumble across Madhatters online. We had walked right past it on our quest for dinner on Sunday night and not noticed it. We decided to make a go of it anyways. The menu online was exactly...\n\n\nMore"], ["Half priced Apps on weeknights for HH and a decent brunch with bottomless mimosas included on Sunday for $15.", 4.0, "December 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Half priced Apps on weeknights for HH and a decent brunch with bottomless mimosas included on Sunday for $15."], ["Always a favorite", 5.0, "November 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Always a favorite"], ["They serve food here? Yikes.", 1.0, "November 13, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "They serve food here? Yikes."], ["Casual fun.", 3.0, "August 8, 2006", "agillia", "North Carolina", 42, 16, "Good place for happy hour - a normal bar in an upscale area. Friendly staff and good american cuisine! Only drawback is that it is pretty smoky."], ["A great Bar", 5.0, "June 19, 2006", "riskman4", "Roanoke, Virginia", 157, 64, "Definitely not a chain. Quirky bar. Monday night NY strip steak for 10.99 with salad, potato and veggies. And it was a GREAT steak. Happy hour mixed drinks (until 8 PM) only 2.75 in Pint glasses. Friendly staff and great server Jesse. Very nice clientelle."], ["Oasis of slanted normality", 4.0, "June 6, 2006", "A TripAdvisor Member", null, 1, 0, "After wandering DuPont circle looking for something normal, I gave up and ducked into the Madhatter. This is a bar's bar. Nice solid drink choices and a good American cuisine menu. I had a few beers and a burger, watched a ballgame, and had a nice time chatting with the patrons and bartenders. Not upscale at all, not too expensive,...\n\n\nMore"]]], ["Halsa", [["Avocado Toast of Dreams", 5.0, "October 7, 2015", "Amanda H", null, 3, 0, "I stopped in for my first time and was pleasantly surprised by this find. Their space is beautiful and welcoming. The avocado toast was the perfect snack. Will be back for more."], ["If you love IKEA, you will appreciate this restaurant", 5.0, "September 13, 2015", "We-L0VE-Adventure", "Washington DC, District of Columbia", 28, 8, "Well lighted, small but comfortable. Minimalist in the Scandinavian genre. We tried the pulled pork with asparagus salad and potatoes – a one dish meal – plenty of food, excellent flavor and texture.\nA varied and interesting menu, I would return to try other dishes including breakfast!"], ["Healthy Organic Food in the Brookland neighborhood of Washington DC", 4.0, "March 19, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I like the place, it has very minimal looking deco. It is a kind of fast food casual restaurant. It is all white Scandinavian looking (kind of Ikeaish). It is billed as healthy sourced food. The menu is simple either build your own plate or you can choose the pre-determined component main dish. Fish is $15, the most expensive and...\n\n\nMore"]]], ["Subway", [["Great Lunch", 5.0, "April 22, 2015", "rfinerc", "Springfield, va.", 2, 0, "This Subway was very clean and well kept. As always, it's a very inexpensive lunch or dinner. I also liked the quick in and out."], ["Fresh, Fast and Predictable", 4.0, "April 22, 2015", "dana s", "maryland", 23, 5, "You can always get just what you want at Subway. While there could be more volume of your chosen protein, the assortment of veggies and garnishes is great. There is consistent service, food quality, and product from location to location, whether you're having lunch in DC or breakfast in San Diego. Subway is a go-to place."], ["Subway is the best sendwiches to compare to some others.", 4.0, "April 22, 2015", "kastroforjoe", null, 25, 2, "What to say subway is the tradition i am sure that everyone of us at last have once experience eating satsubway so subway for me is where my stomach can be happy Hahaha ha grab a sendvich and beer or cold coke will be the best and cherish the day ahead."], ["Good sub bad price", 3.0, "April 21, 2015", "Martha0107", "Baltimore, Maryland", 84, 14, "Subway on cold spring lane in Roland park Baltimore MD did not participate in the April deal of $6 foot longs. Not cool. The 6\" spicy Italian was good for $4 but 12\" for $6 would have been better.\nServer was not rude but not nice. Could have had a small smile to make the visit better."], ["Eat Fresh", 5.0, "April 21, 2015", "Azad A", "Washington DC, District of Columbia", 6, 7, "Majority of these subways are pleasant to eat at. the food is Fresh as ever, best meal to eat when traveling, because it has lots of Veggies to keep you alert when you're driving. WE always enjoy eating at subways while traveling. Eat Fresh!"], ["Depend on each place", 5.0, "October 3, 2014", "Sabrina T", "Fairfax, Virginia", 51, 9, "I love subway, the sandwiches and salads are amazing but some places they just don't know how to prepare."], ["Well above the average Subway.", 4.0, "September 6, 2014", "OdosMama", "Boston, Massachusetts", 15, 1, "We eat at Subway on occasion at home, and it's all right. Not fine dining, but good for a quick lunch. The Subway we visited was at the Library of Congress, and was primarily visited by employees. We happened by while in the tunnel between buildings and decided to stop there for lunch.\nThis was well above the normal Subway,...\n\n\nMore"], ["always safe healthy food..", 4.0, "March 12, 2014", "Ashwk", "Cambridge, Massachusetts", 21, 3, "I, being a vegetarian, often runs into problems into having good fresh food.. Subway is always a safe bet..fresh veggies and a nice hearty Italian bread.."], ["Good value, saves walking", 5.0, "August 2, 2013", "timbob42", "Sydney, Australia", 36, 22, "We got a day pass on a Sunday and went to Arlington and then around to Pentagon City and back to the centre of the city. It was so easy and cheap, $14 for unlimited travel for the day. The service was quick, safe, clean and we saw heaps."]]], ["Boundary Road", [["Neat Space", 4.0, "September 29, 2015", "Aaron_Meyer", "Jasper, IN", 9, 1, "We had lunch upon our arrival to DC. This place has a great decor. The food was pricey but we got a lot to eat as well. I had the BLT and had so much I ate the rest for lunch the next day. I also tried part of a meat tray. I would go back here for sure. There...\n\n\nMore"], ["Good food, indifferent service", 4.0, "July 19, 2015", "raw1167", null, 5, 7, "All my courses were excellent. They were well presented, flavorful and adventurous. The only negative was the surly service. The waiter said 'here is the desert menu, just in case'! He didn't sell the specials or desert, he worked hard to be unenthusiastic!\nHowever at the end of the day the food spoke for itself it said 'I am tasty,...\n\n\nMore"], ["Good food, cool space", 4.0, "July 4, 2015", "bradshawgirl", "Jackson, Miss.", 328, 295, "We stopped for a delicious dinner at Boundary Road, this cool bar/restaurant we'd been walking past all week, during our last trip to DC. OMG! So good! I couldn't believe we'd waited until so late in our trip to eat there!\nWe started with specialty cocktails (I tried the I'm Thinking About Getting a Vespa, and hubs chose the Bootsy...\n\n\nMore"], ["Great food and vibes", 5.0, "June 7, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I don't dish out 5 stars review often, and only if they deserve it.\nI recently dined twice in this place, I go once in a while, because DC is spoiled with choices, even though I dined out every week.\nI started with some meat & cheese, now I cannot remember what they were, because it was a couple of...\n\n\nMore"], ["Decent neighborhood restaurant", 3.0, "May 9, 2015", "Robert Y", "Millburn, NJ", 30, 9, "Noisy place. Food was good and fairly priced, but the wine list was limited and overpriced. Stick to the beer. There was, however enough room for our grandson infant's stroller, so his parents and we could eat comfortably. That's a plus for new parents wanting to get out for a decent meal. Service was good.,"], ["Good American Food", 5.0, "April 13, 2015", "EBJ99", "Libertyville, Illinois", 96, 42, "I had the brick chicken--delicious, Another family member had the short ribs (loved them). Waitress was great and let me sample a wine before I ordered it. I got a Happy Birthday brownie."], ["BLB", 4.0, "April 6, 2015", "LMASZ", "New York City, New York", 8, 3, "I was visiting DC for the weekend and took a yoga class in the area and popped into a few places before finally settling here. My waitress was super nice (although the hostess wasn't the nicest) and my meal was great. I had the BLB (\"bacon\" \"lettuce\" \"beets\") and it was delicious. Great hash browns as well! Found out when...\n\n\nMore"], ["Good food, bad service, bad attitude", 1.0, "March 31, 2015", "Fred S", "Washington, DC", 8, 2, "I had brunch there on Sunday. We had reservations about noon and showed up a few minutes early. We were seated promptly. That's where the attention to guests ended.\nWe had to wait about 15 minutes before our server approached the table. We ordered drinks, that showed up about 15 or 20 minutes later. 2 of the 4 people ordered...\n\n\nMore"], ["Great Place in Many Ways", 4.0, "March 28, 2015", "RangerDanS", "United States", 108, 82, "We have been here for dinner and now lunch. Both times the food was very well prepared and the staff was very friendly and attentive. At lunch my friend had a sandwich that made me wish I had ordered it. She also got fries and a side salad. The waiter actually forgot her order and brought fries instead of her...\n\n\nMore"], ["a favorite on H St", 5.0, "March 17, 2015", "Bill C", "Bridgetown, Saint Michael, Barbados", 16, 14, "great food, excellent service, comfortable and relaxed atmosphere, amazing desserts so save room for the donuts"], ["Service was really good and all entrees well prepared.", 4.0, "March 8, 2015", "thymefortravel", null, 86, 41, "We were in town visiting our son. Boundary Road was right down the street from his apartment. We had Duck Breast a la Plancha, Braised Bison Short Ribs Sauerbraten, and a huge steak that was on special. All entrees were well prepared, and the service was good."], ["Nice surprise", 5.0, "March 4, 2015", "Charles A", "Oberlin, Ohio", 107, 68, "Nothing pretentious here--they are all about the food and a comfortable atmosphere to party with friends. Great beers on tap and inventive cocktails. Monkfish, swordfish, chicken and the Fred Flintstone steak were all artfully prepared and delicious. Flour-less chocolate torte and panna cotta desserts were perfect. A short cab ride from downtown gets you to a place that is very...\n\n\nMore"], ["Way over rated bistro", 2.0, "November 20, 2014", "flashikan", "Jakarta, Indonesia", 40, 22, "We had a large party, sharing many dishes. Perogies & French fries for appitiser, average and tepid. Bison grill was tender, yet not an original sauce nor flavor. Sowrd fish did tantilize my tastebuds, served with fresh veracruze style veg topping. The duck literally oozed blood for 5 minutes...before it went back to kill that bird. Several people had rissoto,...\n\n\nMore"], ["Yum & Quaint", 4.0, "November 3, 2014", "aegisprncs", "Key West, FL", 201, 101, "This place was very quaint and what looked to be like the local business persons happy hour hang out. They had some good craft brews, decent wine list and tasty bar food like fancified beanies & weenies, cheese platters, etc. The décor was enjoyable. The lighting is low and the happy hour was happy & bustling. Even so, we got...\n\n\nMore"], ["As Good As it Gets! A talented Chef with amazing food!", 5.0, "October 5, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "This is one of my favorite restaurant in DC, and I have never given it a 5 stars. As you can see from my review, I don't give out 5 stars too often unless it is really good. It is buzzing on a Saturday night. Chef Brad came by and recommended the in-house made bison sausages with beans as appetizer,...\n\n\nMore"], ["Excellent drink selections", 4.0, "October 2, 2014", "Jennifer N", null, 38, 16, "I like this place. The food is pretty good and the drink selection is awesome. My favorite part is the ambiance. The inside is really nicely designed with an industrial feel."], ["Sometimes you wanna go where everybody knows your name", 5.0, "June 26, 2014", "Simi984", "Washington DC, District of Columbia", 37, 24, "Boundary Road is a warm, welcoming neighborhood gem just a few blocks from Union Station. Once you're inside, all the noise of H Street is gone. If the exposed brick, rustic lighting and open kitchen don't make you feel right at home, try one of their crafty cocktails or locally-sourced, amazingly appetizing dishes. The Chef is always trying new things...\n\n\nMore"], ["Good Neighborhood Restaurant", 4.0, "May 19, 2014", "oldcpa", "Little Rock, Arkansas", 112, 109, "Visiting family, in D.C.'s Capitol Hill neighborhood, we were taken to one of their favorite restaurants. It's a very casual place with a bar area and an open kitchen. My wife and I were likely the only non-residents in the room. The waitstaff was both friendly and efficient.\nWe both had the bison hanger steak. It was excellent, cooked medium...\n\n\nMore"], ["Liked the emphasis on locally sourced ingredients", 4.0, "May 5, 2014", "Russell M", "Louisville, Colorado", 208, 65, "I went to this restaurant because it advertised locally sourced ingredients. Overall, we all really liked what we had, but no one was raving at the end. My friend and I had the bison flank steak and it was just what you expect from bison -- really great flavor with little fat. Third person in our party had the halibut...\n\n\nMore"], ["tasty appetizers in an airy atmosphere", 4.0, "January 2, 2014", "jg325", "WashingtonDC", 489, 320, "My parents and I went to Boundary Road for dinner and to try out their \"Foie La La\" offerings in December. (With the Foie La La promotion, there were seven different restaurants on H St. having seasonal foie gras dishes in somewhat of a competition, and this was the main reason we came that night. Since my parents were visiting,...\n\n\nMore"], ["Very nice restaurant around the corner", 4.0, "October 11, 2013", "CJunker", "Washington DC, District of Columbia", 58, 10, "The Flank steak, Brick chicken and bluefish, and the fries are great. We have disliked a couple of specials but overall never a bad meal there and the service is friendly and reasonably efficient."], ["Non friendly Bartender and dry - bland meatballs", 2.0, "July 21, 2013", "REVIEWGURUTODAY", "Washington DC, District of Columbia", 33, 11, "Bartender wasn't all too friendly. Never told us about the drink specials and order of meatballs came out dry and non seasoned."], ["Very interesting place; good for vegetarians", 3.0, "February 2, 2013", "Randell N", "Washington DC, District of Columbia", 52, 17, "This is a fascinating place, decorated in a warehouse type style with different implements as decoration. The food was a little sparse and the chef tried combinations and mixtures of flavors that weren't particularly appealing to us. On the other hand, the focus on local foods was a plus and the whimsy of the place appealed to us (including having...\n\n\nMore"], ["Nothing Exceptional", 3.0, "January 19, 2013", "wellknowing", "swvirginia", 4, 0, "There is a certain charm associated with Boundary Road. The restaurant is located in a quaint neighborhood, and has charm, but the dining experience doesn't live up to the first sight feeling. The meals, drinks, and service don't merit the costs. The best entree on the menu was the vegetarian risotto dish. The bison flank steak didn't taste like bison....\n\n\nMore"], ["Solid local favorite", 4.0, "December 11, 2012", "Ladybug1330", "Washington DC, District of Columbia", 75, 37, "Choice beer list, revolving menu reflecting the availability of local produce, etc. Very laid-back, good place for late night meal, a drink, meeting with friends. I live in the neighborhood and frequent it regularly, will continue to do so."], ["Great Service and Food", 5.0, "December 9, 2012", "irishmac22", "Bettendorf, Iowa", 26, 8, "My husband, daughter, son-in-law and 1 yr old granddaughter & I dined here the night before Thanksgiving. It has become a favorite neighborhood restaurant for her family and I could taste why! Excellent & unique menu choices, great presentation and a great staff, all in a comfortable atmosphere."], ["An excellent Capitol Hill Restaurant!", 5.0, "November 23, 2012", "ChrisFromWisconsin", "Appleton, Wisconsin", 19, 5, "3 friends and I went on a 5-day culinary adventure surrounded by all of the neoclassical splendor of DC. Although we used Zagats almost solely as a guide, Brad Walker's excellent restaurant was suggested by a local (nephew of a fellow gourmand). We all had great meals and Brad personally ensured that everything was perfect!"], ["Good Food, Fair Service", 4.0, "November 6, 2012", "TandemBikeRider", "Marietta, GA", 196, 58, "I dined here solo on a Monday night. I was greeted promptly by my waiter and then ignored for 15 minutes. It seemed like he was the only one working that night, so he was busy. I doubt he would have ignored Pres. Obama...\nMy vegetable risotto was very good and the saison beer I had was too. The beer...\n\n\nMore"], ["Chef Brad Rocks!", 4.0, "November 4, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Last night was the third time I went to Boundary Road. We made a booking for a table of 3, and specified the table, but it was not available, the hostess moved fast to fix the problem. The food quality is so consistent, we had Foie Gras, Duckliver Mousse, Maryland Crab Soup, Brick Chicken, the yummy Bison Ribs, Apple Pie,...\n\n\nMore"], ["Beautiful food, simple! Both Obama and me has good taste!", 4.0, "August 22, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Had my Boundary Road experience last night. Chef Brad Walker is our neighbour, but I can assure you I am not bias at all. We both owe Dachshund mix in the same neighbourhood. OK back to the food. We eat out a lots anyway, so why not try our neighbour's new restaurant. Plus since Obama has tried it, I figure...\n\n\nMore"], ["good food, great expectations", 4.0, "July 25, 2012", "blanquetteseguin", "Hanoi, Vietnam", 25, 23, "We had the 3 course prix fixe with wine pairing. The food was very good, especially the locally-sourced sides. My French husband loved how rare the duck was, but if you are squeamish, you might want to ask for it to be a little more done. We thought the food could be fantastic, but its not quite there yet, but...\n\n\nMore"], ["Welcome to the neighborhood, Boundary Road", 4.0, "May 22, 2012", "reddheaddc", "Washington, DC", 20, 1, "Ok, so Obama's visit put this place on the map soon after its opening. Doesn't necessarily mean a restaurant is good. But our first try was promising. French fries with curry mayonnaise were a fantastic starter...thin, hot, crispy. Loved the salad with strawberries and the selection of cheese/meat that came with rustic bread. Hubby tried the pork, which was tasty...\n\n\nMore"], ["If it's Good Enough for Obama,it's Good Enough For Me", 5.0, "May 5, 2012", "JD3", "Massachusetts", 142, 251, "This is a fairly new restaurant in an up and coming part of town. My daughter couldn't get in one night because Obama was dining there, so she had been wanting to go back. When my husband and I came to town she decided to take us there.\nThe atmosphere was very warm and inviting, with exposed brick walls, and...\n\n\nMore"]]], ["Blue 44", [["Neighborhood gem", 4.0, "October 8, 2015", "286solotraveler", "Washington", 41, 4, "This attractive neighborhood bistro offers fresh seafood and excellent service. Indoor and outdoor seating. Good restrooms, comfortable booths."], ["Great For Dinner Before A Movie At The Avalon", 4.0, "August 2, 2015", "DaveHRoe", "Bethesda, Maryland", 147, 42, "Looking for a place to grab a bite before catching a flick at the Avalon. Found this place on-line...thought we'd give it a shot. It was a very pleasant experience. Our waitress was friendly and attentive. I started out with a Moscow Mule. It came in the traditional chilled copper mug. It was delicious. For dinner, I had the Crispy...\n\n\nMore"], ["Delicious fried oysters", 5.0, "July 30, 2015", "SMT44", "Heidelberg, Germany", 34, 21, "Delicious food, great service. I was a solo diner, and the staff was attentive, but not overly so. I will go back on my next visit to DC."], ["Quick Monday dinner and a nice surprise", 4.0, "July 16, 2015", "bumper1965", "Washington DC", 151, 98, "We have a friend who is in a near by retirement home across the street so we popped in here for a quick Monday night dinner afterward.\nI did my research and knew it was fried chicken dinner night.\nI was surprised at the rest of the menu. There were several items on the regular menu I'm going back to...\n\n\nMore"], ["Neighborhood Destination but Average Food & Spotty Service!", 3.0, "June 14, 2015", "Lois C", "Bethesda, Maryland", 152, 29, "It was crowded on a Saturday evening and my special salt-free diet request was encouraged by the wait-staff but my choice had to be returned to the kitchen for correction. Staff promises but the kitchen is not able or not willing to comply. Perhaps it was the busy evening but we were often ignored by our waiter who stood aroung...\n\n\nMore"], ["Brunch for schoolmate", 3.0, "June 1, 2015", "Jen H", "Gambrills, Maryland", 114, 44, "I attended a brunch here yesterday for a girl who goes to my school because it was her birthday. The parents rented out the whole restaurant because the girl who is Autistic would not do well in a loud, public environment. There were a lot of children who went to her previous school who were also Autistic and only like...\n\n\nMore"], ["Soooo yummy!!!", 5.0, "March 19, 2015", "Kristina W", "Phoenix, Arizona, United States", 10, 16, "I had the crab cake. My daughter had a burger. We were both very happy with the meal. For dessert we had the Smores torte. Omg. Soooo good!!! Very friendly service. Highly recommend."], ["Two and a half stars", 2.0, "February 3, 2015", "PeteB2009", "DC", 38, 16, "I was there last week and had a sandwich served on stale bread. How hard is it to crisp the bread up? And there was far too much bread in comparison to sandwich filling. (Filling was three shrimp and three fried oysters. For $17). They have done better in the past, but I don't have any real desire to go...\n\n\nMore"], ["noisy and slow service, but great food", 4.0, "January 11, 2015", "annbury", "New York, NY", 363, 188, "Five of us went to this place on a recent Sunday night. Luckily three of our group got there early and were sitting as we came in about 5 or 10 minutes late due to this idiot cabdriver who did not know his way around town. The service was a bit slow, but the food was great. Two of us...\n\n\nMore"], ["Solid food, feels like a neighborhood gathering", 4.0, "January 6, 2015", "Cynthia R", "Washington", 42, 9, "Classic food with a few twists. Great burgers, salads, and classic dinners (pasta with meatballs). Great addition to northern DC - on Connecticut Avenue."], ["great american neighborhood bistro", 5.0, "January 4, 2015", "spfunbath", "maryland", 43, 21, "too many terrific looking items on the menu...to the left were the casual dishes...spaghetti and meatballs and the burger...both enjoyed by the kids at the table to the left...i'm a kid too - at heart...have to try the spa/meatball next time...to the right...a fine looking steak with mashers and spinach for the grown-ups...again...looked terrific...we had some delicious fried oysters for...\n\n\nMore"], ["Fun. Informal. Imaginative Menu.", 4.0, "November 18, 2014", "Newsat11", "Cleveland, Ohio", 58, 19, "Great new addition to the neighborhood. An upscale diner-type place with varying specials including some classics like the fried chicken dinner. Reasonable prices, friendly service, worth the visit."], ["Neighborhood Gem", 4.0, "September 16, 2014", "FrequentTravelerWDC", "Washington, DC", 19, 11, "It is always pleasant to be surprised by a neighborhood restaurant. This was the case during our most recent visit to Blue 44. We enjoyed the \"Blue Plate Special\" which consisted of a tasty salad, Fried Chicken (voted the best in DC), mashed potatoes with gravy, green beans and toped off with a desert of sweet potato crumble. The dinner...\n\n\nMore"], ["2nights in a row", 4.0, "August 24, 2014", "CPJHKH", "Bedford, Massachusetts", 11, 5, "Very good and innovative menu w reasonable prices. Very satisfied. We split blueberry salad, husband had a very interesting swordfish special w fried green tomatoes (he loved it), and I had an equally interesting and delicious calamari w polenta."], ["Solid neighborhood restaurant for friends, family& solo", 4.0, "August 1, 2014", "dcinwdc", "Maui, Hawaii", 21, 4, "Four stars for what it is: a solid neighborhood restaurant (Chevy Chase, DC) in a neighborhood with some pretty mediocre dining options. Have been on numerous occasions: with friends, family (husband & 2 kids), with my husband alone, girls' night out & solo (It IS in the neighborhood!) Fish entrees are quite good (served 2 different styles), crab cake sandwiches...\n\n\nMore"], ["An OK neighborhood restaurant", 3.0, "July 11, 2014", "mlt2011", "Washington DC, District of Columbia", 4, 0, "A pleasant, but unfornately unexceptional neighborhood restaurant in an an affluent area with few competitors"], ["Nice addition to upper Connecticut Avenue", 4.0, "July 7, 2014", "Doris N", "Washington DC, District of Columbia", 29, 9, "Nice menu. Very attentive service. Caesar salad is very fresh. Grilled shrimp on top is a good addition. Portions at dinner time can be too large but that means good take home leftovers."], ["Love this place", 5.0, "June 2, 2014", "Battlejag", "Washington DC, District of Columbia", 42, 26, "A wonderful restaurant; every dish is creative and delicious. Homemade potato chips and the bistro chicken are my favorites. Owner greets each patron and genuinely cares about service. Eat outside if its not too warm. Specials are good, such as shrimp and grits and softshell crabs. Not your typical fare, and that's a good thing."], ["Great salads", 4.0, "May 28, 2014", "BeachesForFour", "Washington, DC", 103, 24, "We were looking for a place to eat out on a Monday night -- our first two choices were closed so we ended up here. I had a great salad with fresh figs -- super fresh, delicious dressing. Perfect light summer meal. Aside from the screaming kids at the next table, the atmosphere was great. Note to parents: 3 and...\n\n\nMore"], ["Good Food; Reasonable Prices", 3.0, "April 12, 2014", "IAP65", "silver spring, md", 379, 97, "Went to this restaurant for the first time with several of my friends. The restaurant doesn't take reservations unless you have a party of at least six; however, it appears to have an early crowd (lots of families) so if you go after 8 p.m. there is virtually no wait.\nThe bar is small, but attractive (as is the rest...\n\n\nMore"], ["Great Fried Oysters", 4.0, "January 23, 2014", "gervitrn", "Bethesda, Maryland", 40, 14, "Good and thoughtful service. Variety on the menu. Would return again......................................................................................."], ["A homie fav!", 4.0, "December 18, 2013", "Pati Y", "Kensington, Maryland, United States", 5, 1, "Blue is a good solid restaurant in one of my childhood neighborhoods. Loved it since it opened. Always a cozy atmosphere and nice options for a large or small meal."], ["Try the fried chicken on Mondays!", 4.0, "October 20, 2013", "VNB", "Washington, DC", 15, 5, "Their fried chicken special - only on Mondays - is delicious. Other dishes I've tried have been good, not great. Nice neighborhood spot."], ["Don't know who eats what? Blue 44 is your place", 4.0, "September 23, 2013", "lutzboy", "washington dc", 52, 30, "Blue 44 is a great neighborhood restaurant in upper NW DC. The food is great and the service is always friendly and consistent. I LOVE the perogies! However, what we like most about the menu is that no matter what type of diners we take to Blue 44, there is always something that appeals to everyone. Picky, adventurous, kids, seniors,...\n\n\nMore"], ["Our favourite local", 4.0, "September 17, 2013", "finny123", "Tshwane, South Africa", 105, 79, "Never disappointed with Blue 44...excellent service, great food and opportunity to sit outside (actually I have never eaten inside in all the times I have been there). Food is mostly American-style of high quality and not too pricey which makes it a great regular family choice. Dogs permitted in the outside area (a nice bonus)."], ["good place for eating", 4.0, "September 3, 2013", "ajk470", "Arlington, Virginia", 18, 3, "I went to this restaurant twice and both times had consistently good meals. The wait staff is friendly and the food seems to be of high quality. Reasonably priced."], ["Yum!", 4.0, "May 31, 2013", "Sabrina38", "Washington DC, District of Columbia", 11, 8, "Went with a couple of friends on Monday Fried Chicken night. It was delicious! A lovely salad to start, juicy pieces of chicken, mashed potatoes w/gravy, a biscuit (surprisingly sweet, but good), and dessert (chocolate brownie thing) all for $19. We threw in an app of the pierogies. They turned out to be heavy and gummy so I don't recommend...\n\n\nMore"], ["Brunch in Chevy Chase", 4.0, "May 28, 2013", "KJDC19", "Kansas City, Missouri", 115, 35, "Fine brunch menu for family outing. The location has parking in the rear but not always easy to find. Cozy nice location on Connecticut Avenue near the Chevy Chase Circle. Food was good and service too."], ["Good place to eat", 4.0, "April 10, 2013", "suzyq928970", "Washington DC, District of Columbia", 12, 2, "This is a new restaurant in our neighborhood that is a huge improvement over the previous Tex-Mex and other iterations. It's great for a weekend or mid week meal. My husband really enjoys the mussels and variations on the shellfish.. I do agree with others that a Sunday evening or Saturday afternoon is getting filled with lots of families and...\n\n\nMore"], ["A warm spot in the cold", 4.0, "February 17, 2013", "dlosea", "Silver Spring, Maryland", 459, 149, "Blue 44's just a block and a half south of the Avalon theater on Connecticut Ave., so it makes for a perfect after-movie dinner or snack. It was bitterly cold out the night we went, so the warmth of place was most welcome. Despite the fact that the entire place was full, there was hardly any noise and no background...\n\n\nMore"], ["Fresh hot food in a nice environment", 4.0, "February 10, 2013", "annite57", "Vienna, Virginia", 55, 27, "Blue 44 is right up Connecticut going toward Maryland and nestled next to a liquor store; on the outside it looks kind of dodgy, but the inside is new, clean and modern. The layout of the restaurant is perfect, with tables on the outside and big ole booths in the middle and a small round bar at the back. The...\n\n\nMore"], ["Straight out of an old Foodie Handbook", 3.0, "January 24, 2013", "hypefreetravel", "LA, California", 43, 45, "Blue 44 has become popular with the 1% crowd who populate this part of DC. Not surprisingly their good reviews don’t see through the menu items that come right out of an old foodie handbook (butternut squash soup, grilled cheese with caramelized onions and pulled pork etc.) cooked no doubt by recent culinary school grads. With food that looks like...\n\n\nMore"], ["Great neighborhood restaurant", 4.0, "August 4, 2012", "Nature4Me", "Washington, DC", 37, 27, "We had an early dinner at Blue 44 on a Friday night recently, and it was great. The atmosphere is good, neighborhood pub-y, the service is friendly and attentive, and the food is quite good. We had the deviled egg appetizer, the bistro chicken, the veggie streudel, the grilled cheese of the day, and the zucchini fries. Everything was absolutely...\n\n\nMore"], ["Very Good", 5.0, "July 30, 2012", "Rockrolex", "Washington, DC", 108, 51, "Excellent, general American food with some twists; decent selection of wines by the glass.\nHeirloom tomato flatbread was a bit sweet but nicely cut with arugula.\nBoneless short ribs were very good, but too much to eat at one meal. I took half home.\nThe pan roasted trout with skin on was excellent as well.\nIce cream comes from Annapolis...\n\n\nMore"], ["Delicious food, excellent service - at a reasonable price!", 5.0, "July 10, 2012", "Teri99", "Maryland", 171, 46, "This restaurant, located in NW DC close to the MD line, is situated right on Connecticut Avenue. I arrived to meet a friend and chose to sit outside. The service was prompt and attentive; our server even adjusted the umbrella as the sun moved to be sure we were comfortable. Having arrived first, I ordered wine for both of us,...\n\n\nMore"], ["Outstanding Neighborhood Restaurant", 5.0, "May 3, 2012", "Ogre1969", "Chevy Chase, Maryland", 31, 10, "We had a wonderful dinner at Blue 44 sitting outside watching the ebb and flow along Connecticut Ave.\nEverything we tried was delicious and our waiter Fernando couldn't have been better. The fried oysters were the best I have ever had. The burger was cooked perfectly as ordered and the parparadelle and wild mushrooms were great. The tomato soup and...\n\n\nMore"], ["Neighborhood Gem", 4.0, "April 16, 2012", "soncijo", "Washington DC, District of Columbia", 201, 100, "Second meal at Blue 44. The food was excellent, service excellent, ambiance pleasant, and so convenient. I strongly recommend it!"], ["Good but on the outskirts of Washington , really Chevy Chase, Maryland", 4.0, "March 30, 2012", "traveltrek57", "Coopersburg,PA", 113, 39, "This is a little busy restaurant. We came for lunch thinking it was close to the Washington Mall area. We were surprised to find it was way out of the way if you want to stay by the Sights area. We enjoyed the food a great deal. The crabcakes were a true Maryland delight! The staff and servers very helpful....\n\n\nMore"], ["A great neighborhood find!", 5.0, "March 25, 2012", "Andrea W", "Chevy Chase, Maryland", 107, 53, "We have been to Blue 44 a few times, and each time is as good or better than the last! We took our 5 and 7 year-old grandsons, and the waiter was very solicitous of them (which is a real plus!). The food is excellent, and the service to match! The owner is welcoming and warm, and the service is...\n\n\nMore"], ["Neighborhood newbie with consistently good food", 4.0, "March 15, 2012", "Jeri G", "Washington DC, District of Columbia", 18, 12, "We took our family to Blue 44 for dinner the other night. Blue 44 is the kind of place that consistently delivers good food at reasonable prices, with friendly service. Families are always there with their kids, because of the long booths that seat 6-8 people, although if you go as a couple, you can sit in the bar area...\n\n\nMore"], ["Excellent Neighborhood Food", 5.0, "March 11, 2012", "dazow", "DC", 43, 16, "The ambiance is fair, but the wait staff and the food are extraordinary. The feel of the place is casual, but the food is first rate and the service is really tops . It is a wonderful place to go to get some first rate food and service and not have to be in the center of the the DC...\n\n\nMore"], ["Great place for locals and visitors", 5.0, "January 13, 2012", "Gardnerpa", "Washington DC, District of Columbia", 4, 1, "I must say I am a frequent visitor of Blue 44 and have been since the restaurant opened. Living in the area, I know it can be difficult to find good food at a reasonable price, but Blue 44’s menu is tasty and won’t illicit the monetary guilt that comes with some of the areas other restaurants. The menu features...\n\n\nMore"], ["Work in progress", 3.0, "November 16, 2011", "BeachesForFour", "Washington, DC", 103, 24, "We live in the neighborhood and went to check it out soon after it opened and had a mixed review. My husband had the fish special which was terrific and I had one of the worst sandwiches ever. Terrible nosise problem too and kids running around screaming. We went again recently and we both had the pasta special which we...\n\n\nMore"], ["Decent American Food - But It Gets Noisy", 4.0, "October 28, 2011", "PeteB2009", "DC", 38, 16, "Good Burgers, Cheese Steak, Ribs, Salads. Noise is the only concern."], ["Great neighborhood restaurant!", 4.0, "October 11, 2011", "paxa", "Washington DC, District of Columbia", 370, 207, "This is a great neighborhood restaurant and definitely deserves all the rave reviews about it. We were a group of 5 looking for a casual café style place to get something light and chose it based on the Yelp reviews. And it didn’t disappoint. I was worried about it not being good for a larger group (per the reviews), but...\n\n\nMore"], ["A great spot all around!", 4.0, "September 7, 2011", "Queenie2011", null, 2, 2, "Blue 44 is a welcome restaurant on that stretch of Conn Ave. A super neighborhood joint- even though I'd recommend it to folks who travel there from NW DC & Bethesda environs. The children's menu is freshly prepared & delicious. Our kids love going but we go early & I am thinking it must be popular with couples & groups...\n\n\nMore"], ["Good bistro style restaurant in Chevy Chase DC", 4.0, "August 5, 2011", "BlueNWashington", "Washington DC", 341, 120, "Blue 44 is a new and very welcome addition to the Chevy Chase Circle neighborhood, offering a relatively short menu of American/European dishes at moderate prices. The menu includes a good choice of appetizers/entree and main dish sandwiches. The entree list is shorter, but the heavier stuff is well chosen and very well prepared. The hanger steak is among the...\n\n\nMore"], ["Seasonal menu with interesting choices - looking forward to return visit", 4.0, "July 4, 2011", "dcbird", "Washington, DC", 82, 31, "Blue 44 had been open for perhaps a month when we went, but for a restaurant still in its opening phase, it was exceptionally promising. As a starter I had the gazpacho soup, which was perfect for a really hot day in DC; it was zesty but not overly spicy, so I got the full taste of fresh ingredients. My...\n\n\nMore"]]]]