[["El Rinconcito II", [["Addictive!", 5.0, "July 7, 2015", "amergalinpretoria", "Washington DC, District of Columbia", 51, 20, "I was in Columbia Heights and famished. A friend dragged me here to eat when she told me it was reasonably priced and good. After eating there once I probably went back 2 or 3 more times in a 7 day period. Not only is the food really good, but the portion sizes are quite generous. Staff is also very...\n\n\nMore"], ["Great salvadorian cuisine in CoHI", 4.0, "October 1, 2014", "JPlatner", "Arlington, Virginia", 145, 35, "Fantastic hole in the wall authentic salvadorian food two blocks from the Colombian heights metro! The pork and cheese papusas were authentic and delicious, and the enchiladas were excellent. My dining partners enjoyed their food as well, everyone gave it two thumbs up! Highly recommended!"], ["Amazing Salvadorean Food", 5.0, "December 17, 2013", "jmart134", "Baltimore", 78, 29, "This food has all the comfort of homemade latin food: flavorful, fresh, and plentiful. The roasted plantains are always perfectly crisped on the outside and soft and sweet on the inside, and served with sour cream to balance the sweetness. The breaded steak with pico de gallo was seared nicely and the breading wasn't too thick. And the pico de...\n\n\nMore"], ["Savory Salvador : )", 5.0, "November 7, 2013", "Sacred-Valley-Girl", "Washington DC, District of Columbia", 62, 25, "Excellent service. Great for either eat-in or take-out. You feel like you're in south america, even down to the Telenovelas on tv. Tasty food, reasonably priced."], ["A little bit of latin heaven in DC", 5.0, "August 2, 2012", "seesgurl", "connecticut", 62, 36, "First I have to say we litterally went in for a \"bite or bit\" to eat...in Columbia Heights...So we got papusas, tamales and plantains...margaritas. The papusas were wonderful but the tamale (chicken) was really heaven. The corn meal/bread covering melted in my mouth. The restaurant serves Salvadorian food in a basement row house, with brightly colored walls and furnishings. The...\n\n\nMore"]]], ["Nam-Viet Pho 79", [["Vietnamese food at it's best", 5.0, "October 9, 2015", "Alfredo E", "Washington DC, District of Columbia", 5, 0, "It has become a routine for me to stop by at this home style restaurant after watching a movie at Cinema Uptown.\nEvery meal that I had was always satisfying.\nMy favorite is the Saigon style Soft -Shell Crab, deep fried, sautéed with garlic, ginger, jalapeños and served on bed of lettuce salad with lemon pepper dipping sauce.\nTry also...\n\n\nMore"], ["Delicious Food and Comfortable Atmosphere", 4.0, "September 23, 2015", "BillandKathy27", "Vienna, Austria", 83, 44, "This inconspicuous family run restaurant serves wonderful Vietnamese and Thai food in a friendly and efficient way. Vegetables, fish, seasonings all blended well and lent themselves to a relaxing evening with friends. It should also be noted that the prices are reasonable."], ["Tip added in for a party of 4???", 2.0, "August 27, 2015", "noelx4", "Halifax Nova Scotia", 50, 50, "We stopped here after a morning at the zoo. Dh had the pho, but when it arrived they were out of cilantro and basil, which was disappointing. Dd has won ton soup which tasted unacceptably iodine-y to her. I had vermicelli with lemongrass beef which was the best meal on the table. Ds had grilled chicken on vermicelli and he...\n\n\nMore"], ["Worth the Metro Ride to Cleveland Park", 4.0, "July 9, 2015", "Holokauahi", "Colorado Springs, Colorado", 213, 92, "Nam Viet is not really convenient to much of anything, but it is well worth the Metro Ride out to Cleveland Park, as it serves up maybe the best Thai and Vietnamese food in the District, in a casual environment, and at very reasonable prices."], ["An old standby", 4.0, "July 2, 2015", "catonsviller", "Catonsville, MD", 46, 25, "After a day at the National Zoo, we walked up the street to a place we've been to a few times before, Nam Viet. It doesn't look like much, but we've always been happy with the food and the service. I had canh chua, a tamarind based soup. It was delicious, full of fresh vegetables and pieces of salmon -...\n\n\nMore"], ["Great Food!", 4.0, "March 24, 2015", "karen k", "somers, nY", 90, 33, "Having been to Vietnam earlier this year and thoroughly enjoying the fresh food on our trip, this little place pleased us thoroughly. A great neighborhood restaurant, staff is friendly. We didn't have reservations, and were seated easily, but we also were there about 5:30 p.m. on a Thursday. Diners were coming and going nicely. I had the chicken and shrimp...\n\n\nMore"], ["Hidden Vietnamese Gem in Cleveland Park", 4.0, "January 25, 2015", "Derek F", null, 150, 57, "Not sure how I missed this place after living in the area for two years, but my family and I were rewarded with a delicious meal that included Crispy Spring Rolls to start, Chicken Pho and Lemongrass Beef on Rice and on Rice Noodles. Get the rice noodles if you want a more authentic taste. And don't forget to add...\n\n\nMore"], ["Great", 5.0, "January 7, 2015", "Steve W", "Blaxland, Australia", 6, 0, "Just had a lovely bowl of Pho Bo and it was delicious. Very good service and cheap as chips. Will make it a regular when in Washington."], ["very good pho", 5.0, "December 2, 2014", "Orren S", "Plainsboro, New Jersey", 30, 9, "great tasting pho and other dishes at reasonable prices. Even my young daughter liked it. Wait staff was great"], ["Varied Menu but Ordinary Food", 3.0, "December 1, 2014", "Talentisageless", "Usa", 57, 41, "Neighborhood restaurant at reasonable prices. Dishes lack imagination. Stay away from garden rolls and eggplant dishand Staff lacks customer service skills and the atmosphere is not welcoming."], ["Wonderful cuisine and great staff", 5.0, "October 14, 2014", "Ontheroadagain467", null, 26, 10, "This restaurant is a hidden gem. The staff are very friendly and helpful. I ordered the Lemongrass chicken. It was amazing!! The flavors just burst in my mouth with each bite. What a great meal. I also tried the spring roll. Fantastic! What a great experience. It was great to linger and really enjoy the food and the staff.\nThe...\n\n\nMore"], ["Great Pho!", 4.0, "September 29, 2014", "Diego R", "Washington DC, District of Columbia", 26, 7, "I've been to Nam-Viet a few times, mostly for a late dinner during the week. I always end up having a bowl of Pho and I've never been disappointed. Their steamed dumplings are also very good."], ["Too bad.", 2.0, "August 17, 2014", "Mcklauren", "New York City, New York", 16, 8, "I used to love this place. At one point, it was high-quality Vietnamese cuisine that was nearby and served by lovely people. It may not have been authentic- my husband and I spent a month in Vietnam a few years ago, only to return to the US and realise just how hard it was to find examples of the cuisine...\n\n\nMore"], ["Great Neighborhood Place (but worth traveling to...)", 4.0, "June 1, 2014", "carpathianarts", "Washington DC, District of Columbia", 118, 51, "Although this eat-in or take-out restaurant has been in Cleveland Park for a long time, we never paid much attention to or patronized it until a year or so ago when the staff at a Vietnamese place in northern Virginia (where Vietnamese restaurants are common) told us that the best Vietnamese cuisine in the DC Metro area is served at...\n\n\nMore"], ["Excellent value for money", 4.0, "April 15, 2014", "MaribelJi", "Washington DC, District of Columbia", 13, 0, "This is a great place to go with your family. Food is good and very well priced. Service is quick and uncomplicated. Perfect place for a week dinner. They also offer take outs."], ["Excellent Orange Chicken", 4.0, "April 8, 2014", "sissi2754", "sydney", 17, 5, "This is a great restaurant and I come almost every week. It is very simple with plastic tables but the orange chicken is absolutely wonderful. My friends who come with me most of the time are also very happy to return and have their own favorite dishes.\nSometimes the service is a bit slow, and waiters distracted, but they are...\n\n\nMore"], ["Poor Attitude", 1.0, "June 13, 2013", "Tim L", "Sugar Land, Texas", 11, 2, "Their service and attitude is very bad. They just bring you the food without any greeting. Although we have only 5 people including 2 kids, they just charged me the tip without notifying me. I went to several other restaurant at DC in this trip and nobody did so. Probably the 18% tip means a lot to them, although they...\n\n\nMore"], ["Unfriendly Service, Mediocre Food", 2.0, "April 22, 2013", "sh_away", "Washington DC, District of Columbia", 30, 31, "We were shown to our table towards the rear of the restaurant. The waiters were remote and uncommunicative. The menus were 'dumped' on the table.\nWe ordered a variety of dishes to share. Most were dull and unappetizing. The aubergine and seafood dish was mostly sloppy boiled tasteless aubergine with a small amount of tasteless seafood. The crepes were at...\n\n\nMore"], ["Good simple VietNamese food", 4.0, "April 12, 2013", "diane28970", "Washington DC, District of Columbia", 65, 29, "this is the place to go if you want Phoo. They have many varieties and they are all good. This is just a simple Oriental restaurant, no frills, but good soup."], ["Very good pho near the National Zoo", 4.0, "January 3, 2013", "Lorraine777", "El Dorado Hills, California", 102, 101, "This was a great find after a chilly afternoon at the zoo. We had soup -- I had a vegetable noodle, my husband had a beef noodle, and our 4-year-old had a lot of mine. They were both delicious, and actually better than the Vietnamese noodle soup at a restaurant we frequent in California. Prices were very reasonable, about what...\n\n\nMore"], ["An old friend", 4.0, "December 28, 2012", "nancyjackathens", "Fernandina Beach, Florida", 106, 60, "We ate at Nam Viet during a return trip to DC to visit our daughter and weeded very pleased to find the same high level of food and service. Our family has been going to Nam Viet for a VERY long time. Consistently good food, consistently friendly service. Their soups are fantastic, their appetizers delicious, in short, after many, many...\n\n\nMore"], ["Delicious food without breaking the bank", 5.0, "December 21, 2012", "Remy S", "Reading, Pennsylvania", 20, 8, "The bun here is amazing. I love vietnamese food, but I have a friend who isn't an adventurous eater. Since I finally convinced her to come with me four months ago, though, she has eaten here five times! We also like the curry and pho here a lot. The prices aren't bad (for DC) but you do get a lot...\n\n\nMore"], ["Nam-Viet has delicious soup", 4.0, "December 2, 2012", "buckeyetraveler346", "Washington DC, District of Columbia", 8, 5, "The soup here is really good. It's great for a chilly evening. Nam-Viet is conveniently located in Cleveland Park near the Metro Red Line. Another plus is that the menu is pretty reasonably priced."], ["Service could make up for the lack of flavor", 3.0, "November 1, 2012", "Aksudntpron", null, 16, 3, "Former, tastier version was better. In the last two years the quality has changed fir the worse.\nRudeness is not tolerated. I won't be back"], ["Cannot Beat Their Soups", 5.0, "October 30, 2012", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Pho's on Connecticut Avenue NW is a treasure. Delicious, nutritious affordable dishes served with a smile. Try any of their soups (small and large sizes) but especially the seafood."], ["Nam-Viet", 4.0, "October 15, 2012", "dcalvinm", "Altoona, Pennsylvania", 26, 15, "Nam-Viet is located between the Cleveland Park Metro Station and the National Zoo. It is very convenient to finish your day at after visiting the zoo. The serving sizes were very large and reasonable priced. We were able to be seated right away and our food came promptly."], ["So good it almost mitigated power outage.", 5.0, "June 30, 2012", "Jean-Marie S", "Washington DC", 107, 112, "We've lived in Washington DC for 15 years and tonight we were reminded of why we love Nam-Viet. A massive power outage made us cry uncle and sent us running to the Marriott Wardman Park (see separate review under Hotels). Even though there are a slew of hotels around the corner from the hotel, we got in the car and...\n\n\nMore"], ["Delicious pho that hit the spot", 5.0, "April 29, 2012", "kassie59", "Tallahassee, Florida", 116, 39, "After a day of being on our feet at museums, we found Nam-Viet Pho 79 a welcome refuge. Love the decor that in our room was brick, hinting at the building's origin maybe 100 years ago. The tofu pho was flat out delicious. The service was fine, nothing superlative."], ["A great no frills meal", 4.0, "April 28, 2012", "AntoDC", "Doha, Qatar", 84, 36, "Pho, pho, pho, pho, pho (number 16 or 17 for me) with an order of crispy rolls to start with...a nice cold \"33\", and with little more than $15 you are set.\nSure, this isn't trendy, classy, fancy, chique -- it's just an honest Vietnamese joint that's been making consistently good food for many many years. Perfect anytime, whether for...\n\n\nMore"], ["Good Food...Very BAD attitude", 3.0, "April 27, 2012", "bd1951", "Washington DC, District of Columbia", 3, 0, "We've been eating here for over ten years...the pho is first rate and I love,love,love the crispy spring rolls....but no one who works here ever smiles or seems to enjoy their job\nAnd just try to send food back....we've only done this two times but each time the cook comes out very confrontational and insulting really., really wierd\nEach time...\n\n\nMore"], ["Food improving", 4.0, "March 31, 2012", "Lynnemezzo", "Maryland", 25, 26, "My partner and I visited this restaurant, which has been a staple in Cleveland Park for many years, last weekend. Although it has been a long time since we've been there, I must say the food has improved since our last visit. They still serve the best <<cha gio>> (crispy spring rolls) I've ever tasted and the beef <<pho>> soup...\n\n\nMore"], ["Good food, reasonable prices", 4.0, "February 23, 2012", "VanNessVoyager", "Washington DC, District of Columbia", 105, 88, "Nam Viet has good food, and the prices are reasonable. I particularly like their soups and spring rolls. Service is usually quick, and they are agreeable to customizing orders. All in all, a nice neighborhood restaurant with tasty food."], ["OK Vietnamese food if you can't hit the burbs", 3.0, "February 20, 2012", "BlueNWashington", "Washington DC", 340, 121, "Nam-Viet Pho 79 is in the Cleveland Park neighborhood which has a lot of restaurant choices. If Vietnamese soup is what you want, you won't be disappointed by what's on offer, even though there are places in Virginia that are better. The spring rolls (chiagia) are generally below average and should be avoided.\nPrices are reasonable; decor is dineresque; the...\n\n\nMore"], ["Good food, inexpensive very quick", 4.0, "December 9, 2011", "psyduck1947", "Washington DC, District of Columbia", 169, 44, "Spics is too brightly lit. Other than that, if you want good Vietnamese in upper NW DC, this is the place. The spring rolls are great. The Pho's 1st rate and the huge portion of delicious combination fried rice can almost feed three. If you order carry out, it's usually ready in 10 minutes!"], ["Many varieties of pho & other Vietnamese favorites - lots of good choices", 4.0, "July 6, 2011", "dcbird", "Washington, DC", 82, 31, "This is a slightly tacky neighborhood restaurant, in great need of some refurbishing and sprucing up, but don't let that put you off. The pho soups are flavorful, and I've also enjoyed a variety of fish dishes there, especially the catfish. The chairs aren't particularly comfortable, and sometimes the tables are wobbly. The service is friendly, although sometimes you have...\n\n\nMore"], ["My family ran into this restaurant during a rainstorm. We looked at the menu and decided to stay for dinner. We had...", 4.0, "December 1, 2009", "seapipe", "Ventnor City, New Jersey", 17, 5, "My family ran into this restaurant during a rainstorm. We looked at the menu and decided to stay for dinner. We had never eaten vietnamese food before, but we loved the food here."], ["Good Vietnamese food in DC", 4.0, "April 4, 2009", "CentralCATraveler", "Central CA", 155, 111, "Went to this Vietnamese restaurant in DC for the pho, but was slightly disappointed with it. It was ok, but I've had better. The other soups were good like the sweet, sour, and spicy soup. The other meat/noodle dish and fresh rolls we had were fine. Crowded, but large place with little ambiance. Difficult to find parking, but close to...\n\n\nMore"], ["good soup noodles! and...", 3.0, "October 18, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good soup noodles! and a bit more classier than your average pho joint"], ["The pho is disappointing. Get the grilled stuff with vermicelli instead.", 3.0, "June 11, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The pho is disappointing. Get the grilled stuff with vermicelli instead."], ["Any of the grilled entrees are wonderful. Mmmm grilled lemongrass beef, so tender and flavorful. Stay away from the...", 4.0, "May 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Don't get the pho. Everything else is pretty good, esp. the grilled lemongrass beef... tender and flavorful, mmmmm..."], ["Sweet, Sour, Spicy Shrimp Soup ($10) is terrific (add a dash of the table hot-sauce and it's perfect). In the summer I...", 4.0, "January 8, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Sweet, Sour, Spicy Shrimp Soup ($10) is terrific (add a dash of the table hot-sauce and it's perfect). In the summer I had Softshells here, fried with a sour-pepper sauce (really good and very interesting sauce), but the price tag was $24 - oops!"], ["not bad for pho in dc. when you need a pho fix but can't get out to va or md.", 3.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "not bad for pho in dc. when you need a pho fix but can't get out to va or md."], ["Orange chicken!... Don't...", 4.0, "December 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Orange chicken!... Don't miss out!"], ["More than just Pho, they...", 4.0, "December 2, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "More than just Pho, they offer a ample menu."]]], ["Mai Thai", [["Great dinner", 4.0, "October 14, 2015", "paulat", "Houston, TX", 47, 15, "Our family was very pleased with our dinner on Sunday. The kids chicken satay was moist and flavorful. My tofu and vegetables was very tasty and the Pad Thai was quite good. We sat outside on a quiet street just a block off crazy M Street. Would definitely return."], ["Super", 4.0, "August 27, 2015", "Jack V", null, 25, 6, "Very extensive menu. Really too much to choose from. Reasonably priced. Good location. Your choice of dining inside or outside."], ["Friendly, excellent value", 4.0, "August 23, 2015", "Joan M", "New York City, New York", 52, 17, "This restaurant is very popular with the Georgetown U crowd. There is an extensive menu and the portions are very large. The food is very good. It is very informal and one can eat outdoors when the weather is nice."], ["Just ok", 3.0, "August 18, 2015", "longjch", "Cave Creek, Arizona", 229, 84, "I recently stopped by Mai Thai with friends for dinner and came away unimpressed. Avocado salad was tasteless, even with the dressing. Pad Thai wasn't very flavorful either. Coconut Shrimp was OK. Definitely not the most exciting Thai meal I've had."], ["Great Thai Food", 4.0, "July 29, 2015", "TCReviewsAll", "London, United Kingdom", 16, 13, "Mai Thai is a cute little place ticked away on Prospect Street. The ambience and decor is good and they also have free wifi. We ordered some vegetable spring roles for starters which were good. The presentation can be worked on a bit but the flavour is amazing. For mains we ordered a Green Curry Jae (Veg) and a Chicken...\n\n\nMore"], ["Wonderful, authentic Thai food!", 5.0, "May 27, 2015", "Karen S", "Hamilton, Bermuda", 16, 4, "We were blown away by this place. The service and food were excellent. Too bad it was our last night in Georgetown - we would definitely go back again. It wasn't pricey either."], ["Mai Thai", 3.0, "May 3, 2015", "Anitabrinks", null, 9, 0, "Hit upon this place by pure chance looking for somewhere to eat. Food was fabulous but our waitress really couldn't be bothered! Did not ask if we needed help with the menu , tried to walk away before I had finished my order. Hadn't asked if we wanted drinks and then looked blankly at me when I asked which beer...\n\n\nMore"], ["Don't Bother...", 2.0, "December 27, 2014", "laura t", "Melbourne, Australia", 18, 5, "Took family there as we all love Thai food and others liked it so we thought let's give it a go. We went for lunch - family of 4 and we got poor service and to me that over rides the actually food served. Okay, the food was good ( not great ) but our waitress was not in a...\n\n\nMore"], ["Delicious Thai in Georgetown", 4.0, "September 19, 2014", "teamtanner", "Brisbane, Australia", 29, 22, "We were steered to Mai Thai by our hotel and it was a good steer. Having a taste for good Thai we were keen to try it and had some favourites such as Penang and Massaman along with some others. All was very good including the appetisers. Good service and good price. Relaxed and kid friendly."], ["The first Thai food!", 5.0, "July 17, 2014", "Lau6176", "Milan, Italy", 13, 3, "I have eaten in this very nice place few days ago for lunch and it has been my first time at a thai restaurant. It was very very good, if you stop at Georgetown you cannot miss it!"], ["Pet friendly! Great food!", 4.0, "June 14, 2014", "Mia M", "Wallingford, Connecticut, United States", 83, 29, "We traveled to DC with our dogs for a fun weekend. I had heard that Mai Thai was dog friendly on bringfido.com, so we decided to stop here for a late lunch. They have outdoor seating on the sidewalk in front of the building which was very peaceful. The staff was very friendly and accomodating about the dogs. They brought...\n\n\nMore"], ["Thai food in Georgetown", 4.0, "May 28, 2014", "Kportfan", "New York City, New York", 5, 2, "The concierge at our hotel recommended this Thai restaurant. The restaurant was not crowded, we sat outside. Service was attentive and pleasant. Food arrived quickly and was delicious! No complaints."], ["Thai food catered to non-Thais", 4.0, "December 8, 2013", "Hepzibah T", "Singapore, Singapore", 66, 53, "The food we ordered (pad thai, tom yum goong, stir-fried seafood with basil leaves, fried rice and sushis) were tasty. However, the tom yum and the stir-fried seafood were not spicy at all even though we did ask the service staff to make them very spicy just like how Thai people would like them).\nThe presentation were good. The service...\n\n\nMore"], ["All Around Wonderful", 5.0, "November 10, 2013", "TRM1", null, 22, 4, "We chose this restaurant at the suggestion of a friend; he did NOT steer us wrong!\nWe had a reservation and were seated immediately. Out waitress was friendly and helpful; she suggested appetizers and, for one member of our party, an entre. Service was prompt. The appetizers were amazing. We actually ended up ordering another portion of the shiitake maki...\n\n\nMore"], ["Good Thai food, inattentive waitress", 4.0, "October 7, 2013", "RunningOnAndOn", "South Florida, Florida", 66, 30, "Food is very good. Location is great in Georgetown. The restaurant is very casual and comfortable. The only downside was that the waitress was very inattentive."], ["Very Good Thai", 4.0, "August 15, 2013", "SuperK3_0", "Charlotte, North Carolina", 39, 18, "My son and I had Pad Thai and Pad See Ew at Mai Thai and both dishes were very good and on par with the best Thai I have had."], ["Variety of choices for vegetarians", 4.0, "July 10, 2013", "VirginiaTravelbug", "Virginia", 35, 15, "We were a large group of vegetarians and there were enough dishes on the menu for us to order. The service was attentive and the food quite flavorful. Some of the dishes were a bit too toned down (would have preferred a bit more spice) but since we had kids in the group that worked out quite alright."], ["Nice Thai/Sushi in Georgetown", 4.0, "March 14, 2013", "VAPrgal", "Virginia Beach, VA", 89, 29, "We saw Mai Thai during a walking excursion around Georgetown and came back later in the evening for dinner. On a Sunday night, the place was hopping. My party of 4 ordered a wide range of sushi and thai dishes, all of which were quite good. Staff was very friendly and attentive, prices appropriate for DC. This is not my...\n\n\nMore"], ["Fun", 3.0, "March 14, 2013", "AshBearPig", null, 30, 11, "Fun atmosphere, I had my birthday dinner here and they were very accomodating. Its in a great location, 3-5 blocks away (walking distance) from clubs and bar scene. Food was good."], ["Convenient Location, Average Food", 3.0, "February 24, 2013", "AllAmerican4", "Arlington, Virginia", 50, 29, "One of the few restaurants that didn't have a long wait for a late Sunday lunch, so we tried it. First indicator. Atmosphere very relaxed, wait staff incredibly friendly and attentive, food average. Our group ordered Pad Thai (one with Chicken, the other with beef), Drunken Noodles w/ Tofu & Ka Pow. Entrees \"Amercanized\" -- for example -- Drunken Noodles...\n\n\nMore"], ["Tasty Thai food, nice atmosphere", 5.0, "February 21, 2013", "R M", "Athens, Ohio", 93, 39, "We had a great meal at Mai Tai while in town around the holidays. I enjoyed a delicious and warming bowl of soup to start and then a very nicely done seafood curry. I loved it -- they grilled salmon and then plated it on top of a puddle of spicy coconut curry sauce, surrounded by shrimp, pineapple and tomatoes...\n\n\nMore"], ["great food, nice location", 5.0, "January 23, 2013", "mihafl", "Gainesville, Florida, USA", 13, 3, "located in a very nice area, promenade-type, in georgetown, which for whoever does not know is frequented by a lot of tourists, this restaurant has a nice atmosphere.\nthey also have a nice terrace, which is so nice in the summer.\nfood is great, prices ok (about ** on a scale of ****)."], ["Fantastic Food", 5.0, "December 18, 2012", "Blue1201", "Canberra, Australia", 14, 4, "We were looking for Thai food in Georgetown and were really happy with this choice. I am a big fan of Thai food and found the flavours in the green and red curries excellent. The meals were reasonably priced and there was a good selection of wine."], ["Excellent food, good service", 4.0, "December 18, 2012", "Schwags", "Canberra, Australia", 75, 43, "Loved the red beef curry, the green curry, the appetisers were good too. We would recommend this restaurant for a casual meal with great Thai flavours and fresh ingredients. Wine was fine and service friendly."]]], ["High Velocity Sports Bar", [["Pricey but good", 3.0, "October 14, 2015", "BuckiNut76", "Columbus Ohio", 11, 4, "They have a lot of screens to make it easy to catch a game, and the food is really good. I really enjoyed the options of beers they had, however they are pricey!"], ["Good Burger and Fish", 4.0, "October 5, 2015", "Patty B", "Nashville, Tennessee", 294, 119, "We got in late and were looking for a decent dinner at the hotel we were staying at (Marriott Marquis). We were surprised to find such good food here as it is called a sports bar. We had soup that was served quickly and was nice and hot. My husband had the burger and fries and said it was good....\n\n\nMore"], ["No light entrees", 3.0, "September 27, 2015", "Kathy L", "Urbana, Iowa", 40, 6, "It was okay. My husband had baby back ribs that were very good. I had the salmon, which was okay. I did like the polenta and kale that it was served with. My biggest complaint is that they didn't have a \"lighter fare\" on their menu and I'm on a restricted diet. I thought all Marriott restaurants now featured lighter...\n\n\nMore"], ["Lunch and dinner", 2.0, "September 19, 2015", "Thomas A", "Staunton, Virginia", 81, 18, "If i just reviewed lunch it would have been rated a little higher I had the wings and pretty good service - after touring DC we decided to try the dignitary - that was a waste of time - so back to high velocity - service was very very slow waited forever for our check - maybe George was just...\n\n\nMore"], ["Good food", 4.0, "September 19, 2015", "Sherry A", "Fishersville, United States", 111, 14, "After touring the city, went back to hotel to relax and grab a bite. Had the chicken quesadilla and it was a big portion and rather good. Bar and lots of TVs to keep you up to date on the sport of the day. Reasonable prices on food and drinks. Only negative I have is the nasty city water they...\n\n\nMore"], ["Ok restaurant if you don't want to leave the hotel", 3.0, "September 12, 2015", "NDMIII", "Lynchburg, Virginia", 38, 8, "It is a standard Marriott sports bar. Service was good. Food was ok. We went there after a reception in the hotel and didn't feel like going out of the hotel."], ["Excellent food, affordable prices, fantastic service", 5.0, "August 28, 2015", "Gina E", "Nashville, Tennessee", 29, 6, "Great lunch and dinner selections conveniently inside the Marriott Marquis hotel (I did not try breakfast). Food was excellent, prices affordable, service fantastic.I would highly recommend High Velocity Sports Bar."], ["Want a place to watch the hubbub of DC?", 5.0, "August 24, 2015", "Fred O", "Tampa, Florida", 10, 1, "Great selection of craft beer. I loved the flatbreads to go along with the beer. And the service was friendly and outstanding."], ["Bday dinner and Blue Jay game!!", 5.0, "August 12, 2015", "Sandra M", "Mississauga, Canada", 9, 1, "We are enjoying a wonderful birthday dinner at the sports bar in the Marriott Marquis. We love our Blue Jays and it was awesome that they put our game on the big screen! George provided excellent service and ensured we had a great evening!!"], ["It's OK, but ....", 2.0, "August 11, 2015", "VeliMM", "Ocean City, Maryland", 11, 4, "After a couple of hours driving, decided to get something to eat and closest place was High Velocity sports bar. Overall it's a nice place if you're there only for couple drinks or watching a game, but when comes for the food ..... wrong choice. Service is OK, but quality of the food is ... bad. We ordered wings, ribs...\n\n\nMore"], ["Okay for late night", 3.0, "July 29, 2015", "mrsniice", null, 26, 10, "Good food, slow servive, average prices for the city. Overall it is a good place to eat if you need a meal late at night and you have no where else to go."], ["Decent food and drink, nothing special. Good service", 3.0, "July 21, 2015", "Orso52", "Boston, Massachusetts", 484, 140, "Located in the Marriott Marquis Convention Center, High Velocity offers an interesting and diverse menu. I stopped in for lunch and had the soup if the day, a creole style gumbo which was very good. The Thai chicken salad I had for the main was rather uninspired and bland. The service is friendly and efficient."], ["Long wait", 3.0, "July 10, 2015", "Huskergal58", "Illinois", 10, 0, "Food was okay, long service time. Chicken and tortilla soup had neither one in it. Food was pricey for portion size, I know it is a hotel restaurant but you expect good service in a hotel like this."], ["Typical Sports Bar", 4.0, "July 6, 2015", "Taihosan", "Orlando, Florida", 85, 30, "While staying in the Marriott Marquis, we decided to grab a few sandwiches at the sports bar. We were seated immediately because it was not crowded. My husband was happy with all the TV screens, although the particular event he wanted to see was not up for viewing. Service was pretty fast but could have been a little more attentive....\n\n\nMore"], ["Good Food quick service", 4.0, "July 1, 2015", "amasnyc", "New York City, New York", 174, 35, "Both restaurants near the hotel only were serving Brunch on Sunday, so we went back to the Hotel and ate at High Velocity. Servers were efficient but would have liked them to be more friendly."], ["massive nachos", 3.0, "June 30, 2015", "FuddleWuddle", "London, United Kingdom", 21, 8, "tasty nachos but could have fed a family of 4... UK portion size!\ndidnt feel uncomfortable as a single business traveler, unlike some bars"], ["Very average", 3.0, "June 25, 2015", "Lori B", "Knoxville, Tennessee, United States", 89, 28, "The atmosphere and vibe of this place are really cool! The food is painfully average. We spend around $60 for two people and wish we would have went somewhere else.\nWe stayed in the Marriott Hotel connected to this restaurant. It stormed pretty bad one evening so we decided to eat here and avoid the storm."], ["Cool space and a great setting for this hotel bar", 4.0, "June 21, 2015", "tferraro", "south florida", 440, 150, "Smack in the middle of the Marquis hotel this large open space bar/restaurant is in a great place and is the place to be while staying at the Marquis. Cocktails are great and the food while limited is pretty good. Service can be a little slow at times but overall this is a great place to hang and enjoy!!"], ["Average food", 2.0, "June 20, 2015", "KtownBrown", null, 9, 2, "I ordered carry out. The chicken tenders were frozen (my assumption based on the breading and mouth feel) but they were cooked thoroughly. Hardly worth $12. The flatbread was oily and oddly chewy, and agian, overpriced for the quantity and quality. Maybe the drinks are good, but the food is just average."], ["Hot Spot to Watch the Game", 4.0, "June 10, 2015", "Angie D", "Oak Park, Illinois, United States", 48, 16, "I came here to get a late night bite and watch the game, there is no bad seat and the fish tacos were on point."], ["The Mighty Mo is Mighty Good", 4.0, "June 8, 2015", "Darrell6t", "Washington DC, District of Columbia", 45, 15, "We had supper here while staying at the hotel. We had a Mighty Mo from the old Hot Shoppes menu and a beer. The beer menu is huge and there is something for every beer lover. The double hamburger sandwich comes with delicious onion rings and a bit of slaw. Our server was pleasant and efficient. The place was a...\n\n\nMore"], ["Great Sports bar", 4.0, "June 3, 2015", "impresiv1", "Chandler, Arizona", 205, 77, "This place is inside the Marriott Marquis, and for being a hotel restaurant, this place is pretty good. There is a separate entrance so you don't have to walk through the hotel lobby. I stayed at the Marquis for 3 nights and probably went here 5 times. Great beer selection, Nachos are HUGE and awesome. Bartender guys were nice, funny,...\n\n\nMore"], ["Very good lunch & service", 4.0, "May 22, 2015", "JamieNSC", "Charleston, South Carolina, United States", 73, 17, "We are in town for a convention and stopped here for lunch. They are pretty busy between the hotel guests and business from the convention center so there was a wait but they seem to be pretty efficient about keeping things moving. I had the turkey club and chips and thought it was really good. My companions enjoyed their selections...\n\n\nMore"], ["Nice sports bar with good food in Marriott Marquis by the Washington Convention Center", 4.0, "April 20, 2015", "Orso52", "Boston, Massachusetts", 484, 140, "I stopped in here for lunch during a meeting at the Washington Convention Center across the street. It is surprisingly good for a hotel restaurant. My chicken pita pocket sandwich was fresh, hot and tasty. A reasonably healthful option. Of course this was offset by the also excellent sea salt fries. Service was friendly, attentive and quick, though I never...\n\n\nMore"], ["Refreshing food/drink - in a bright/clean place.", 4.0, "April 19, 2015", "TomSahl", "Spokane, Washington", 112, 34, "We had a great server, who not only recommended delicious menu items but who gave us a tip that directed us to our best dining experience during the trip ...\nFresh and abundant salad proportions with refreshing libations."], ["Great burgers", 4.0, "April 6, 2015", "John P", "Leesburg, Virginia", 72, 28, "Watched NCAA BB games, had a craft beer and a above average burger with great fries. What more could you want?"], ["Sports Bar", 4.0, "April 5, 2015", "Matt T", "New York", 25, 5, "The High Velocity Sports Bar is excellent for a hotel restaurant. We had buffalo wings and fries and both were very tasty. I recommend you go here if you are staying at The Marriott Marquis Washington D.C. or want a late snack."], ["Jambalaya was great!", 3.0, "March 31, 2015", "LASunshineLosAngeles", "Los Angeles", 24, 6, "I ordered jambalaya for a late night dinner since it was suggested by the restaurant manager - taste was good and ingredients were great! If the chef could switch the pasta from Penne to linguine or fettuccine, that would be much better! (Since the Penne was a little too hard for my standard.)"], ["Great Food, Good Ambience", 4.0, "March 22, 2015", "krimar", "Pennsylvania", 54, 184, "You can choose to eat the bar or at a table--unique surfboard tables--food is great but the service was a tad bit slow (we ate in an off hour). That's the reason for the 4 rating."], ["Good food and service", 4.0, "March 22, 2015", "Jackie328i", "Baldwinsville", 27, 11, "We tend to have low expectations for hotel based restaurants, but the food here was good and service great. The only complaint, one day I wanted just a snack, but the hummus plate had just 2 sticks of celery and just 2 carrots. Good thing I wasn't that hungry! They did make a great Cosmo though."], ["Hi Velocity is a Classic Sports Bar", 4.0, "March 19, 2015", "SeanOden", "Thunder Bay, Canada", 77, 23, "Hi Velocity Sports Bar is just what it says. It is in the Marriott Marquis Washington hotel in downtown Washington. I have reviewed the hotel separately.\nHi Velocity is fairly large, with a range of table choices, and lots of large screen televisions on all the walls. No surprise, there were sporting events on all screens.\nOn a Thursday night...\n\n\nMore"], ["Good burger but sloooooow service", 3.0, "March 16, 2015", "Jose O", "Fairfield, Connecticut", 48, 12, "I ate here on two occasions. The first was better (on the restaurant side), but the second was on the bar side where service was glacial and servers seemed to not really care. On the plus side, I found the food to be good...though slightly expensive. If you need something at the hotel, this is the less expensive option. However,...\n\n\nMore"], ["Service Needs Help!", 2.0, "March 5, 2015", "Glynis M", null, 9, 3, "The wait staff needs intense training so that they can get the orders correctly and the menu needs to be revamped."], ["Ok but not wonderful", 4.0, "March 4, 2015", "ratfinkle", null, 42, 12, "Stopped in for dinner after arriving at the hotel. Nice decor and lots of TV screens if you want to watch the sports. My wife had and enjoyed the fish tacos but I give the nachos a resounding \"meh\", mainly because the cheese was completely tasteless."], ["Great Bar Food", 4.0, "February 23, 2015", "George S", "Cincinnati, Ohio", 139, 25, "All kinds of beer on tap and a lot of big screen TV's, best surprise is the great food! Weather was nasty out side so it was good that the restaurant was in the hotel."], ["Just Average", 3.0, "February 22, 2015", "Nicholas M", null, 9, 1, "We have eaten here several times during this stay. The menu is skimpy and inconsistent. The service consistently sucks. Once the food is served the waiters don't check in our refill drinks. The food is ok, but nothing to write home about."], ["Overall good food", 4.0, "February 18, 2015", "SBM06", "NJ", 25, 8, "Finding vegetarian is always hard. They had good flat bread and veggie burger. Service was good too."], ["Great Food", 5.0, "February 3, 2015", "TravelerSandy", "Grand Rapids, Michigan", 37, 15, "Each in our party ordered something different. We all agreed the food was good and we had great service. It was a bit noisy that night as it was Super Bowl Sunday."], ["GOOD MENU", 4.0, "January 24, 2015", "NANCY M", null, 40, 24, "Didn't like the setting- tv screens etc. BUT! you can sit in lovely lobby and order from the same menu"], ["They went out of the way to accommodate us!!!!", 4.0, "January 21, 2015", "Cheryl B", "Milford, Connecticut", 74, 29, "Spent four nights in the hotel that this restaurant is in. Late meals because of business. Both nights the soup was not my favorite so I asked if they had french onion. The chef made it special for us and it was some of the best soup I had ever had. Warm filled with rich broth, I can't thank you...\n\n\nMore"], ["OK", 3.0, "January 15, 2015", "Matt S", "Brighton, Michigan", 579, 165, "High Velocity for a meal is an OK place. There isn't that extensive of a menu (it appears that it is the same menu for lunch and dinner), and hands down the food is pricey (typical for a hotel bar/restaurant). I ordered the jambalaya for lunch. It was decent, but nothing stand-out. I thought the shrimp, while large, wasn't tender...\n\n\nMore"], ["Hit and Miss", 3.0, "December 14, 2014", "Cougar729", null, 22, 13, "We stayed at the Marriott for a week and ended up at High Velocity twice.\nTrip 1- Sunday night during NFL football, the place was pretty full. The hostess told us we could sit at bar or wait for a table even though she wasn't sure how long the wait was... Ok... Walked to bar, no seats available, on the...\n\n\nMore"], ["Low quality bar food but your only option in the Marriot", 3.0, "December 12, 2014", "CSSnowshoer", "New York City, New York", 724, 327, "Hard to believe that a hotel as big as the Marriot would not have a decent dinner restaurant for its visitors. This restaurant serves bar food. Minimally healthy. And it appeared that most of it had been pre-made then just heated up for us.\nI was marooned at the Marriot for days, and ended up having mutliple meals here. The...\n\n\nMore"], ["Good luck getting served during the lunch rush", 2.0, "December 7, 2014", "Anthony K", "Pittsburgh, Pennsylvania", 103, 55, "It is located in the Marriott Marquis and is quite bust during lunch. I should preface that by saying there was an international neuroscience conference going on just across the street at the convention center that was attended by over 30K all looking for a place to eat. Perhaps it is not so busy at other times. Anyway, I went...\n\n\nMore"], ["Filling and Substantial for the Weary Traveler", 4.0, "December 4, 2014", "Barbara M", "Albuquerque, New Mexico", 80, 20, "For those needing food after a day of travel, the sports bar filled the bill. the reuben that I had was very good and the soups that others had were really enjoyable. and it was a delight to be able to watch what was happening that day in sports as well."], ["good bar food", 5.0, "December 2, 2014", "ToniaYVR", "Vancouver", 43, 31, "Quite a nice ambiance. Not too loud. You can sit and have privacy. Servers very friendly and a good selection."], ["Avg at best", 3.0, "November 25, 2014", "BobBarb", "Upland, Ca", 46, 19, "Very noisy, limited menu,tables close together.\nMy wife had the new york steak and said it was very good. I had a cajun dish that included some very large and plentyful shrimp. Even with the large shrimp the dish was at best average."], ["Noisy & Dark but food good", 3.0, "November 17, 2014", "Thurstonland", "The Hague, The Netherlands", 103, 72, "After a misunderstanding about which table we were seated at, we got served.\nThe place is noisy and dark. I had to use the light on my phone to see the menu with (ok - this could be a reflection on my age but it's a first for me).\nSeating is comfortable.\nThe menu is pretty much what you would...\n\n\nMore"], ["Ah-MAZE-ing service + atmosphere", 5.0, "November 7, 2014", "Shel D", null, 4, 0, "My family (husband and 4 boys) were in town one weekend and found this awesome sports bar around the corner from our hotel. The tv screens and huge spacious booths were great but the service was really what blew us away (the complimentary ice cream cookie sandwiches and huge beer menu didn't hurt!) Really happy, busy atmosphere. Clearly a well...\n\n\nMore"], ["Quick service", 4.0, "November 4, 2014", "ndm685", "Simsbury, Connecticut", 49, 12, "Great quick eats at the Marriott Marquis. Service was very good. A nice place to light upon arrival."], ["Great Waitress", 4.0, "October 30, 2014", "Beepa1942", "DeWitt, Michigan", 9, 2, "A good place to watch football and unwind. Our waitress made the difference. She was charming, personable and attentive to the several tables she was covering. The stark steel and glass theme prevailed giving the place a \"factory-like\" appearance."], ["Visit son", 3.0, "October 29, 2014", "Pjhic", "Wilmington, North Carolina", 7, 2, "Nice place to watch football. Nice layout with comfortable chairs and couches. Food was typical bar food."], ["Modern steel/chrome makes for a cold sports bar.", 3.0, "October 24, 2014", "Travels-Lots3759", "Los Angeles, California", 31, 10, "I had a mixed experience here. I went in for a quick meal and it took a while even to get a glass of water. However, when I called to the manager's attention (who had stopped by the table to check in - thanks!) that my soup seemed to be missing some key ingredients, they were quick to take it...\n\n\nMore"], ["Nice for a quick bite when you stay at the Marriott", 3.0, "October 22, 2014", "Collierke", "Rumst, Belgium", 31, 11, "We stayed at The Marriott in july and ate here twice.\nService is good and food isn't expensive.\nYou shouldn't go here for fine dining but more for quick dinner.\nWe ate the chicken pita and hamburgers, both were good, a lot better then the regular fast food chains. The water however has a bad taste, bust that's the case...\n\n\nMore"], ["Food nothing spectacular", 3.0, "October 18, 2014", "desertcaper", "Indio, ca", 32, 15, "Just average & pricey but all food in DC is pricey. Menu is limited but lots of beer choices & very convenient when your tired after long day of walking."], ["Getting better", 3.0, "October 7, 2014", "Carrie M", "Richland, Washington, United States", 6, 4, "The food is good, but the menu is a bit limited. The steak, flatbread, quesadilla and wedge salad are great. If you are low carb you will be limited."], ["Bar staff is just plain awful", 2.0, "October 6, 2014", "gcmanke2", "Bedford, Indiana", 100, 98, "The food was great, but I nearly walked out in disgust with the rudeness of the bar staff. The management needs to either clean house and hire some bartenders who actually like their job, or train their staff on customer service 101."], ["Fun to watch sports, but basic bar food", 3.0, "October 6, 2014", "GamecockGirl", "Columbia SC", 102, 67, "The menu is fairly limited and is standard bar fare -- wings, burgers, fries. etc. But it's a great place to watch sports, with many huge screens, and the bartender I had was attentive and friendly."], ["Fun place", 4.0, "October 5, 2014", "jmull50", "Iowa", 152, 48, "Sparkling clean place. Great server (Ness). Had appetizers and drinks during happy hour and prices were reasonable."], ["Love the Baked Chips and the Classic Turkey club sandwich!", 4.0, "September 30, 2014", "annh128", "Southwest Region, Cameroon", 9, 4, "Slow service in th In-Lobby Cocktail Lounge. Only 3-4 wait staff , despite the crowd. Often took quite a while to get a server to take your order."], ["Great well Designed Space for Networking", 5.0, "September 29, 2014", "Maxine S", "Nyc", 37, 6, "I loved the setup, comfortable seating areas, excellent drinks and bar snacks. Cosmos and spinach dip was a hit with me."], ["Why walk the city looking for better?", 5.0, "September 15, 2014", "Dave B", "Alpine, Utah", 64, 24, "I stayed at the new Marriott Marquis, and this sports bar/restaurant was right here in the building so decided to give it a try after walking around looking for a place to eat prior. I was pleasantly surprised at the quality of the food including the wings and ended up coming back the next day as well. Great atmosphere and...\n\n\nMore"], ["Trendy and friendly", 4.0, "September 10, 2014", "pickybiz", "US", 150, 45, "High velocity offers a variety of food in a trendy, sports-based atmosphere. Sometimes it felt a bit frantic with so many TVs showing so many things, but the service was fast and the food was very good."], ["Great ending to a perfect day", 4.0, "August 15, 2014", "Tanya B", "Seminole, Florida, United States", 81, 37, "We walked about 10 miles plus today touring the city. Not exaggerating! I had on a pedometer. We were tired and came back to the hotel. Didn't really want sports bar food but decided to take a chance on High Velocity. The atmosphere was relaxing and upscale. I am sure it can get loud during major sports event but it...\n\n\nMore"], ["Some growing pains", 3.0, "August 13, 2014", "TMP826", "Atlanta, Georgia", 11, 6, "Went to High Velocity for a late lunch and was promptly seated. I ordered the beef satay salad which seemed to take a while (about 30 min.) to deliver (restaurant was not busy at the time). The beef was overcooked and dry and did not taste as if it had been marinated. Some of the salad greens were stale and...\n\n\nMore"], ["Good food, not such good service", 3.0, "August 11, 2014", "DealLovingTraveler", "Seattle area", 36, 16, "As a guest of the hotel, I ended up eating here three times. We had issues the first time we ate here. It took 20 minutes to take our order and another 35 to get the order to the table -- not good, especially since the restaurant was only about 1/4th full. The next time, the hostess was ready to...\n\n\nMore"], ["Typical Hotel Sports Bar", 3.0, "August 10, 2014", "FredRo1948", "Metuchen, New Jersey", 104, 69, "Good food, average service. A bit noisy. Located in the Marriott Marquis and the better of two options there for lunch."], ["Same ole...", 3.0, "August 5, 2014", "Donna B", "Voorhees, New Jersey", 8, 0, "Nothing exciting or new with the food offered at this hotel resturant. We found the menu offered at the other two hotel resturants."], ["Late nights working dinner", 4.0, "August 5, 2014", "travelerlynn", "Washington", 12, 3, "Good food, good service. Great Truffle Fries! Admittedly I ate there almost all of the nights I was there due to lack of time and options. But enjoyed the food, simple, good portions and fresh."], ["Tasty food", 4.0, "July 27, 2014", "Funmom123", "Atlanta, Georgia", 51, 26, "Located inside Marriott Marquis, very good sports bar. Multiple television screens on the walls. American cuisine with tasty food. Lots of beers choices. We ate there twice during our stay."], ["Good Sports Bar", 4.0, "July 23, 2014", "TheFoodLegend", "Charleston,SC", 184, 44, "Standard sports bar. Instead of pitchers of beer, it comes in 3-foot high cylinders. Cute. Saw World Cup final there and the noise level was tolerable. Food a notch above standard, since it's in a Marriot. Convenient to Convention Center."], ["Dinner with family", 5.0, "July 14, 2014", "Kathleen P", "Connersville", 47, 9, "Hostess brought manager to discuss our dietary needs before we decided to eat. The food was prepared especially for us as directed. The server was pleasant and friendly with our toddler. Highly recommend the churros for dessert!!"], ["Better than average hotel bar", 4.0, "July 14, 2014", "Anna D", "Bordentown, NJ", 45, 27, "We arrived at the Marriott Marquis at around 11 pm after a three hour drive from NJ, and wanted to grab a couple drinks before we turned in for the night. The woman who checked us in suggested High Velocity and we were very pleased. They have about fifty beers on tap, including some very good local brews that are...\n\n\nMore"], ["Not JUST a Typical Hotel Venue!", 5.0, "July 11, 2014", "desvw1029", "WV", 26, 8, "Enjoy a WONDERFUL meal in a brand spanking new hotel! Located in the new Marriott Marquis, more food than we could possibly eat...(I'm 3 pounds overweight after one meal lol). TV's everywhere. Great wine and beer list. GET the M Burger...O. M. G. Just another added perk for staying at the Marquis!"], ["High Velocity Is Right Name for Sports Bar", 5.0, "July 10, 2014", "ReallyNJ", "Bowie, Maryland", 61, 20, "Large screen televisions, great company, large booths, and decent food (reasonably priced) equals a great time in High Velocity Sports Bar. We enjoyed this sports bar."], ["Great Burgers!", 4.0, "June 28, 2014", "Robin D", "Seattle", 102, 39, "A very well done sports bar, screens are everywhere, and clear. Burgers are very good. The restaurant is open late, which is a plus if you are arriving late."], ["Great food and great service", 4.0, "June 16, 2014", "Ralph H", null, 6, 1, "The entire staff in this restaurant is friendly and committed to making your time enjoyable. Had steak one night, jambalaya another night, and a Reuben for one lunch, and they were all excellent. Didn't like the parmesan truffle fries, but that's a personal preference, and it was worth giving them a try. They have plenty of tv's tuned to sports...\n\n\nMore"], ["Great addition to the city in a spectacular new hotel, Marriott Marquis DC", 4.0, "May 3, 2014", "AJP57", "Washington, DC", 158, 46, "This is the largest hotel in DC now and it just opened a couple of days ago. Marriott outdid themselves; it's gorgeous with a fabulous atrium and sculpture. It's light and airy. The Anthem Restaurant is supposed to feature items from the former Hot Shoppes Restaurant chain which is how Marriott got its start in DC when I was a...\n\n\nMore"]]], ["The Cafe at National Archives Museum", [["Good Enough for Me", 4.0, "September 29, 2015", "sue r", "Munroe Falls, Ohio", 52, 34, "We ate lunch at this little cafe while visiting DC. Food was good, not expensive, and service was fast. Nothing elaborate, burgers, sandwiches, chips, drinks. There is a separate dining area that is comfortable,"], ["Friendly and accomodating.", 5.0, "July 2, 2015", "Francisco O", "Iowa City, Iowa", 116, 44, "This place was an unexpected pleasant surprise. It was a perfect place to grab a quick lunch. We bought burgers, veggie burgers, fries and onion rings. All tasted very good. My little girl asked for a grilled cheese and even though it wasn't on the menu they made her a very nice grilled cheese sandwich.\nThe veggie burger also wasn't...\n\n\nMore"], ["A hidden gem!!", 5.0, "April 3, 2015", "sctigergrad07", "Pendleton, South Carolina", 27, 14, "My sister and I are lunch here when we visited the museum. Lots of sandwich options, including cheesesteaks and cheeseburgers. Everything is made to order, and they customize it to your request. The ladies working here are absolutely delightful! There are also snack, drink, and dessert options. The most surprising thing: despite being in a museum, everything is reasonably priced!!...\n\n\nMore"]]], ["Murphy's Pub", [["Murphy's Irish Pub Burned Down", 4.0, "May 3, 2015", "elaine s", "Missoula, Montana", 495, 103, "This pub on Calvert Street in NW Washington was really great - served delicious pub fare and very friendly people, but we learned a fire caused it to close suddenly and is no longer open."], ["Average", 3.0, "March 19, 2015", "Dennis F", "Alexandria, Virginia", 20, 3, "It's just average food nothing to write home about. Had the Irish Breakfast.....poached eggs were over cooked sausage was store bought."], ["it was OK for lunch", 3.0, "September 30, 2014", "Suzcamp", null, 72, 22, "Food was fine and the drinks were fine but just your basic pub. Good for a quick bite. Staff was friendly and there is outdoor seating."], ["A local pub", 4.0, "September 8, 2014", "Travelerbeme", "Marlton, New Jersey", 29, 16, "We stopped here one day as we returned from the Metro to our room at the Omni. The day was hot, the beer cold and the staff friendly. Reasonable prices."], ["LOVED IT", 4.0, "August 25, 2014", "Rob B", "Tulsa", 14, 1, "Loved the outdoor seating and the great service. Pricing was fair and the food was great ( Fish and Chips with a cold beer )."], ["Poor service, mediocre food.", 3.0, "July 23, 2014", "Carla B", "Powell, Ohio", 19, 8, "We went here on a weeknight because it was close to the hotel and seemed to have a good menu. Unfortunately we had a server who tended to wonder aimlessly around the restaurant so much that after ten minutes the hostess came back and took our orders. We were there for around 45 min before we got food. I had...\n\n\nMore"], ["Lacking Personality", 3.0, "July 19, 2014", "ladygilormini", "Owatonna, Minnesota", 33, 13, "This place was close to our hotel and one of the many places we walked by when we were exploring the neighborhood. It looked interesting. We returned for dinner and were disappointed at the lack of personality. We had set our expectations a little higher. The food came out fast and hot and was just okay. Service was also just...\n\n\nMore"], ["Pretty good", 3.0, "July 16, 2014", "jennifer v", "Atlanta, Georgia", 63, 16, "This was an alright little place. Good beer, pub food. Service was average, nothing spectacular. The environment is decent - think neighborhood pub. I was not blown away with anything about it, but if you are looking for a cold beer and some pub grub, you will not be let down, but you won't be impressed either."], ["Good American Irish bar", 4.0, "July 11, 2014", "Neil P", "Paignton, United Kingdom", 8, 2, "Good range of beers and basic bar menu. Was able to watch the football (soccer) World Cup on several TV screens"], ["Woodley park", 4.0, "July 7, 2014", "HUGOTRAVELS", "THE NORTH", 7, 3, "We popped in for pint and to watch the world cup match but ended up listening to the entertainment. They had a guy in with an acoustic guitar singing Irish songs and little ditties with audience participation which made for a great atmosphere."], ["Irish bar with an american singing Scottish songs", 3.0, "July 7, 2014", "ReggaeJames", "Kingston-upon-Hull, United Kingdom", 19, 7, "nice little pub and probably the only place in five or so miles that will actually serve you a full pint but all in all pretty standard. and as the title says i don't think they really understand the Irish theme"], ["Tatty", 2.0, "July 5, 2014", "Michelleandave", "Liverpool, United Kingdom", 56, 28, "Average pint, needs some TLC, although people were, we didn't feel compelled to eat there, seemed a bit grubby"], ["Good Irish Food", 5.0, "July 2, 2014", "mrsnutpop", "Crestline", 125, 41, "Great find on business trip but it gets veery busy at night. Get there early for lunch as the tables fill up then too. Corned beef and cabbage was some of the best I've had next to moms."], ["An Irish classic in Washington DC", 4.0, "July 1, 2014", "pah4551", "Melbourne, Australia", 13, 5, "This was Great, nice food very friendly staff, fantastic enviro, hey taste the beers to find the the one you like best, what a great place I love it, I don't want to go home"], ["First place we had dinner", 5.0, "June 24, 2014", "kary84", "Connecticut", 47, 22, "And we were not disappointed. It was quiet and right across the street from the hotel. It was a perfect evening."], ["Friendly", 5.0, "June 18, 2014", "mazpaphos", "paphos", 14, 7, "Great place for a very casual drink after sightseeing. Not the smartest place but the foods lovely and not expensive"], ["Your average Irish pub", 3.0, "June 16, 2014", "zimof1", "Purrmerend", 289, 115, "Nothing big nothing special, but if you are into a cold beer and some snackfood, you might want to go here. the beer is cold and the food greasy, particulary the nachos. But they do have outdoor seating!"], ["Nice diversion from Marriott Wardman Park \"hotel food\".", 4.0, "June 15, 2014", "Bill A", "Damascus", 72, 21, "Fun atmosphere and good food (not great). I've only been during lunchtime, but it looks like they must have a good time here in the evenings. A little loud and close, but that's what I expect in an Irish pub. Outside dining is popular when weather is good and there are even some all weather \"curtains\" to help when weather...\n\n\nMore"], ["Great food, not so good service", 4.0, "May 28, 2014", "LauraAHA", null, 99, 30, "We walked over from the Marriott, and picked this restaurant so we could sit outside. We liked that locals were there with their dogs, so we had hopes that we would find good food if locals were there. We loved our food, but not the service. The salmon filet was delicious, and the Pasta Primavera with chicken was outstanding -...\n\n\nMore"], ["Good beer selection, Good food as well", 5.0, "May 11, 2014", "kalvinr11", "Milford, New Hampshire", 56, 30, "We were staying at the Marriott across the street and needed an affordable meal close by. We went in during happy hour mid-week, and were glad to see 1/2 off drafts and $5 Guinness pours from 4-7PM. We consumed a few beers a piece and had some quite good food. The food was good for an Irish pub, and the...\n\n\nMore"], ["Love the Service", 5.0, "April 20, 2014", "Margc_11", "Ontario", 34, 11, "Asked about unique dishes and tried the home made crab cakes with rice and green beans, husband had the Murphy's chicken wings which he liked very much. Great meal."], ["Food, not so great", 2.0, "April 14, 2014", "Rudyfs2", null, 138, 35, "Stopped there for breakfast as the popular place next door was packed with an hour wait.\nI had the cornedbeef hash meal. It was definetly from a can which was surprising from an Irish themed pub. It was mushy and identical to the cheapest canned hash from your local supermarket."], ["Great pub with Excellent food and service", 5.0, "March 3, 2014", "TBUB", "Woodstock, Georgia", 58, 11, "Good meal selection within easy walking distance from Wardmann. Daily specials are especially good value and staff is exceptional."], ["Decent pub", 3.0, "March 1, 2014", "Rachel548", "Columbus, Ohio", 73, 20, "Stopped by for dinner after a convention at the Marriott and the place was really busy. Service was slow, but that's to be expected when it's so busy. Atmosphere was laid back and the location is close to hotels and the metro. Decent selection of drinks and I thought the food portions were just right. Price wasn't too bad for...\n\n\nMore"], ["Good Time", 5.0, "February 17, 2014", "Jon C", "Yorktown, Virginia, United States", 185, 55, "Had dinner and drinks there last week. I had a fish sandwich and my partner had stew, Both were very good and was reasonable. Made it there for happy hour and it was a good deal. Definitely will go back, easy walk from Metro and the Marriott."], ["Good Food, Good Value", 4.0, "January 13, 2014", "Munrovius", "Westfield, Massachusetts", 56, 33, "Good spot for a dinner that is good and non-elaborate. Try it if you are not looking for luxury. Good drinks. We tried Murphy's because it was across the street from our hotel and we made a good choice. Crab & crawfish casserole, mac & cheese, burgers, all good. Friendly service, big-screen TV's. We went back a second night when...\n\n\nMore"], ["Good Irish fare, excellent service", 5.0, "December 27, 2013", "Traveler44Chicago", "Chicago", 38, 17, "We walked into Murphy's on a cold and rainy night, and asked to be seated somewhere warm. We were immediately seated right by the fireplace. The staff was friendly and attentive, and the food (Irish fare, plus other offerings) and drinks were of good quality. I would highly recommend this to anyone looking for a pleasant meal in the Connecticut-Woodley...\n\n\nMore"], ["pretty good", 4.0, "November 15, 2013", "2explrs", "knoxville", 104, 40, "We went here for lunch. The spinach artichoke dip was quite good. Husband had chicken curry and thought it was quite good. I got a chicken salad and it was quite tasty as well. The prices are a little high for what you get but at least it tasted good. We came for lunch, we were there around 11 which...\n\n\nMore"], ["OK Pub Food", 3.0, "August 5, 2013", "Equity", "Avon, CT", 409, 573, "I have been to Murphy's a few times as it is very close to the Omni Shoreham Hotel where I like to stay in D.C. It is very near the Woodley Park Metro station. It is popular with locals and tourists alike and is nice for a quick drink or burger. We had burgers the other night. While the quality...\n\n\nMore"], ["Average Pub", 3.0, "May 7, 2013", "donjol", "New Jersey", 105, 28, "We went for lunch after finishing a half marathon, looking for a burger or a sandwich and fries. I ordered the corned beef sandwich and was disappointed by the lack of meat and the potatoes. I was really looking forward to some fries and instead we all got a few potato slices. Not at all satisfying. The dining area was...\n\n\nMore"], ["Great drinks and specials!", 4.0, "January 26, 2013", "Ljd619", "Reston, Virginia", 42, 24, "I went to Murphys last December with some folks from work. I called ahead to make a reservation and give them a heads up because we had quite a large group. The manager was very nice and accomodated us beautifully. They have 1/2 off drinks and food during happy hour, actually they have specials every day. The place is not...\n\n\nMore"], ["An Excellent Find", 5.0, "October 22, 2012", "Steven W", "Washington DC, District of Columbia", 187, 64, "On a trip to DC, we found this place very close to our hotel. It was not too crowded for a Saturday night. The food was excellent. Two new items are Irish twists on bar food. First is a Corned Beef and Cabbage Spring Roll, served with a dipping sauce of stone ground mustard, honey and other seasonings. The second...\n\n\nMore"], ["Great food and value in a sea.of over priced restaurants", 4.0, "July 21, 2012", "Scott D", "Niagara Falls", 15, 17, "It was so good the first time we went back and brought friends."], ["Good value in DC", 5.0, "March 9, 2012", "Claudio Z", "Fort Worth, Texas, United States", 4, 1, "While staying at DC this past week I visited this place twice. Both times te food was great. Service a little slower in the evening hours but still worth the wait. Apple crust pie is good and the fish & chip are great! I would definetly go back!"], ["Great atmosphere, generous pourings, cute Irish bartender!", 4.0, "July 21, 2011", "Petwriter", "Jupiter, Florida", 152, 118, "This place has a great atmosphere, the whiskey was generous and the bartender, though too busy to talk, had an Irish brogue and was quite handsome! The bar is very polished and heavy wood, and there are Irish trinkets, posters, and flags about-making the atmosphere very Irish. It reminded me of the pubs in Dublin. Loved it."]]], ["Postscript at the Madison", [["Good food for a business trip", 5.0, "October 14, 2015", "Teshina W", null, 4, 0, "I'm no foodie by a long shot, but I must admit that I enjoyed the food and the drinks - a lot! Considered \"pricey\", but it's DC!!! Everything can be a bit pricey! Try it out and see!"], ["Great bar and restaurant!", 5.0, "September 20, 2015", "casswife", "Dunfermline, United Kingdom", 256, 294, "This is an excellent bar and restaurant, particularly when served by Sonia! The food is good as is the atmosphere."], ["Could be better.", 2.0, "August 3, 2015", "docbsullivan", "Jackson, Mississippi", 20, 3, "Slow service, good drinks. Do NOT get the beignets if you've been to Cafe DuMonde or anywhere in New Orleans."], ["Lovely food but expensive", 4.0, "July 14, 2015", "EmzeC", "Manchester, United Kingdom", 4, 0, "We were staying at the Loews where Postscript is located.We were meeting up friends coming up from Carolina. It was gone 20:00 when they arrived and all of us were hungry and it's very hard to find a place that we all wanted to eat at so we settled on the postscript it was lovely food I had the fish...\n\n\nMore"], ["Outstanding service", 5.0, "June 25, 2015", "Nina C", "Walla Walla, Washington", 32, 3, "The food was excellent but was outclassed by the servers. It was a pleasure to dine there with not being hurried and the knowledge of the food by the servers. What fun!"], ["Saturday Night and NOT Open!", 1.0, "March 31, 2015", "FlightNursetraveler", "Staunton, Virginia", 44, 31, "So the Madison greatly promotes Postscript. All sorts of yummy sounding drink specials and small bites. How in the world is this NOT open on a saturday night????"], ["Great bar food for a late evening arrival", 4.0, "March 7, 2015", "ShutterGo", "Philadelphia, PA", 41, 86, "Checked in late, so grabbed a salad and a beer. The kale Caesar was very tasty and the IPA has also very nice. The bartender was friendly and provided just the right amount of attention."], ["Good \"Bar\" fare and Drinks are Excellent", 4.0, "February 26, 2015", "R K", "Woodbridge, Virginia", 200, 64, "Nice bar and light eating area in lobby of hotel. Get a table with your back to the bar and watch the people come and go! There were two of us for a late after business lunch/early dinner before the Kennedy Center, so we shared the Charcuterie Board and each had the burger. No complaints, prices were reasonable and wait...\n\n\nMore"], ["Too much for too little...", 3.0, "February 24, 2015", "Stephen K", null, 53, 15, "The place looks great, seating comfortable, a little too bright; but it is, after all, a lobby restaurant. Server was attentive until she put my food in front of me. Then she disappeared. Could it be that she was ashamed of how much four meager strips of beef and some soggy French fries cost? I almost had to beg for...\n\n\nMore"], ["have the chef's tasting menu", 4.0, "November 17, 2014", "SusanWellington", "Wellington", 123, 66, "best bargain on the menu with generous wines to match. It was an enormous assortment of stuff from the menu and we enjoyed every dish. If you like meat, this is certainly the place to go. So many dishes they are hard to list but among them was octopus ceviche, salad, beef, pork, ravioli, and of course desert. YUM!"], ["good food", 3.0, "October 12, 2014", "Cparedv", null, 14, 4, "I ordered a Sandwich, because they don't have a large menu. There are only some options, but the food was good"], ["Great hotel restaurant for drinks, light meals, breakfast", 5.0, "July 12, 2014", "Melissa J", "Raleigh, North Carolina, United States", 40, 19, "His hotel restaurant is great for evening drinks and light meals. The lunch menu is more diverse than the. Dinner menu, but a new restaurant has opened in the hotel so this my scale back soon. The food was good and in line with DC food prices, approx $20 a plate or more."], ["Overcooked Eggs Benedict", 3.0, "June 30, 2014", "Sharon A", null, 5, 2, "Loved the ambiance and that they kept the coffee flowing; hate that my eggs Benedict were hard-boiled and not poached and that my server never asked how my meal was - just set the bill on the table as if I should hurry since I was eating alone."], ["Overpriced and very slow", 1.0, "May 30, 2014", "Mmkern", "Tampa, Florida", 5, 6, "Watch the prices. They print one price on the menu and charge more on your bill. Also, very very very slow service. Not worth the price, it was just convenient because we were guests at the hotel."], ["Very Good and Fun to Sit and Watch People", 4.0, "May 28, 2014", "ddavis1212", "xxxxx", 86, 52, "Good food, not overpriced for a big city Hotel and inside or outside eating, so you can enjoy the views on the street or in the restaurant threw the large windows. Nice Bar and as I said before Friendly!"], ["A nice surprise", 5.0, "May 20, 2014", "abetter1", "Ottawa, Canada", 97, 46, "We didn't know what to expect as the main restaurant was under construction. We had the skirt steak and veggies and fish and chips and both were fabulous. Treat yourself to a coffee as it's some of the best coffee I've ever had and generous cups. Breakfast too was delicious. Try the frittata. It's delicious!"], ["Entertaining Clients", 5.0, "April 29, 2014", "nycnrf00", "New York", 15, 8, "Great staff who knew when to step in and move my breakfast along and other times knew when we needed to be left alone. I can't tell you how much we appreciated that!"], ["Great Old fashioned service", 5.0, "April 21, 2014", "Moptops4", "Lynbrook, New York", 2, 1, "It had a 5 star rating and was worth every cent. Terrific concierge.\nThe restaurant was terrific and the eateries on P st. were all good."], ["Breakfast and Dinner", 5.0, "April 12, 2014", "kate9340", "South Hadley, Massachusetts", 8, 6, "Breakfast was delicious. I had the signature eggs benedict my daughte had an omlet and both were very satifying. We also had dinner there as well. We were both very satisfied. Not an extensive menu, but we were both happy with our selections. A little pricey but still an enjoyable meal."], ["Overpriced", 3.0, "March 29, 2014", "Mobaychic", "Montego Bay, Jamaica", 12, 9, "I only eat here because of convenience. 7$ bottle pellegrino... Etc\nLots of choices close by, so explore"], ["Good late night food", 4.0, "March 21, 2014", "woods748", "Newmarket, Ontario", 7, 4, "My husband and I ate here late one night, around 10:30pm. He had fish and chips, while I had a piece of delicious chocolate cake. We both liked our food very much.\nIt had a nice, relaxed atmosphere. The service was good and relatively fast. I would eat here again the next time I am in Washington."], ["Cozy atmosphere; great food", 5.0, "February 16, 2014", "Nina N", "Brooklyn, New York", 4, 0, "A colleague and I were in D.C. Feb 11-13, 2014. After fleeing our nearby hotel, which remains open despite heavy interior construction, we landed at the Postscript within the Loew's Madison hotel on Wednesday night. The bar area is comfortable and low-key; beer, wine, and cocktails are available at happy hour, whether sitting at the bar or at a table....\n\n\nMore"], ["Great food, limited menu", 4.0, "February 4, 2014", "Sail2Maine", "Falmouth, Maine", 90, 20, "While the dinner menu has limited choices the food is very well prepared and the service attentive. Great bread but you have to ask for it with your meal. One night I had the Madison Burger and it was cooked perfectly and the next evening I enjoyed the Hand Cut Tagliatelle. Prices are reasonable for DC. A full breakfast with...\n\n\nMore"], ["Horrible hostess and staff", 1.0, "January 25, 2014", "Deena H", "Chicago", 9, 6, "We were staying at the hotel and we came down for some dessert and coffee. The hostess failed to acknowledge our presence as we stood there waiting. We had to ASK to finally see if dessert and coffee were an option. Clearly, we are too polite. We were seated in the area with couches and a table. We sat for...\n\n\nMore"], ["Great Food, Poor Service", 3.0, "January 16, 2014", "Victor K", "Clarksville, Maryland", 3, 0, "The food was very good but the service was poor. Had to ask the waiter for simple things like water and bread and he seemed genuinely disinterested in whether we were enjoying ourselves or not."], ["Delicious", 4.0, "December 10, 2013", "TiffaStar", "Kissimmee, FL", 17, 7, "Staff was friendly and the breakfast delicious. For drinks, the bartenders are knowledgeable and helpful."], ["Delicious!", 5.0, "November 25, 2013", "TheRoad2Nowhere", "Orlando, Florida", 31, 20, "I ordered Room Serivce 2 nights and ate in the Restuarant one night of my stay - all meals were outstanding. I espcially enjoyed the Wasabi Salmon dish - total home run!"], ["Great Breakfast & Lunch", 4.0, "October 30, 2013", "WARSAWRUN", "Peoria, Illinois", 251, 82, "I've eaten here several times during stays at The Madison and this visit affirmed the consistent performance of this restaurant. The ambiance achieves an excellent balance between elegance and casual dining. Unique soft chair seating and decor create an inviting atmosphere. Noise levels are conducive to comfortable conversation. On this visit I had business breakfast and lunch meals. Both were...\n\n\nMore"], ["Breakfast", 5.0, "August 24, 2013", "bshutts", "orlando", 20, 16, "The food and coffee were great and the service was very good. I had breakfast while staying at the hotel on business. The restaurant was busy but that did not impact the service,and I was able to get in and out quickly."], ["Impeccable Service!\nAnd as elegant as its namesake.\nThe Madison", 5.0, "August 2, 2013", "ewreckdaset", "New York", 1, 0, "Let me start off by saying, I began my week as a husband in the dog house. But thanks to some hard work, prayer, and Kaouthar, the hotel's concierge, I'm back in the running for the husband with the play of the week as if I was featured on Sportscenter.\nAfter creating a fumble that turned into a touchdown for...\n\n\nMore"], ["Great Breakfest but expensive", 4.0, "June 18, 2013", "Redleg71", "Indianapolis, Indiana", 17, 24, "Awesome food and Service but the prices were ridiculous. 100 bucks for breakfest for a family of four is a little pricey but the duck confit was awesome although alittle small. My boys loved the funky monkey waffles and hot chocolates and the staff made them feel like little kings. Awesome food from a food snob just realize its a...\n\n\nMore"], ["Great breakfast restaurant", 5.0, "June 17, 2013", "mariusmyk", "Bergen, Norway", 51, 38, "We ate breakfast at PS twice during our stay at the Madison. Their omelets are great, and so is their orange juice. I also recommend the breakfast BLT sandwich. A very pleasant a la carte breakfast experience."], ["Good food, ok service a little expensive.", 3.0, "May 19, 2013", "diversinc", "San Francisco", 42, 16, "The food at postscript was good but the service is very mixed and the menu somewhat limited. Prices are also a bit high. There can be a long wait for service as well. If you are in a hurry or want to save your cash, check YELP reviews of nearby breakfast places."], ["Best of the Two bars", 5.0, "May 1, 2013", "Deborah B", "Beverly Hills, California, USA", 48, 18, "My favorite of the two hotel bars. The bartenders were great and a lot of fun. The ladies of the bar know how to make a drink that knock your socks off. While the drinks are a little pricey, you always have happy hour, and a very interesting range of people who are at the bar. The only thing I...\n\n\nMore"], ["Terrible service..", 1.0, "April 15, 2013", "moynihana", null, 44, 19, "The taps didnt work, the bartender chatted with the other bartender with my full drink in her hand for at least five minutes while we looked on, they dont serve food, and once you get your drink they are out of sight. dont waste your time or money."], ["Very pricey for breakfast", 2.0, "April 10, 2013", "Jersey717", "AL", 23, 9, "Easily a $50 breakfast for 2 adults and a child. Hot Chocolate $5.00; Tea $5.00; Coffee $5.00...and you haven't even ordered food yet. Service is okay (servers tend to disappear for a bit). The food is fine but there's quite a number of places around there you can get coffee & a breakfast for around there at a 1/3 of...\n\n\nMore"], ["Great breakfast!", 4.0, "March 26, 2013", "MaureenB1975", "Lawrenceville, New Jersey", 6, 18, "Great service, tasty food. Typical hotel restaurant prices. Will eat there again the next time I stay at the Madison."], ["Classy Breakfast", 4.0, "January 19, 2013", "RedLakeChip", "Armonk, New York", 22, 12, "Liked the room decor, huge bagel and lox dish, omelets and oatmeal.\nDidn't like the waffle - too dry."], ["Contemporary menu items along with old favorites", 4.0, "January 1, 2013", "awareofthemoment", "Minneapolis, Minnesota", 11, 6, "The service is excellent and the staff will work with you to bring you anything you might like. The frittata with mushrooms, asparagus and goat cheese was particularly good, though I would vote for more goat cheese. My son raved about the pancakes. The have very good bacon but the fruit they offer is only in small portions as some...\n\n\nMore"], ["Beautiful decor, good food, mediocre staff", 3.0, "December 13, 2012", "mcm4055", "Los Angeles, California", 20, 21, "The decor is absolutely lovely, modern with touches with historical stateliness. But the marble tables are either not wiped down enough or already permanently stained, which was a turn off. The servers were knowledgable and professional but the hostess was apathetic, another turn off. Finally, the food was solidly good: meatball w grits was delish, crab cake sandwich tasty and...\n\n\nMore"], ["Delightful!", 4.0, "November 28, 2012", "PismoLulu", null, 285, 133, "I lunched alone and had the cheese plate and added prosciutto. Very large portion with yummy bread, fig jam, marcona almonds. I literally ate every crumb. Atmosphere is sophisticated hotel chic. Service only so so, but I didn't mind."], ["Great for breakfast, lunch or dinner", 5.0, "November 11, 2012", "masssunlover", "Middleton, Massachusetts", 21, 14, "We enjoyed breakfast every morning at Postscript. The staff was friendly and very attentive. Great selection of choices from fruit to a full breakfast. Very comfortable surroundings. We also enjoyed lunch and dinner there. Great burgers!"], ["Only restarant opened during Hurricane Sandy", 4.0, "October 30, 2012", "leslierosier", null, 7, 3, "I was staying at the Madison during Hurrican Sandy and pretty much stuck inside the hotel. With a light crew on duty at the hotel the Postscript restaurant was the only restaurant/bar opened at the hotel and I didn't want to go outside to venture anywhere in that nasty weather so we eneded up eating here for a few meals....\n\n\nMore"], ["Good mini burgers!", 4.0, "October 24, 2012", "donnalouise11", "Lossiemouth, United Kingdom", 34, 9, "My son loved the 'silver dollar' mini burgers! All the food we had was lovely, although more expensive as you'd expect in a hotel, we were staying at the Madison so it was convenient on our first night when we arrived on a late-ish flight!"], ["Great food, outstanding service.", 5.0, "October 23, 2012", "Sheriff3477", "Voorhees, New Jersey", 106, 44, "The food here was great. One night we had a brownie dessert which rocked! The following day we had dinner, which was incredible. Libby, who served us dessert on our first night was great. She was so friendly, quick, and helpful. Libby seemed to be working her behind off....ask for her though."], ["Bad Bartender", 1.0, "October 22, 2012", "Greasefire11", "Indianapolis, Indiana", 41, 8, "Food was great, too bad the bartender didn't know his drinks. Ruined what would have been a great meal."], ["Casual atmosphere, great food", 5.0, "October 19, 2012", "mtnbikerScottsdale", "scottsdale", 73, 21, "Went here after a busy day of sight seeing\nCold beer, great food and service\nGreat atmosphere\nWould go there again"], ["Friendly wait staff", 5.0, "October 18, 2012", "Annette F", "Kansas City, Missouri", 12, 2, "The food was very good, make sure, if you want water, to order immediately as they do not ask you or automatically bring it."], ["Good food and friendly staff", 5.0, "October 13, 2012", "sissy13", "Milton DE", 52, 32, "My 6 year old granddaughter and I had a great dinner and breakfast at the Postscript. We used the hotel restaurant as we didn't want to venture out after a long day of sightseeing. The restaurant was right in the lobby. The staff was helpful and the food was great.."], ["Stayed at the Madison for a week", 5.0, "September 30, 2012", "chargrove", "texas", 28, 20, "There is not alot open late right around the Madison. We went on an evening tour and returned to the hotel at 10:30 delighted the restaurant was still open. Highly suggest the chicken panini one of the best things I ate all week!"], ["Bar food with style", 5.0, "September 29, 2012", "bigbaz", "High Peak U.K.", 70, 70, "Again this was really good food without too much added to it by way of spreads and sauces as much American food is. The steak was excellent"], ["Great drinks", 5.0, "September 28, 2012", "Juan M", "Springfield, Virginia", 2, 0, "Good serve at a good price for the Johnny Walker black label. The ambience was the best I've ever had in a hotel bar."], ["Perfect on a cold night", 4.0, "September 20, 2012", "Julie B", "Highlands Ranch, Colorado", 4, 1, "After checking into the Madison and dealing with the rain, it was nice to have a casual meal at the Postscript. My waiter was very nice and helpful. The food was a bit pricey but it was more than a burger and fries. I have the ravioli!"]]], ["Drafting Table", [["Adequate for a Pre-Theatre Dinner", 3.0, "October 1, 2015", "Ed C", "Arlington, Virginia", 79, 43, "Due to traffic and weather delays, we had to find a last minute place for dinner before a 7:30 curtain. The Drafting Table is on the same block as the theatre, and said we could get dinner in less than 45 minutes. The food was good, and the prices were reasonable. My only complaint was that the finish on the...\n\n\nMore"], ["wonderful spot for breakfast", 5.0, "September 28, 2015", "sbraud", "Gonzales, Louisiana", 17, 14, "we had breakfast here on our last day, wish we would have stopped in earlier. the breakfast was delicious we sat outside and watched the foot traffic go by, best iced coffee I have ever had."], ["Quick dinner", 4.0, "September 27, 2015", "rdlop", "Pearland, Texas", 15, 2, "We were looking for a light dinner and came across this place. We had chicken tenders with potatoes and salad, and fish with fries. We were seated quickly outdoors, and our food came out equally as fast. Food was tasty, and satisfied us. It seems to be more of a bar for the twenty something crowd to meet for a...\n\n\nMore"], ["Great beers!! Cool place!!", 5.0, "September 1, 2015", "BigCaz", "Glasgow, UK", 40, 18, "Visited with family/friends on a Saturday evening and we weren't disappointed. This place sits on a really cool stretch where there are numerous places to eat - we chose this because the menu looked good but mainly because of the beer choice! Service was first class - from the guy on the door to the waiter to the guy who...\n\n\nMore"], ["Good place to grab a deink", 3.0, "August 8, 2015", "Amy W", "Washington DC, District of Columbia", 116, 18, "This place is never too crowded- despite its prime location on 14th street. We sat outside and enjoyed some people watching with our cocktails."], ["Great Ambiance! Great PUB GRUB! GREAT BEER SELECTION!", 5.0, "July 26, 2015", "willingtravelr", null, 39, 12, "Great Ambiance! Great PUB GRUB! GREAT BEER SELECTION!\nWhat more could you ask for? We were walking around the Columbia Heights neighborhood (Washington, D.C.) late one night and found this place!\nIt was super busy but were able to find a table inside and a great waitress.\nThe prices were fair and the pub grub if you like that sort...\n\n\nMore"], ["Great food, but a little tight for a sports bar", 4.0, "June 30, 2015", "Loren A", "Washington DC, District of Columbia", 17, 5, "The TVs could be better arranged for sports viewing, but the food is very tasty. The duck grilled cheese is particularly delicious, but I've enjoyed everything I've eaten there so far."], ["Ok food, but plentiful mimosas!", 3.0, "March 23, 2015", "Maryefuller", null, 48, 13, "We went for brunch and for bottomless mimosas. The food was just okay, I had the Hillbilly Benedict (poached eggs with sausage gravy), which was fine but kind of bland and had a pretty good sized piece of eggshell right on top. After some initial slowness, our waitress was great and kept the refills coming at a good pace. Sunday...\n\n\nMore"], ["Drinks, soccer and snacks!", 4.0, "March 17, 2015", "LukeFlorida", "East Coast", 38, 10, "This is my go to soccer bar. The serves love the game, the TVs are always tuned in and the people are usually a bit rowdy (when called for). The HH is great with many beers to choose from. They usually rotate a few taps so there is no need to worry about the selection growing old. And I must...\n\n\nMore"], ["DC Grub", 4.0, "October 2, 2014", "elabat", "New Orleans, Louisiana", 8, 2, "On a recent trip to D.C. strolled upon this place along 14th St. NW, wife and I were both in the mood for a burger and decided this would be the place to try. It not fancy, but the burgers were excellent and the staff very friendly. If in the area you could certainly do yourselves a favor and stop...\n\n\nMore"], ["Low key neighborhood spot with decent food", 4.0, "September 24, 2014", "JT M", "Washington DC, District of Columbia", 158, 53, "A cute neighborhood joint with decent food and a good beer selection. Most of the offerings would fall under the category of bar food, but their are some adventurous items. I like their duck grilled cheese."], ["Brunch was excellent!", 5.0, "September 14, 2014", "Sarah G", "Palm Beach, FL", 20, 14, "Enjoyed brunch here, and the food was great! The French toast was amazing, sweet but delicious, and different than any kind I've seen before. Biscuits & gravy was good too, as well as the hillbilly breakfast. Good beer selection, and pretty cool atmosphere. Staff was great too!"], ["Great place", 4.0, "August 24, 2014", "Littell", "Goshen OH", 10, 11, "This restaurant was very cute with a wonderful and helpful staff plus great food and beer. We sat outside in the small but very cute area. The waiter was very personable and had great suggestions when I asked him about some of the specials on food and beer. We really enjoyed the entire dinner."], ["Just a very good experience", 4.0, "July 30, 2014", "Jengelk2", "Superior, Wisconsin", 9, 11, "A friend and I stopped here just for drinks before meeting some friends somewhere else for dinner. We looked at the menu and decided that we neeeeeeded to just eat there, the options were fantastic! There is a great selection, and I love that it is small, so not too overwhelming.\nWe started off with drinks, my margarita was nothing...\n\n\nMore"], ["Good Beer, Average Food", 3.0, "March 11, 2014", "Domer90mom", "Minnesota", 198, 126, "They have a surprisingly eclectic menu in a place that seems just a drinking establishment but the quality of the food wasn't much. However, it was a friendly and fun place and would be a good place to hang out with friends and grab a couple beers."], ["give it a try", 4.0, "February 20, 2014", "rufkdlk", "Washington DC, District of Columbia", 30, 13, "saw something about the chef on TV and went in immediately, they learned to open at 4 since nieghbors open at 5, liked fries very much despite their efforts to upsell and even liked \"dirt,\" a simply vanilla pudding that my guest said a 3 year old could make but not it comes with gummy worms. Thought fish and chips...\n\n\nMore"], ["Great Beer and Great Food", 5.0, "October 7, 2013", "Mick B", "Washington DC, District of Columbia", 64, 28, "If your looking for a place with good selection of brews and a unique twist on traditional food items, this is your place. Everything from the atmosphere down to the last bite of your draftsman burger you can not go wrong. Now I would be remorse if I also did mention the bacon wrapped dates, a must try for the...\n\n\nMore"], ["The food is very average but it's a nice local clientele", 3.0, "August 2, 2013", "D_in_DC20005", "Washington DC, District of Columbia", 35, 6, "Interesting that the menu doesn't much appeal to us (not very creative or even that flavorful) but it is a good place to grab a beer and hang with friends if you are in the neighborhood."], ["Nice outdoor communal seating", 3.0, "June 17, 2013", "Nads82", "Falls Church, Va", 423, 110, "Loved sharing some sangria and small plates with friends. The red sangria was much better than the white. The bacon wrapped dates - while not original - were a home run. The fried pickles are worth trying and true to form. Look forward to coming back here. Inside ambiance was hip and relaxed."], ["Cute place but terrible acoustics", 2.0, "June 16, 2013", "PhilNTed", "Washington DC, District of Columbia", 44, 25, "It would seem like a great fit for the neighborhood - attractive space, good service and decent food -- but the acoustics are unbearable. They did some \"sound-proofing\" not long after opening but they didn't go far enough. If they fix it, I'd go back once in a while.\nOverall, a very casual place. No outdoor seating. Indoor seats aren't...\n\n\nMore"], ["The New Place To Be Seen, But Don't Go For The Food", 3.0, "May 23, 2013", "Perry A", "Arlington, Virginia", 56, 16, "In the midst of the action in Logan Circle in DC this is the place to see and be seen. However, the food and service leaves a lot to be desired. They've tried to have an eclectic menu but the preparation has missed the mark. I had the \"duck pancake\" grilled cheese and it was totally undistinguished. It tasted like...\n\n\nMore"], ["Bland but pricey food", 1.0, "April 21, 2013", "John A", "Washington DC, District of Columbia", 1, 0, "This place sucks big time. I made the mistake of taking an out-of-town friend here for dinner last week and was embarrassed by the flavorless selections we had from the menu and lackluster service. I would not recommend spending a dime in this place. You could find more flavorful food going to a McDonald's."], ["Funny little Pub", 3.0, "March 2, 2013", "lora39", "New York City, New York", 5, 1, "Funny little pub. Nice staff, pleasant atmosphere but it's really just a pub. Not much on the menu beyond bar food but that was good."], ["What a cool place to just Chill", 5.0, "January 29, 2013", "flacachula", "Brussels, Belgium", 94, 28, "Took a friend out of town for the first time to have brunch and it was great as it was the only place that stays open past the traditional Sunday 11-2 pm thing all over 14st-\nMimosas heaven it was amazing the food was great and they were very accomidating on portions\nIt was a very attentive staff that was...\n\n\nMore"], ["Bar room food", 3.0, "January 21, 2013", "Notorius66", "DC", 35, 5, "Nice staff, pleasant atmosphere but it's really just a bar hiding behind a restaurant. Not much on the menu beyond bar food and it's just kind of OK. Noisy and a bit drafty."], ["Bland", 3.0, "January 4, 2013", "J C", "Washington DC, District of Columbia", 41, 15, "Although the decor is cool, the food at Drafting Table is underwhelming. The beer list is good. The environment is somehow too austere to really relax."], ["Great new restaurant", 4.0, "October 30, 2012", "Marylandmama", "Maryland!", 205, 125, "We went here for their first official Sunday brunch. Other than a very long wait for the food, it was fantastic-- the brunch options are many (falafel, eggs, steak, you name it), and it's a cool atmosphere. The long food wait should be excused given it being their first brunch service-- don't think it'll always be this way. Service was...\n\n\nMore"]]], ["Nooshi Capitol Hill", [["Fastest. Delivery. Ever.", 4.0, "September 1, 2015", "Rachel20002", "Washington DC, District of Columbia", 6, 0, "Food is consistently good. Waitstaff is not always the best and there's not much to be said for the ambiance. It has become my takeout go-to."], ["Good-higher price at SE location", 3.0, "August 29, 2015", "Tony M", "Washington DC, District of Columbia", 36, 19, "Good Asian cuisine, prices higher at SE location. I ordered delivery but was informed NW location will not deliver to NE(I was a hotel on 2nd St.) Wings are a rip off, imagine the flat part of a wing ding...cut it in half and that's what you get in the KFC wing order. Otherwise the Singapore and honey peanut noodles...\n\n\nMore"], ["Best Sunday afternoon early dinner", 5.0, "August 18, 2015", "Guillermos99", "Guatemala City, Guatemala", 31, 14, "To begin: 1/2 price bottle of wine/champaign.. We went for the Champaign... 100points... Then the appetizers... fried crab-meat wonton... Chin Chin... Delicious! and Curry Laska.. A bit too soupy but still great...\nBetter than food... SERVICE! SERVICE! SERVICE!!! We (My partner and me) rate our restaurants and there is nothing better than a Great Service... We can forgive a bad...\n\n\nMore"], ["Nice Asian fusion food in the Capitol area", 4.0, "August 9, 2015", "dunblane_andersons", "Dunblane, Scotland", 93, 26, "We visited Nooshi in July 2015. We really enjoyed our food and the atmosphere. The appetizers were fantastic, so much so we filled up on them before the main course arrived! Service very attentive and quick. We would recommend."], ["Meh, basic sushi and cocktails", 3.0, "June 25, 2015", "Mmmpez", "Washington DC, District of Columbia", 19, 0, "Nothing spectacular here. Inexpensive happy hour deals but approach with low expectations because you won't be wowed."], ["Enjoyable experience", 5.0, "June 23, 2015", "FandB2", "Columbia, Maryland", 111, 47, "We were there for lunch with another family member who is familiar with the area. It was a very good choice within blocks of the Eastern Market subway stop. The service was outstanding and the food tasted great. Combined we had the Sushi Premium, Maki Zen, Edamame, Chicken Satay, Vegetable Spring Roll for our entrees. They were all well prepared...\n\n\nMore"], ["Tasty sushi", 4.0, "May 31, 2015", "BostonNatalie", "Boston", 34, 17, "Cute location on barracks row. Very attentive and friendly service. Sushi was fresh and delicious and wide selection of non sushi items available in case you are with someone who isn't into raw fish."], ["Great Sushi, Great Atmosphere", 4.0, "March 12, 2015", "Britney M", "Woodbridge, Virginia", 24, 12, "Living in Woodbridge, it's hard to get out of town and pinpoint a good place for sushi- I used to eat it multiple times weekly while living in New England. This place was chosen by my friend when we went out for her birthday last week, and it didn't disappoint! The rolls were fresh, filling, and interesting- we had a...\n\n\nMore"], ["Good for suchi...and sashimi...and soup", 5.0, "February 12, 2015", "Lanxlad", "Washington DC, District of Columbia", 178, 60, "It was cold snowy Monday night when a friend visiting from Palm Springs suggested we go out. The restaurant was virtually empty, it being Monday and snowing--and desperately cold. We arrived and ordered martinis (expensive) and settled on a huge platter of suchi. To warm us up we ordered three bowls for the three of us of tom yam, a...\n\n\nMore"], ["Yummy", 5.0, "December 29, 2014", "PhillyCodeHound", "Doylestown, Pennsylvania", 13, 3, "Very good Asian Fusion. Great atmosphere. Loved the Pad Tai. Took 2 yo there. Not a great place for a toddler but they were very accommodating."], ["Meh", 3.0, "October 28, 2014", "hawaiishell", "Washington, DC", 24, 12, "Went here for lunch. I ordered the fried oyster roll which was okay. I would not order again. I also ordered the Malaysian noodles. The portion was small and it was just noodles - did not taste authentic. Maybe I just ordered two wrong items on the menu. The service was good though and the staff very friendly. I went...\n\n\nMore"], ["Not as good this time", 3.0, "August 31, 2014", "Layne O", "Fort Lauderdale, Florida", 302, 109, "We both enjoyed the ginger salad. Nice and fresh and cool on a hot summer day for lunch.\nMy Mee Goreng was served spicy as I requested. I was pleased with my selection.\nAlan's Lemon Chicken had no lemon flavor. It should have been called Soy Sauce Chicken. It was as dark as a steak."], ["Less than impressed - there is much better sushi on the Hill!", 3.0, "August 5, 2014", "BritinDC", "Washington DC, District of Columbia", 26, 6, "My friend and I visited Nooshi Capitol Hill for the first time yesterday evening but we won't be rushing to return. We didn't have a terrible time, but there was just nothing great about the place. Yes, they do have a varied menu so you can go with friends who might not like sushi and know there will be something...\n\n\nMore"], ["Excellent value", 4.0, "June 4, 2014", "Finn S", "Washington DC, District of Columbia", 20, 9, "This offspring like it's NW original provides really excellent far eastern (eg Thai, Indonesian, Chinese) dishes at very reasonable (not to say low) prices, often better tasting than more expensive places. We have eaten both locations many times and they are highly recommended"], ["Take a chance on Nooshi", 4.0, "April 5, 2014", "BrianJonestown", "Scottsdale, Arizona", 106, 37, "Friday evening and the 8th St area was crowded. Restaurants were suggesting 90-120 min wait before a table would be available. So we decided ........let's take a chance on Nooshi! Straight to a table and met by attentive staff who told us what wasn't available. A few dishes and one of the beers otherwise the people around us seemed happy...\n\n\nMore"], ["Great sushi on Barracks Row", 4.0, "March 2, 2014", "julia7178", "Washington DC, District of Columbia", 44, 21, "We stopped into Nooshi for the first time while walking on 8th Street looking for a light and passably healthy lunch. The upstairs restaurant was decorated very nicely, and the windows gave a nice view out to the street below. The sushi was very good and the sashimi tasted fresh, we were pleased with our meals overall. We didn't try...\n\n\nMore"], ["Best Asian", 5.0, "January 10, 2014", "Mezzat69", "Washington DC, District of Columbia", 65, 33, "I liked this place because of the variety. You can get many different dishes that represent different asian countries. My daughter has allergies and they happily accommodated us.\nI was so impressed and had them cater a party for me. My guests were raving about the food. They were very reasonable, did all the preparations and made it a stress...\n\n\nMore"], ["Nice Asian Restaurant on the Hill", 4.0, "December 14, 2013", "Layne O", "Fort Lauderdale, Florida", 302, 109, "Three of us walked to 8th Street SE to try this restaurant upstairs over Restaurant Row for lunch. Tea service was quite different and special from the typical pot brought to the table. A nice touch to start the meal. We ordered family style so that we could try several dishes. The overwhelming favorite was the Thai Basil with chicken....\n\n\nMore"], ["Nooshi is not good sushi", 2.0, "November 23, 2013", "Tom S", "Washington, DC", 36, 52, "We're always looking for good sushi/Thai/Asian on Capitol Hill in particular or anywhere else in D.C. and unfortunately Nooshi is no good. All of the sushi tasted the same; the delivery was so late that everything that should have been hot (soup, eggplant and duck) was cold. They said 45-50 minutes; when I called an hour after I ordered, they...\n\n\nMore"]]], ["Chesapeake Room", [["Very Good Food!", 4.0, "October 8, 2015", "Anonymous0411", "Pennsylvania", 28, 4, "We decided on this restaurant after our initial choice had over an hour wait on a Sunday after church; we were headed to the Eastern Market after lunch. We were immediately seated in the patio area which was tented-in for the colder weather and had heaters that kept it very warm! The atmosphere was very nice and of a higher...\n\n\nMore"], ["A Local Favorite", 5.0, "August 24, 2015", "saramatthews", "Philadelphia", 138, 64, "This restaurant recently revamped its menu and its name reflects what it highlights - local foods of the area - but cooked with a light nouveau flare. We tried many of them - crabs, catfish, hush puppies, fried green tomatoes and enjoyed it all.\nThe service was as good as the food and the outdoor seating area on a lovely...\n\n\nMore"], ["Pleasant evening", 4.0, "August 4, 2015", "KarlaMKB", "Chapel Hill, North Carolina", 3, 2, "We went with a group of 8 family members on a Saturday night. We had made reservations and arrived on time, but they had given our reservation away to another group. Fortunately, they were able to seat us on the patio. Most of the food was great - winners were crab bisque, salmon, and crab cakes. The scallops were good,...\n\n\nMore"], ["Stick to the bar", 3.0, "July 11, 2015", "ManCapHill", "Washington DC", 42, 13, "Beautiful bar, but dining space is sparse - unless you like outside seating under the awning. Getting a remodel now, so be sure to check out the new space in August 2015. Bartenders are friendly and attentive. Hostess and other servers could use some more professional training."], ["TCR Eggs!!", 4.0, "June 15, 2015", "4_Travlin_Fools", "Philadelphia", 43, 15, "6 of us stopped in at 12:30 on a Sunday with no reservation and we were seated immediately. Bloody Mary was excellent. All the food was delicious and I'd go back again.\nService was a bit lacking.\nWhen our food was served, one order was missing and an appetizer of soup was never received. The manager came right out with...\n\n\nMore"], ["Fine dining experience", 4.0, "June 3, 2015", "jatenne9", "Oklahoma", 61, 15, "Reading reviews of this establishment, it sounded as if the service and food were a bit uneven. It was a pleasant surprise that nothing was uneven or other than high quality.We dined on a Saturday night with reservations. We were served well by Xavier, the same man who had met us at the door and served us at Senarts a...\n\n\nMore"], ["Nice dinner but nothing memorable", 3.0, "May 19, 2015", "goddess0063", "Euless, Texas", 112, 41, "After deciding we didn't want to wait 45 minutes at 8pm at a neighboring restaurant we came in here. We were seated immediately because it was barely half full.\nWe started with the steamed mussels and calamari. I liked that there were choices for the sauce for the mussels and we chose the spicy tomato with sausage. It was rather...\n\n\nMore"], ["Great brunch in a neat area", 5.0, "April 14, 2015", "Allen727286", "Dallas, Texas", 237, 135, "Enjoyed creative egg dishes and regional ones in a very nice inside seating space. Outside area also was very nice. The service was friendly and responsive. The bar is impressive and willing to provide whatever you want."], ["Quiet on 8th", 3.0, "January 27, 2015", "Steve408", null, 155, 57, "This quiet 8th street restaurant is a nice seafood place to dine. The food and service are good not great. I am sure it is one of the low key places on 8th.The Calamari starter was good and so were the crab cakes. I had the Whole Fish special which was also good. I will go back but am in...\n\n\nMore"], ["A Pleasant Lunch on a Cold Day", 4.0, "November 19, 2014", "Robbo_from_Sydney", "Sydney, Australia", 181, 67, "Nice mimosas followed by a very good crab soup helped us into the right mood to devour shrimp and grits and a very tasty burger . The shrimp and grits was a bit dry but the waiter on his own volition asked whether I would like some more of the sauce and then delivered a pot of wonderful sauce straight...\n\n\nMore"], ["A great option for early dinner", 5.0, "October 23, 2014", "khermes", "kansas city", 8, 4, "We had a great meal around 6 o'clock on a Thursday. Lively enough but easy to talk and have a quiet conversation. Five dollar glasses of wine for happy hour were awesome. I had an excellent crabcake sandwich\nand hubby had a great hamburger."], ["So disappointed", 2.0, "September 30, 2014", "DianefromDC", "Washington DC, District of Columbia", 59, 30, "I've watched this restaurant since it began a few years ago. It is a perfect location with a wonderful outdoor seating area. The bathrooms are nicely decorated and the overall decor of the restaurant is very welcoming.\nThen there is the food…..\nI ate there about two years ago and it was just ok. A friend and I decided to...\n\n\nMore"], ["Good choice for lunch or brunch on the Hill", 4.0, "September 21, 2014", "Decoamie", "Washington, DC", 282, 136, "The Chesapeake Room is a nice option for a meal on Barrack's Row on Capital Hill. The menu has a nice selection of seafood, as well as other options. The service was great. I had a very nice meal of crab soup and mussels. The portions were generous. The patio is very pleasant, since it is on a side street....\n\n\nMore"], ["Don't order the whole fish", 3.0, "September 17, 2014", "smrtcar", "Washington DC, District of Columbia", 106, 122, "My wife and I had our first date night since moving to DC and chose The Chesapeake Room. Nice ambiance and the menu looked interesting. We both enjoyed the calamari and I had a cup of the creamy chowder. Both very delicious. She loved the scallops on risotto, very tasty, and I had the whole fish (not sure what kind...\n\n\nMore"], ["Not bad but a bit inconsistent", 3.0, "August 11, 2014", "Barbara28970", "Washington DC, District of Columbia", 62, 34, "I've eaten at this restaurant at least a half a dozen times, most recently this week. I have mixed feelings. I usually eat there because I am meeting someone for business and need a quieter place to talk. Other restaurants in the area are very noisy. Their outside eating area is quieter than the bar area. My salmon salad was...\n\n\nMore"], ["Nice Bar Near the Eastern Market", 5.0, "August 9, 2014", "okie56", "Rockford, Illinois", 78, 40, "The Chesapeake Room was a delightful find on a hot, sultry day in DC. It was mid afternoon, and after biking around the mall and other points of interest, this cosy bar offered a clean and quiet rest and great food! It is sandwiched among other local and chain restaurants, but seemed a step up -- very nicely appointed. I'd...\n\n\nMore"], ["Great Atmosphere; SLOW Service", 3.0, "July 28, 2014", "Mary Jane P", "Vienna, Virginia, United States", 13, 6, "Early Saturday dinner before the Billy Joel concert at Nat's Park. Very pretty restaurant; upscale feel. Overall, the food was delicious: fried calamari, caprese salad, whole fish branzino (delish), half roasted chicken, shrimp and grits, apple crisp, banana tempura. Drinks were cold and tasty. Only problem was that the service was so slow! Maybe because there was not enough wait...\n\n\nMore"], ["\"Nice Brunch\"", 4.0, "June 26, 2014", "ScotVA", "VA", 111, 63, "Had a late Saturday brunch. Good seafood omelet. My friend's entree was also excellent. Capitol Hill prices and somewhat slow service but still a nice brunch."], ["Very good food in a friendly place", 4.0, "June 8, 2014", "Bruce J", "Melbourne, Australia", 86, 52, "Our group consisted of five adults and two young children. We had a nice table and friendly service. For our wine we chose an excellent Argentinian malbec and for food we had nice mussels with chorizo, an excellent Atlantic salmon salad, nice smoked duck and crab cake sandwiches, The atmosphere was quiet and we had no difficulty conversing. The service...\n\n\nMore"], ["Upscale casual, very good food", 4.0, "May 29, 2014", "caliroan", "New York, NY", 42, 18, "We enjoyed a very good meal here on a recent Saturday night.\nThe herbed calamari and crab corn jalapeno fritter appetizers were delicious. My wife ordered the rock fish special and enjoyed every bite. I had the scallops with vegetable risotto - heirloom carrots, asparagus, spinach, mushrooms - it was outstanding. Our kids split a gourmet burger and fries and...\n\n\nMore"], ["I cannot wait for this baby to slip below the waves...", 2.0, "May 13, 2014", "TimmyOT", "Washington DC, District of Columbia", 67, 63, "A restaurant with the word \"Chesapeake\" in it that doesn't serve crab cakes...for starters. This was a hastily conceived restaurant, great looking, but only a meek attempt at fine dining. Too bad."], ["Good food for a good price", 4.0, "March 8, 2014", "CandyfromCalifornia", "Yorba Linda, California", 142, 29, "We \"stumbled\" onto this restaurant while walking and looking for a place to eat. We sat outside as the day was beautiful. My husband had the steak entre and I had the crabcake sandwich. With wine, the tab for two was under $70."], ["The Chesapeake Room: the best \"room\" on Eighth Street", 5.0, "December 19, 2013", "TJ N", "Washington DC, District of Columbia", 1, 0, "If you live in D.C. -- or are a frequent visitor -- you have seen how Eighth Street in Southeast D.C. (also known as Barracks Row) has been transformed over the years. On Fridays, Saturdays, and, of course, for Sunday brunch, the locals and Capitol Hill crowd flock to the eateries there and are greeted by an array of options....\n\n\nMore"], ["An oasis with fabulous food and cocktails", 5.0, "October 14, 2013", "OhSugarrush", "Columbus, Oh", 45, 21, "We sat out on the patio under a fan on a very warm day and ordered cool drinks; a Martini and a glass of white wine. The drinks were ice cold and the food was nice and hot. We ordered and split a burger and steak fries. Possibly the best french fries I've had in a very long time. I...\n\n\nMore"], ["Pretty good food, pretty good service", 4.0, "July 30, 2013", "globetrotterjon", "Washington, DC", 56, 23, "Came here for brunch. The menu looks very exciting -- unfortunately, uneven service led to initially cold Eggs Benedict -- yuck. While they quickly replaced them for a fresh hot order, the uneven pacing/service threw our collective meal off. The food itself was good, but not great. I was expecting a little more \"unique\" fare from a place which appears...\n\n\nMore"], ["Great Food, Uneven Service", 4.0, "July 17, 2013", "VOnDC", "Washington DC, District of Columbia", 30, 10, "We really enjoy the food here and the drinks are amazing. Yes, as has been noted service is uneven, but it is not as bad as Ted's Bulletin, which is how we discovered The Chesapeake Room in the first place. The brunches here are well worth the effort. Sit outside, it is great!"], ["Very pleasant terrace on lively 8th St near Capitol Hill", 4.0, "July 14, 2013", "DemandingGourmet", "Geneva, Switzerland", 56, 26, "Very pleasant dinner on the comfy terrace opening onto lively 8th St near Capitol Hill.\nGood to very good food, good choice in the menu, nice wines by the glass, great martinis.\nFriendly service - all round a very pleasant experience."], ["Great food, fun location", 5.0, "July 8, 2013", "Barbara H", "Washington DC, District of Columbia", 30, 10, "A friend recommended The Chesapeake Room to us for an easy, casual, but excellent dinner on Capitol Hill near Eastern Market. I have to say, I may not have gone into this restaurant without the recommendation. It was a hot, hot Saturday and no diners were on the large outdoor patio area - so no quick peaks at the food...\n\n\nMore"], ["An aura of indifference", 2.0, "July 7, 2013", "travelingfun101", "Washington DC, District of Columbia", 180, 85, "My friends and I ate here last year and decided to give the Chesapeake Room another try. Bad call... particularly when there are so many restaurants on Barracks Row on 8th Street. Despite not being busy at all, it took 10 minutes for our waiter to show up for drink orders and another 15 minutes to get our 3 Bloody...\n\n\nMore"], ["A+ food, C+ service", 3.0, "June 8, 2013", "svargasi", "Brunswick, Georgia", 123, 52, "We stopped for lunch, after searching for parking for a half hour. Menu was excellent for everyone except someone who does not eat seafood. But that's to be expected for a restaurant named after Chesapeake Bay. My wife, who loves seafood, had the crab soup which she described as delicious. I had the chicken sandwich, which was very good for...\n\n\nMore"], ["Slightly Above Average Food, Average Service", 3.0, "May 18, 2013", "melobeam", "Los Angeles, California", 543, 280, "The menu looked promising so on our last night in DC we ate here. Well, the service was very spotty and when our waiter did pay attention to us he was nice but it was very infrequent and we kept having to ask the busboy for things like: silverware, water, can we order our meal, etc. We started off with...\n\n\nMore"], ["Pleasantly Average", 3.0, "May 16, 2013", "IowaGrandparents", "South Dakota", 189, 108, "Had a very pleasant couple of hours on the patio at the Chesapeake Room.\nTried the fried oyster appetizer -- actually pretty good. The oysters appeared to have been fresh before being deep fried.\nTried the shrimp and hummus appetizer -- probably a tad above average for a true hummus lover. The shrimp seemed irrelevant.\nThe mixed drinks were nothing...\n\n\nMore"], ["Lunch", 3.0, "March 1, 2013", "DayleD", "Burke, Virginia", 65, 17, "I had a cup of the Crab soup, it was OK ...the Oyster Salad was good but oysters were small. Service was good."], ["Very good food... if you like small portions", 4.0, "February 25, 2013", "Donnar4108", "Washington DC, District of Columbia", 37, 9, "The crab soups and oysters were excellent. I like small portions, so I was happy. But if you don't, the appetizers are not for you."], ["Good food, great ambiance, friendly service", 4.0, "February 2, 2013", "Randell N", "Washington DC, District of Columbia", 52, 17, "My wife and I ate there on recent Sunday night and were very pleased. The dark paneling and large pictures of Chesapeake scenes give it a homey feel. Our waiter was attentive, humorous and prompt. Sunday night seems to be a good time to come, as the placed was not packed. Our meals were excellent. My wife had shrimp, scollops...\n\n\nMore"], ["Service won't bring you back ...", 3.0, "January 23, 2013", "JAB611", "Washington, DC", 95, 33, "Good food with lousy service is an excellent recipe for mediocrity! The staff seemed overwhelmed and unprofessional. My companion and I sat at a packed bar staffed with one person, on a very busy holiday weekend (Inauguration weekend no less!), which made no sense! With no apparent relief or available assitance (like a manager perhaps!) our bartender/server had to eat...\n\n\nMore"], ["Lovely evening out", 4.0, "December 13, 2012", "Torri N", "Washington DC, District of Columbia", 61, 35, "I went to this restaraunt last night to celebrate a friends' birthday, we all have a great time. The atmosphere was great, the food was good (I had the cream of crab soup and the shrimp and grits for dinner) and the server was very attentive. The food was all moderately priced but the alcohol is a bit expensive considering...\n\n\nMore"], ["Must try, Great Food!!", 5.0, "November 8, 2012", "MrnMrsyork", null, 10, 2, "My husband and I eat at the Chesapeake Room in DC for both lunch and dinner often. The menu is constantly changing and the food is amazing. The restaurant is small but comfortable and has a good atmosphere. It is located close to the capitol and a great place for either a business lunch or a romantic evening out."], ["Warm and Welcoming In Washington!", 4.0, "November 5, 2012", "mofess", "cape cod", 8, 8, "Our last night in Washington and our best meal! We had to wait at the bar and as we gathered around a high top, I sent a glass of wine crashing to the floor. In seconds 2 waiters had dealt with the mess and the 3rd brought me a new glass of wine, without charging us! Shortly afterward we were...\n\n\nMore"], ["Blaah....old school", 3.0, "October 15, 2012", "Jadorevelo", "Washington DC, District of Columbia", 37, 17, "Back in DC and trying out some of the new places in my old haunt. I am torn; I love this neighborhood and the fact places such as The Chesapeake Room has made a home in it means that there are plenty of great choices to dine without going further into town. Yet, its old school approach to its menu...\n\n\nMore"], ["Bad service, good food, overpriced", 2.0, "July 5, 2012", "Kulinair8907", "Pittsburgh, Pennsylvania", 31, 30, "I went here while visiting the city with my girlfriend. The host was very nice, but we soon realized that our server was just awful. She was very touchy-feely, and in your face. She took our drink order and then disappeared until it was time to get our check. The nice bartender noticed we waited for a good 15 mins...\n\n\nMore"], ["Really good choice", 4.0, "June 11, 2012", "CliffChallenger", null, 44, 18, "I only ate hear as I was staying nearby and I wanted somewhere local But it was a really good choice. I ennjoyed the crab soup and the main course burger was good quality. Attentive service and a good choice of beer from small breweries.\nIt's very close to Eastern Market metro and the whole area is a pleasant change...\n\n\nMore"], ["Crab cakes saga", 2.0, "June 6, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Read a lots about their crab cake before I went and how this is such a nice place. Very disappointed in the crab cake. Funny thing is I like the place, the atmosphere, it is better to sit outside but because I am a favorite of the mosquitoes I opted to stay inside. Everything we ordered for for appetizer was...\n\n\nMore"], ["Amazing bison burger", 5.0, "January 5, 2012", "LiveToEat-DC", "Annapolis, Maryland", 56, 18, "My husband and I stopped in here for a quick bite on the way to a NYE party and were pleasantly surprised to find that we could sit down at the bar immediately. The bartender was amicable and efficient. He let us know about the special NYE menu but didn't push it on us when we weren't interested. It was...\n\n\nMore"], ["Nice Lunch Place", 4.0, "November 17, 2011", "Traveldiva36", "Mc Lean", 175, 62, "My colleagues and I were drawn by the wonderful smells emanating from the Chesapeake Room while walking down 8th Street, looking to make a lunch decision.\nWe made a great choice: The Chesapeake Room has a heated enclosed patio that was a perfect venue for our celebration lunch. I thought my salad with grilled chicken was quite nice, accompanied by...\n\n\nMore"], ["Great meal at The Chesapeake Room! (Gluten Free)", 5.0, "October 24, 2011", "misstorri", "Marlton, N.J.", 5, 22, "My family and I went to this restaurant after I had researched places to get a Gluten free meal in D.C. My Cousin has Celiac Disease and absolutley cannot have anything with Gluten in it. From the very moment we sat down his fears were put to rest. The waitress was well versed and the Head Chef even came to...\n\n\nMore"], ["One of the best meals of my life.. $23 for appetizer and entree", 5.0, "October 23, 2011", "tlhjar", "Bowie, MD", 361, 167, "Sunday brunch. Neighborhood restaurants were crowded. Had shrimp and hummus appetizer. Several Lahvosh crackers, great hummus, jumbo perfectly grilled and seasoned shrimp (3 large ones), paprika but not overdone. At my request, they skipped the creme fraiche. This would have been enough. $10, filling and very enjoyable. Short ribs with mushroom demiglace, great home fries with a little cheese, mushroom...\n\n\nMore"], ["great choice for food & atmosphere", 4.0, "October 11, 2011", "Thinman41", "Danbury, Connecticut", 46, 24, "This is a great place to eat with interesting choices for food and an eclectic decor.\nFrom catfish to bison burgers, crab cakes to home-made mac & cheese.\nPub-like atmosphere, large tropical fish tanks in the walls. Great attentive service.\nMy family enjoyed it and we will be back. Friendly neighborhood has several other dining choices."], ["Mixed results and rather expensive", 3.0, "June 5, 2011", "dcist25", "Dallas, Texas", 13, 12, "We had been interested in visiting The Chesapeake Room since we moved back to the area last year. Seems like a great location, right on 8th St. in Barracks Row with a very inviting decor. We finally made it there on a Friday night and were surprised to get an outside table immediately, while all the other restaurants nearby had...\n\n\nMore"], ["GREAT DINNER, COOL PLACE", 4.0, "March 20, 2011", "lauraccss", "Maryland, USA", 32, 26, "Restaurant is located in a quaint and very hip neighborhood ..with fun decor and very comfy oversized outdoor chairs. with over sized heaters... Menu was original and creative. Service attentive and quick...the food AWESOME...for starter I had a crabcake on green fried tomatoes..excellent ... entree .. Skate fish on angel hair pasta on a tomato/mushroom broth that was delicious ..the...\n\n\nMore"], ["Almost perfect and a great new addition to the neighborhood", 4.0, "August 16, 2010", "Scottinaboat", "Washington DC, District of Columbia", 110, 47, "We recently went for a dinner on a Monday night and were completely impressed by this new addition to the area. We started and split the entree seafood salad and then both had Bison burgers. All amazing and the wines were great... the only complaint we had was the signature martini was weak as best and the olives small, glass...\n\n\nMore"], ["what a great 1st meal", 5.0, "July 12, 2010", "ok4dean", "Green Bay, Wisconsin", 5, 4, "We happened on this restaurant on our way to the Marine Parade at the 8th & I street Barracks. It was the first meal we had during our visit to D.C. and it set the standard that all others would be compared to. We had (2) of the specials and the food and presentation where exceptional."]]], ["The Brown Bag", [["Quick and easy breakfast - priced right", 4.0, "October 11, 2015", "rstandly", "Sequim, Washington", 25, 21, "This restaurant is right next door to the Crowne Plaza Hamilton Hotel on 14th. This is a great option for breakfast or lunch (they close at 3:30 so no dinner served). Although we didn't have a chance to try one of their handmade sandwiches, we did eat breakfast here several days during our stay. Potions are perfect and everything is...\n\n\nMore"], ["Good breakfast, reasonably priced", 4.0, "September 26, 2015", "phelsuma90", "Dardenne Prairie, Missouri", 82, 38, "Went here for breakfast on a couple of mornings - tasty sandwiches and a selection of accompaniments - all reasonably priced. A good local option. And I appreciate their philosophy of local and sustainable."], ["Good food with generous portions", 4.0, "September 3, 2015", "Sean713", "Washington DC, District of Columbia", 19, 7, "I frequent this location often for lunch. The food is better than average and the portions are generous. I like that their meats are antibiotic free and their ingredients are locally sourced. Their sandwiches are great, though sometimes I wish they took more care in making them. Often times the are sloppily thrown together and end up being a mess...\n\n\nMore"], ["Easy, good and very inexpensive for breakfast", 4.0, "July 30, 2015", "BSWTRAVELS10", "Nashville, Tennessee", 112, 34, "Easy breakfast. CHEAP and good. Nice variety-almost cafeteria style-but good. A nice alternative to a hotel breakfast."], ["Quick breakfast", 5.0, "June 3, 2015", "two8balls", "Albuquerque, NM", 32, 12, "Walked down 14th toward Starbucks in search of breakfast. I popped in here. For breakfast they were making made to order omelets from fresh ingredients. They even had an egg white option--- which made my daughter so, so happy. We ordered two omelets with potatoes to take back to the hotel to share.This was enough for a light breakfast for...\n\n\nMore"], ["Great for breakfast or lunch", 4.0, "May 23, 2015", "BillMancs", "Manchester, United Kingdom", 40, 30, "Just down the street from our hotel, this was a busy place but friendly and cheap. Obviously popular with office workers for lunch and rightly so."], ["Fresh, tasty and quick.", 3.0, "April 21, 2015", "Bob T", "Boston, Massachusetts", 324, 90, "There isn't anything exceptional about this place, but it's a good choice if you are looking for a quick, inexpensive, freshly prepared salad, noodle bowl or sandwich. They have several locations around the city."], ["Good Fresh Food", 3.0, "April 8, 2015", "FairfaxBob", "Orange Park, Florida", 115, 158, "The Brown Bag prepares good fresh food in house. Good value for money. The quality of the food is excellent, but service time for a simple breakfast order well after the breakfast rush was slow...almost 15 minutes for a simple egg scramble plate."], ["Lunch", 5.0, "December 15, 2014", "CocoBrown1216", "Boston, Massachusetts", 9, 1, "I loved the food. I think it was a bit overpriced for me, but then again, I love the bargain. It was within walking distance of most hotels and the hours were very good."], ["Great sandwiches", 5.0, "December 2, 2014", "Traveler3305", "United States", 56, 8, "By far, the best sandwich ever is the Big Apple Turkey! It has become my favorite. The service is excellent and the staff is very efficient at handling orders. I highly recommend it for lunch."], ["Quick Service, Healthy Options", 5.0, "November 30, 2014", "GreenMan305", "Orange, California", 28, 13, "Great place for a grab and go breakfast. Food Quality is good. I had a breakfast sandwich that was perfectly prepared."], ["Good for for on the run...", 3.0, "October 21, 2014", "Ann-Marie D", "Providence, Rhode Island", 22, 20, "Stopped in here for a bite to eat during a recent trip to DC. My son met us for lunch and this place was right around the corner from his office. Sandwiches are made to order and the salads are very fresh. A sandwich (we split it), salad, and three sodas came to $27 with tax."], ["Nice quick breakfast stop", 3.0, "September 10, 2014", "TTTravels", "Mississauga, Canada", 33, 10, "While visiting Washington and staying at Thomas Circle, we stopped by in the morning on our way to the Metro. We ate the perfect, fresh breakfast sandwich with a delicious coffee - reasonably priced and quick."], ["great food", 5.0, "August 6, 2014", "Lezlie L", "Hamilton, Canada", 9, 3, "loved loved loved. This is such a great idea for travellers, we found the food good, the price good and the convenience perfect."], ["Good breakfasts", 4.0, "July 2, 2014", "mbickel17", "myerstown", 35, 17, "Good place to stop each morning with kids on the walk downtown. NO BATHROOM…don't try it. I had to take elevator…scary - into loading dock area."], ["Blah", 2.0, "June 24, 2014", "inlandfoodie", "claremont", 19, 13, "With so many fresh ingredients and omelets made to order, we were really expecting a good quality experience. Unfortunately my lox omelet and my husband's scrambled eggs and croissant were bland, bland and bland. They put all orders in a brown box (even if dining in) and the food tastes exactly like that box... Not good."], ["Great breakfasts", 5.0, "May 13, 2014", "Suzanne S", "Grand Rapids, Michigan", 10, 3, "This restaurant was right next door to our hotel.. Mostly a takeout restaurant but also plenty of room to eat there. Self serve with excellent food and great prices. Complete Farmer's Breakfast (eggs, bacon, potatoes, fruit cup) for $7./person Coffee (free refills) and juices extra. Not open late afternoons and evenings. Perfect place!"], ["Nothing special", 3.0, "May 8, 2014", "NorthFlorida", "Lake City, Florida", 41, 15, "This is a cafeteria style restaurant that serves sandwiches, soups, and salad. We had a sandwich and a salad. They were okay."], ["Cold coffee", 2.0, "April 5, 2014", "KarenHoCo", "Ellicott City", 16, 11, "Stopped by for coffee and a bagel on a Saturday morning. Coffee was cold and light cream cheese on my stale bagel was nonexistent. Should have waited in the line ae Starbucks."], ["\"quick lunch\"", 5.0, "July 1, 2013", "cindyr68433", "Laurel, Mississippi", 6, 1, "What a great little place! Patrons select a brown bag to mark and order either a sandwich, wrap, salad, pasta, etc. The staff is helpful to everyone and walked this first-timer through the process...created a personalized pasta dish that was delicious, more than enough, and very cost effective..."], ["Ok for breakfast", 3.0, "June 27, 2013", "S M", "Boston, Massachusetts", 64, 11, "I went there for breakfast one morning and could have had a better and cheaper breakfast at the hotel where I was staying!"], ["Truck Version", 3.0, "May 7, 2013", "wallyguy", "Indianapolis, Indiana", 49, 14, "Tried to grab what I thought would be a quick lunch at the Brown Bag food truck. Took over 35 minutes from the back of a 8 person line until I got my food. Didn't even get the sandwich I ordered. However, the sandwich was good (can't tell you what it was though--I ordered the pulled chicken)."], ["Easy, yummy, quick, and fresh", 4.0, "April 5, 2013", "iamnotcarey", null, 2, 0, "Stopped on our walk from our hotel to the metro for lunch and ended up getting breakfast there the next two days too. Muffins are delicious. All food was yummy and fresh. Easy and quick to order and then we sat outside. A great choice!"], ["Slow service undercooked eggs", 2.0, "March 30, 2013", "jkwasnick", "Denville, New Jersey", 108, 46, "Came here for breakfast. Had to order one item at a time as they were made. The chipotle chicken wrap was delish but ordered the omelette and they ran out of eggs, the guy behind making the food literally had to leave and run to cvs to buy eggs. How a breakfast place runs out of eggs is beyond me....\n\n\nMore"], ["Responsible, quick, and fresh", 4.0, "March 28, 2013", "Liesl32", null, 21, 8, "This place was a unique eating experience for me. You literally fill out a brown bag by choosing from the options listed for salad, sandwiches, or noodles. The food was pretty good, and the value was comparable to others in the area. My favorite part is that much of the packaging was recyclable or compostable."], ["A perfect place for a fresh lunch", 4.0, "March 14, 2013", "Nads82", "Falls Church, Va", 423, 110, "I work around the corner and love coming here. The sandwiches are very good and they have some delicious soups and sides. While it is a bit pricey, I feel it is a great value. Service is excellent and the location is perfect for lunch."], ["Good Breakfast on the Go", 4.0, "March 11, 2013", "Questovia", "Minot, North Dakota", 114, 46, "On the way to sightsee for the day and wanted a substantial breakfast we found it at the Brown Bag. It is a self serve restaurant with a good variety of hot offerings, fresh fruit, and beverages. The New York omellete is particularly good and we both agreed it was the best cup of coffee we had in the city...\n\n\nMore"], ["Good for breakfast", 4.0, "February 25, 2013", "Lara1302", "Beirut", 4, 0, "They serve bagels, eggs, fresh fruit, yoghurt, soup etc... good for a quick breakfast and open early... just walking distance from the Donovan and easy on your pocket"], ["Good for decent bites (breakfast or lunch)", 3.0, "January 7, 2013", "Highadventurer", "Singapore, Singapore", 325, 332, "The hotels around the area are not on busy weekends and there are no McDonalds in the vicinity (that i know of). It is pick and choose your salad and sandwich rather than a diner. I came back a second time for the omelette breakfast and it was good for me on a tourist as opposed to business expensed.\nFor...\n\n\nMore"], ["Nothing special", 3.0, "August 1, 2012", "atew2u", "Charlottesville, VA", 37, 13, "Had the lemon orzo salad...very bland. Also stopped in for breakfast and wasn't really tempted by the fresh baked items that were advertised out front. May as well go to Starbucks two doors down..."], ["Catch the tacos!", 5.0, "July 29, 2012", "mtangel", "Columbia Falls, Montana", 22, 10, "Grabbed a lunch while at a business conference at the Crowne Hamilton, wonderful choice and good price!"], ["Easy place to get decent breakfast", 3.0, "July 25, 2012", "AnnaSW82", "Cincinnati, Ohio, United States", 12, 3, "We got our breakfast here everyday and it was decent. Good prices but they messed up on our meal one day when there was no one else in the restaurant. I mean, they gave us a totally different thing then we asked for and we didn't notice until we got back to the hotel. But it was still pretty good.."], ["Good lunch spot", 4.0, "April 23, 2012", "pearl796", "Washington DC", 29, 9, "Your average selection of lunch choices- salads, sandwiches, etc. They have a lot of interesting combinations, but you can make it your own. It gets pretty crowded at lunch but they do their best to get you in and out fast. There's some outdoor seating available and some inside."]]], ["Buck's Fishing & Camping", [["Deeply satisfying!", 4.0, "September 26, 2015", "Joseph K", null, 20, 3, "A perennial favorite. Despite changing hands a couple of times since Carole Greenwood started the establishment, the flavor, quality, and style never wavered (the only seemingly permanent change is the departure of deviled eggs). On a recent visit with 6 friends, we started with lamb meatballs (juice, savory, and lamb-y), mini-corn dogs (just for laughs, no reason to order again),...\n\n\nMore"], ["Bad taste", 1.0, "September 23, 2015", "ls112015", "Tampa, Florida", 1, 0, "My wife and I went to DC for the day to see our son. We ate at Bucks. This was the first time for all of us. What a disappointment it was. The service was slow, the food was well lets say I have had a better tasting happy meal. It was very price for the portions. Son had a...\n\n\nMore"], ["Summer Sunday Evenig", 5.0, "August 20, 2015", "Susan W", "Oakton, Virginia", 10, 4, "We enjoyed a beautiful evening and dinner on the patio. The service was attentive, but not overbearing. The food was great. We shared fried green tomatoes as an appetizer. Our entrees were a quinoa dish and soft shelled crabs over a summer vegetable mix (wonderful!). We were going to forego dessert, but couldn't imagine not tasting the lightly orange flavored...\n\n\nMore"], ["Good neighbourhood eats!", 3.0, "August 9, 2015", "BermudaCbear", "Bermuda", 31, 9, "A cut above the pizza places on either side and the sandwich-type eateries in the area, this offers a wide variety of locally sourced foods and has the added attraction of using a wood-fired grill."], ["Delicious and so pleasant", 4.0, "July 15, 2015", "Thsnitch", "Bethesda, Maryland", 34, 15, "After many years, I went to Buck's and it was great. Very hip but not too noisy.\nWe started with the ribs appetizer - smoky and tender. I had a bratwurst on a homemade roll with sauerkraut and mustard plus some incredible French fries. Others had a beautiful burger, another soft shell crabs and finally pork tacos. Everyone was pleased....\n\n\nMore"], ["Very good!", 4.0, "July 8, 2015", "donc880", "Washington, DC", 151, 68, "I really like Bucks! Great, casual, very eclectic (decor, crowd) neighborhood spot. Great service and value. Nice casual bar to hang out and have drinks before dinner. Loved the fried green tomatoes and mozzarella and soft shell crabs! Highly recommend."], ["What a neat place!", 5.0, "June 9, 2015", "matinecock", "Glen Cove, New York", 143, 56, "Took my son and his family to an early Saturday dinner here. My son had heard of Buck's but had never been there. Don't be fooled by the name. This is high-quality food not a chuckwagon. Our orders ranged from burgers to Fish & Chips to Fried Chicken to Corn Dogs. I asked about the Wild Scallops and our terrific...\n\n\nMore"], ["Great neighborhood restaurant", 5.0, "June 5, 2015", "Seriously I", null, 22, 6, "Solid, always good . Farm to table , seasonal and local. Great staff,relaxing atmosphere , easy parking . Don't miss the chocolate cake for dessert !"], ["Lovely experience, great food, knowledgeable about gluten-free", 4.0, "May 21, 2015", "Belle W", "Arlington, Virginia, United States", 80, 20, "This place is fantastic. We sat outside on a lovely evening, surrounded by greenery on the charming front patio. Service was outstanding and I practically licked my plate the food was so good. I had steak, and they were careful about the gluten issue on the french fries. Since the oil in the fryers had been changed that day and...\n\n\nMore"], ["Treat yourself", 5.0, "May 7, 2015", "Ardeecee", "Nanjing", 66, 23, "Dining outside can be dicey but not when the service is great and the food even better. I was a member of a party of seven and not one of us had anything but compliments on the food. Good helpings, good choices and to be best after eating entrees, the largest sirloin that I have had for years I still...\n\n\nMore"], ["Leaving Hungary", 1.0, "April 11, 2015", "stevemangino .", null, 2, 1, "Small small portions. A $14 burger should be 8oz not what looked like 4 on tiny roll. Main coarse small entree tiny amount of veg so you have to order starch a la carte. Now I don't mind paying $26 for scallops but 3 scallops.......really.....really. Now the place is always full so I guess you won't change but if you...\n\n\nMore"], ["Buck's Fishing & Camping", 4.0, "March 25, 2015", "flobow3648", "Washington DC, District of Columbia", 32, 10, "An excellent neighborhood restaurant, Bucks is great for a great dinner experience. Buck's has many excellent appetizers and entrees. One of my favorite appetizers is the fried oysters; well cooked and succulent. Of the entrees can recommend the wood grilled pork chop, roasted chicken, and an excellent hamburger. Service can be off at times especially when they get busy and...\n\n\nMore"], ["A place that puts its effort into the food, where it should be", 5.0, "February 12, 2015", "hypefreetravel", "LA, California", 43, 45, "The food at Buck’s is so carefully, simply and well prepared that you almost forget about the noise level, which like most places in DC is pretty high. But you don’t need to talk much to your dinner table companions, since the food makes you concentrate on the eating. Clearly there are folks in the kitchen who care and it...\n\n\nMore"], ["A pretty good neighborhood spot", 4.0, "December 24, 2014", "PaulineKael", "Washington DC, District of Columbia", 23, 61, "An enjoyable restaurant with very good food and a nice atmosphere. My take on the menu is innovative comfort food. The rockfish is always an excellent choice. The selections for wines by the glass could be better but, all in all, this place is a good bet."], ["Great product and prep, skip the wines", 4.0, "December 19, 2014", "Hammerabi", "Washington, D.C.", 79, 8, "As advertised, Buck's delivers very fine quality locally sourced food, simply and well-prepared. The rockfish we had was excellent, as was the caesar with a nice, but slightly underpowered dressing, and really nice freshly baked garlic croutons. The wine list was very pedestrian, serviceable, but nothing special. Not surprising, given the camping theme. The interior is wonderful, beautifully designed and...\n\n\nMore"], ["Great Meal!", 5.0, "December 10, 2014", "JD28204", "Charlotte, North Carolina", 290, 144, "Loved, loved, loved the entire experience. The decor is charming. The atmosphere is both romantic and lively. The wedge salad was by far the best I've had. The horseradish dressing is amazing. My steak was cooked to perfection and was seasoned perfectly. The carrot cake was divine. I would love to return when next in DC."], ["Great Atmosphere, but Noisy", 4.0, "December 8, 2014", "littlemac4", "Washington DC, District of Columbia", 75, 34, "Reservation recommended as this is a small-ish restaurant. The casual theme throughout is unique and interesting. There are good choices on the menu. We had a nice table at the back. Even though it was around a corner from the main room, it was still very noisy. I ordered the less expensive steak-frites. The steak was very good and cooked...\n\n\nMore"], ["Interesting", 4.0, "November 10, 2014", "Charlie T", "Oshawa, Ontario, Canada", 199, 65, "Interesting decor odd name for a restaurant but pretty good experience. I sat at the bar looking at a large weird mural painting of angels flying around. No cab red wine but some French choices. I started with deep fried corn meal oysters. I ordered the scallops for and entrée and really enjoyed the meal. Great service by the bartender...\n\n\nMore"], ["Food OK, Bit Overrated", 3.0, "September 27, 2014", "1KRP", "Washington DC, District of Columbia", 131, 33, "This was our second visit, a party of six having dinner. As usual, we enjoyed our appetizers: best were the fried oysters, plump and tender (although a little oily). We also got the mini corn dogs with a mustard sauce: they were fine but nothing too special. The rosemary almonds disappeared quickly. The drinks were on the pricey side for...\n\n\nMore"], ["First Visit", 3.0, "September 22, 2014", "maggiesueb", "Maryland", 65, 29, "This was a first visit to Buck's for two of us, and a second visit - although many years apart - for the other two. We arrived at 6:30 PM, and were able to find parking in the rear lot. We were seated promptly and admired the casual - but not hokey - décor. Our female server did not seem...\n\n\nMore"], ["Good place for couples and friends", 5.0, "August 19, 2014", "Mike B", null, 51, 22, "Great place to enjoy a good meal and have a conversation you can hear...service was excellent and waitress was very attentive. Reasonably priced.."], ["Fun, high class southern food, but a bit pricy.", 4.0, "July 18, 2014", "Brian S", "Flyover Country, United States", 37, 9, "I had the best corn dogs I have ever had (ok, not a very high bar there, but they were outstanding) at Bucks. The shrimp and grits were very good. The atmosphere is fun, the food is locally sourced, and the prices are a bit high (but probably worth it)."], ["A disappointing dining experience", 2.0, "July 11, 2014", "mlt2011", "Washington DC, District of Columbia", 4, 0, "We decided finally to try this upscale, but casual neighborhood restaurant after several years of reading mixed reviews. Unfortunately, the negative reviews we've read accurately reflected the experience we had.\nThe uptown DC location of the restaurant is convenient and the faux rustic decor is attractive, but the service and the food preparation were disappointing. The waitress seemed distracted and...\n\n\nMore"], ["One of my favorites", 4.0, "July 7, 2014", "Doris N", "Washington DC, District of Columbia", 29, 9, "Food and service are both very good. Can be a bit noisy but not as bad as many others in this regard. Definitely worth the price."], ["Excellent meal", 4.0, "April 29, 2014", "susan r", "Bethesda, Maryland", 26, 15, "We arrived a bit early for our reservation but were seated right away. The server was great and well informed and very helpful. We hadn't been to this restaurant in over a decade and it was as good as we remembered"], ["Where is my drink??", 2.0, "March 28, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "This review is only for the bar and not for the food there. I was actually waiting for a table at Comet Ping Pong, and was told that we can either have a drink by the bar in Comet Ping Pong or go this place who must be owe by the same group. We went in, got a seat in...\n\n\nMore"], ["Unusual Decor and Good Food", 4.0, "March 3, 2014", "SnowmanHOCO", "Dayton, MD", 83, 29, "Party of six for a Friday birthday dinner. Parking is limited; there is a lot (used by multiple vendors) behind the restaurant (full when we arrived). Service was special; our server was charming. We had spagetti squash, fried oysters, fried onion rings, burger (good but small); fries were just okay, and steak (outstanding but VERY expensive). Will return."], ["Buck's For Me", 4.0, "January 13, 2014", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Buck's has an eclectic menu, a cozy venue and smart, attentive wait staff. Recommend either of the steaks, and their iceberg wedge salad. Appetizers such as fried oysters (a healthy portion) and lobster stew complete the feast."], ["The steak is definitely a winner", 4.0, "November 22, 2013", "paxa", "Washington DC, District of Columbia", 370, 207, "Buck's was recently reviewed again in the Washington Post Magazine to commemorate its 10th anniversary, so we felt we cannot put off trying it any longer - after all we are big fans of the other restaurant Comet Ping Pong next door. We made a last minute reservation on a Friday evening for 6 pm, although I think we could...\n\n\nMore"], ["The camp site is becoming predictable", 3.0, "October 28, 2013", "DCMomInChief", "Washington DC, District of Columbia", 80, 50, "I like predictability. It is soothing. I know what I will get. However, sometimes predictability turns into boredom. Bucks Fishing's menu seems to be adverse to any change, updates or modifications. I am becoming bored."], ["Great food and a nice atmosphere!", 4.0, "October 22, 2013", "tomandjerry00", "Washington DC, District of Columbia", 2, 0, "I really enjoyed eating here! The food was very good and the menu was diverse enough for all tastes, but small enough that each item was still unique.\nWe all tried each other's orders and no one was disappointed. A great stop in Van Ness!"], ["overpriced and poor service", 2.0, "September 3, 2013", "ajk470", "Arlington, Virginia", 18, 3, "the place looks charming enough . However, the food was nothing special and was expensive for what you got."], ["Nice visit to Buck's", 4.0, "September 2, 2013", "Ethan F", "West Hartford, Connecticut", 65, 19, "Had a nice meal at Buck's Fishing & Camping on Saturday evening. Really liked the warm feel of the space and the quiet atmosphere. Service was very good. Mussels appetizer was excellent, as was the bread. Beer selection could be much better for a trendy place like this with no local beers to try, such as a nice IPA. Small...\n\n\nMore"], ["Burger + Bourbon + Beautiful Night + Outdoor Seating + Kind Hostess = GREAT Evening", 4.0, "August 19, 2013", "DCJD2012", "Washington DC, District of Columbia", 131, 71, "I previously ate here and wasn't blown away, although I loved the setting and the service.\nI recently went on a night of amazing weather and enjoyed a burger and bourbon on the outdoor deck. It was a really great evening and due to both great food, excellent service and a nice hostess.\nWorth a drive up Connecticut Avenue."], ["Consistently Good", 4.0, "May 9, 2013", "jrjojo", "Washington DC, District of Columbia", 384, 124, "Buck's is a very popular restaurant and deservedly so. Quality entrees and salads with a laudable wine selection. Get a reservation on weekends."], ["Go Fishing and Camping Instead", 2.0, "April 12, 2013", "nop_12", "Washington DC, District of Columbia", 92, 74, "I REALLY want to like this restaurant, living in the neighborhood and have been about 4 or 5 times in the past several years in hopes that the quality has improved. even with a living social coupon, i find no value because really it is about the food and Buck's keeps missing the mark. expect to get the privilege of...\n\n\nMore"], ["Bucks was fine", 3.0, "January 25, 2013", "RichDC87", "Washington DC, District of Columbia", 95, 28, "I was underwhelmed by Bucks. The food wasn't bad, but nothing there made really want to go back. Duck confit was fine. My girlfriend's seafood pot pie was what you might expect. My chorizo starter was sub par but not bad necessarily. Prices were a bit silly for some items, and my $14 cocktail wasn't quite worth that downtown, let...\n\n\nMore"], ["Bucks for Dinner", 5.0, "January 23, 2013", "mijomurray", "Washington DC, District of Columbia", 37, 8, "We had a great meal there last night. Shared mussels as an appetizer - fresh, plump, flavorful and a great start. My seafood pot pie was loaded with salmon, scallops, mussels, vegetables and a wondeful sauce. Wife's lime salmon was equally as good. Shared an apple crumble topped with creme fraiche gelato - wonderful. We'll be back."], ["Terrific low key and upscale dining in upper NW Washington", 5.0, "January 19, 2013", "davidbViennaVA", "Washington DC, District of Columbia", 133, 73, "This restaurant is always on the Washingtonian 100 Best List and I finally went there earlier this month for a business dinner. The entire meal was excellent. They have free parking behind the restaurant, and there is free on street parking on Connecticut Ave after 6:30pm during the week.\nThe food was excellent - I got the skirt steak which...\n\n\nMore"], ["Cute, decent food", 4.0, "November 23, 2012", "andarcaminos", "arizona", 112, 60, "For families, we prefer Comet which is next door, but this is another good neighborhood place. The food is fine, but prices a bit high for the quality."], ["Great steak", 5.0, "November 1, 2012", "SkipperDad", "Bethesda, Maryland", 106, 60, "One of the best steak experiences in the DC area, without the fancy trappings. And it is hard to find anything on the menu that isn't fabulous. One of the best casual places to eat in town!"], ["There's something about Buck's...", 4.0, "October 25, 2012", "kans1", "New York City, New York", 14, 3, "Maybe it's the campy feel...not quite sure..it's a bit pricey but it's good..it's next to Politics and Prose so if your there for a book talk it's a natural choice before or after..."], ["Outstanding - best duck confit around", 5.0, "September 25, 2012", "MarciaFW", null, 1, 1, "I stop at Bucks every time now when I visit DC. This is a restaurant for foodies. Natural cuisine. The duck confit is excellent. Great oysters. The interior design is wonderful - modern and outdoorsy combined. This is a gem - move it down to Texas please!"], ["hit or miss", 3.0, "July 19, 2012", "Ktowner6", null, 41, 33, "i have been to buck's maybe eight times in the last six years, as i live within easy walking distance to the restaurant. at times, i have had terrific meals, but more often i have left disappointed and with a much lighter wallet.\nbuck's has been heralded as a favorite of robert redford and dick cheney, and the design of...\n\n\nMore"], ["Eh......not poor but less than average.", 3.0, "July 5, 2012", "Leslie B", "Washington DC, District of Columbia", 50, 18, "I was really excited to try Buck's Fishing and Camping. Unfortunately, I was disappointed. The food was so so. I ordered the soft shell crab - it was watery and there was little to no meat in it at all. It only came with one crab, which I should have asked about. One full, fat crab would have been better...\n\n\nMore"], ["So glad we tried it!", 5.0, "June 28, 2012", "ConcordCouple", "Concord, Ohio", 10, 4, "This is the upscale sister restaurant of Comet Pizza, which is right next door. Our friend was right about Comet and right about Buck's. Their attention to detail was amazing...food fantastic. Thoroughly enjoyed our dinner."], ["Rude hostess...", 1.0, "June 7, 2012", "Azzurri06", "Washington DC", 37, 22, "If a rude and unaccommodating hostess gives you the warm and fuzzies, this is the place for you!\nWe had read about Buck’s Fishing and Camping in The Washingtonian when it first opened and were interested in going but never had a chance to go. When we saw it featured on Living Social, we snagged the deal immediately. As always...\n\n\nMore"], ["Cozy and lively, great food", 5.0, "May 7, 2012", "reyner", "Baltimore/Washington metro area", 4, 3, "What a great little restaurant. Feels like it should be in Del Ray Beach or Charleston rather than upper NW Connecticut Ave. The food was great, the service was very good. It's not a bargain, but I think it's reasonably priced. It's tight inside and not the place if you're looking for a quiet, relaxing dinner, but my wife and...\n\n\nMore"], ["Good food, fun but noisy, v good service", 4.0, "April 5, 2012", "ccjon", "Chevy Chase, Maryland", 37, 31, "Buck's is a down-home/funky restaurant set up sort of like a fishing camp. The halibut was very good, as was the iceberg lettuce wedge. The greens salad was small and overpriced. My brother had a steak, and loved it. The wait staff was helpful and friendly. Not haute cuisine, but good food and a good time."], ["I really want to like Buck's but it falls short", 3.0, "March 7, 2012", "Belladoux", "Washington, DC", 65, 15, "I've only been here a few times but I find it expensive for what you get. The last time I sat at the bar. There was a very drunk guy there with his almost as drunk girlfriend, who were clearly friends with the bartender. He was listening to her iPod and singing along, in a loud voice. There were lukewarm...\n\n\nMore"], ["Unfriendly cramped pricey dining", 2.0, "February 25, 2012", "Hidntreshr", "Washington DC, District of Columbia", 38, 52, "This was a horrible experience. They lost our reservation, had no interest in being courteous, plopped gross food on the table, and sat us so close to the other tables that fellow patrons on both sides interjected in our conversation. You couldn't pay me to return."], ["Buck's FIshing and Camping", 4.0, "February 2, 2012", "nms9017", "New Orleans", 45, 11, "There are people here dressed in everything from coats and ties to T-shirts and jeans. The food is inventive and unexpected, but doesn't lose sight of the most important thing: deliciousness. The food is local and sustainable, and the decor is, to put it simply, kind of weird, but awesome."], ["Skip it", 3.0, "December 5, 2011", "ermibr", "Virginia", 35, 34, "Went with family years ago. Nothing was \"wrong\" with the food but it was expensive and underwhelming. Went a second time because my wife had a groupon. Same thing.\nThe signature item is the sirloin steak, and while I am not an steak expert, I did not see how it was better than a steak made at home. It was...\n\n\nMore"], ["Nice option in the neighborhood", 4.0, "November 28, 2011", "BeachesForFour", "Washington, DC", 103, 24, "This restaurant is in our neighborhood and we have visited several times. It's a real asset to have it so conveniently located, but I'd even go farther to eat here. I've had the fish races several times and never try anything else -- they are just too good and well-priced to miss! Others in our group are more adventurous and...\n\n\nMore"], ["Pleasantly Surprised", 4.0, "October 26, 2011", "Jason T", "Middletown, Maryland", 36, 24, "The food was excellent and the prices were very reasonable. We started with the pate, which was served with fresh bread, pickled cucumbers/onions, and homemade mustard. Definitely a nice start. I then got the wedge salad, which was a little heavy on the dressing but tasty nonetheless. House made bacon and bleu cheeses crumbles were a nice touch. For an...\n\n\nMore"], ["Service smug; food ok", 3.0, "September 19, 2011", "walton56", "Washington, D.C.", 183, 86, "near our oldest daughter's home, we were excited to try Buck's. The experience left me quite indifferent - kind of like the service. we went for an early dinner after a mid-afternoon show, so the place was not that busy. The service was efficient enough but so unfriendly - we didn't feel like they welcomed our group of 5. the...\n\n\nMore"], ["Worst food ever", 1.0, "September 16, 2011", "GidgetCancun", "Washington, DC", 7, 2, "We also had a groupon and always wanted to try it and thought this is our chance. I must say I am sorry we did. I got the fish tacos, two very small tacos with two tiny pieces of fish on them and they were priced at $18.00 and this is all you got. The wine list was terrible no...\n\n\nMore"], ["bleh. terrible service and oversalted food", 2.0, "September 2, 2011", "eleanor G", "Washington DC, District of Columbia", 4, 11, "We went to Buck's for my husband's birthday with a friend (and because I had a groupon). A big mistake. The server appeared to be on drugs, she was seriously out of it. She was barely willing to take our order, didn't bring my husband's drink, then brought us a drink later we hadn't ordered which was actually intended for...\n\n\nMore"], ["Good food. Reasonably priced. Good drinks. Good service.", 5.0, "June 13, 2011", "DCtraveler1950", "Washington, DC", 17, 7, "We particularly enjoy eating at the bar so we can sit next to each other talk easily even when the place is full. And the bartender is fabulous. Exceptional cosmos. Nice selection of wines by the glass. Funky decor. Menu offers several regulars and several seasonal dishes both in appetizers and main courses. Mussels, fish tacos, deviled eggs, burger with...\n\n\nMore"], ["average food in a cute neighborhood setting", 3.0, "February 28, 2010", "oliverlevitt", "Fort Myers, Florida", 215, 176, "I would not go out of my way to go to Bucks, but if I lived in the neighborhood it would be a nice addition. For DC prices it is very reasonable. Everything the three of us had was pretty much average(mussels, seafood stew, veal chop). The setting works well for a date restaurant."], ["Stay away", 2.0, "January 30, 2010", "fastrunningmom", "Washington DC", 17, 19, "Our daughter suggested we eat at Comet Pizza, which is next door to Bucks. Comet was packed, and the guy next to us said he'd been waiting almost an hour...so we went next door to Bucks. Even though it was not even close to full, we were given a menu and waited more than 15 minutes for someone to take...\n\n\nMore"], ["Too healthy......", 1.0, "December 23, 2009", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Too healthy......"], ["Bucks Restaurant in Washington DC", 2.0, "February 28, 2009", "ejsteen", "Washington DC", 1, 2, "The atmosphere is good, but this restaurant often \"just happens to run out of\" all the reasonably priced items on the menu, forcing diners to order the remaining, overpriced items. When we arrived at 8:30 pm on a Friday, they had already run out of 2/3rds of the menu, including basic deserts. Also, we found it intolerable that the fried...\n\n\nMore"], ["Sometimes great food, sometimes not so great. Quirky service, quirky restaurant.", 2.0, "February 24, 2009", "Felipe B", "Washington DC", 13, 7, "I've had one really amazing meal at Bucks and two that wel...weren't awful, but weren't very memorable or worth the money. They have a really great atmosphere, very loungy, it could be a perfect little date place on a cold winters night, except you just never know what you're going to get at bucks. The service and the food can...\n\n\nMore"], ["Is a chicken wing a dinner-sized meal?", 2.0, "January 25, 2009", "ecopen", "usa", 11, 10, "We had dinner this weekend at Bucks. I like the place: the ambiance, the people, the menu. While the flavors are very, very good, we spent $75 this weekend on two entrees (4 shrimp with an half cup of grits, half a waffle and a chicken wing), a small salad and two glasses of wine. You have got to be...\n\n\nMore"], ["Avoid Buck's if you are a vegetarian", 1.0, "November 10, 2008", "moby7290", "Washington, DC", 1, 1, "I went to Buck's, knowing that it wasn't the most-vegetarian friendly restaurant, because a friend and his wife wanted to go there. However, after my experience there, I will never go back, nor can I recommend it.\nI let the staff know I was a vegetarian, and inquired as to my options. I was directed to two appetizers on the...\n\n\nMore"], ["Not for this price!", 1.0, "June 21, 2008", "kbtkpk", "Takoma Park, Maryland", 4, 6, "The service was so indifferent and the portions of 2/3 of the dishes we ordered were so tiny that we barely noticed how good the food tasted. A highlight was when we had been waiting way-too-long for our main course and saw our server pop out the front door of the restaurant to light up a cigarette right in front...\n\n\nMore"], ["Very good gingerbread cake with whipped cream.", 3.0, "March 28, 2008", "mrwatson", "London, United Kingdom", 256, 228, "Very good gingerbread cake with whipped cream."], ["Horrible Service. We should have listened to the reviews", 1.0, "March 16, 2008", "elpern", "Beijing", 2, 3, "You should know, I never do reviews but feel strongly about this so I have signed onto this and other sites just to save you from an unpleasant evening :\n- Service was curt from the beginning, practically slammed dishes and silverware on the table but only if you continuously harp on the fact that you want these items\n-Yes,...\n\n\nMore"], ["Nothing good to say about Buck's", 1.0, "March 7, 2008", "DCgirldiner", "Washington DC", 1, 0, "Possibly one of the worst dining experiences I've ever had. Very expensive prices for bland, unimaginative and visually unappealing food. As an example, the iced tea was an astounding $4, and the falsely advertised \"delicious\" chocolate cake slice was $9. The wedge salad came with a dressing that looked (and probably tasted) like something my baby coughed up. The wait...\n\n\nMore"], ["My shrimp and grits was...", 5.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "My shrimp and grits was genius."], ["Simply the Best!", 5.0, "October 25, 2007", "FLA_Joe", "Miami, Florida", 2, 1, "Having been to Buck's many (15+) times it is hard to imagine that I've been eating in the same restaurant as the last couple of reviewers. A self-proclaimed foodie, Buck's is my current absolute favorite restaurant in DC (Two Amy's, Obelisk, Colorado Kitchen, Sesto Senso, Zaytinya and Sushi-Ko are a few other favorites to the extent that's helpful). The warm,...\n\n\nMore"], ["Save your money! No bang at Bucks.", 1.0, "October 20, 2007", "topbanana57", "Laurel, MD", 4, 1, "I took my wife and parents here for dinner based on a few decent reviews. I like to try new restaurants. I lost this time. I've eaten im many of the nations' finest restaurants and I can tell you, when the waitress (I'm being complimentary) tells me I can't get a Bloody Mary, it's a sign. That's all I need...\n\n\nMore"], ["The worst steak I ever ate!", 1.0, "September 15, 2007", "regul8ed", "McLean, VA", 7, 8, "The worst steak I have ever had: We were looking forward to Buck’s “signature” prime, dry aged strip steak. We didn’t mind a bit when the waitress told us that a steak ordered “medium” was cut into large pieces so it would cook properly without getting dried out. What we DID mind was getting instead what clearly were the cut-off...\n\n\nMore"], ["Fun gourmet dining experience!", 5.0, "March 6, 2006", "BigBenDC", "Washington DC", 4, 9, "Great, fun atmosphere, friendly staff (and bartenders!), and the food is absolutely amazing. Our waiter informed us that the food is all organically grown locally, and the chef creates a new menu daily. While the menu options are limited and the chef doesn't allow for subsitutions, the dishes are so well matched that the flavors complement each other nicely. My...\n\n\nMore"], ["Disappointing", 2.0, "November 7, 2005", "Italy2004", null, 15, 11, "We'd heard the chef could be cranky. We were amazed that this was so readily evident to us without ever meeting the chef. It started with our notifying the very friendly maitre'd at our 6:00 arrival that we would like to be out in 80 minutes because we were attending a concert, and being told that the chef is \"picky\"...\n\n\nMore"], ["No bang, big bucks", 2.0, "October 28, 2005", "A TripAdvisor Member", null, 1, 0, "Was really looking forward to my visit, but was sorely disappointed. Got the $21 shrimp entre which was 3\nshrimp, a sausage the size of my pinkie, and some\ncheese grits. It was appetizer size.\nI was still hungry when dinner was over. Comparably expensive restaurants in DC generally give you more food. My friend got the fried rabbit, also...\n\n\nMore"]]], ["Panera Bread", [["AMAZING Turkey Chili", 3.0, "July 3, 2015", "benjaminzzz", "Washington DC, District of Columbia", 64, 9, "YOU have to try the turkey chili - it's VERY good. I still have yet to try the sandwich's because every time I come to Panera I can't get over the chili."], ["Same ole, same ole", 4.0, "June 10, 2015", "Roger C", null, 186, 80, "Been there twice in two days for breakfast. Nice people, nice food, good coffee - dependable. A lot of competition around busy 14th St, but this place seems to still be rocking along.\nLike it."], ["Love the Pick 2 option", 4.0, "March 26, 2015", "Mix1110", "Cairo, Egypt", 4, 0, "Love their salads and soups\nMy fav soups are turkey chili and broccoli & cheddar\nFav salads fuji aple , thai sesame chicken"], ["Enjoyed the Flatbread Sandwiches", 5.0, "August 13, 2014", "Kitty H", "Kaufman, Texas, United States", 26, 10, "Tasty bbq chicken flatbread. Loved the green tea. I will definitely go back. All ready thinking about how flavorful the food was."], ["A bit pricey but always good", 4.0, "January 5, 2014", "Itz M", "Washington DC, District of Columbia", 30, 27, "I appreciated that the staff took care to heat up only the parts of the sandwich that needed heating up. High calories and a bit pricey, but truly yummy."], ["Bakery and light meal, I think.", 3.0, "September 4, 2013", "Yosawa", "Bangkok, Thailand", 18, 18, "They sell many kinds of breads, pies, etc. They also sell lunch set. The taste is OK. The service is OK. The price is a little bit high.\nOverall I don't have any feeling against this cafe. It's just OK."]]], ["Met Cafe", [["Surprise!", 5.0, "May 28, 2015", "CAK314", "Clearwater, Florida", 179, 116, "Met Cafe is in an unassuming courtyard and seemed fairly tucked away off the beaten path. We stopped in for a takeout lunch before walking around the Mall. What a great place! TONS of selection, in addition to a very impressive buffet, they also have sandwiches and other items made to order. The buffet was simply amazing. Not only did...\n\n\nMore"], ["Just Right for Lunch", 4.0, "March 9, 2015", "jeffl499", "Alexandria, VA", 1001, 373, "Modeled after Chinese buffets throughout the city, the Met offers a full array of hot and cold items on its buffet tables. Some very tasty and creative dishes that are just right for a tourist drained of energy from visiting the White House, Lafayette Park, the Mall, etc. There is a good salad bar as well as a sushi station...\n\n\nMore"], ["We call it \"By the pound\"", 4.0, "November 16, 2014", "Tony D", "Washington DC, District of Columbia", 2, 0, "I've been going there at least once a week since 2011. It's a great place for a fast large-group-friendly place where you don't need a reservation. Lots to choose from from sushi to whatever you might want. You weigh your plate on the way out and pay by the pound."], ["Good buffet for lunch in downtown DC", 4.0, "August 22, 2014", "jennyrose0853", "Windham, Connecticut", 114, 66, "My family and I were walking around the national mall area and needed lunch. This place is a little tucked away but was worth the money. They had sushi and a variety of food items in the buffet. Anything from seafood salad to spinach pie. It was all good especially for the price. To feed three of us with drinks...\n\n\nMore"], ["Very good business day DC lunchtime option", 4.0, "October 4, 2013", "SeatOfMyPntsTravelr", "Washington DC, District of Columbia", 492, 148, "My grown daughter's office recently moved to Foggy Bottom at the border of the GWU campus and the World Bank. I walked over at lunchtime today to orient her to her lunch options. I chose the F & G area between 19th & 17th Streets Northwest and after walking through the other options we ended up at Met Cafe. We...\n\n\nMore"], ["Tasty cheap breakfast in central downtown", 5.0, "July 31, 2013", "neilzone", null, 89, 44, "We stopped here for breakfast after visiting the Lincoln Memorial and west end of the Mall - it is not a touristy cafe, and is set back from the road.\nOur food was cooked freshly for us, and was delicious - two breakfasts and drinks for about £10.\nPlenty of seating."]]], ["United States Holocaust Memorial Museum Cafe", [["Memorable visit", 4.0, "October 7, 2015", "EmilAlex", "Abu Dhabi, United Arab Emirates", 102, 83, "We visited the place today and it was quite memorable and touching. I had been here 20 years back and it has completely changed. There is a lot to read and understand as u go around this museum. It is worth it."], ["Unfortunately No Other Local Option", 2.0, "October 6, 2015", "Mikeb1Falmouth_MA", "Falmouth, MA", 454, 235, "After touring this incredible museum, we were \"stuck\" eating in this just OK cafe. The food is overpriced and disappointing in a bland setting. If time permits, try to find another option. The soups tasted like they came out of a can and the bagels were stale and dry."], ["Good authenic food", 4.0, "October 1, 2015", "SeekADeal", "London, Canada", 80, 36, "We, 5 all had different items. Soup, salads, sandwiches, knishes, very good.\nI would have liked to have had more variety of desserts but we might have been late.\nI don't like brownies everywhere we go... and don't eat home made ones so, give me some applekucken."], ["Way Overpriced", 2.0, "September 26, 2015", "RHA1936", null, 35, 13, "There is really nowhere else close to eat when visiting the Holocaust Museum, but try to avoid this place. The selection is limited and the prices are ridiculously high. We were three people who ordered one knisch, one cup of soup, one salmon sandwich on about 3 inches of a sub roll, one egg salad sandwich on another 3 inches...\n\n\nMore"], ["Incredibly Moving Museum", 5.0, "September 20, 2015", "Jenny S", "Palm Coast, Florida", 59, 14, "This was my first - and last - visit to this museum. I literally felt sick toward the end of the visit. We were there for about 3 hours, and you really need at least this much time to fully experience all of the exhibits. Everyone should try to get to this museum - you will never forget the images,...\n\n\nMore"], ["Very emotional", 4.0, "September 17, 2015", "hairfairy17", "san antonio", 36, 22, "Wow. This was impressive. We have no idea the life these people lived in or shoes they walked in. Sorta confusing set up in musuem, just ask the front and they will help you."], ["Must See Attraction", 5.0, "September 11, 2015", "winnie4751", "North Mankato, Minnesota", 13, 2, "A must see in Washington DC. You need at least 4 to 5 hours to really give this museum justice. Left us in tears because of how people treat others."], ["Welcome refreshment", 5.0, "September 6, 2015", "H201120", "Washington, United Kingdom", 29, 8, "Friendly and helpful staff. Very clean. Food of a high standard. Had lunch before embarking on tour. Quiet at the start of September so no queues."], ["Good for a quick pick-me-up", 4.0, "September 1, 2015", "LLCJ54", "Alamo, California", 260, 100, "Completely serviceable. Needed a quick pick-me-up. The food was better than expected. The restaurant was clean. Really, could not ask for more."], ["CHERRY BLOSSOM FESTIVAL WASHINGTON", 5.0, "August 27, 2015", "eichenlaub", "Canada", 20, 9, "Sad subject but interesting museum. Displays were well done and we enjoyed touring this museum. We toured after the Parade and even though is was busy we were able to see all the museum."], ["They Need Lockers & A New Attitude", 2.0, "August 20, 2015", "Kimberly A", "Delaware", 13, 3, "My wife and I were not allowed into the museum because she had a pocket knife. We are Firefighters & EMT's those are issued to us. The guard was very rude told us if we aren't cops we can't have those and If we were cops we would have been allowed in with it?! He told us to give it...\n\n\nMore"], ["Really, really expensive", 3.0, "August 19, 2015", "tjeason", "Raleigh, North Carolina", 145, 49, "Bring your own snacks. There were decent cheese pizzas and salads if you need to stay onsite. But really, why are the prices this high?"], ["United States Holocaust Memorial Museum Cafe", 3.0, "August 19, 2015", "lenapapas", "Ottawa, Canada", 5, 2, "The cafe is open every day from 8;30 to 4;30and the menu is quite good but nothing special.The good thing is that you can order lunch to go before you visit and if you are a vegetarian there are some options for you as well."], ["Summer Vacation", 5.0, "August 17, 2015", "juliad104", "Beltsville, Maryland", 3, 0, "This museum is educational and had an emotional and a somber effect. Once inside, you are given a ticket for the start of the main exhibition. Until then, you are view several other exhibits.\nAt the beginning of the main tour, each person receives an identity card of a person who experienced the holocaust. Each display brings to life the...\n\n\nMore"], ["good food but not kosher", 3.0, "August 4, 2015", "calikiddo", "San Francisco, California", 23, 2, "The holocaust museum was great and they had a nice menu but the kosher items were limited and not very good. I would have expected more of a museum catering to so many types of people. The regular food looked great though so it would be great if you could make more or better kosher food."], ["One of my favorite museums", 5.0, "July 31, 2015", "Wendylee03", "Mesa, Arizona", 11, 1, "A very moving museum. It causes a lot of emotions as you visualize the horror of the holocaust. It is a part of history that should not be forgotten. It should be taught to students in school so something like that never happens again."], ["Pricey but worth the air conditioning in the summer", 4.0, "July 28, 2015", "Erin C", "Bradenton, Florida", 92, 31, "The food in the cafe is good and the choices (for a small cafe) are plenty. There are even kosher options. The prices, however, are higher than I felt good about paying until I factored in that it was the only indoor place to eat nearby unless you start looking for places inside the office buildings a couple blocks away....\n\n\nMore"], ["Quick & convenient", 3.0, "July 25, 2015", "Lermis", "South Texas", 87, 23, "We needed something light and quick before our timed visit into the museum. Hubby and I shared a cheese pizza and drink and it was better than expected food service fare. There were many kosher items as well."], ["Ok", 3.0, "July 25, 2015", "ThinTiger", null, 79, 45, "Located in a separate admin building from the main museum, once you pass through security... The food was fine. We had a couple of nicely presented Pizzas. It filled a hole. Nothing to write home about, functional and filling."], ["KOSHER food available!", 3.0, "July 18, 2015", "Karen S", "Norfolk, Virginia", 15, 7, "Good food, average cafe style BUT they offer KOSHER food! Convenient to Museum (located just outside the museum). Be prepared to have your bags searched and pass through a metal detector."], ["Overpriced, good alternative is Dept of Agriculture across the street.", 1.0, "July 6, 2015", "Chad L", "Nashville, Tennessee, United States", 40, 22, "Eat where the locals eat. It's a ton cheaper and better food. Go across the street to the US Department of Agriculture Building and enter via Wing 3 (it's posted). Once past a simple security check (just like the museum), you can go to the cafeteria (public welcome). The food is great (big spread) and you pay for the buffet...\n\n\nMore"], ["Worst food. Overpriced", 1.0, "July 5, 2015", "dianap2012", null, 41, 10, "The museum is amazing, but the cafe is horrible. The food was cold and nasty. The staff was unfriendly"], ["Disappointed!", 2.0, "July 4, 2015", "GabyOrtiz", "San Jose, Costa Rica", 8, 1, "we had an awesome experience at the museum. My family was more than touched to see all the horrors these people we went through. But unfortunately, the cafeteria offers really bad products. We were expecting much more. Wouldn´t eat there again."], ["Few options, costly", 3.0, "June 29, 2015", "kctravellers3", "Kansas City", 70, 25, "Not a lot of options, small area and pretty costly. There are better options nearby. I would look elsewhere."], ["Everyone needs to see this", 5.0, "June 23, 2015", "BigJon55", "Longview, Texas", 50, 18, "This was our favorite and most impactful museum visit in DC.\nRich history powerfully communicated through sight and sound and interactions with actual holocaust survivors.\nIt's too important a part of history to miss this, even if you aren't a history buff."], ["Nice stop from the heat", 4.0, "June 22, 2015", "Tyler M", "Pittsburgh, Pennsylvania", 23, 5, "Stopped here for lunch while waiting for our museum entrance time.\nFood is pretty good, but expensive (not really for museum food). I had a black bean burger that was delicious. Wife had pizza that both she and our daughter enjoyed.\nNote, you do have to go through security to get in."], ["Ok food but expensive", 3.0, "May 26, 2015", "Leanne1444", "Northamptonshire, United Kingdom", 44, 20, "The food was pretty tasty however very expensive for what it was. Also quite hard to find. However the lack of food places around the museum means it is close to the attraction."], ["Delicious but a bit hard to find", 4.0, "May 19, 2015", "Colleen L", "San Marcos, California", 11, 5, "We were surprised to find a very nice cafe - across the courtyard from the main museum. Matzo Ball soup was terrific - everything was fresh and tasty."], ["Not so hot", 2.0, "April 20, 2015", "ktr11", "Flagstaff, Arizona", 115, 62, "We ate here after our tour of the Holocaust Museum. A staff member at the museum directed us here. The food was average and very expensive being it's a cafe and the food is ready made. I would try to find somewhere else."], ["Poor selection, no charm", 2.0, "April 20, 2015", "heyvinds", "Seltjarnarnes, Iceland", 72, 31, "Went to the museum cafe with my famili after our visit to the museum. We were starving. The selection is poor and the foot was lacking in all aspects. It was probably the worst food I had all month.\nI will never go there again, not even after a visit to the museum."], ["In a pinch", 3.0, "April 16, 2015", "JacqB", "Huntington Beach, CA", 239, 73, "We were starving and the dining options in this area are pretty limited other than L'enfant plaza for tourists. We ate here on a rainy afternoon before entering the museum. What you need to know is that this is NOT inside the museum, but near the back entrance and you must exit if you have already gone through security and...\n\n\nMore"], ["Nice Respite", 4.0, "April 16, 2015", "hachi7", "hachi7", 11, 2, "Good to support this museum and its affiliations. Good to have a quiet respite from the very serious subject matter of the museum. Very modern and clean, with the usual cafe menu."], ["Food was beyond basic, so was price, though.", 5.0, "April 10, 2015", "TheFloridaAdvisor", "Lake Wales, Florida", 262, 149, "If you're not worried or stupid enough to drop 25-30 dollars on a couple small food items not worth half that, then I'd recommend this place. The food was great, honestly. It was extremely overpriced in my opinion."], ["Great Pit Stop", 5.0, "March 21, 2015", "DesertDrifters", "Toronto, Canada", 113, 28, "Disappointing that this is not inside the Memorial building, however, it offers a wide variety of quality food and drink (at a reasonable price), and is clean and well maintained."], ["A must see be prepared to be depressed", 5.0, "March 11, 2015", "drl_smit-may", null, 116, 76, "This is an essential museum reminding us of a terrible chapter in human history. It is very tastefully done but you will be depressed that human beings could do this to each other. If you are in Washington DC you should not leave without going to this museum. Everyone should be reminded about this part of human history."], ["Not to be missed", 5.0, "February 13, 2015", "AmyC723", "Livingston, New Jersey", 134, 36, "My son and I visited in December. Apparently tickets are not needed during the winter months. We got there early and felt that we were able to really absorb the exhibits and the movie clips without huge crowds. It is extremely moving, sad, heartbreaking and interesting. I will never forget it"], ["Very expensive and not great choices!", 1.0, "January 7, 2015", "IV_BOYS", "Stow, Ohio", 30, 27, "Went here with a family of 7 and paid $132! Very expensive and not great choices for kids. The cafe is next to the Holocaust museum in a separate building. You must go through a separate security checkpoint to get in.\nNOT FAMILY FRIENDLY!!! WARNING!!! VERY EXPENSIVE!"], ["Skip", 2.0, "January 1, 2015", "Darren H", "Petersburg, Illinois", 14, 3, "Expensive and poor selection. Cafe style with 90% vegetarian offerings. Individual pizza, like the microwavable kind and size, were $10.00."], ["Good food", 5.0, "December 29, 2014", "cal1357", null, 11, 2, "We had a late breakfast here while waiting to go in the Museum. It was good food and nice selection."], ["Overpriced", 2.0, "December 5, 2014", "AMC8380", "Mandan, North Dakota", 167, 91, "Stopped here for a quick lunch before visiting the museum. $24 for a sandwich, Cobb salad, and small pasta salad seemed excessive. The salad and pasta were mediocre. The Italian roasted veggie baguette was good though. Just not worth the price.\nThis is a deli/cafeteria set up and located in the admin building next to the museum. You will have...\n\n\nMore"], ["I am sure it was excellent...", 5.0, "December 3, 2014", "Brian S", "Lost River, WV", 88, 47, "After the tour there was no way any of us had an appetite. I saw people eating but we could not. I guess if you wanted to drink and let it all set in It is an intense attraction and I would not even eat before hand."], ["Good for a break", 5.0, "December 2, 2014", "Jayne2126", "Rogerstone, United Kingdom", 184, 73, "Good to have a cuppa after going through the museum (typical Brit)!!! Good coffee & knish. It was odd going through the equivalent of airport security first though!"], ["Your tax dollars NOT at work", 1.0, "November 28, 2014", "Helpha1", "Ipswich, United Kingdom", 15, 8, "Had to go through security to enter the cafe. Three unfriendly guards on duty. On entering the cafe 4 members of staff were sitting at a table with one poor young waiter managing on his own. The coffee urn/canister was empty so my husband told the waiter who looked at the four seated members of staff who ignored him so...\n\n\nMore"], ["Good but Pricey", 3.0, "November 20, 2014", "Molly S", null, 16, 5, "We stopped here before we moved on in D.C. and though the food was decent, it was a cafeteria style setting, limited seating and almost $40 for three bottles of water, three Knishes and a cookie."], ["Sorry excuse for a knish", 2.0, "November 13, 2014", "oregonpoppa", "Eugene, Oregon", 132, 96, "Most of the reviews for this café said it offered pretty good food at a decent price. I think the fact that it is part of the Holocaust Museum inspired their charitable attitudes. Also the fact that there aren't a whole lot of alternative choices close by makes this a café of choice.\nMy wife had the matzo ball soup...\n\n\nMore"], ["Unique choices", 4.0, "November 7, 2014", "dle0313", null, 38, 26, "Some reviewers have confused the actual museum with its cafe. This review is about the CAFE. Choices reflect the unique nature of the museum, and include Jewish deli favorites like knish, matzo ball soup, and there are a few Kosher items. That's in addition to some other unusual dishes such as salads and PB&J. As all restaurants in D.C. (!!),...\n\n\nMore"], ["Overpriced, rude service, and marginal food", 2.0, "October 29, 2014", "baltoro", "San Diego, California", 367, 97, "We ordered an egg salad sandwich on a croissant. It was small and expensive. The woman who worked at the cash register was rude. I couldn't hear her well, and she was very impatient.We went to the museum again today, but we didn't return to the cafeteria."], ["No bacon", 1.0, "October 29, 2014", "Tracy0692", null, 2, 0, "Hungry and a little lost we found the The holocaust museum. Went to its cafe located next door. They had little to pick from. Bagels looked old and the knish looked tired. Tried the knish. Please go somewhere else. Food horrible.\nSelection was poor, food poor. Coffee was only thing worth getting."], ["Good choice of food, reasonably priced", 4.0, "October 21, 2014", "Katie906", "Hamilton Parish, Bermuda", 230, 123, "It was a relief to sit down quietly after the museum, seating comfortable. Coffee and rinks reasonably priced. Interesting choice of food, all well cooked and tasty. Made a change from usual fast food outlets."], ["Good food at fair prices", 4.0, "September 10, 2014", "Marilyn W", "Hull", 30, 14, "We went there just as staff were ready to close but we were still made welcome . Good coffee, reasonably priced. Friendly helpful staff. Nice and clean. Be aware you have to leave the museum to get to the cafe but this is not a big deal."], ["Surprisingly good, fast food!", 4.0, "August 27, 2014", "fairytoes", "NC", 121, 38, "Stopped in for a quick bite expecting fair food but it was great! Had the roasted veggie sandwich and it was delicious! My husband had the salmon wrap and said it was the best he had ever had!"], ["Not too busy", 4.0, "August 27, 2014", "Wiganer78", "Wigan, United Kingdom", 19, 5, "Visited this cafe after a long, hot walk around the monuments and prior to our museum visit. Be aware that you will have to undergo a security check (carried out by pretty humourless guards). However, once in the building, we appreciated the air conditioning and the clean surroundings. Food was OK."], ["Essential", 4.0, "August 24, 2014", "Travel7YYZ", "Toronto", 140, 63, "As another reviewer stated, not sure how to \"rate\" something like this.\nBut it's very well done, imparting facts and emotion in a well-organized manner. Not to be missed."], ["Prepare yourself", 4.0, "August 23, 2014", "Candy A", "Myrtle Beach, South Carolina, United States", 11, 5, "I wasn't really sure how to rate this. I really had no idea what to expect when I visited here. As a whole , there is a lot of information, it's very educational, and the layout is great. If you want to step ahead of someone to see another display and then return to see the things you skipped, you...\n\n\nMore"], ["Good Meal before you visit the Holocaust Museum", 4.0, "August 8, 2014", "LMK101", "Virginia Beach, Virginia", 91, 21, "There is good variety of meals for all tastes. You can find sandwiches, salads, pizza though they all look fresh and healthy. They offer a variety of drinks as well."], ["Ok experience", 3.0, "August 7, 2014", "Lisa R", "Buffalo, New York", 16, 5, "I had been looking forward to visiting this museum for months. I have read many books on WWII and the Holocaust. I guess I was looking for a more personal experience to understand what people endured. There was a massive amount of literature, videos and pictures. Mostly relating to the political aspects of that time.\nYou could not leave without...\n\n\nMore"], ["New but Expensive", 3.0, "August 3, 2014", "DeeDeeNC070", "Greenville, North Carolina", 192, 162, "After touring the Holocaust Museum, we snacked at the Museum Cafe. First know that there are few eateries in this part of the Wash DC Mall area; I know because we looked (and walked) for a now-closed restaurant in this area the day before. (Suri is wrong on directing you to some dining establishments.) Few if any alternative eateries are...\n\n\nMore"], ["Cash out your savings account", 3.0, "July 19, 2014", "JoeyBowman", "Hudson, NC", 89, 39, "$30 for my girlfriend and I to eat what was a mediocre meal at best. Friendly staff. Security was nicer here than at the actual museum."], ["Steer clear", 1.0, "July 4, 2014", "edwardNsandra", "Orlando, Florida", 20, 13, "We ate here for breakfast before heading into the museum. I ordered a broccoli cheddar knish, but it had absolutely no cheddar in it, just incredibly soggy broccoli mush; it was so awful I couldn't eat it. We also bought 2 chocolate chip cookies that were so bad the kids couldn't bring themselves to eat them. We also purchased a...\n\n\nMore"], ["Better than most museum cafes", 4.0, "July 1, 2014", "SCDad", "South Carolina", 162, 97, "We got into town just after lunch and had experienced the Smithsonian cafes before, but we'd heard that this one is pretty good (and for those who care, it's also kosher). The kids ate personal pizzas and we ate black bean burgers. No complaints."], ["Expensive, as Expected, but Tasty", 4.0, "July 1, 2014", "1Annabelle1", "Downingtown, Pennsylvania", 109, 50, "This is a nice place to have something to eat while you wait for your ticket time for the museum. I had the potato knish, and it was a treat! I had never had that before. My husband had the black bean burger and really liked it."], ["About what you'd expect for a museum cafeteria", 3.0, "June 15, 2014", "Citallwic", "Columbia, South Carolina", 840, 353, "We ate lunch at this smallish cafeteria after touring the museum. The security check at the entrance was a little off-putting, though I do understand the necessity. The food was decent, but a bit pricey, which is par for the course at museums on and near the National Mall. Not surprisingly, there were Jewish food choices.\nOne more thing: We...\n\n\nMore"], ["Way to expensive", 3.0, "June 9, 2014", "Carolreckamp", "North Barrington, Illinois", 52, 65, "I got a ticket for entrance to the Museum shortly after noon. While I know these kinds of places are expensive it was to convenient to pass us. I had the small vegetable chilli, chips and a drink for $12 bucks. It was totally average food and I can't remember the last time I paid so much for so little...\n\n\nMore"], ["Something for everyone", 5.0, "May 17, 2014", "Crewchic", null, 14, 4, "I brought 10 students and 8 adults to this little cafe. They all found something they loved. I loved the Matzo ball soup and my potato knish was also delicious. The big hit was the strawberry sandwiches! The kids loved these! You have to pass through tight security before coming into the cafe which is unique for a dining experience."], ["Lunch", 1.0, "May 13, 2014", "KeyWestJunkie_62", "Urbana, Ohio, United States", 38, 13, "The only reason we ate something here was because we were in the area and had not had lunch yet it is basically cafeteria food. Very expensive stay away from here"], ["A place to get a light meal", 5.0, "April 22, 2014", "Ginny Y", "Lebanon, Pennsylvania", 17, 7, "Recently we were in Washington D. C. to visit the Holocaust Memorial Museum. It was a day when the weather was not cooperating. We were looking for a place to eat as well as get out of the rain. We were directed to this small cafe, adjacent to the museum. It is cafeteria-style. The food selection was wide-ranged and the...\n\n\nMore"], ["Convenient but pricey", 3.0, "April 16, 2014", "nnjpeach", "Hackensack, New Jersey, USA", 88, 28, "Went here after the museum and luckily the line was not long. I agree with other reviewers that security guards at the entrance were not at all friendly but the restaurant staff was ok, but i chose a pre-made sandwich that was very good. It was a bit pricey for me but not unlike other eateries in DC.\nNegative, those...\n\n\nMore"], ["Wish I knew ahead of time...", 4.0, "April 13, 2014", "Davijuls", null, 161, 73, "Go online and get tickets for the main exhibit! Otherwise there is not much to see but the children's area. Also, magnetometers are used to go in so be mindful of what's in your pockets."], ["Great food", 5.0, "December 16, 2013", "Robbie M", null, 13, 1, "They offer kosher food but not prepared on site. The service is outstanding and the food very delicious."], ["Convenient", 4.0, "November 11, 2013", "kady39", "Northwest Ohio", 36, 13, "This is a cafeteria style cafe. If you have a panini or similar sandwich made, they issue you a beeper so you can come up when it's done. My tuna, havarti dill cheese panini with a tomato was very good, but a little over-priced. I guess that's a city for you. You have to go through security again to enter...\n\n\nMore"], ["Much better than what we expected.", 5.0, "October 3, 2013", "Matt C", "Sacramento, California", 148, 92, "With its close proximity to the Holocaust Museum, its only fitting that this cafeteria specializes in Jewish Cuisine.\nWe tried the Matzo Ball Soup, the Knishes, and the Tuna Sandwich. All of them were excellent!\nCappuchino was only $4 and the quality was comparable to those I've had in Rome.\nWe were not expecting this little Oasis and were very...\n\n\nMore"], ["Good food and friendly service", 5.0, "September 16, 2013", "NaHu11", "Australia", 52, 24, "A different range of food in a land where greasy and sweet food is the norm. And the lady at the register was lovely. Kosher food also available"], ["Good bagel, soup and sandwich. Not crowded", 4.0, "September 11, 2013", "Westexans", "Midland, tx", 38, 14, "This is not located in the museum. Go out the door and across the yard to another building and go thru another security scan. It is upstairs. We enjoyed it for light lunch, and the lady at the counter was very helpful."], ["We must never forget!", 5.0, "September 3, 2013", "Traveling19-51", "Lexington, Kentucky", 56, 54, "Very tastefully presented, very moving and thought provoking. I thought the portion design for the children was excellent. I bought the book on tape if Daniel's story. My grandson who was 11 put down his games to listen intently. He asked many many questions. I enjoyed the room with all the shoes and listening to the stories of the survivors....\n\n\nMore"], ["Disappointed of food choice", 2.0, "September 3, 2013", "dusoft", "Canada", 11, 3, "One of the very few places were we thought we can eat around National Mall - but their choice of food was very poor and the food we finally got was tasteless!"], ["Food was ok", 3.0, "July 29, 2013", "fourfeetadventures", null, 9, 3, "In a separate building adjacent to the museum. The food was pricey. We had the personal pizza and it was ok for the price."], ["Amazing .....", 5.0, "July 20, 2013", "Jackie C", "Jacksonville, Florida", 10, 9, "I say Amazing in that it is \"amazing\" what the people had to go through, for those who made it and those who did not. So much information, documents, personal objects, documentaries to take in. Your heart just breaks for those who had to endure this tragedy."], ["Just Okay", 3.0, "July 11, 2013", "Michelle W", "Elyria, Ohio", 44, 14, "We stopped here before going into the Museum. It's in a separate building on the second floor (there is an elevator). My husband really liked the panini he had, and my son like the salmon wrap he had. I had a caesar salad, which was unremarkable. It was crazy busy but the staff managed to take care of everyone. Very...\n\n\nMore"], ["Museum food", 3.0, "July 8, 2013", "jwillstp", "Germantown, Tennessee", 299, 97, "Typical overpriced museum food. But in a clean and not as busy as the other museams location. Would eat here again if in the area."], ["It's museum food - what did I expect?", 3.0, "June 30, 2013", "zzMomof5zz", "Cincinnati, Ohio", 57, 38, "This is a very conveniently located cafe. It serves only vegetarian and pescatarian food items. We spent a lot and left with slightly less hunger than we had when we walked in. Not a lot of other restaurant choices nearby on the weekend."], ["Food was Good, Rest was Excellent", 5.0, "June 30, 2013", "PeterNMI", "Washington, DC", 116, 62, "The museum can be demanding. It is popular, crowded and covers a difficult topic. So, having the opportunity to find a table, sit and eat is most welcome to the weary. The staff does a fine job of preparing and presenting the food with an ambiance that a person can relax at table, taking a break from a busy day."], ["Spendy but great with groups", 5.0, "June 23, 2013", "breoni", "Topeka, KS", 729, 368, "We pre-order sandwiches for our group. Most of the kids get the turkey sandwiches, while others get the PB&J or Egg Salad. There is a small dining room, and you have to go through security to enter, so I will enter and pay for our lunches, and then the staff wheels out the boxes of sandwiches, chips, apples, and cookies,...\n\n\nMore"], ["Not bad", 3.0, "June 11, 2013", "Bonnieeellen571", null, 33, 13, "A little pricy but potato knishe and tuna melt were good. The location is extremely convenient to the Holocaust Museum and there aren't many other choices in this location."], ["Nothing special", 2.0, "June 3, 2013", "Lori L", "Tyler, Texas", 158, 85, "We spent longer at the museum than expected, meaning we were getting hungry so we wanted something close so we could finish the museum. So we left the museum and went across the courtyard to the little cafe... It has a very limited menu and we ended up splitting a grilled cheese panini. Was not that great and the prices...\n\n\nMore"], ["Lovely selection of food", 5.0, "May 9, 2013", "Debbie W", "Boksburg, Gauteng, South Africa", 91, 34, "Great eating options available in a very well stocked buffet style eating facility. Lots of healthy and nutritious choices to make as well as some decadent options if you looking to indulge. Bathrooms are available off the main eating area."], ["Try the tomato and mozarella salad...yum.", 3.0, "April 18, 2013", "Tom B", "Eugene, Oregon", 140, 49, "Well, obviously I have a preference here. I was pleasantly surprised at how good this was. Otherwise, the place is average."], ["A thoughtful vegetarian find just outside the Memorial", 4.0, "January 23, 2013", "Manmap", "Hagerstown, Maryland", 123, 50, "It isn't cheap, like all downtown eateries; but the offerings were well paired and of high quality. From Knishes to potato soup, tuna panini to salads, everything is homemade and fresh."], ["Close for a quick bite to eat", 3.0, "January 5, 2013", "Candace C", "Freeport, IL", 147, 60, "If you need to get something to eat and are near the Holocaust Museum- this is a close place and you can regain your composure after seeing the Museum-this place will allow you to grab a bite to eat."], ["Some Kosher options, but otherwise typical museum cafe food.", 3.0, "December 29, 2012", "Deborah1150", "Fort Worth, Texas", 36, 15, "The cafe is convenient, but definitely not \"destination museum dining\". There are some Kosher options, but otherwise the food is typical cafeteria fare. The cafe is small, but I suspect adequate; one has to leave the museum, cross the courtyard, and go through another security check to get to it. The inconvenience probably discourages the crowds. Also, unless you are...\n\n\nMore"], ["Expensive", 3.0, "October 3, 2012", "TravelBird78626", "Austin, Texas", 27, 14, "Very expensive, but the food was tasteful. Went to eat because the people we were traveling with were hungry."], ["Expensive with limited selection", 2.0, "September 13, 2012", "mightylad", "Ansbach, Germany", 5, 0, "Like any tourist attraction, if you don't come pre-fed then you're going to have to fork out nearly double the usual going rate for food. A can of beer will run you 4-5 dollars and a small salad of mostly lettuce will run about the same. My advice...avoid and eat at one of the plentiful restaurants throughout DC before coming."], ["Expensive for mediocre food", 2.0, "August 25, 2012", "Michelle W", null, 1, 0, "Cafe was close and convenient, but expensive and limited options. Menu does seem to have a lot healthy options."], ["Convenient and Good Food", 4.0, "August 7, 2012", "Sunster-Chicago", "Chicago, IL", 19, 6, "My sister and I and her 3 teens ate at this cafe and we found the food to be good and the staff friendly. The selection is limited, but you can custom-make some of th items you order. The prices were reasonable and the cafe is right next to the Holocaust Museum."], ["Hard to find", 4.0, "July 22, 2012", "missjeepgirl", "Hagerstown, MD", 87, 43, "The cafe is NOT in the same building as the museum, so we had to ask where it was. The food, while not a lot of choices, was very good and not too expensive compared to most museusm cafes. We got the lunch special, of soup and sandwich."], ["Good Sandwiches", 4.0, "July 16, 2012", "Brooks271", "Michigan", 40, 5, "Good cafe. The food was good, but a little expensive."], ["Better than most food on the Mall", 4.0, "June 19, 2012", "Sad7288", "Boulder, CO", 92, 27, "Although many tour guides recommend the cafe at the American Indian Museum(deservedly so), this hidden gem on the other end of the Mall is much better than the other museums. The food selections are fresh and a nice change from the burger and fries found elsewhere. In addition to the kosher fare, there are a nice variety of soups, wraps,...\n\n\nMore"], ["Kosher Food, Matzo Ball soup, Bagel, Cream Cheese", 5.0, "May 30, 2012", "behappy101", "Sharon, Massachusetts", 26, 14, "Are your hungry? The food at most museum cafeterias go is very expensive and taste is just fair.\nThis Museum has kosher food that tastes good. The cafeteria is smaller, the prices are better and the wait is shorter. Where else can you get Matzo Ball soup or a bagel cream cheese and lox?"], ["Good But Expensive", 4.0, "May 1, 2012", "Paswaters", "Centennial, Colorado", 76, 41, "You and your family or companions will find a variety of very tasty meals at this cafe, but prices are predictably high and similar to other local museum cafes. It's typically busy at lunch and dinner times, so plan accordingly or be ready to wait."], ["just a little kosher cafe", 3.0, "April 23, 2012", "Misstourguide", "Maryland", 58, 25, "The food is ok: just expensive. Kosher food is hard to find downtown tho' so it is convenient. Not a great selection of food."], ["Not bad for a museum cafe", 3.0, "April 13, 2012", "lptsoccer", "Bothell, Washington", 82, 59, "The restaurant is outside of the museum so if you go into the museum you will have to go out and get searched before you go back into the museum. The food is pretty good, I had a really good tomato basil soup and a salad. They have daily specials and most of the food looked pretty decent for a...\n\n\nMore"], ["great lunch", 5.0, "April 4, 2012", "Amy S", "Milton, Florida", 58, 21, "We were really hungry after the tour through the museum and found this cafe. The atmosphere and food was excellent"], ["Great staff, easy to work with", 5.0, "July 1, 2011", "breoni", "Topeka, KS", 729, 368, "We had a group of 43 that we needed to feed. Calling them ahead of time was the best decision I made. The staff was great to work with, our order was accurate and tasty. It's a little spendy, and it's strange having to go through security to get some boxed sandwiches, but everyone was great and it made the...\n\n\nMore"]]], ["Cleveland Park Bar and Grill", [["Food and drink and rooftop bar", 4.0, "September 23, 2015", "traveler4444661", "Mississippi", 45, 15, "The beer selection was decent, a little over priced but I think that is standard for the area it is in. The atmosphere wasn't my favorite but they did have a lot of TV's to watch games. I had cheese fries which were not good but some of the other options on the menu looked decent. This place gets 4...\n\n\nMore"], ["Good lunch find after a trip to the zoo", 4.0, "September 7, 2015", "Alison D", "Hershey, Pennsylvania", 36, 27, "Our family discovered this place on our way back to the Metro after a visit to the zoo. The food was much better than I expected from a sports bar type restaurant. There was a kids menu too which we appreciated for our two daughters. Although the restaurant was pretty empty at 2pm, the food seemed to take a long...\n\n\nMore"], ["Fun sports bar", 4.0, "August 19, 2015", "pehland", "Wexford, Pennsylvania", 24, 9, "Stopped in on our last night in DC since it was close to our hotel, and wifey found a groupon. Very nice beer selection, the food was very solid, and the staff was fun and friendly. A great place to sit back and enjoy a ball game and some beers."], ["Great Sports Bar", 5.0, "July 6, 2015", "Bill T", "wisconsin", 8, 3, "Our party of five people had a great time in Washington for the four days that we were there. At the end of those very long tiring days of sightseeing, we would find ourselves heading back to this bar. We loved the service we were given. I highly recommend this bar for lunch or just to sit back and enjoy...\n\n\nMore"], ["great rooftop!", 4.0, "May 27, 2015", "perleytraveler", "Fargo, North Dakota", 87, 38, "We had appetizers and pizza - and enjoyed the great outdoors on their rooftop patio. Nice place to have a beer and just relax! Service was good as well."], ["Informal fun dining", 4.0, "April 13, 2015", "Carmen B", "Baldwin, New York", 53, 17, "Great service! Good food! Flavorful and nice presentation. Informal dining place with good service. Fun place with many tv monitors showing different sports/games. Even though it is a sports bar it has a very friendly environment. Great to go with friends and have a good time."], ["Good sports, soggy pizza", 3.0, "January 8, 2015", "ghp3", "Downers Grove, Illinois", 132, 53, "I stopped in while on a business trip at the nearby Marriott and wanted a place to catch the NFL playoffs. This was a good choice on some levels, with plenty of TV's, all showing sports of various choice, with several on the football game. I was also in the mood for pizza and was pleased to see that they...\n\n\nMore"], ["great place", 5.0, "November 30, 2014", "clarkeck", null, 42, 28, "first our waitress was fantastic. the atmosphere was great. beer was cheep for the area. the food was great. bathroom was clean. we loved this place and it was not far from the zoo. so do the zoo then go there for therapy after all day with the kids. lol."], ["Good food, overpriced drinks", 3.0, "October 26, 2014", "JustVisitingThanks", "Stamford, Connecticut", 23, 7, "We like CPBG--the food is tasty, the service is pretty good, and they have lots of TVs for weekend football. A major complaint is a lack of transparency with their overpriced drink menu. We paid $24 for a pitcher of Yuengling. You may want to read that sentence twice because its pretty unbelievable. Worse when you find out after the...\n\n\nMore"], ["Top Level Dining", 4.0, "October 7, 2014", "FlorissantBound", "Indianapolis, Indiana", 8, 9, "By top level, I am really referring to sitting on the roof for lunch. The weather was great, Connecticut Ave was bustling, and the food and drink did the trick. I had the Sausage Eggs Benedict, perfect for the time of day, 11:30 AM. I didn't realize beer went so well with breakfast, hahal. My older sister lives just down...\n\n\nMore"], ["CPBG", 4.0, "June 30, 2014", "Ren02", null, 4, 2, "There is one server there, I think he often works upstairs, and he just does a fantastic job! His name is Rene\nSliders are really good, and the hot wings, as well...fries used to be better when they served them in a paper funnel."], ["Cleveland Park Gem!", 4.0, "June 30, 2014", "dcmonkey", "Washington DC", 37, 29, "This is a great bar. The food is above average in the drink selection, especially the beer list, is great. But the superstar of the Cleveland Park bar and Grill is the waitstaff and the bartenders. Tommy is a top notch bartender. The kind where you only need to make eye contact to order another drink. And Bethany is a...\n\n\nMore"], ["Rooftop dining with good food.", 4.0, "June 17, 2014", "cassully", "Florida", 51, 11, "The rooftop dining in late afternoon was very nice. The food was good and they had a special on wings that were fantastic! Happy hour cocktails were very reasonably priced. They had a good selection of beers, but a little pricey."], ["Nice neighborhood joint!", 4.0, "May 13, 2014", "shetown12", "shepherdstown wv", 135, 46, "Starving, we stopped in to get out of the rain! Warmed up with a great wine and beer selection, and then dug into brunch, which was hard to choose from the many delicious entrees. Burgers were done rare, as requested, and we left more than satisfied. It appeared that the locals hung out here on Sunday morning, as there were...\n\n\nMore"], ["Limited selections, but near the zoo", 3.0, "April 22, 2014", "Nhampton", "Raleigh, North Carolina", 142, 53, "Stopped at this restaurant for lunch after visiting the zoo. Convenient to metro stop also. Selections were somewhat limited, but there was a good crowd in the bar that day to watch sports on the many televisions. I had mac and cheese, which is supposed to be a signature dish. Not bad, but nothing special. Service was good, friendly."], ["Nice roof terrace - OK food", 4.0, "April 8, 2014", "sissi2754", "sydney", 17, 5, "For me, the main advantage of this restaurant is the roof terrace. It is no really marketed and the entrance is hidden through a dark staircase at the back end of the restaurant, but is is a really nice sunny spot. The service is good and pizzas are good.\nIt is a great place to go for lunch brunch or...\n\n\nMore"], ["What they do, they do well", 4.0, "January 5, 2014", "Michelle S", "Wellington, New Zealand", 313, 97, "Good prices, good basic food, very friendly service - what more could you really ask for? We visited on an evening when this place was full - mainly people watching the football on some of the many screens showing sports in this bar and restaurant. The noise levels were high, but we could still talk amongst ourselves with no problems,...\n\n\nMore"], ["beer drinkers beware!!!!!! way overpriced drafts", 1.0, "November 9, 2013", "biodont", "Media, Pennsylvania", 250, 48, "stopped in here while visiting just to get a draft and catch some football scores. had to almost wave to the bartender who was trying to make it with some cuties. put a ten spot on the bar and had a yuengling draft. got $ back as change. asked \"how much?\", the other drafts were $7.\nthis is way beyond...\n\n\nMore"], ["Get the Bolognese w/ Vodka Meat Sauce", 4.0, "October 6, 2013", "brandon1989", "Washington DC, District of Columbia", 51, 43, "Cleveland Park Bar and Grill is a great neighborhood sports bar. Perfect for game-watching, tons of well placed tv's. The food is also surprisingly good. Most things on the menu are decent options; the pizzas are pretty good but a little overpriced, and the pasta bolognese with vodka meat sauce is outrageously good. My wife ordered it and I honestly...\n\n\nMore"], ["Pizza oven blisters expectations", 3.0, "May 29, 2013", "ArturoE", "Washington DC, District of Columbia", 9, 5, "The cool thing about CPBG is that it's an upbeat sports bar. Go there for the game watching, rooftap bar and (pricey) drinks, but be picky about the menu, focusing on particular items. Unfortunately, pizza is not one of them. You would think that with a nice wood burning oven the pizza would be rich in flavor. But there's a...\n\n\nMore"], ["great place to watch the games", 3.0, "April 11, 2013", "GregRich", "Washington DC, District of Columbia", 50, 20, "I had the pleasure of watching several games here over the March Madness tourney and it was a blast. Great staff and better than average bar food makes this place a sure winner."], ["Great food, sports and fun people in Cleveland Park", 5.0, "March 5, 2013", "Coastalhome P", "Washington DC, District of Columbia", 20, 28, "CPBG was my local bar during the 5 years I lived in Cleveland Park, a great neighborhood bar with a welcoming atmosphere to all. Good mix of ages and conversations at any given time.\nExtensive menu of pasta, wood fired, brick oven pizzas, salads. Lighter fare of sandwiches, paninis, wings and much more, all reasonably priced. Also a great place...\n\n\nMore"], ["Don't expect good service here.", 1.0, "January 2, 2013", "jtspeaks", "Ankara, Turkey", 45, 31, "I first visited the Cleveland Park Bar and Grill in late summer, hoping for a quick pleasant dinner with my family. The food was pretty good, but the service was super-slow (10 minutes before a waitress came to our table, 10 minutes to get someone to pick up the check at the end of our meal), and at that time...\n\n\nMore"], ["Delicious and reasonably priced", 5.0, "December 10, 2012", "VLSchaap", "Pittsburgh, PA", 50, 35, "This restaurant was delicious and extremely reasonable. They have delicious food, and a great selection. It is within walking distance of the National Zoo, near the Cleveland Park metro station."], ["Love the rooftop patio", 3.0, "May 8, 2012", "steve f", "tampa", 3, 0, "Great for a cold beer and a quick bite to eat. The sandwiches and salads are the way to go."], ["It was s very enjoyable lunch.", 4.0, "April 17, 2011", "damerault", null, 1, 0, "My family and I went here for lunch after going to the national zoo. This restaurant is between the zoo and the metro station . We had a friendly greeting at the door. We were disappointed that we could not be seated in the patio. It looked like a lovely place to sit. Although we were seated at a comfortable...\n\n\nMore"]]], ["Shaw's Tavern", [["Yummy food, lacked a bit with service", 4.0, "August 23, 2015", "NorlediaM", "Atlanta, Georgia", 17, 14, "I enjoyed a great lunch at Shaw Tavern this week. I had the special on Wednesday. It was a chicken sandwich of sorts, and was absolutely amazing. I looked at some of the other weekly specials, and told myself I had to come back to try them. The only reason I didn't give them a 5 is that service was...\n\n\nMore"], ["A good neighborhood place", 3.0, "August 14, 2015", "ThomSinclair", "Washington DC, District of Columbia", 31, 14, "Good burgers and beer. This place is great to have in the neighborhood. I wouldn't travel far to go here, but it's nice to have close by. The chicken and waffles are pretty pay great too."], ["Oh my god", 2.0, "July 24, 2015", "cdoobes", null, 64, 14, "This review would be so much easier if there food wasn't fairly good.\nUnfortunately these clowns don't have a clue about restaurant service.\nWe had a reservation for 7 people tonite before the Cowboy Mouth show at the 9:30 club.\nWe are seated inside and virtually simultaneously a band starts playing at sound levels making conversation impossible. This dinner is...\n\n\nMore"], ["USA! USA!", 5.0, "July 24, 2015", "jodokast1616", null, 63, 18, "I went here to watch the USWNT world cup final match. The place was packed shoulder to shoulder and even ordering beer was a task. The atmosphere was great though because everyone there were diehard fans and there to support the team. The bathrooms are unisex so it made for a rather quick turnaround with all the people in the...\n\n\nMore"], ["Nice bar/tavern but night club noise level", 3.0, "July 11, 2015", "rattenpakker", "Roeselare, Belgium", 226, 93, "Good beer selection, acceptable service.\nMostly traditional American food selection ( burgers, ribs, chicken and pizzas) but a very good suggestion that night was the trout.\nFood was fine and for an acceptable price.\nOne downer: the karaoke bar was on night club level so it's hard to have a table conversation."], ["Great Neighborhood Spot", 5.0, "June 29, 2015", "Ted J", "Hilton Head, South Carolina", 37, 22, "Had dinner here while visiting my daughter. Terrific ambience inside and out. Eat outside if the weather permits: there is great street life. Shaw has friendly service and a combination of traditional and unusual fare. We had the black pepper calamari, very lightly breaded and with a nice kick as well as a couple of unusual salads: The Cuke: hot...\n\n\nMore"], ["House salad was great!", 3.0, "June 14, 2015", "Candace L", "Washington, District of Columbia, United States", 11, 2, "The atmosphere is awesome, place settings are very fun, and the house salad rocks. Don't expect attention to details on your order. You will get what is on the menu and like it."], ["Ribs most disappointing", 3.0, "June 1, 2015", "Paul B", "Cincinnati, Ohio", 1, 0, "Well, a great neighborhood restaurant but ribs had small bones in each bite. Suggest a different dish for your meal. If you are driving, suggest a different restaurant."], ["Local Hangout", 3.0, "April 7, 2015", "aircarl", "Washington, DC", 18, 7, "While the food is good, unfortunately the noise level was so loud we could not carry on a conversation without shouting."], ["St Patrick's Day", 4.0, "March 18, 2015", "Caloks P", null, 17, 7, "What a great night to be in this place on St Pattys. Live band with good music, food & drink specials, & the atmosphere! First time here & it won't be my last. The Cali burger & the Pepperoni Pizza are yummy!"], ["Private NYE and Birthday Party", 4.0, "January 9, 2015", "camphobc", "Arlington, Virginia", 6, 3, "Shaw's Tavern could not have been more perfect to ring in the NYE and celebrate my birthday. The General Manager Rob was incredibly accommodating, helpful, and friendly. The private space upstairs so beautiful with hardwood floors, exposed brick and and open floor concept and was a perfect size for the 75 guests there that evening. The bar service was great...\n\n\nMore"], ["Wonderful Brunch Place in Shaw", 4.0, "December 3, 2014", "Christopher M", "Elkridge", 183, 61, "A friend recommended that I try Shaw's Tavern when I was last in DC for brunch, and I sure am glad he mentioned the place--what a neat bar and restaurant! There's plenty of outdoor seating for nice-weather days and nights, but I think I'll always prefer to sit inside and admire the cozy, industrial decor and good vibes throughout. It's...\n\n\nMore"], ["Great neighborhood spot", 4.0, "November 25, 2014", "Jcatharine", null, 17, 11, "Reviews have complained about the service - even when it wasn't busy -- but our experience on a slow Sunday evening was pretty good at both the bar and at a table. Food was presented piping hot. The fired calamari and french fries were done just right, the burger was juicy. Good beer selection. Sadly, Sunday night is the only...\n\n\nMore"], ["Great local tavern", 4.0, "November 24, 2014", "badbeartx", "EU", 22, 25, "pleasant atmosphere albeit a bit noisy.... Good food with a varied selection of farm to table quality items.... Service is good but a bit rushed. Overall a very good night out."], ["Great Neighborhood Atmosphere", 4.0, "November 4, 2014", "AKT301", "Bethesda, Maryland", 26, 6, "Trivia night was fun, good bar food, friendly staff! Have a great time every time I go! If I lived in the neighborhood, I wold be a regular!"], ["Neighborhood friendly tavern. Excellent service. Food ok.", 3.0, "October 16, 2014", "GailCrockett", "Reston", 224, 59, "I went here because I was doing a PaintNite after and ate beforehand. I was not wild about the neighborhood parking, a real challenge. Not sure I would have come by myself. Service was excellent, everyone was super friendly and accommodating. The food was decent. I could tell that a lot of regulars come. Reminded me of an English pub,...\n\n\nMore"], ["Great meal at fun neighborhood spot", 4.0, "September 29, 2014", "MomME50", "Maine", 120, 56, "Relieved to end up at Shaw's after a long day of travel. Enjoyed sitting outside on their patio on a warm late-summer evening; has the feel of a real neighborhood tavern in the sense that it's non-touristy and seems to be frequented by locals. Excellent service and very well-prepared food. We tried their Jambalaya as well as BBQ Salmon (both...\n\n\nMore"], ["Not your typical pub grub", 4.0, "September 29, 2014", "lutzboy", "washington dc", 52, 30, "We hadn't been to the Shaw area for eons, but decided to see Jennifer Holiday at the Howard Theater (she was AMAZING). Found Shaw's Tavern on Open Table and decided to give it try. Just reading the menu, it looked like you typical pub grub, but it's so much more. First they have a happy hour even on Saturday which...\n\n\nMore"], ["Great food and service", 4.0, "August 17, 2014", "KNB7722", "Ocean View, New Jersey", 4, 2, "Really enjoyed our time at Shaw Tavern. Neighborhood spot, nice outdoor area for food and drinks. Sat inside at high top, wait staff didn't notice us for about 10 minutes, we let the host know and waiter promptly appeared apologizing for confusion. Host stopped by 3 separate times to check on us and waiter brought out complimentary appetizer apologizing again,...\n\n\nMore"], ["Excellent Hamburger and salad", 4.0, "June 18, 2014", "Fields J", "Cary, North Carolina, United States", 76, 15, "Great big hamburger and salad with an outstanding balsamic dressing. Located right around the corner form the United Negro College building in downtown Washington, DC. Outdoor seating and friendly wait staff. Great local place to grab lunch or dinner."], ["Best chicken and waffles", 5.0, "June 8, 2014", "variya1", "Syracuse, New York", 27, 6, "Really liked the atmosphere with indoor and outdoor seating. Good pub food and the fried chicken with cornbread waffles was exceptional. Good service too."], ["Great brunch outside", 4.0, "May 30, 2014", "Lauren H", "USA", 96, 61, "My husband and I ate here on the way out of dc after dropping kids off at the Washington monument on Memorial Day. Shaws was serving Sunday brunch. We had great beer and the hot Bloody Mary. Yep it was HOT! We split the brunch pizza that was delectable. Sunny side up eggs on soft dough with pancetta and an...\n\n\nMore"], ["Early Dinner", 4.0, "May 18, 2014", "trooper198", "Lincoln, Nebraska", 179, 67, "Stopped by to have dinner and experience the neighborhood vibe. Was greeted warmly, seated right away. The cheesy grits are wonderful. I had the fish sandwich with cilantro. Very good. My wife had the Portobello mushroom sandwich. Not the greatest. Not much flavor and kind of soggy. Probably will be back."], ["Tasty tavern fare", 4.0, "April 21, 2014", "Queque", "Pennsylvania", 22, 11, "There were eight of us for dinner at Shaw's Tavern, which accommodated our big party on rather short notice. The food was a step above typical tavern fare; each dish seemed to have a special ingredient that elevated it just a notch above what you might expect. The touch of Sriracha in the chicken salad, for example, gave the whole...\n\n\nMore"], ["Great but slow food", 4.0, "April 19, 2014", "Chad S", null, 73, 30, "Great location and brunch bottomless mimosas are genius. They were short on kitchen staff so the slow food made sense. The cocktails are also great. Had the breakfast pizza which was a winner. The Mac and cheese skillet was also amazing. Great vibe if you can get outside space."], ["Great Bar Food!", 5.0, "March 13, 2014", "GoGators1986", "Kensington, Maryland", 28, 5, "I've been driving by Shaw Tavern on my way to work for several years and finally had a meal there before a concert at the 930 Club. The atmosphere is great as well as the service. They have excellent burgers and I would suggest getting the Fried Green Tomatoes as an app."], ["Enjoyable outdoor dining. Great food!", 4.0, "September 7, 2013", "AKMonty", "Raleigh, NC", 46, 23, "Ate on the patio. Good service and really good food. It was 6:30pm on a Friday night and happy hour was still in effect which meant half price wood fired pizzas, which we had - yum. Also $5 house wines - pretty good and $2 off draft beers. I had the salmon dish and it was delish. The berry cobbler...\n\n\nMore"], ["Enjoyable food with good service and casual atmosphere", 5.0, "September 3, 2013", "Delores S", "Washington DC, District of Columbia", 14, 13, "Three experiences at Shaw Tavern: all were enjoyable with good service and great food! The first visit I had brunch on Sunday in July, 2013. The second visit was in August, 2013, I had dinner. The third visit was in September, 2013, I had dinner. I guess I am close to being a monthly regular! My favorite is the catfish...\n\n\nMore"], ["Shaw's Tavern seeks and finds Redemption!", 5.0, "July 18, 2013", "JetJonesy J", "Global", 20, 6, "After switching chefs a couple of times, they finally got it right! The service and food were both outstanding. Their burgers may just be the best in the city! I am looking forward to brunch after viewing the new menu."], ["Charming neighborhood tavern.", 4.0, "July 9, 2013", "travelingcircusof4", "Corpus Christi, Texas", 9, 3, "Everyone in our party, ranging in ages from 10 - 70+, enjoyed a laid-back evening and dinner at Shaw's Tavern. The food and service were spot on."], ["Great Crab Cake Sandwich and patio", 4.0, "June 25, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I did not have much expectation, just thought I like to eat somewhere with an outdoor space and close to home. I was dog tired on a Friday night. I like the vibe of the place, it has that buzz, the bar was lively, and patio was lively. There is a blue grass band every alternative Friday., it starts playing...\n\n\nMore"], ["a tavern experience", 3.0, "June 1, 2013", "TolerantTraveler", "Washington DC, District of Columbia", 349, 98, "It seems most of the tables are those high stool ones and I just am not into that way of sitting and eating bar food. Service was bit uneven but basically this is a tavern and it felt like I was getting the tavern experience as opposed to a restaurant experience."], ["Nice Local Tavern", 4.0, "May 28, 2013", "Jeff W", "Rochester, New York", 78, 19, "I love the local feel and comfortable atmosphere. Nice cold drinks on tap and very good fresh food. I will be back for lunch and soon."], ["You deserve credit for blazing trail", 3.0, "May 20, 2013", "DCInsider", "Washington DC", 201, 112, "This part of DC is still up and coming... there's not much there yet, and though the spillover from U street will happen, it hasn't yet.\nSo- you guys deserve a lot of praise for opening up a cool, funky place and taking a huge step toward revitalizing a neighborhood. This place is vibrant, active, loud, crowded and fun. The...\n\n\nMore"], ["Great lunch spot, good value", 4.0, "May 19, 2013", "diant53", null, 44, 15, "Had lunch there today, and enjoyed it thoroughly. Service was attentive enough/good, bottomless Mimosas on Sunday for a flat $12 each were enjoyed by 2 of our party, and the food was very good. We had steak and eggs (perfectly done sunny side up eggs); a skillet of andouille sausage, peppers, potatoes, couple other things and sunny side up eggs;...\n\n\nMore"], ["good ambiance, but only average food", 3.0, "April 14, 2013", "jg325", "WashingtonDC", 489, 320, "My partner and I went to Shaw's Tavern for dinner one day because we had a Groupon deal and had never been here before. Overall, I thought the vibe and atmosphere of the place was fun, but the food was average.\nThere's an option to sit either inside or outside, and with the warmer weather nowadays, we chose to sit...\n\n\nMore"], ["We had a great time!", 4.0, "March 30, 2013", "Pat A", "Arlington Heights, Illinois, United States", 64, 34, "We found this place online, and it was close to our hotel. If parking hadn't been such an issue, I would have given it 5 stars. We had a great dinner and a great time, as it was Monday Trivia Night. The restaurant is near Howard U, and most of the other patrons were college-age, but this 60-ish couple and...\n\n\nMore"], ["Great new spot in the area", 4.0, "December 16, 2012", "Nads82", "Falls Church, Va", 423, 110, "Really liked this place. Service was wonderful. Cocktails were excellent. Strong beer selection, however the draft beer wasn't icy cold. Had the corn hush puppies that were pretty good. Excellent ambiance. Plan to return ."]]], ["Nook", [["Good food", 4.0, "July 3, 2015", "Ballbreaker1", "Charlotte, North Carolina", 42, 12, "Best food in the court, nice ladies serving it, the quesadilla was great and the chicken even better. Good price as well."], ["The Best in the Ronald Reagan Food Court", 5.0, "March 26, 2015", "Jeff W", "Annapolis, Maryland", 202, 55, "If you like crepes, this is hands down THE ONLY GREAT food in the Food Court here. There is nothing \"wrong\" with the other vendors, this is just such an exception because they offer you a breakfast crepe with sour cream and dipping sauce for under $6. And it tastes fantastic. Sure it's in styrofoam with plastic silverware, but what...\n\n\nMore"], ["Pulled BBQ chicken sandwich!!", 4.0, "December 3, 2014", "kemi715", "Palm Coast, Florida", 9, 5, "The BBQ chicken sandwich was very flavorful! It's so hard to find a good pulled chicken sandwich 😄 I went right at 12:15pm in the lunch rush and my good was made in minutes! Nice and hot and oh so affordable."], ["Great open face quesadilla & Tacitos", 5.0, "November 14, 2014", "Mike d", "Fairfax, Virginia", 12, 7, "It has been a while since I have been in this building. Again this place _DID NOT disappoint. This time I saw , open face quesadilla, it is big flower tortilla, with toppings on it. it is like a very thin crust pizza. The Mediterranean veggie was really good.I wish there was a place like this close to where I...\n\n\nMore"], ["moist cornish hens", 5.0, "April 5, 2014", "penntrainer", "Georgia", 259, 102, "Nice surprise inside the Ronald Reagan International Trade Center food court. The hens were broiled with fresh rosemary twigs and the rice was also seasoned perfectly. Something on the menu for everyone (all ages). Quesadillas were great. Many choices and best prices in the food court. One block from the Smithsonian."], ["Great breakfast!", 4.0, "January 26, 2014", "David A", "Washington DC, District of Columbia", 44, 18, "Had a breakfast quesadilla- it was soo good. Made just right, cheesy and yummy. Quick and easy. It's located in the Reagan building food court, but well worth stopping in if you are doing some sight seeing. Very filling, and just yummy."], ["okay pulled pork at the Ronald Reagan building", 3.0, "December 26, 2013", "PeTTer K", "Ann Arbor, Michigan", 100, 71, "In the Ronald Reagan building food court, nook serves up an okay pulled pork sandwich. Pretty minimal menu and the pulled pork was okay. Service is somewhat quick. Okay sandwich, would try something different next time."], ["Hidden Gem inside Reagan building", 4.0, "September 20, 2013", "Mike d", "Fairfax, Virginia", 12, 7, "We were in the food court in Reagan building looking for something different. Came across this place,after looking at the menu and the food,tried one of the lunch combos,got the jerk chicken with rice and spicy chickpeas with drink it was about $9. What a treat,the food was awesome and fresh.it is not your typical fast food,the food is a...\n\n\nMore"]]], ["Black Fox Lounge", [["Cool Jazz", 4.0, "March 17, 2015", "DanaeKR", "Washington DC, District of Columbia", 7, 8, "Fun and low key place to have a drink and a bit to eat while listening to funky music. Cute space and decent prices!"], ["classic historic lounge", 4.0, "November 15, 2014", "foodicated", "Washington DC, District of Columbia", 10, 2, "Historic Watergate tapestry from original Watergate hotel adorns the wall of this unique lounge. Live music some nights, good light menu and comfortable for couples or business. One of my go to spots when someone special is in town. Owner is gregarious and on top of service."], ["Great music", 4.0, "September 4, 2014", "travelot777", "Washington DC, District of Columbia", 30, 6, "There's always great music here just about any day of the week. Friendly bartenders and good pours. And great location near DuPont Circle."], ["Great Gay Spot", 5.0, "August 9, 2014", "Travelergirl998", "Baltimore, Maryland", 189, 94, "I have attended a few organized events here and I think they are done right. The finger food is always excellent and the crowds are very metropolitan. Drinks are nice with some great sweet cocktails. The space is very good for group events because it allows easy mingling and talking."], ["Not great music, average menu", 3.0, "December 30, 2013", "g-raterr", null, 166, 104, "Pros: Live music every day. 2 floors of music. They have a decent bar menu. Friendly staff. It wasn't too crowded. When I went there was no cover entry. Local artists. There is some food available for purchase but we didn't try it. Drinks were priced at what you would expect them to be near DuPont circle.\nCons: Maybe it...\n\n\nMore"], ["Nightly live music -- Jazz, red wine, chocolate...", 4.0, "September 18, 2013", "owl9", "connecticut", 133, 33, "Jazz? The evening I was there. Nice selection of red wines by the glass. Got a recommendation and taste of the Pinot Noir and Shiraz, had the shiraz. Next tried the malbec, merlots and cabernet sauvignon, liked the cab.\nAccomodating bar staff, completed my evening finding a piece of chocolate cake.\nJazz, red wine, chocolate..."], ["Great little local bar with live music. Nice find on a Thursday", 5.0, "June 6, 2013", "brentond", "LA", 18, 8, "Live music is great - nice little place with a decent menu and good service. Low key, nothing fancy but just what we were looking for"], ["GREAT Monday Cabaret - La Ti Do", 4.0, "May 7, 2013", "stonewithnomoss", "USA", 476, 368, "Downstairs at the Black Fox Lounge on Mondays at 8pm is an eclectic cabaret created and hosted by Regie Cabico. Music, singing, poetry reading and comedy -- there is a little bit for everyone. It feels almost like \"open mike\" but it really is a venue for local DC artists to showcase their talent. $10 cover. Drinks are kind of...\n\n\nMore"], ["Great Bar; Great Music; Great Food", 5.0, "April 7, 2013", "ScottInIndia", "Washington DC, District of Columbia", 111, 105, "Black Fox is my ideal neighborhood bar/hangout. It attracts businessmen and visitors to DC, has a fiercely loyal local \"fan base,\" and you can depend on meeting interesting people here. It's a casual place but the interior is quite attractive and elegant. Disclosure: The owner and I have been friends for 30 years and Jim is the reason why the...\n\n\nMore"], ["Great live music & nice bar", 4.0, "April 3, 2013", "Poopyscoop", "Brighton", 327, 131, "This is a great small bar with a lovely owner & the most amazing live music in the evenings. Very atmospheric & friendly."], ["Great live music", 5.0, "January 13, 2013", "mrmnypny", "New Orleans, Louisiana", 31, 5, "Walked in and the upstairs was kind of lightly crowded, but then we discovered the downstairs live music venue. What a treat as the place was super. Lively crowd, yet intimate setting. It was a good mix of age groups, and we enjoyed the appetizer menu. Lots of fun. We'll be back."], ["Drinks", 5.0, "August 14, 2012", "kelbeach", "Fort Myers Beach, Florida", 14, 0, "Great place to get drinks... Don't know about the food since we got there late night. Daniel was an awesome bartender, friendly and attentive... He even gave us his chocolate mousse cake (yum!). Perfect place to hang out and relax on our last night in DC."], ["Spoken Word and Martinis", 4.0, "August 3, 2012", "MizGlammie", "Toronto, Canada", 1, 0, "Enjoyed a spoken word performance and a martini at the Black Fox Lounge. Young crowd but entertaining."], ["I WILL BE BACK", 5.0, "July 29, 2012", "code3mama", "California", 11, 2, "Wandered into this bar on our way home after a long day of walking and tough week at the international aids conference. What a great place! Fantastic music and a really nice crowd. Terrific bartender that was really nice and even gave us a complimentary cheese and fruit plate! We could not believe it. He kept our glasses full and...\n\n\nMore"], ["Great Bar", 5.0, "July 10, 2012", "kitten1961", "Tampa, Florida", 27, 22, "Wandered into this bar on our way home after having dinner. What a great place! Fantastic music and a really nice crowd. Terrific bartender that was really cute and even gave us a complimentary cheese and fruit plate! We could not believe it. We only ordered a bottle of medium priced wine and there was no cover charge for the...\n\n\nMore"], ["Not just a lounge....food is delicious!", 5.0, "May 12, 2012", "Michael D", "Oxford, North Carolina", 101, 43, "A friend and I were in D.C. for 4 nights. She got a 2 for 1 dinner special through Groupon, so we thought we would check this place out. Live music was in the lounge downstairs and there was a lot of people coming and going. This is a hopping place! We had dinner upstairs and a couple glasses of...\n\n\nMore"], ["Live music", 4.0, "April 21, 2012", "jlynncp", "Baltimore, Maryland", 10, 3, "Just stopped in for drinks and dessert, but it was the live jazz music that attracted me. Nice classy looking place."], ["Great Venue for Music and Good Food", 4.0, "March 18, 2012", "richard_traveler", "Highland, Maryland", 194, 110, "The Black Fox is a reliable source for live music, both in the street level bar (small combo's) and the lower level venue. We saw a cabaret act that was fun in the downstairs area, in a cozy space that held about 50 people. They could have used more servers, but the food, once arrived was very good. We had...\n\n\nMore"]]], ["Pho 14", [["Banh Mi and Pho", 4.0, "September 1, 2015", "Sonia G", "Los Angeles, California", 11, 1, "Nice Vietnamese restaurant. Delicious roast pork banh mi! Spring rolls were a bit bland. My son ordered a shrimp dish that smelled incredible (and he said it was delicious - sorry I forgot the name). My husband had pho and was quite pleased with it. Service is efficient and friendly. Lovely decor!!"], ["Ok..nothing special", 3.0, "May 24, 2015", "AmandaCab", "New Bern, North Carolina", 6, 3, "We were in DC and looking forward to eating some delicious pho. This was ok. If I was in the neighborhood I would come back, but would not make it a point to go out of my way to come here. Service was just ok."], ["Very good pho, very bad service", 3.0, "May 18, 2015", "suezimbm", "Bratislava, Slovakia", 6, 1, "The soup was fresh, very tasty and we could basically build our own pho by choosing ingredients. Five stars for the food.\nHowever, nobody cared about us, even when paying. All of the staff had someting more important to do. Null stars for the service."], ["Consistently delicious!", 4.0, "March 21, 2015", "Lisa M", null, 2, 0, "Pho 14 has a vegetarian broth among its menu options, something that seems to be rare among DC pho places. The sign says it's made from fuji apples. I love it every time I get it. For me, the regular size is plenty; the large leaves extra to take home."], ["Basic, but tasty Vietnamese", 4.0, "January 9, 2015", "BlueTraveller711", "Tegucigalpa, Honduras", 304, 94, "Pho 14 serves reliably tasty Vietnamese food. It's nothing too fancy or creative, but serves consistently tasty Vietnamese staples. The rice dishes and sandwiches are always a good meal and their pho is always satisfying - it's an especially good way to warm up on a cold day. The ice tea and iced coffee make a great addition to any...\n\n\nMore"], ["Dinner", 5.0, "September 24, 2014", "weekendwonder1", "washington dc", 189, 56, "Great stir fry. The veggies with beef, chicken, or pork was great. Salads looked very good. They have a large variety of noodle soups. Rice dishes seemed very popular. Small place but big choices. Parking can be a challenge but worth the effort."], ["Reliable Vietnamese Cafe", 4.0, "August 3, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Have not been here for a while, found myself in this place again on a tired Friday night. Ordered a 'Bun' Fried Catfish with Vermicelli, with a sweet chili sauce, a bit of salad on the side, it was delightful. Light and great for summer. The Vietnamese Spring Roll with grilled pork inside was also a great way to start...\n\n\nMore"], ["Try the \"Goi Cuon Nem Nuong Hoi\"", 3.0, "June 17, 2014", "luv2travel_whoohoo", "Rockville, Maryland", 59, 35, "Came here after Sunday funday with the girls. I was having a major craving for some sodium-laden flavorful pho broth. I could eat pho every day...\nPho: The noodles were very good- just a tiny bit of firmness but not too much. The broth, however, was disappointing. It was slighlty missing that wonderful umami that makes soups so delish. So...\n\n\nMore"], ["Pho 14 at Van Ness - a good addition to the neighborhood", 4.0, "June 13, 2014", "paxa", "Washington DC, District of Columbia", 370, 207, "Pho 14 is definitely what you'd describe as a \"neighborhood restaurant\". It's a few steps from the Van Ness metro, in a mostly residential block where there is a high rate of turnover of restaurants over the years. Most restaurants never make it there for very long, and most of them are not the type of dining venues anyone would...\n\n\nMore"], ["Very good pho and seafood spring rolls, decent bánh mì", 4.0, "June 4, 2014", "jlbdca", "Washington DC, District of Columbia", 6, 0, "Very good pho here and cannot pass up the seafood spring rolls. Usually pick up a bánh mì to go, which are not as delicious as the pho or spring rolls, but pretty good and under $5."], ["Pho-licious!", 5.0, "May 15, 2014", "Jo C", "Atlanta, Georgia", 45, 35, "Pho 14 has 3 locations in DC; I frequent the one located at 4201 Connecticut Ave NW (Near Van Ness Metro). It is a no frills storefront Vietnamese restaurant. Nonetheless, once you walk in and smell the fresh aroma of herbs and condiments cooking, you know your in for a treat. Family-owned, the staff is friendly and welcoming. The food...\n\n\nMore"], ["Not big deal", 3.0, "April 18, 2014", "Viajeromundial007", "Washington DC, District of Columbia", 114, 88, "Small restaurant, friendly staff, clean. We ordered chicken Pho with shrimps...Not a big deal, it was like eating a big bowl of water with noodles..not tasty at all. We were disappointed but maybe we should try another time."], ["My go~to spot for delicious fresh food", 5.0, "January 26, 2014", "wodaabe", "Washington DC, District of Columbia", 109, 43, "Pho 14 is a casual spot, terrific for lunch or a no frills dinner. The staff are very friendly and it's,a warm lively spot in a quaint neighborhood. I could eat the vermicelli bun dish everyday and be very satisfied. In part, I'm partial to this resto because they have the tastiest nuac cham sauce that's surely loaded with sugar...\n\n\nMore"], ["Great Pho (Vietnamese Noodle Soup) in a cold winter day!", 4.0, "January 4, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "What better than noodle soup for a cold winter day! The broth is always good, plenty of vegetables to go with the Pho. The way it work is you pick by the number, and they have different toppings and you can add extra toppings too. My companion has a Grilled Chicken with a Fried Egg on top. Great! Very reliable...\n\n\nMore"], ["Nice service and atmosphere but the pho is weak.", 2.0, "January 1, 2014", "Chang_and_Ling", "Washington DC, District of Columbia", 43, 41, "This is a comfortable place with friendly staff (higher prices, too) and perhaps other dishes are good, but the pho and egg rolls miss the mark. Disappointing for a restaurant named Pho.\nThe meats are the biggest shortcoming. On one visit, which should have been my last, the tendon was actually sinew! Aside from that, their brisket is very dry...\n\n\nMore"], ["Consistently excellent food, service good but not exceptional, no alcohol", 4.0, "November 24, 2013", "MaryRP", "Boulder, CO", 65, 66, "Four of us enjoyed a variety of Vietnamese items, all very well prepared. Try the home made lemonade or coconut juice. A bit pricy at $4 a glass, but exceptional."], ["Really bad pho ......", 1.0, "October 20, 2013", "CloudStrife", "Copenhagen", 80, 80, "If you are searching for authentic Vietnamese cuisine this is not the place to eat. The pho was really bad, the soup did not taste of anything, absolutely not recommended at all, but I suppose this is the best you get around DC or just another tourist trap .....\nThe one star was given because I bought 2 Banh Mi...\n\n\nMore"], ["awesome pho! Great deal", 5.0, "September 17, 2013", "roaming_alicat", null, 10, 12, "this place has fast friendly service and great Pho and vermicelli dishes. I was a little dissapointed with the crispy spring rolls (a little over done each time so I skipped them this time) but the pho was awesome\n. I got the #7 with extra noodles for $1 extra. perfect! very fresh and tasty. this place is easily acceptable...\n\n\nMore"], ["Good food, excellent value.", 4.0, "September 3, 2013", "AJB-Chicago", "Chicago, Illinois", 6, 7, "I haven't had a chance to try Vietnamese restaurants in the past, so when we had a chance to go there, I was very excited and looked forward to going there.\nI ordered a large noodle soup with two types of beef. Food arrived fairly quickly, was host, and tasted great. It didn't break the bank either!\nI definitely would...\n\n\nMore"], ["Unusual veggie broth noodle soup", 5.0, "August 22, 2013", "Sharadaprasad R", "Shawnee Mission, Kansas", 102, 51, "Our family makes it a point to eat out at Vietnamese and Pho 14 has been an exception. The service was fantastic and the ambiance was appropriate and restaurant was by far clean. We ordered large Veggie noodle soup and a Rice spring roll appetizer with an Avocado smoothie. Fresh basil, sprouts, hot pepper and lime was ample to tease...\n\n\nMore"], ["Quick service near Van Ness Metro station", 4.0, "August 10, 2013", "Anne S", "Wethersfield, Connecticut, United States", 11, 7, "The sign outside said Best Pho of Washington, so I went in and chose the large seafood, which appeared in a flash and was delicious with fresh scallops and shrimp, topped with fresh basil, lime, bean sprouts. Comfort food after a visit to Hillwood Garden."], ["Good finging", 5.0, "July 27, 2013", "Trip60", "Washington, D.C", 34, 16, "We were driving around looking for a place to eat and found this little place that serves wonderful food. The portions were very generous and delicious. The soft rolls were very tasty. They serve authentic Vietnamese food at a very reasonably prices Excellent service . We are invited to come back another time!"], ["Great find.", 4.0, "July 9, 2013", "Scott T", "Atlanta, GA", 15, 2, "We found this little place and had to eat their twice in the week we were in DC. It's the best pho other than homemade I've had in a while. You won't regret this place. They messed up our order and went out of their way to make it right. Great place and good service."], ["Always looking for a good bowl of Pho.", 4.0, "May 23, 2013", "Mary K", "Lakewood, Ohio, United States", 76, 46, "Just taking a walk around D.C. when Pho 14 caught our eye. We were craving a good, hot bowl of beef noodle soup and we found one here. The restaurant was casual and nicely decorated, and because it was a bit rainy and cool that day soup hit the spot. It had a nice hint of lime and anise."], ["Love it!", 4.0, "May 9, 2013", "pine1144", "North Bethesda, Maryland", 71, 67, "A great Vietnamese soup restaurant with quality food, reasonably priced and truly authentic. Family run business with multiple locations in DC area. Menu is limited with lots of variations on soup ingredients a few other vermicelli and sandwich choices and several appetizers. Huge soup portions! If you are not familiar with Vietnamese dishes, the staff is friendly and helpful in...\n\n\nMore"], ["I would eat here once a week...", 5.0, "April 11, 2013", "Jennifer B", "Williamsport, Pennsylvania, USA", 118, 60, "Every time we visit DC, we visit Pho 14. It's delicious, clean, and even authentic. The service is brilliant and the value is incredible. If you like a big bowl of amazing soup, you'll love this place. Even the stuff that I wouldn't normal eat (beef tendon) is delicious."], ["Pho Worth Revisiting, Again and Again", 4.0, "April 1, 2013", "SJM_DC", "Washington, District of Columbia, United States", 32, 13, "This Vietnamese restaurant tucked away on Park Road near the Columbia Heights shopping area is our favorite spot to slurp up soul-warming soup noodles. With very reasonable prices and casual, modest decor, it's a place for fun conversation with friends over a steaming bowl of pho (VIetnamese vermicelli noodles) packed with meat and veggies. Go ahead and opt for the...\n\n\nMore"], ["Fine Vietnamese + Non-Tourist Neighborhoods", 5.0, "February 28, 2013", "DCNorm", "Washington,DC", 18, 10, "We're locals but had never been to this place. We didn't have the Pho dishes -- which looked terrific; stick with regular size, which is plenty -- but rather oredered one of the crepes, which were very good, especially with the lettuce leaves and sauce that came with it. We also ordered a Ban Mhi sandwich, also very good. And...\n\n\nMore"], ["Seafood swimming in watery sauce", 2.0, "February 3, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "The first time I reviewed this place in another website, I gave it a 4 star rating. It become my regular noodle joint in the neighbourhood. Then everything change last night. OK. Their Pho noodle soup is great, for my main, I always have the same thing with different pick of meat to go with it. Decided to have something...\n\n\nMore"], ["If you like pho & bahn mi...", 5.0, "December 1, 2012", "Josh N", null, 7, 0, "This is the right place for you. I love eating here. It's not particularly different from another pho place, it's just very good. It is my very favorite place on a cold night when I can get some warm soup. Pho has that soul-warming quality that I really enjoy.\nAdditionally, the bahn mi is worth mentioning. It's not a new...\n\n\nMore"], ["Went back two days in a row", 5.0, "November 25, 2012", "ValerieGW", "Panama City, Panama", 45, 29, "This place has been around for a while now, but I think they're getting better. I left DC two years ago, right after they opened up, and was back visiting just now. I went for lunch by myself, and then lunch again the next day. Good prices - quick service - easy atmosphere - love it.\nDefinitely get the regular...\n\n\nMore"], ["Really good pho. Worth a detour.", 4.0, "September 22, 2012", "FilipoBambini", "Firenze", 103, 46, "What more to say? If pho is your thing, you won't be disappointed. Very nice ambience in a so-so neighborhood. Really good soup and spring rolls. Pretty good service. I like eating lunch here every time I'm in Washington."], ["Awesome Pho, fresh ingredients and delicious", 5.0, "July 20, 2012", "Alex Z", "Austin, Texas", 73, 43, "We came here while visiting some friends in the area. We all got the Pho (which seemed to be the local recommendation) with different veggies/meats, and we all loved it. The service was very quick, the sides of basil and sprouts were fresh and delicious, and we were able to completely stuff ourselves for about $15 a person including tip....\n\n\nMore"], ["Don't bother", 1.0, "July 9, 2012", "Girlseatworld", "Ellicott city, md", 88, 21, "Our office ordered a variety of grilled meat vietnamese sandwiches, egg roll and spring roll from them for lunch. The egg roll and spring roll are fine. The sandwiches are skimpy on meat. The bread is also on the chewy side more so than the crunchy side. There are definitely better vietnamese sandwiches in Rockville and in Virginia. Unfortunately for...\n\n\nMore"], ["Best Pho around!", 5.0, "July 2, 2012", "Juliann W", "Washington DC, District of Columbia", 31, 15, "My fiance and I stumbled upon Pho 14 on a cold wintry day in Columbia Heights. All I wanted was something warm and Pho sounded perfect. Every since, we've been coming back at least once a month if not more often. Their Pho is delicious, their hot tea hits the spot on cooler days, and the vermicelli is absolute perfection!...\n\n\nMore"], ["Great neighborhood Pho joint", 3.0, "June 17, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Great neighbourhood Vietnamese restro. It is casual, fast service. The food is authentic enough. Great noodles. Tasty and cheap. I am a regular."], ["Great experience", 5.0, "May 19, 2012", "Egill_M", "Reykjavik, Iceland", 9, 16, "I am not familiar with Viet Namese food but our visit to Pho 14 was a great experience in all respects. The meat ball soup and spring rolls tasted great and the Pho soup was incredible. Great, attentive service and the food came very quickly. They do not serve alcohol which makes for a nice quiet atmosphere. Highly recommended."], ["Excellent", 5.0, "February 23, 2012", "Ajimae", null, 2, 2, "Whenever I travel, I always check out pho restaurant. Surprisingly, Pho 14 is not listed in tripadvisor app in my iPad. They make very nice Pho. I love it. I will definitely revisit this place."]]]]