[["Cava Mezze Grill", [["A great choice", 5.0, "September 3, 2015", "sewingone", "Washington DC, District of Columbia", 82, 19, "Very nice place on restaurant row near Eastern Market (great shopping). Near Marine Barracks. I eat here often! Great food, good pricing!"], ["Quite good - bit different from Chipotle", 4.0, "July 7, 2015", "Vijay R", null, 10, 7, "Some of their sauces/chutneys are unusual. I think they are better than Chipotle, the menu tends to be a bit more variety. Maybe they are a hybrid of Roti and Chipotle?"], ["Quick healthy lunch", 5.0, "June 30, 2015", "Kim T", "Findlay, Ohio", 13, 4, "At a conference in DC, happened upon this \"fast food\" place for lunch. The resturauant was operated similar to a chipotle, but the meals were created with Mediterranean ingredients (hummus, feta, rice). The food was fresh and very flavorful. Overall, great tasting lunch that was inexpensive, quick, and healthy. I was happy to note that they sell their goods at...\n\n\nMore"], ["Reliable...", 3.0, "June 23, 2015", "FoodGuyWineGuy", "Washington, District of Columbia, United States", 121, 27, "Cava is a good reliable place...nothing is really outstanding but the food comes fast, it's relatively cheap and reliable."], ["Like Chipotle, But Better", 4.0, "June 19, 2015", "xislandgirlx", "Bay Area, CA", 7, 0, "I wanted to take something on my flight home from DC and had heard about Cava, so decided to stop by and pick something up to go. This is a Chipotle like style; you choose your base and then your toppings. Only difference is that its Mediterranean food instead of “Mexican”.\nI only have raves about this place! The staff...\n\n\nMore"], ["Good food fast!", 4.0, "April 21, 2015", "Bill_and_Nives", "Reston", 102, 20, "The concept is like Chipotle except for mid-eastern cuisine. It does a great job of having appetizing and fresh foods served very quickly. The decor is rather plain (like Chipotle) and prices fair. Overall a good experience and will definitely visit again..."], ["Healthy and fun experience!", 4.0, "April 16, 2015", "heyheymommyj", "Manila, Philippines", 44, 8, "I love this place. Felt so healthy ordering the grains and greens, chicken & braised beef (you can have half orders by the way) and everything else to go with it! With yogurt dill and toasted red pepper hummus, it was a loaded dinner but felt good having all the organic and fresh veggies!\nP.S. This place reminded me of...\n\n\nMore"], ["Wish we had one close by", 4.0, "March 30, 2015", "LOuladdaoud", "Wilmington, Delaware", 16, 5, "In an effort to find a low-cost meal that would satisfy a meat eater and a vegetarian, my husband and I decided to try this little place near Chinatown in D.C. We were pleasantly surprised and would definitely go back!\nI had the falafel and loved it; my husband had the spicy lamb meatballs and was quite satisfied. We were...\n\n\nMore"], ["Terrific healthy tasty \"fast\" food", 5.0, "March 27, 2015", "budget_travel_buff", "Minneapolis", 51, 37, "This is like a Greek or Mediterranean version of Chipolte. You go through a line and get the base - rice, salad or a grain/greens combo. Then you add three toppings e.g. hummus, toss in a protein (chicken, pork, falafal, meat balls..)and a bunch of fresh toppings add some sauce and you have an amazing meal.\nWatch out of the...\n\n\nMore"], ["Busy; delicious food & sexy atmosphere", 4.0, "March 17, 2015", "iStefPayne", "Washington DC", 126, 58, "Love the menu, the atmosphere is sexy (a little dark, cool lighting, busy but comfortable), and it's a great place to go with friends or on a date.\nAs I mentioned, it's busy, so you might have to wait and at times the busy-ness has evoked a twinge of arrogance from the staff (I notice this mostly as a former...\n\n\nMore"], ["You know it's good...it's Cava", 4.0, "October 20, 2014", "mamtravels", "Washington DC, District of Columbia", 66, 30, "I never write reviews of \"fast food\" places. But...wow. Opening day, there was a line around the block (yes, they were giving away free food...but still). So the second day I figured I would check it out and still there was a long line.\nThe food was extremely fresh, everything was coming out hot, fast and it seemed like it...\n\n\nMore"]]], ["Sophie's Cuban Cuisine", [["The Real Deal!", 5.0, "September 17, 2015", "Sue E", "Boston, Massachusetts", 6, 1, "Run by Cubans. Its the real deal! They have a full buffet with many options. You can also have them deliver to your hotel room."], ["Spicy and delicious", 5.0, "July 24, 2015", "mkwatermelon", "Floral Park, New York", 25, 11, "Was walking around looking for a place for lunch and spotted this place. The food was really good. We had a salad with spicy chicken and a salad with pork. Both were delicious. Friendly staff."], ["I'll Be Back", 4.0, "August 26, 2014", "banjobwana", "germantown, md", 127, 44, "Based on very limited experience, as good as anything that I've had in Miami's South Beach. Had the \"Pork with a twist\" sandwich; my colleague had the Cuban sandwish. Both exceptionally good. Lots of flavor, good balance of flavors, clearly quality ingredients. The \"twist\" was that the sandwich included fried sweet plantain. It works.\nLocated in the middle of DC's...\n\n\nMore"], ["Forget Havana", 5.0, "November 7, 2013", "Richard B", "Washington DC, District of Columbia", 4, 3, "Sophie's has been opened for a few months, and I finally got around to try it. I really enjoy Cuban food, having spent many days/nights in Miami on business over the last 20 or more years.\nSophie's menu spans the entire range of Cuban cuisine. and does each very very well.The portions are large and the service is excellent and...\n\n\nMore"], ["NYC Chain Cuban Restaurant opens in DC!", 4.0, "October 19, 2013", "AJP57", "Washington, DC", 158, 46, "Sophie's DC branch just opened within the last couple of weeks and I went there for lunch with a coworker. I had the Masitas de Puerco (pork chunks), moro (dark rice) and plantains (platanos maduros) and it was delicious. My friend had the Ox tails and she commented that the meat was too tough so she didn't care for them....\n\n\nMore"]]], ["National Press Club", [["Wonderful place!", 5.0, "September 28, 2015", "luvsroadtrips33", "Philadelphia, Pennsylvania", 7, 1, "Had a very enjoyable lunch here. Food was excellent, but the stand out was the service, which was superb. Everyone, even teenage kids who would rather eat pizza everyday really enjoyed it. This place is a hidden gem in the heart of a very busy part of the city. Would be delighted to return."], ["Lunch at the RELIABLE SOURCE", 5.0, "September 27, 2015", "LARRYOTTER", "Bucks County, Pennsylvania", 254, 99, "Had lunch after the Pope's speech to Congress. always a treat away from the hustle and bustle. Crab cakes are a reliable but but I opted for friend oyster poor boy. HOUSE RULE= No photography. The company is always special with the Hon. Joel Whitaker"], ["A Capital Experience", 5.0, "September 19, 2015", "reliantship", "Los Angeles, California", 175, 118, "Thanks to a contact, I had passes to the members' only restaurant. There is another restaurant that is open to the public. The chef did a nice job with the halibut special and the steak frites got a rave review from my dining companion. Service in the restaurant was very \"old school,\" and you got the feeling these waiters have...\n\n\nMore"], ["Food was Ok - Ran out of Alcohol", 3.0, "May 29, 2015", "Dawn D", "Houston, Texas", 65, 23, "MIxed reviews on the food, it was just ok. We started with a salad that had a cheese puff pastry on it - it was quite good. Then out came the steaks, mine was cooked to a medium and a good cut, the other people at my table were disappointed in their steaks and they were over cooked.\nTo top...\n\n\nMore"], ["Good club, good conference", 4.0, "May 8, 2015", "NoraFrydman", "Sunnyside, New York", 129, 21, "The building is nice but no tight security at this place. I had a conference on the 13th floor. The floor could occupy many conferences in many rooms. The Club of course carries many nice paintings like many other club houses. Good for small or mid-size conference with small audience. Not sure whether I will go back here soon, maybe...\n\n\nMore"], ["Lovely setting, exciting atmosphere", 4.0, "April 23, 2015", "Paula M", "Los Angeles, California, United States", 91, 37, "I attended a book launch party! There were quite a few other events going on at the same time so finding the room was a little challenging but we found it okay. The food and drinks were very good!"], ["A Nice Surprise, A Step Back to an Earlier Decade", 4.0, "February 16, 2015", "syael1339", "Annapolis, Maryland", 65, 27, "We were given a gift certificate for weekend brunch at the National Press Club. I'd been there before for seminars and presentations, but if you haven't been there previously, be prepared for a search for the right elevator to the 13th floor. Once on the 13th floor, enjoy your walk to the dining room by studying the numerous photos on...\n\n\nMore"], ["Enjoyable Dinner and Service", 4.0, "January 5, 2015", "1234esam", "Morristown, New Jersey", 28, 9, "We found the National Press Club via an app. We were pleasantly surprised as it was restaurant week. The service was very good and the meal was terrific. Would eat here again."], ["Food was meh", 2.0, "December 6, 2014", "Mybyzz71", "Alexandria, Virginia", 67, 43, "We went here for brunch. The food was bland we never did get the fruit cup that was suppose to come with the meal and waiter over charged us. For such a prestigious place I really expected great service. The service was terrible, slow and seemed like they all had better places to be. I would not return here."], ["Impressive", 5.0, "September 1, 2014", "RickCourt", "Chester, Virginia", 52, 18, "The Press Club was impressive. The meal (lamb chops) although smaller then I had expected, was very good. After dinner viewing the many awards and pictures was also very enjoyable."]]], ["Domino's Pizza", [["Good Domino's", 5.0, "October 4, 2015", "Arabiman", null, 62, 33, "It's Domino's. The delivery was efficient. The delivery person was a nice as he could be. The pizza was HOT. It hit the spot"]]], ["Morrison Clark Restaurant", [["better bar food than most when you've had a 12 hour day...", 4.0, "September 25, 2015", "agriffithva", null, 14, 7, "We mostly had sandwiches and fries with various gelatos for dessert. They were fresh, filling and tasty - all I ask for food when exhausted."], ["Charming, romantic restaurant", 4.0, "September 10, 2015", "Eric S", "Stephens City, Virginia", 20, 12, "My wife and I stayed in DC over Labor Day weekend and had dinner one night at the Morrison Clark. Having worked in the area and seen the ongoing construction for the past couple years, I was happy to see that renovations were complete. The restaurant and hotel look gorgeous. Great ambiance and stylish decor. We were the only couple...\n\n\nMore"], ["Good But Pricy", 4.0, "August 12, 2015", "joycec705", "Atlant", 22, 5, "The food was good, not five star, but quite yummy. The staff was great, the location was perfect, being the the hotel."], ["Supper after a busy day", 5.0, "July 9, 2015", "mrsanderson", "Riverside Cty", 71, 51, "Returned to the hotel after a busy day and decided to have dinner in the hotel restaurant. Hubs wanted crab cakes. Started with a house salad and roasted garlic soup. Both were fresh and delicious. Crab cakes were made with fresh crab and the NY strip steak was tender. The black truffle sauce was mellow and rich. Dessert wasn't an...\n\n\nMore"], ["Good food in a nice environment", 4.0, "July 3, 2015", "Medlaw_Travel", "Long Island, NY", 91, 24, "Nice restaurant in a small Inn, limited menu but the breakfast was very good quality, excellent service, quiet"], ["Poor selection", 2.0, "April 8, 2014", "MidwestGirl58", "Bristol, Maine", 45, 10, "Continental breakfast is the only thing they serve. It is poorly presented and very few selections. If they run out early, you are out of luck."], ["Impressive piece of history...", 4.0, "September 9, 2013", "Todd B", "Tampa, Florida", 1, 0, "Impressive piece of history both inside and out. You feel like you are stepping back in time, and you can imagine what it must have felt like to be a guest in a different time period. Visually appealing on all levels. Rooms were also impressive, as well as the room service. Decided to eat in the restaurant for dinner one...\n\n\nMore"], ["A bit pricey but superb!", 5.0, "July 3, 2013", "BillL80", "Richmond VA", 125, 43, "If you are looking for a quiet meal in an elegant setting, this is the place for you. It is a very small restaurant with seating for no more than 20 people but a great place to have a business meal where conversation is important."], ["Delicious", 5.0, "April 25, 2013", "luvz2travel_7", "New Jersey", 14, 17, "Best scallops EVER!! Cozy, romantic atmosphere. The service was very efficient and waitress extremely friendly!"], ["Enjoyable Dining Experience", 4.0, "April 21, 2013", "westernfb", "Baltimore, MD", 244, 95, "Stayed nearby on business but ate some of my meals here in the restaurant. The atmosphere was peaceful and comfy and gave me the feeling of being in an inn much further outside of a city. The service was friendly and relaxed. Prices might seem a bit high for some from out of town. For breakfast, I had Eggs Benedict,...\n\n\nMore"], ["A Neighborhood Gem", 4.0, "March 23, 2013", "jazzyepi", "Yardley, Pennsylvania", 44, 56, "We stayed at a hotel nearby and found this restaurant online. It was well worth the visit. Parking for the restaurant is free valet service so no parking hassles. The room is charming, the service\nexcellent and the food tastefully done. An enjoyable experience all around. You could be in a nice country home instead of bustling DC!"], ["Great Service, Delicious Food, Reasonably Priced", 4.0, "March 17, 2013", "EarlyBuyer", "New York", 19, 26, "The title of the review pretty much covers it. Food also arrived promptly and the coffee at breakfast was good."], ["Good Food and Great Ambiance", 4.0, "February 26, 2013", "JLynne52", "Oklahoma City, Oklahoma", 69, 19, "While staying in the hotel, I ate in this restaurant twice and had room service once. Food was very good - first night I had scallops that were divine! Second nite I had steak with green beans and salad. Very good! Wine selection is also very good! Desserts were good but not outstanding - I had the bread pudding and...\n\n\nMore"], ["Good for breakfast", 4.0, "February 18, 2013", "WenqianLu", "Providence, Rhode Island", 10, 3, "Food is good and environment is nice, but a bit expensive... We stayed in the same hotel, so it's convenient anyway."], ["Genteel dining", 4.0, "February 2, 2013", "art_nouveau_5", "Ottawa, Canada", 46, 24, "The Morrison Clark Inn is just a little off the 14th St beaten path, but worth the detour. The dining room retains much of the Victorian character of the Inn and is mercifully quiet, which is just lovely when you are aiming for conversation over dinner. The menu is not extensive and not terribly avant garde, but everything was tasty....\n\n\nMore"], ["Great little breakfast spot! Quaint!", 5.0, "November 23, 2012", "AliBowes", "Orlando, Florida", 41, 23, "Food was good, traditional eggs, bacon and toast, but lots of it and everything you would need for a good breakfast."], ["Surprise!", 5.0, "November 5, 2012", "Mike M", "Zug, Switzerland", 19, 8, "Excellent cuisine but not particularly lively and lacking in atmosphere as this is a Hotel Restaurant We were almost alone that night. This is not really highlighted on the travel review sites"], ["Okay", 3.0, "November 3, 2012", "Joseph B", "Monroe, Oregon", 102, 23, "Due to the hurricane we were the only ones in the restaurant. Service was good and the food tasted good, not exceptional, but good. The price was a bit much for the quality of food."], ["Great meal on porch in downtown dc", 4.0, "October 15, 2012", "Marblerye", null, 7, 4, "Food was great. Crab cakes and chicken Cesar salad. Sat on front porch in downtown dc. Service was there when needed but laid back and let you relax. Restaurant was located in a historic hotel."], ["Wonderful Meal", 4.0, "September 25, 2012", "jozzperth", "Perth, Australia", 56, 39, "4 of us ate here for dinner. Not one of us had a bad meal. The service was excellent, the food, awesome.\nNot overpriced and we were made to feel very comfortable."], ["Southern Style at Morrison-Clark Inn", 5.0, "August 17, 2012", "ciaograzia", "San Diego", 11, 2, "Very talented chef, with extraordinary culinary experience. Make his acquaintance (this is an intimate historic hotel) and it is likely he will prepare a meal to your tastes. It will be dazzling, including desserts."], ["Elegant and tasty", 5.0, "August 9, 2012", "UncadooPhilly", "Philly", 65, 51, "A wonderful place for an elegant meal. We had both lunch and breakfast here, we walked away smiling!"], ["Good Food, No Bar", 3.0, "July 20, 2012", "WarmVacations", "New England USA", 146, 135, "The food here was very good, but no bar if you wanted to chill out after along day. You were expected to go to a lounge room and be served, rather than sit on a bar stool."], ["Great food, great service!", 5.0, "July 8, 2012", "DJL393", "Anaheim, California", 4, 1, "The food here is fresh and well-prepared. By far the best we experienced in DC. Beautiful setting, cozy and romantic."], ["great breakfast", 5.0, "June 26, 2012", "Bsknees", "Du Quoin", 86, 42, "Try the orange french toast--very good! Great service- quick seating on a weekday."], ["Fantastic", 5.0, "May 9, 2012", "saraherrn", "Traverse City, Michigan", 20, 6, "This was a very nice dining experience. The staff was very friendly and the food was wonderful."], ["Extremely Impressed with Customer Service", 4.0, "April 21, 2012", "chiefs3182", "Harrisburg, PA", 8, 2, "Everyone in this entire place should be an example of customer service. From the time that they vallet park your car (which is 24 hours) to the front desk to the restaurant, everyone treats you like royalty. They are very polite and will do absolutely anything you would like. The decor and everything in the restaurant is very elegant and...\n\n\nMore"], ["Expensive but good", 4.0, "March 12, 2012", "Jacques B", "Montreal, Canada", 26, 8, "Don't have the steak; it was overcooked. Do, however, have the ravioli and their soups. Avoid the good but costly ($4 each cup of coffee) breakfast"], ["DC-Great Food and History", 5.0, "January 19, 2012", "dazow", "DC", 43, 16, "Historic Inn from 1864 serving classic American and a little Southern (it is in DC) food. The food is extraordinary and the service is exemplary. From the moment you walk into this place and they take your coat, the food and service are top class and bring you back to a time that was something most of us only read...\n\n\nMore"], ["Nice restaurant", 3.0, "January 12, 2012", "Kimberlee M", "Bloomsbury, New Jersey, United States", 4, 1, "Really pretty restaurant. We stayed in the hotel so it was convenient. We only had breakfast so there is not much to say about bacon and eggs. It was a little pricey for bacon and eggs x 2 came to $30.00."], ["Food was good, service could be better", 3.0, "January 1, 2012", "senti2comun", "Dublin, Ireland", 258, 248, "The food was good and I really like the ambiance, although it was pretty empty when I was there... Other reviewers felt it was a little overpriced, although for what I ordered ot was fine, and fresh ingredients. In general I have been underwhelmed by DC restaurants, so as DC goes, this is a good pick.\nBut I have to...\n\n\nMore"], ["Very average food which is overpriced", 2.0, "December 31, 2011", "mptopham", "Auckland Region, New Zealand", 40, 33, "We had dinner and breakfast here.\nI had steak frites, the steak was very average and tasted and ha the texture of having been frozen. The fries were so salty I could only eat a few.\nMy wife had open faced mushroom ravioli with feta cheese. It was watery and bland with no feta in sight. It was limp pasta...\n\n\nMore"], ["Way over priced!!!!!", 2.0, "November 27, 2011", "fundad1967", "GREENSBORO", 6, 1, "The place was nice but the service was rushed, and we didn't feel like we could take our time and enjoy our Thanksgiving dinner.when they brought me my apple pie, it looked as if they dropped it on the floor..I made them bring me another one. The food itself was just ok, not much seasoning and nothing to make us...\n\n\nMore"], ["Fantastic food!", 5.0, "November 22, 2011", "ehdailey", "Knoxville, Tennessee", 87, 45, "Service, food, wine -- all above excellent. If I could give a higher score I would. The Amish chicken is absolutely to die for."], ["Horrible food and very overpriced !", 1.0, "November 4, 2011", "dlmalo6006", "Mendon, Massachusetts", 2, 0, "This restaurant has a very limited menu and while the description of the food sounded wonderful, most of it was tasteless ! We had the open-faced mushroom ravioli which in actuality were just mushrooms, sauteed without garlic, onion or any type of herb or wine and then tossed over wonton skins. The dish had no taste what so ever. We...\n\n\nMore"], ["Drowning in salt", 2.0, "September 26, 2011", "CSSnowshoer", "New York City, New York", 724, 327, "I always know when I have ventured south, because the salt content in restaurant food substantially increases. But the meal I had at this restaurant last night took the prize. Still recovering from the pork in reduction sauce on polenta. Would have been better off drinking seawater.\nActually, I should have taken my cue from the fact that I walked...\n\n\nMore"], ["Elegant Brunch", 4.0, "July 31, 2011", "DCRam", "Washington, DC", 40, 10, "We had a large group of friends visiting from out of town (13 of us total) and wanted a quiet place for brunch but with very good food, service and decor. The Morrison Clark surpassed all of our requirements and put us in a private room. Dinner is always a treat, but we had never had brunch there before--it will...\n\n\nMore"], ["Good God This Restaurant Is Romantic!", 4.0, "July 7, 2010", "Christine O", "Long Island, New York", 44, 44, "We went there for our wedding anniversary and the ambiance was romantic beyond belief! I counted the tables in there; only 13. It was calm, relaxing and comfortable. The service was great (one waiter for the entire restaurant). Unfortunately, the food was just OK. Go, by all means, but know that your dinner isn't going to be as wonderful as...\n\n\nMore"], ["Lovely meal", 4.0, "June 22, 2008", "Gary-n-Jane", "Weston-s-Mare, UK", 4, 0, "We chose this restaurant as it was recommended in a guide book, and although at first thought that the menu was a little limited, it turned out to be a wonderful meal, in a very pretty old fashioned dining room in this very charming house. The food was presented very well, tasted excellent, and the waiters were very attentive. We...\n\n\nMore"], ["One of the most romantic...", 5.0, "June 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "One of the most romantic restaurants in the city"], ["Awesome comfort food - best spot for a romantic or nice weekend meal when without a reservation!", 5.0, "January 26, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Awesome comfort food - best spot for a romantic or nice weekend meal when without a reservation!"], ["disappointing", 2.0, "January 2, 2008", "Neil B", "Washington DC, District of Columbia", 28, 20, "disappointing"]]], ["Recess Lounge", [["Love Love Love", 5.0, "October 12, 2013", "GiGi R", null, 6, 1, "Went on livingsocial twice and been back 3 more times after that..... the food is FaB!!! the Scallops Al Chef is a MUST... the red sangria is GOOD!!! the CAKES!!!! THE owner stopped by our table which was cool!!!"], ["So good we went twice in 3 days", 5.0, "October 10, 2013", "James S", "Middleton, Wisconsin", 104, 38, "We were in DC for a short vacation and had received a promotional special from this restaurant. The tapas were very good and the sangria was especially good. The wait staff was very helpful with tapas selections and answering questions. The cheese stuffed eggplant slices were so good, I asked for the recipe. The wait person went back to the...\n\n\nMore"], ["Tapas and Sangria", 4.0, "September 16, 2013", "cobmets8", "Falls Church, Virginia, United States", 75, 32, "A deal from Groupon brought me into Recess Tapas Lounge for the first time and the restaurant's follow-up deal will definitely bring me back for more. The Sangria was sweet and not too strong. The tapas was very good. We had two different shrimp dishes, lomo saltado, and mussels. The mussels were a little too spicy for my wife, but...\n\n\nMore"], ["Horrible Food and Service", 1.0, "August 26, 2013", "Joan K", "Washington DC, District of Columbia", 34, 24, "Went here on a weekday date. The food was nasty. We had several dishes, some of which arrived cold. We also had the lomo steak and it was almost all fat.\nThen when we requested our bill the waitress had calculated it wrong. After showing her the error and 30 minutes of her trying to correct it, the bill still...\n\n\nMore"], ["Look for the 727 in big letters on the building", 4.0, "August 18, 2013", "I_am_Lost_on_purpose", "Washington DC, District of Columbia", 31, 20, "I came here for a Friday night dinner with a friend. We had a Groupon and it was accepted without any issues. We decided that we would have two tapas each. The food was great. I had the Lomo steak and scallops. The food was enough for a dinner. I was very surprised as the generous portions. It was so...\n\n\nMore"], ["A Hideaway for Excellent Tapas and Sangria", 4.0, "August 12, 2013", "Jonathan R", "Washington, District of Columbia, United States", 196, 62, "Thanks to a Groupon that promised four tapas and bottomless sangria for just $29, my wife and I visited Recess last Friday at happy hour. While I've walked along this block many times, the restaurant isn't easy to spot, as it's below street level and the staircase is tucked into the side of a neighboring building's entrance. There are a...\n\n\nMore"], ["The best Venezuelan food in the town!", 5.0, "August 6, 2013", "Viajeroconbuengusto", "Washington DC, District of Columbia", 163, 37, "I'm from Venezuela, and I can certify this is the best Venezuelan food you can try in this city. The arepas,The cachapas, the tequenos are the best! The atmosphere is very nice and cozy. The service is very good. The first time I was there, the owner came to my table to ask if everything was ok. I really appreciate...\n\n\nMore"], ["Food fab, but gratuity ....", 4.0, "July 31, 2013", "Suzanne H", "Washington DC", 8, 2, "Food was excellent, we had calamari, chicken croquettes and spinach which was particularly good, as appetisers. Steak, talapia and crab cakes then a cake and ice cream dessert. The food was beautifully presented.\nThe staff were great, if anything a little too attentative.\nWe ate in the basement restaurant which was atmospheric with the red lighting, could have eaten on...\n\n\nMore"], ["Nice tapas/good visit", 4.0, "July 27, 2013", "Denise S", "Idaho Falls", 52, 29, "I love a good Tapas eatery and Recess will be added to my list for a revisit. The selection was good but I was disappointed that at 8pm, two of the dishes I was interested in were unavailable. Recess has a decent wine list, including a reasonable selection of \"by the glass\".\nThe ambiance is more like a bar, but...\n\n\nMore"], ["Great tapas - wonderful flavor!", 5.0, "July 19, 2013", "Jonathan H", null, 1, 0, "This was the best restaurant that my wife and I ate at while we were in DC for a week. My wife ordered the Paella and I ordered the lomo saltado. The plantains were excellent and the sangria was really good too. We will definitely eat there again when we return."], ["Serendipity", 4.0, "June 12, 2013", "abecedarius", "Salem, Massachusetts", 395, 132, "Three of us had just finished \"business cocktails\" at the famous restaurant down the street, but no tables were available there for dinner. So I turned to Yelp, found Recess, and boy, were we happy. The food was delicious, the service was good and the prices were a real bargain! For the record, I had the Salmon recess and mussels,...\n\n\nMore"], ["A pleasant surprise!", 5.0, "June 8, 2013", "BrandonPerdue", null, 13, 6, "My wife and I were visiting DC and were walking back from the National Mall to our hotel. We we hungry so we just started looking for anywhere to eat. We walked by and saw the outdoor seating at Recess. We ended up sitting inside, and loved the vibe. The food....wonderful! Really unique and the smaller portions allow you to...\n\n\nMore"], ["Happy Hour!", 4.0, "June 5, 2013", "Kristen N", "Los Angeles, California", 53, 36, "No complaints here! I've been twice recently during the week to enjoy drinks and a bite to eat both inside at the bar, and at its outdoor seating. Their happy hour specials include a short list of drinks for $5 (Sangria, martini, Black Snapper, etc) and $5 appetizers. The drinks and food I've tried have both been very good. The...\n\n\nMore"], ["Excellent Tapas with a twist", 5.0, "June 4, 2013", "Judith J", null, 16, 5, "We found this excellent place by chance. There was an outside eating area but we opted to eat inside which was in the basement of the building. The atmosphere was great and the staff were very helpful with their advice on the various options. The chef worked in Spain but has Cuban & Venezuelan influences so the food is spicier...\n\n\nMore"], ["Two is enough to make a meal", 5.0, "May 25, 2013", "Doug P", "San Antonio, Texas", 86, 12, "I was in DC for a business trip recently and wanted a place to eat close to the hotel. The entrance is below street level and it first seemed more like a night club than a restaurant. However, after trying the food, I can tell you they know how to cook!\nThe Lomo Saltado was excellent. A nice blend of...\n\n\nMore"], ["Great happy hour specials!", 5.0, "May 10, 2013", "dlp5", "Duluth, Minnesota", 88, 24, "We had excellent food & service! Our group of 6 Sampled a variety of tapas, enjoyed everything! Loved the plantains with avocado, the grilled spinach, and the sweet potato fries. Save room for dessert--highly recommend the tres leche cake with homemade cream and the banana bread pudding (very chocolatey)."], ["The tapas are great!!!", 5.0, "April 19, 2013", "BuffyMaryland", "Maryland", 63, 14, "I had a Groupon; it's close to a metro; my husband and I love tapas. So, what's not to like? I tried about half the tapas on the menu (far exceeding my Groupon) and really enjoyed everything. My only disappointment was the sauce that came with the calamari. It was a red tomato type sauce that added nothing to the...\n\n\nMore"], ["Tasty food", 4.0, "April 17, 2013", "EddiOZ", "Australia", 106, 112, "We just happened to walk past, and decided to give it a go. It is with some trepidation we descended the stairs as it feels like entering a dark night club. We were pleased other people were there, otherwise we may have left. It was difficult to read the menu as it is so dark inside, but thankfully we ordered...\n\n\nMore"], ["didn't enjoy the vibe inside, but the tapas were good", 4.0, "April 12, 2013", "jg325", "WashingtonDC", 489, 320, "My partner and I went to Recess Tapas Lounge because we had somewhat of a prix fixe menu that we got on Groupon. Overall, we felt that the food was pretty good but the vibe was a bit off.\nFirst, scheduling was kind of an issue because this place is not open on Sunday or Monday. If I were tourist...\n\n\nMore"], ["Had the tapas, looking forward to the party", 4.0, "April 8, 2013", "coreyhend", "Washington, DC", 7, 3, "Our group was attracted by, yes, a GROUPon to enjoy tapas and sangria. An absolutely fantastic atmosphere to enjoy smooth drinks and so much fun trying different Spanish and other foods with a Spanish twist. As with most Tapas places, you pay for the privelidge of lots of small bites, but this one is worth it!"], ["Excellent tapas but ridiculously priced drinks", 4.0, "March 30, 2013", "CAHA", "Dartmoor National Park, United Kingdom", 178, 85, "We thoroughly enjoyed our visit. The bar tender was excellent and helped us in choosing from a wide range of tasty dishes. We ate tapas style having a dish in between drinks and therein lies the problem - only imported beer, low quality imported beer at very high prices ($6 for a small bottle of Heineken !) other wise would...\n\n\nMore"], ["Nice find", 4.0, "February 26, 2013", "tikidream", "bethesda, md", 388, 110, "This restaurant is super convenient to my office, but even if it wasn't I'd still go! Food is good and prices are really good. Happy hour deals make this a much go to place. It is a bit out of the way on 15th St. near the White House and tucked under an office building- but the staff are pleasant...\n\n\nMore"], ["Good flavor combinations", 5.0, "February 24, 2013", "Billsfoodfinds", null, 15, 1, "We had heard it was nice, maybe a bit more for a younger group but four adults took the trip down stairs and we all were totally pleased with the food, atmosphere (a bit noisy but could easily talk without raising our voices), and wait staff (young yet helpful).To be honest we had better and more interesting tapas than other...\n\n\nMore"], ["Loved this place", 5.0, "January 5, 2013", "Ruth W", "Edinburgh", 89, 43, "We discovered Recess by accident and very much enjoyed the experience. My husband and I are from Scotland and often eat Spanish Tapas but this was a new concept for us. Larger portions with great flavors and artistic flair. We loved the steak au poivre and the excellent calamari with serious sangria. Our waitress was very attentive and we were...\n\n\nMore"], ["Quick service", 4.0, "December 29, 2012", "CarmelinaRose", "New Berlin, WI", 19, 3, "We went here on a Thursday night. It was fairly empty and consisted mosty of smalle groups of people and couples. Atmosphere was so-so, name at entrance is broken, there is a hole in the wall, people at the bar were getting louder, and it was a bit chilly. Food came extremely fast, which made me question how freshly made...\n\n\nMore"], ["Nice Tapas Bar... the the bassement", 4.0, "November 13, 2012", "chguy", "annandale, va", 48, 27, "Went there with a coupon to try it and did not regret it.\nOnce you take the plunge and go down the staircase you enter a relatively small but nice restaurant. The wait stuff is attentive and friendly providing efficient service. The menu list might be limited when compared to other similar venues; but everything we trying was well prepared...\n\n\nMore"], ["A nice surprise!", 5.0, "October 20, 2012", "KnickerbockerJones", "San Francisco, California", 92, 39, "I stopped here with my cousin after a depressing time at the holocaust museum. He picked it because it was down the street from the white house. It has a happy hour $5 special that includes house red and white wine, sangria and a cocktail drink. The fried calamari is also $5. I had a steak dish that was absolutely...\n\n\nMore"], ["First place I'll go when I return to DC", 5.0, "September 27, 2012", "cbmeier", "Fort Worth, Texas", 33, 19, "We happened upon it for a late lunch and the food was wonderful. We thought we'd only have a bite or two with iced tea to get out of the heat. We ended up having several x-tini's and many many tapas -- we couldn't decide which was best!!! All of it was very good. The team was very hospitable and...\n\n\nMore"], ["Ole!", 5.0, "September 22, 2012", "karen h", "Ipswich, United Kingdom", 90, 55, "Really enjoyed this tapas bar. Very friendly staff and the food was fab, good value as well .we were going to the local grill but came across this by chance, it's downstairs and has an advertising plaque outside there may also be a staff member who will show you downstairs, if not take the plunge and give it a go...\n\n\nMore"]]], ["Lime Fresh Mexican Grill", [["Fresh and Flavorful Mexican", 5.0, "August 18, 2015", "Joseph L", "Glen Allen, Virginia", 19, 5, "I ate lunch here on business and ordered the Lime Burrito with chicken and a raspberry iced tea. The D.C. Scene is pretty busy at lunchtime, so I had to find a place that served fresh food and was quick. This place hit the mark. The burrito was very flavorful, and came with endless tortilla chips. The chicken tasted like...\n\n\nMore"], ["Lime Mexican Grill", 5.0, "August 10, 2015", "Mark M", "Cedar Park, Texas", 14, 4, "I really liked this place. The food was incredible with very fast service. The salsa bar was very good. Interesting way of ordering. It is difficult to find as it is right on the edge of Chinatown in a small space but it very much worth the search."], ["Good Mexican Take-Out", 4.0, "February 26, 2015", "Meg M", "Minneapolis, Minnesota", 58, 20, "I was looking for take-out food close to my hotel and found this restaurant. The service was great - the cashier was very friendly and another employee offered me a sample. I got the bean burrito, which came with chips, was huge, very tasty and inexpensive. They also have a small dining area."], ["Just okay", 3.0, "February 14, 2015", "Holden20777", null, 396, 190, "Chicken burrito was nothing to write home about. The rice was pretty bad, and tasted as if it was brought back to life from the dead.\nDo not recommend."], ["Very fast & fresh", 4.0, "September 29, 2014", "MomME50", "Maine", 120, 55, "Needed a quick & easy meal late one afternoon after a full day of activities. Great location right by a major metro stop, super-fast & friendly service, really tasty food very reasonably priced. More variety on the menu than the national Mexican fast food chains, and the salsa bar makes it easy to personalize things, mix and match, etc. Very...\n\n\nMore"], ["Wet & chilli", 4.0, "July 8, 2014", "Michael P", "Edinburgh, United Kingdom", 26, 11, "We were soaked after a Washington downpour & hungry after a day at the Smithsonian, someone recommended this place so it was a destination. 4 diners.\nNothing unexpected here but the food was quick to arrive, tasted good and was reasonably priced. The chef came over to see how we were and all was well. I would eat here again."], ["Cheap and cheerful", 4.0, "May 29, 2014", "Chymeera", "London, United Kingdom", 6, 3, "Quick and easy with good portions. By that stage we were too tired to try and find something a little less chain like."], ["Great, quick meal before heading to the Verizon Centre", 5.0, "February 24, 2014", "MFC31", "London, United Kingdom", 335, 134, "On our way to watch the Ice Hockey at the Verizon Centre, we stopped off here for dinner. I'm always up for Mexican and his place didn't disappoint!\nFresh ingredients, great staff, amd an ideal location make this a brilliant option before the game, just get there early!\nThere really isn't anything thing else to say about Lime, if you...\n\n\nMore"], ["Good alternative", 4.0, "December 11, 2013", "GoodFood88", "Washington DC, District of Columbia", 594, 253, "Lime is more than the typical burrito place. The good is fresh and has many options, not just burritos. They have quesedillas and tacos as well as desserts. The 7th street burrito is good, with bacon and a slight char on the outisde of the tortilla from the panini press. Overall it is very good and a good alternative to...\n\n\nMore"], ["Cheap and Cheerful", 3.0, "November 22, 2013", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "The location is great in this place, right off from the Metro station, in the same building as Target and Washington Sport Club. I have never been to this place until Tuesday night. I went to chip in for a fund raising event for a Guatemala orphanage. The place is larger than I expected. It has a back room where...\n\n\nMore"], ["Happy hour!", 4.0, "September 5, 2013", "Mike H", "Bonner Springs, Kansas, United States", 42, 13, "Happy hour tacos $2 and a margarita for $3.\nTacos were okay, but hey I paid $2 for them.\nThey have a salsa bar with about 8 different salsas. They are lacking a hot salsa however.\nManager was busy talking to a table of his friends the whole time I was here. His employees had to keep interrupting him for...\n\n\nMore"], ["First Thoughts", 5.0, "September 5, 2013", "brandonoursler", "Nashville, Tennessee", 68, 26, "This was my first time at this restaurant and I really enjoyed it. They have so many different kinds of sauces. Service is great and go out of your way, especially if they're not busy, to make sure everything is great. I'll definitely be going back whenever I'm in the area."], ["The best in Mexican food in the city", 4.0, "August 16, 2013", "Viajeroconbuengusto", "Washington DC, District of Columbia", 163, 37, "The food is very good!!! I love they have a big table with different kind of sauces. They have also good promotions during the week. The service is good, the baths are clean (despite the crowdy place where is located) the prices very reasonable, the atmosphere is nice as well. And I love the system they have, you order and...\n\n\nMore"], ["Not Wowed", 3.0, "May 3, 2013", "Michelle L", "Sumter, South Carolina", 10, 9, "The food here was good, but not great. The cashier lacked personality. If I am ever in DC again, not a place I would return to."], ["One of the best burritos that I can recall..", 4.0, "January 27, 2013", "JoyceInDC", "Washington DC, District of Columbia", 196, 54, "I just had at Lime Fresh Mexican Grill today. Noticed it opening sometime before the holidays, and finally decided to drop in. Lots of choices - incl. vegetarian. Decided on a '8th Street Burrito' with chicken. Man....was that good!!! Adding a little something from the salsa bar (chopped cilantro, pico de gallo, lime wedges), a choice of hot sauces (I...\n\n\nMore"], ["Great Fajitas", 4.0, "November 16, 2012", "Les F", "Boylston, Massachusetts", 300, 112, "The food is good here with low prices but the music is loud and the service at your table is limited. This restaurant is basically carry out but you can order at the counter and eat at a table. Atmosphere is ok but the music is loud. Basically a lunch place where you get the food fast. The pre-mixed marguaritas...\n\n\nMore"], ["What great Mexican fast food", 5.0, "October 12, 2012", "flacachula", "Brussels, Belgium", 94, 28, "Great food, great service and great place to eat or to go. Try the salsa bar wow everything is fresh and all types is salsa to choose from"]]], ["Harry's Pub", [["Harry's Pub - Washington, DC (Delicious Salmon)", 5.0, "October 3, 2015", "Ben B", "Hackensack, New Jersey", 54, 15, "Excellent and delicious healthy food choices can be found at Harry's Pub in Washington, DC. My wife and I enjoyed grilled salmon that tasted very good!"], ["Delicious", 5.0, "September 12, 2015", "LGSH", "Iowa City, Iowa", 34, 7, "First night in DC and decided to stay in hotel for dinner. Not disappointed. I had salmon entree and husband had crab cake sandwich. We were both very pleased with our dinner."], ["Ok", 4.0, "September 10, 2015", "Rachel J", "Illinois", 129, 33, "I stopped here out of convenience. It was in the hotel and it was late. I had the burger and just say ok. It was a little tough. The service was friendly but pretty slow. Don't be in a hurry."], ["Nice hotel lunch", 4.0, "September 2, 2015", "cb628", "Vero Beach, Florida", 264, 86, "Being in a hotel, you expect the prices to be a bit higher. The food was very good. The crab cake sandwich was quite good with more crab than I anticipated. The rueben sandwich was delicious and filling. Fries were good. Service was very good during a busy lunch."], ["Great food!", 5.0, "September 1, 2015", "Susan Susie J", "Atlanta, Georgia", 17, 4, "Inside the Wardman Marriott. Pricey but good food. Ate there twice and recommend it. Large groups were accommodated well and I recommend the salmon."], ["Ok hotel lobby restaurant.", 4.0, "August 17, 2015", "maryCincinnati", "cincinnati", 122, 196, "The service was excellent, pretty good food, décor typical for a bar/restaurant. I think the price is high but most hotel food is overpriced. We had the crab cakes which were good."], ["It was ok", 2.0, "August 1, 2015", "Jack O", "Helena, Montana", 46, 16, "I read the reviews so I decided to stop in. It was just ok. The burger wasn't that good, just average. The fries were good, however. Crispy on the outside, and soft on the inside. Mother service was just average, too."], ["Dine at Harry's!", 4.0, "July 31, 2015", "luvs2travelOttawa", "Ottawa", 12, 27, "The food was good pub fare reasonably priced. The wait staff were very pleasant and efficient. The service was fast and I thought that meant sloppy preparation but not so. I enjoyed a great salmon dish cooked perfectly, and great fish and chips another night."], ["Fantastic!!", 5.0, "July 28, 2015", "Newlovenewlife2012", null, 346, 70, "We are here because it was close (we were staying at the Mariott) and decently reviewed. So glad we did. My husband enjoyed the chicken wrap and I the cheeseburger (no bun).\nThe service? Excellent!\nThe menu of beverages? Excellent!\nThe taste? Amazing!\nThe only things we missed were the Cholula and Portland ketchup.\nNot bad!"], ["Good food", 4.0, "July 27, 2015", "Amanda C", "Bismarck, North Dakota", 18, 7, "Located in the Marriot Wardman hotel, so very convenient location!! Both the fried chicken Cesar wrap & the steak were good. Service was a bit slow, but very friendly!"], ["Crabs! (the good kind)", 5.0, "July 3, 2015", "Marg050", "Oakland, California", 75, 52, "I ate here during my stay at the Marriott Wardman Park and was surprised by the service and the quality of the food. I had crab soup which was delicious - great texture, lots of crab pieces and just enough spice to make it interesting. My friend had a burger and said it was good.\nService was particularly good. It...\n\n\nMore"], ["Surprisingly good", 5.0, "June 13, 2015", "Mkerer", null, 4, 0, "I was on a business trip to Washington DC and grabbed a quick bite for dinner in Harry's Pub in the Marriott Wardman Park. I sat at the bar and I ordered the Ahi tuna appetizer and a half spinach salad. The food was fresh and surprisingly tasty for a hotel restaurant. The bartender was attentive and shared the history...\n\n\nMore"], ["Great Bartenders!", 3.0, "May 19, 2015", "Jamie D", null, 71, 7, "Food is limited, but very good. They have a crab cake burger that is very good. The salmon is also a nice serving for the price! They have entertainment on weekends."], ["Good food", 5.0, "March 26, 2015", "happy1234", "Lititz, PA", 18, 20, "They cater to allergies, I have a gluten allergy and my friend has a latex allergy. Talked to chief and he understood"], ["St Paddy's Day Traditional Fare", 3.0, "March 20, 2015", "Dedi S", "Portland, Oregon", 95, 44, "We popped in to a lively seen with lots of active conversation. The pub is on the noisy side. We were seated immediately and a high chair delivered promptly for the 2 year old in tow. Because it was St Patrick's Day we opted for the traditional Corned Beef and Cabbage offered as the special. The cabbage was excellent, but...\n\n\nMore"], ["eatrery", 3.0, "March 4, 2015", "JoEllyn D", "Loveland, Ohio", 45, 5, "Had dinner first nite at hotel. Hamburger overdone. Loved tomatoe/cucumber salad. Crab cake was tooo spicy. Fries were good. Serving sizes were enough to share."], ["No different than the others", 3.0, "February 28, 2015", "Sunshine4RL", "Houma, LA", 30, 7, "This location is no different than the other two eateries in the hotel. By bypass this pub, for a grill."], ["Just Okay", 3.0, "February 17, 2015", "LeeAnn1641", "New York", 74, 29, "Had burgers at Harry's which weren't prepared right but tasted okay. Staff seemed overwhelmed as there were conferences going on and families staying for a volleyball tournament. One large group we were with asked for separate checks and had to wait an hour to get them. I would try one of the restaurants on Connecticut avenue."], ["late night is a great night", 4.0, "November 19, 2014", "Ed Z", "Lincoln Park, Michigan", 41, 32, "Harry's Pub is perfect for a late-night dinner and drink. The staff respects privacy and intimacy, remaining ever-present to provide quick and efficient service for food that is much better than local pub grub. Fills the void in the stomach after interminable political dinners on the rubber surf and turf circuit. Alcides and his associates on hand treat patrons like...\n\n\nMore"], ["Very nice!", 4.0, "November 14, 2014", "NanComm", "Allegan Michigan", 55, 36, "I was a single diner for dinner and treated very well both by the hostess and my waiter. The food was excellent and nicely presented. Service attentive, but not intrusive."], ["Nice Gastropub", 4.0, "November 6, 2014", "FrequentTraveler1225", "Gainesville, Virginia", 139, 57, "Good Burgers, a variety of beers on tap and in bottles. They have both some local and nationally known beers on tap including some IPAs. Plenty of bar space and tables to accommodate. I had the Mushroom Swiss burger which was better than average."], ["Delicious food!!!", 5.0, "October 27, 2014", "Jacqui K", "Atlantic City, New Jersey", 10, 4, "We stopped at the restaurant when we returned to the hotel at 11:30 and Harry's was still serving food. We were pleasantly surprised by the food!"], ["Nice pub, go on in", 5.0, "October 8, 2014", "fiamit20", "South Bound Brook, New Jersey", 11, 2, "the staff was friendly and quick. The food was great and the prices were even better.The draft beer list was plentiful."], ["GREAT SERVICE & GREAT FOOD - Harry's Pub", 5.0, "October 1, 2014", "Don C", null, 1, 0, "October 1 - having come to the hotel on a last minute business event, I and an associate had the pleasure of dining at Harry's Pub shortly after 7:45 pm - we had been at work earlier in the day in NJ and then drove down. Feeling hungary and tired, we decided to give Harry's Pub a go.\nOur server,...\n\n\nMore"], ["Have a drink and go", 3.0, "September 17, 2014", "Panos T", "Karlsruhe, Germany", 32, 14, "A little bit overpriced, the beer was ok. Parking there is difficult, we were on foot going down the street and stopped by. The personal and the service were ok. I went there as it was on my way, nothing special."], ["Crowded and over priced, too loud", 2.0, "September 14, 2014", "ImLucyRichardo", "Saint Paul, Minnesota", 137, 48, "This little pub is in a convention hosting hotel. Parking will cost you $15. Drinks are over priced and no eats the food they just want a drink and get out.\nI don't recommend this location."], ["Wonderful Crab", 5.0, "September 9, 2014", "Diane84647", "Ephraim, Utah", 43, 20, "I had the crab soup and crab cake. The soup was filled with fresh veggies and crab. It was seasoned perfectly. The crab cake was delicious and flavorful. The entree came with cole slaw and a tomato/cucumber salad. Wonderful. The restaurant was busy, but not too noisy. The service was attentive and impeccable."], ["Average hotel fare", 3.0, "August 12, 2014", "robstefanik", "Swampscott, Massachusetts", 43, 27, "Standard Caesar salad; standard hotel price, which means a bit pricey for what you get. Chili was just ok - finely ground beef was used, which made me question whether or not it was made in-house."], ["Crowded and overpriced", 3.0, "July 27, 2014", "Funmom123", "Atlanta, Georgia", 51, 26, "Chaotic, which may be due to large crowd/convention the hotel was hosting. Classic American food - salads, burgers, wings. Food was okay. Overpriced."], ["Open Late", 5.0, "June 17, 2014", "Jay G", "Jacksonville, Florida", 57, 30, "I was staying at the Marriott Hotel and got hungry late at night on 06/10, after room service has ended. This spot was one of the two which were still open within the hotel. The bar was full but not that many customers were sitting in the dinning room areas. I ordered my food and Pelligrino water. The waitress and...\n\n\nMore"], ["Avoid", 1.0, "June 12, 2014", "e2trainer", "Glasgow, United Kingdom", 31, 54, "Firstly the service was shocking hardly a smile when asked if we could eat. The order was wrong and half of the items were forgotten. The food was unappetising poorly presented and tasted bad. There are plenty of good places around here so don't go here."], ["Very good dinner, enough to share", 4.0, "June 3, 2014", "28412traveler", "Wilmington, North Carolina", 113, 23, "My friend and I ordered the grilled pork chops(2), mashed potatoes and steamed vegetables and house salad. We chose to split the meal, since neither of us was very hungry. They split the servings, with each having our own plate and honestly, it was a gracious plenty. The waiter was very attentive, checking on us to refresh beverages. I saw...\n\n\nMore"], ["Liked it", 4.0, "May 28, 2014", "LauraAHA", null, 99, 30, "We visited the bar a couple of times during our stay at the Marriott Wardman Park. The bartenders were friendly and entertaining. They offered cheerful information in response to our questions, with bits of history of the hotel and some of its famous visitors as well as directions to a local Ethiopian restaurant and recommendations for must-see DC sites."], ["Cold Stella Artois, Calamari and People Watching", 5.0, "May 21, 2014", "Bob C", "Fitchburg, Wisconsin", 61, 21, "Fun pub.... the calamari was excellent and of course the beer was cold. It's a great place to relax outside and watch the world go by."], ["Food is okay", 3.0, "May 7, 2014", "Shanola", "California", 33, 22, "The food is okay, its hotel food. Service is great as are the drinks. Nice place for a drink to unwind but there are better places in the area to eat."], ["Poor service and average food", 2.0, "April 29, 2014", "DexSig", "Boston, Massachusetts", 16, 37, "My family and I were guests at the Marriott that this place is attached to. We decided to try it out for dinner since it was on site. Our server was, while very nice - was very slow. Our son decided late on what to have, and she 'forgot' to put his order in. By the time we got her...\n\n\nMore"], ["Strong Drinks", 4.0, "April 17, 2014", "Lana P", "KANSAS", 34, 36, "I was in meetings in the hotel conference center. My Husband stopped in for drinks while he was waiting on me to get out of my sessions. They were expensive but STRONG. The wait staff was friendly and kept the nut bowl full and fresh."], ["A nice find", 4.0, "April 15, 2014", "RockyRaccoon", "Atlanta, GA", 145, 72, "Offers outdoor seating and even they also remove the windows to allow a breeze for the inside. A bar inside that has the right feel. Food was good. Wait staff was extremely friendly."], ["Nothing special", 3.0, "April 2, 2014", "kellyo1126", "Denver, Colorado", 32, 20, "Your typical, run of the mill hotel pub. Expensive drinks. Food was mediocre; neither good nor bad. Service was decent sitting at the bar, but it wasn't too crowded."], ["loud", 3.0, "March 30, 2014", "Travelgo68", "West Palm Beach, Florida", 44, 42, "had spaghetti/meatballs....nothing to write home about. they bring popcorn to the table. very, very loud restaurant."], ["Charged a random $100", 1.0, "March 15, 2014", "MattG138", null, 6, 7, "Called the company and they indicated they couldn't find the \"random\" $100 charge. They insisted I file with my bank - they keep the fraud as the bank isn't going to send out the dragnet for that amount. Pay cash at this dump or beware. Had both receipts for a total of $48 yet there was a random straight $100...\n\n\nMore"], ["Very good for single dining experience.", 4.0, "March 8, 2014", "baglady061", "Pittsfield,MA", 63, 30, "Recently stayed in this hotel for 7 days/6 nights while attending a convention and ate in this charming pub for four of those dinners. As I was alone, I wanted to stay in the hotel for dinner. I found the food tasty and not overpriced given hotel and tourist standards. The salad portions were especially generous. Since I was alone...\n\n\nMore"], ["Excellent Service and Dinner", 5.0, "March 5, 2014", "TanyaJ101", null, 17, 5, "I ate at Harry's while I was in DC because I was wanting to stay close to the hotel and why not!\nI had an excellent dinner for half the price I paid for my dinner the previous evening. The food and service were by far superior to my previous dining experience!\nI will definitely return!!!"], ["Really good burger", 4.0, "March 2, 2014", "casadeboys", "Hong Kong", 100, 58, "Loved the burger, cooked medium rare to order, and extra crispy fries! Much better than expected from a conference hotel. Service was polite and speedy."], ["Walk to Murphys it is worth it.", 3.0, "February 17, 2014", "Jon C", "Yorktown, Virginia, United States", 185, 55, "Had lunch here and it was ok at best. Did not have fish and chips. Hamburger was ok but way over priced. Beer is even more overpriced. Staff was very friendly and service was good but not worth a repeat visit. Being in the hotel allows for the high prices I guess but a 3 minute walk is worth the...\n\n\nMore"], ["Great Atmosphere!", 5.0, "February 7, 2014", "Sweetlife9", null, 5, 8, "LOVED the Mac & Cheese! This is a great Irish Pub. There was a guy playing live music when we were there. The food and music was all excellent. We will go back when we are in DC again."], ["A good spot for a quick drink.", 5.0, "January 20, 2014", "nycbookwriter", "New York City, New York", 91, 38, "This is a great place for a quick drink or a spot of tea on a cold day (like that Arctic Vortex when I was there). It's inside the Marriott, so its a quick place if you are staying there.\nFood: regular American fare."], ["Mediocre service, boring menu", 2.0, "November 24, 2013", "R-LKirch", "Lafayette, Indiana", 14, 7, "My title says it all. I ate here during a conference at the Marriott and didn't care for the service or the food. I had a crab soup that was overly salty and hummus that tasted like it came out of a can. Don't bother with this place. It looks charming, but the food is of poor quality."], ["Average food and over priced", 3.0, "November 10, 2013", "Deborah W", "Tampa, Florida", 50, 23, "This is very convenient if you are staying in the hotel and are tired after a long conference day. The food is OK, nothing really great. The prices are very high. I paid $12 for a glass of wine that goes for $8 in the local stores. The wait staff was very attentive and funny but the hostess really acted...\n\n\nMore"], ["Good Food and Atmosphere", 4.0, "November 7, 2013", "Lesley M", "Beverly, Massachusetts", 32, 3, "The staff were very friendly. It was nice to find a basic \"bar\" in the center of Washington. We sat at the bar. The staff made us feel as if we were regulars. The food was excellent. Prices were good especially on drinks during happy hour."], ["Average food.", 3.0, "October 12, 2013", "micstebou", "Fargo, North Dakota", 207, 43, "If eating in the hotel, try Stones Throw instead. Very limited beer selections here. Food average. Quiet and good service."], ["Harry Kari", 2.0, "August 21, 2013", "DuncanMcShafty", "Birmingham, United Kingdom", 14, 14, "Caught mid-downpour, we spotted Harry's and gratefully ducked inside. With hindsight, we should have stayed outside and got drenched.\nBilling itself as a 'family restaurant', it clearly operates on the assumption that many of its customers will only visit once, in order to keep the kids happy with child-friendly fare. Consequently the food is shovelled out to the masses, with...\n\n\nMore"], ["Convenient if it's raining", 3.0, "July 30, 2013", "Kelly C", "Madison, Alabama", 10, 2, "Harry's service was good and fed me well when it was raining. In my opinion, it was a bit overpriced and the food was not exceptional. It's nice for hotel food, but I ventured out once I had the chance!"], ["Servers fighting, wrong food, wrong drinks", 1.0, "July 29, 2013", "lizzytish2002", "allentown, pa", 15, 21, "Horrible service, decent food, servers were fighting with each other in front of customers. Our waitress didn't check on us at all and only had 1 drink (besides waters) to get and she totally messed that up. They delivered the wrong food to us at first but fixed it quickly."], ["Harry's handles it", 4.0, "July 26, 2013", "MrAllan54", "Providence, Rhode Island", 53, 27, "The pub is thankfully opened late. After arriving late we were able to get a good meal (excellent braised short ribs). The waiter was a bit fuddled and the host AWOL. But the waiter made an extra effort to redeem and did. Drinks were average and prices were hotel priced and consistent with dc."], ["Mixed feelings", 3.0, "July 17, 2013", "Louise S", "Brentwood, Tennessee", 16, 7, "My friends and I had lunch here and had fantastic food and great service! On another night, a groups of 5 went for dinner. There was no one at the hostess stand for at least 10 minutes. After we were seated the server was not friendly and made us feel we were an inconvenience! We asked for separate checks at...\n\n\nMore"], ["Good food!", 4.0, "July 11, 2013", "Deborah I", "Bridgeton, New Jersey", 48, 14, "Good service....food was delivered quickly, even during busy times. Prices are high compared to area restaurants, but the convenience of not having to leave hotel is almost worth it."], ["Food was good but pricey", 3.0, "July 7, 2013", "LPAMIKE", "Jonesboro", 195, 38, "Food was good but pricey. Great location and a great place to hang out. Food was over priced but my wife highly recommends the salmon patty sandwich. Once again, $4 for a soda."], ["Prices weren't too bad but the food wasn't too good.", 3.0, "June 27, 2013", "TourSamanaWithTerry", "Santa Barbara de Samana, Dominican Republic", 79, 35, "Service was so so as the waiter was a little abrupt. The draft beer was warm, which right away will get you a 1 star drop from me. If you can't keep the beer cold, then what are you really doing? The appetizers that we ordered weren't really that great. The buffalo wings were super fried with a side of...\n\n\nMore"], ["Cozy", 5.0, "June 18, 2013", "charellen", "Virginia", 29, 33, "Just had a burger and fries, but they were great. Good beer selection, and you can watch your sports too."], ["Good meal at fair price", 4.0, "June 16, 2013", "ExperiencedTravelers", "Los Angeles, California", 203, 201, "We ordered a pulled bbq beef sandwich which was excellent and a Mac 'n Cheese off of the kids menu, which was also very good. For a bar the food was good and mostly locals, not tourists, which is always a good sign."], ["Worst Service", 1.0, "May 30, 2013", "RichardLBrown", "Sarasota, Florida", 103, 31, "Cannot tell you about the food because we did not get that far. After securing a seat we waited ten minutes before getting up to seek a waiter who said something off-putting. He finally brought some water and literally threw menus on the table. Another ten minutes... and we asked another waiter if she could help find our waiter as...\n\n\nMore"]]], ["Triple B Fresh", [["Loved it!", 5.0, "September 14, 2015", "Kuhoots", null, 19, 9, "I haven't been able to find a Korean place that served Kim Bap. They do. It's a Sushi wrap with beef and it's wonderful!! I'm so glad we found this place."], ["Great Korean Casual Foods", 4.0, "August 9, 2015", "LifeTObe", "Belfast, Maine", 5, 4, "It is a great Korean casual (boon sik) restaurant. Their prices are a little bit pricey, but their tasty foods compensate it! Don't forget their nutritious drinks (misutgaru). They are nice and cold slush."], ["Not so special :)", 3.0, "July 29, 2015", "Prabu D", "Colombo, Sri Lanka", 67, 22, "Maybe I ordered the wrong thing, but it was not so good. I was hungry and didn't enjoy the food. It was recommended by a friend and I was not impressed. They did have great selection of Korean food, but the option I had (Chicken and steamed rice) wasn't that special :)"], ["Good choice for a quick take out bibimbap!", 4.0, "March 25, 2015", "Decoamie", "Washington, DC", 282, 136, "I love this choice for take-out at Dupont Circle! The main offering is bibimbap, with four different choices for rice as a base. There's a very good selection of veggies and four come with the standard bowl, plus a protein. There are also some Korean snack foods, though I haven't tried them. This is mainly a take out place since...\n\n\nMore"], ["Great fast-food", 4.0, "December 9, 2014", "TheAdventuresofET", "Washington DC, District of Columbia", 25, 36, "This is like a Korean style chipotle (fusion bimbimbap). Not sure if it's spicy? Ask to have a taste test. Servers are stingy with the servings.\nGet the bowl. The wrap / sushi style is not that good."], ["Great choice for Korean Bibimbap at busy Dupont Circle", 4.0, "December 7, 2014", "Decoamie", "Washington, DC", 282, 136, "I stumbled upon this bibimbap place just a stone's throw from Dupont Circle itself and am very glad I did. There are a number of quick and healthy choices within a block or two of the circle, but this place just took my top spot for a very quick and healthy option for lunch or dinner. The formula is by...\n\n\nMore"], ["Delicious bimibapish (and healthy!)", 4.0, "October 1, 2014", "Cambridge2014", "Cambridge, United Kingdom", 137, 56, "This place is a little hidden (opposite the Dupont circle hotel next to Willie T's) - I wouldn't have found it except I've been staying at the hotel. Since seeing it, I have been wanting to try this. The outdoor seating usually has asians sitting eating. It's like a Chipotle for bimibap. The staff are friendly, very patient (as you...\n\n\nMore"], ["Great Bibimbap!", 5.0, "August 4, 2014", "Mll162014", "Washington DC, District of Columbia", 1, 2, "Awesome restaurant. Had the classic Bibimbap, which was really good. You can also make your own, which is nice (you pick your rice, protein, and vegetables). I was impressed with their choices of protein, which includ bulgogi, spicy pork, spicy chicken, and tofu. Furthermore, bibimbap bowls are less than 10 dollars! For the price, its hard to find a better...\n\n\nMore"], ["Fresh veggies, tasty proteins!", 5.0, "July 13, 2014", "TakinItEasyinIowa", "Ames, IA", 19, 24, "We found this place on yelp near our Dupont hotel. It was a short walk away and perfect for a rainy evening. I got the bibambap and my husband got the protein bowl. The ingredients were fresh and delicious and the manager?/owner? was very helpful and friendly. It's a little place, but on nice days you can sit outside. It's...\n\n\nMore"], ["Amazing rolls and bowls!!", 4.0, "June 3, 2014", "DuniyaGolHai", "Mumbai", 21, 27, "Between two of us, we had the pan fried dumplings, veggie bowl and veggie roll.\nThe veggie bowl was sumptuous, and the brown rice + black rice was delicious.\nThe veggie rolls were one of the best I have had! I will definitely go back for it.\nJust one thing though, i had initially ordered kimchi roll after checking with...\n\n\nMore"], ["Delicious + cheap = my favorite lunch place in Dupont!", 5.0, "May 28, 2014", "ew36", "USA", 10, 6, "I love this place -- it's by far my favorite lunch spot around Dupont Circle, which says a lot since there are a ton of restaurants nearby! The bimbap is tasty, filling, and fresh (and cheap!), and I like that the spicy sauce is on the side so you can spice it up (or not) to fit your own tastes....\n\n\nMore"], ["Satisfying Korean food!", 5.0, "April 15, 2014", "Cuzzzz", "Closter, New Jersey", 17, 11, "We were visiting from New Jersey and my inlaws who just came from Korea was craving Korean food. I was a little hesitant since the name of the restaurant sounded more like a 80's rapper. I didn't know that they specialized in bibimbap aka triple B! Anyways my kids loved the ramen, the kimbap was freshly made and rolled when...\n\n\nMore"], ["Great Korean Spot", 4.0, "January 5, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "This place has been opened since July 2013, I just never got round to try it out. I am a big fan of Bibimbap. Finally got there last night. It is right next to Kramerbooks. It actually has a patio outside on the street level, so summer would be nice. Down the stairs is the small restro. It is a...\n\n\nMore"]]], ["McDonald's", [["Wonderful value, delicious French Fries", 5.0, "September 8, 2015", "MJS1944", null, 94, 55, "This McDonald's is very usefully located - just where Wisconsin Ave NW DC and Van Ness Street cross. A US Post Office right by. Good parking.\nThe McDonald's team behind the counter were getting on well together, gave me a pleasant feeling from the start. Spacious sitting area. Basic burger implausibly cheap - but then I splashed out on those...\n\n\nMore"], ["5 stars restaurant!", 5.0, "February 19, 2015", "Yoshca P", "Washington DC, District of Columbia", 2, 1, "This is the best McDonald's I've ever been in DC, crew is very polite, restaurant is very neat, music is perfect! Very pleased with the service. Keep up the good work fellows!"]]], ["Soupergirl", [["Healthy and nourishing for weary tourists", 5.0, "July 6, 2015", "Chava R", "South Milwaukee, Wisconsin", 4, 1, "So delicious! Even my husband the meat eater loved the soup. Would have loved a place to sit down as well but we just took our food back to our hotel room."], ["Great variety; good health info available", 4.0, "May 19, 2015", "cmonkeydog", "Takoma Park, Maryland", 55, 18, "Soupergirl isn't that easy for those who live far enough to need to drive; parking can be unpredictable in that area. However, if you're just getting off the Metro, you can pop in and grab something for dinner or stock up for future meals. The 2 or 3 times that I've visited, they've had plenty of options of both hot...\n\n\nMore"], ["Wonderful soups!", 5.0, "April 21, 2015", "Randall C", "Takoma Park, Maryland", 34, 18, "There is an eat in area but we did take out for lunch We had a black bean soup which was excellent. The service was fast and friendly."], ["Healthy and delicious!", 5.0, "November 5, 2014", "Fred G", "Chapel Hill, North Carolina, USA", 68, 24, "I love this place - you can find fresh, local, healthy and tasty soups for a very fair price. I try to stock up on soups when I come here. I'd highly recommend checking them out!"], ["gazpacho", 4.0, "July 11, 2014", "Faith C", null, 26, 11, "nice place, all the soups looked great and you could try a few (hot!) for free before you buy. I picked a gazpacho, my first time having it. It tasted really fresh and flavoursome -but it was my first time having cold soup and I guess it's not really my kind of thing! But I'm sure it would have been...\n\n\nMore"], ["Fresh, full of flavor, and healthy.", 5.0, "June 27, 2014", "Cece R", "Marfa, Texas", 6, 6, "To say that I'm a picky, very discriminating eater…is an understatement. I have high standards, and if the food in front of me doesn't measure up, I don't eat it. Someone gave me a gift certificate to Soupergirl, and because I don't like soup, and I live about 20 minutes away, I used it grudgingly. I made one trip and...\n\n\nMore"], ["Not special enough for a special trip.", 3.0, "June 7, 2014", "barymad", "bethesda, md.", 262, 65, "I tried the new Soupergirl location on the second floor of a townhouse on M Street NW. I found the soup selection full of over engineered concoctions and lacking the comfort food choices one would expect from a business that just serves soup. My soup was uninspired and lacked character. Priced a little high for the portion size. I will...\n\n\nMore"], ["Supergood", 5.0, "May 13, 2014", "10027", "New York City, New York", 97, 140, "Really good food in a casual lunch and takeout place. A rotating menu of salads, soups, breads now open on M between 18th and 19th. Had a spicy kale salad today with Turkish lentil soup. A truly perfect lunch at a great price."], ["Cheap, cheerful and kosher", 4.0, "January 3, 2014", "BerkoBoy88", "North of London", 207, 103, "As its title suggests in is a supplier of home made soups, eat in or take out. If it grows in the ground or on a tree they will probably turn it into a soup. It is strictly kosher and vegan as well. So meat or dairy available. Most of the soups were new to my wife and I but...\n\n\nMore"]]], ["Room 11", [["Cute neighborhood spot on 11th St NW", 4.0, "September 19, 2015", "JT M", "Washington DC, District of Columbia", 158, 53, "This popular neighborhood spot on 11th St NW has good food and a large outdoor patio. The restaurant space inside is quite small with tight, cramped seating. Not a place for private conversation. I had risotto with mushrooms and squash. Long green and purple beans w mint, cashews and shallots. And chocolate beignets for dessert. Arrive early on weekends as...\n\n\nMore"], ["Delicious food and great cocktails", 5.0, "September 18, 2015", "Jono222", "Brisbane, Australia", 23, 11, "What can you say about a place that is packed on a wednesday night, they mare doing something right."], ["Love your cocktails - sit at the bar and watch the action", 4.0, "August 24, 2015", "Heather550", "Toronto, Canada", 35, 13, "Great drinks by super informative mixologists. Sit at the bar and learn so much. Lots of tinctures and bitters being put to good use. There is talk of a hipster vibe in some reviews - don't really know what that means but I know I am 50+ and felt totally comfortable."], ["Friendly for All, Including your Dog", 5.0, "July 26, 2015", "Travelerplusmom", "Virginia, United States", 30, 10, "This place may be small in size, but large on tasty and quality food. Room 11 is a favorite place of our vegetarian daughter and after one visit, we understand why. Their risotto rice was extremely flavorful and cooked to perfection. Their asparagus side is an exceptionally large portion suitable for sharing and the taste is as impressive as the...\n\n\nMore"], ["Grilled cheese sandwich", 3.0, "July 18, 2015", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "There are just a few seats indoors. Although, the patio area is larger.\nWe had the grilled asparagus omelette with mozzarella and the grilled cheese sandwich. The omelette was ok, nothing to write home about. But the grilled cheese sandwich was terrific ****. It comes with a delicious marinara dip sauce and salad.\nThe lady at the bar gave us...\n\n\nMore"], ["Nice spot, but a bit too small.", 4.0, "July 5, 2015", "Ashley C", "Montgomery, Alabama", 16, 5, "My husband and I were in the city for the night and met friends here for drinks. With a party of five, it was difficult to find a table that would accommodate our group (since the rain made the patio an unviable option). We ordered drinks and tucked ourselves against the window on two barstools for a while, but it...\n\n\nMore"], ["Great service, but the biscuit was dry dry dry, need to be improved.", 3.0, "June 7, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Have not been back here for a while, decided ot come for Sunday breakfast, it opens at 8 am, a bit later than The Coupe not far away. I like the brunch where you can have a smaller poriton. \"Build your own Biscuit' is the s tar item, and that is where the problem is. The concept is great, but...\n\n\nMore"], ["Nice Hangout For Drinks With Friends", 3.0, "April 7, 2015", "MJS2013", "Salt Lake City, Utah", 68, 19, "Unexpected friends needed a bite to eat and drinks too. Room 11 was perfect. An outdoors patio, friendly service and cool other guests provided a relaxed atmosphere. Can't say much about the food as we didn't eat (salad and olives), the drinks could have been a bit stronger.\nA nice place to hang for an evening."], ["Sweet spot", 4.0, "February 18, 2015", "ChefAsYouLikeIt", "Washington DC, District of Columbia", 14, 3, "We enjoyed everything at this charming neighborhood bakery/bar/restaurant. The bartender came out to our table and concocted a personalized alcohol-free beverage for one us, but he is famous for his magical bitters-infused beverages. Relaxing atmosphere, wonderful staff, good food and hip, cosy bar."], ["Great Portions", 5.0, "January 20, 2015", "MobileMorrisons", "Dallas, Texas", 24, 8, "My husband and I went to Room 11 for brunch while visiting DC. My husband got the root vegetable hash and I got the corned beef at the waiter's suggestion because they were out of the grilled cheese. Both were delicious but we were very pleased with portion size. The servings weren't too big or small. We left full and...\n\n\nMore"], ["Great for breakfast with dogs!", 4.0, "August 26, 2014", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I come here for my coffee fix and pastry only and not for dinner. A while ago I had been here for dinner and it was so so. So this review is soley for coffee and pastry. There are two benches outside and the patio outside is also open for breakfast. There are an array of pastry to choose. All...\n\n\nMore"], ["Quaint restaurant with good food", 4.0, "July 12, 2014", "LovesToTravel0928", "Appleton, Wisconsin", 19, 7, "The restaurant is very small inside but has outdoor dining too. Menu had many good selections. We had the cauliflower appetizer which was very unique and good. Great wine and cocktail options too."], ["Room 11 is Waiting", 4.0, "May 29, 2014", "PaulF221", "Washington DC, District of Columbia", 7, 3, "Pleasantly surprised by the sophistication of this neighborhood \"joint\", and I use that term affectionately. We were looking for a restaurant within walking distance of the Gala Theatre and Room 11 popped up. Making the most of a limited amount of space, the patio is the spot during the outdoor season, while the limited (not too) indoor space has a...\n\n\nMore"], ["Wonderful new expanded venue with huge patio in summer", 4.0, "January 16, 2014", "Katie E", "London, England, United Kingdom", 94, 37, "Great food, unique and fun cocktails, and a new expanded venue - great for warm weather al fresco dining on the patio!"], ["DC locals favorite", 4.0, "December 28, 2013", "jschn_2000", "Raleigh, NC", 60, 17, "Room 11 in Columbia Heights is off the radar for tourists, but a delight for the neighborhood! Seasonal menu is short but covers the bases from appetizers to entrees: beet/carrot soup, Korean short ribs, risotto, pork chops with the best Brussel sprouts I've ever eaten. Inventive cocktails (burnt sugar old fashioned) and well-chosen beer and wine list, and save room...\n\n\nMore"], ["Overrated", 3.0, "November 7, 2013", "Sacred-Valley-Girl", "Washington DC, District of Columbia", 62, 25, "Poor service - inedible food. Four different orders, poorly timed delivery, expensive and service bordering on rude."], ["A Perfect Cafe in Columbia Heights", 4.0, "July 27, 2013", "NuttyGirl323", "Appleton, Wisconsin", 66, 36, "Visiting DC for a conference and staying with a friend, we popped into Room 11 on a Monday night. Small, quirky and inviting are the 3 words that best describe this place. The food is a delightful spin on old favorites. And save room for the honey and goat cheesecake truffles. I was skeptical but proven wrong. The white sangria...\n\n\nMore"], ["A great intimate restaurant with amazing cocktails and delicious food", 5.0, "July 6, 2013", "wodaabe", "Washington DC, District of Columbia", 109, 42, "I am frequently disappointed by DC's restaurants. The restaurants that line 14th street always leave me feeling a bit sick to my stomach and regretting that I didn't make the drive out to the suburbs for some quality food. Room 11 is an exception and I am eager to go back! The restaurant is small and lends to a very...\n\n\nMore"], ["Great neighborhood bar", 4.0, "June 27, 2013", "Robert M", "Leawood, Kansas", 89, 74, "Four of us dropped into Room 11 between our destinations on a busy DC day. We enjoyed great service, a good selection of drinks, and nice seating indoors and outdoors.\nThis is the kind of place you can really enjoy, with servers and staff that are friendly and efficient. If I lived nearby, this would be MY neighborhood restaurant and...\n\n\nMore"], ["Can't wait to come back", 4.0, "May 14, 2013", "Lynn P", "Ohio", 89, 29, "We went one evening for desserts and drinks but the power was out and they weren't serving food. We went back the next morning (Monday) for breakfast and were not disappointed. There was a small selection of sweet and savory items available and the coffee was delicious. Really looking forward to coming back the next time we're in town for...\n\n\nMore"], ["Good Service and Great Atmosphere", 3.0, "April 14, 2013", "CaptainAwethume", "Hyattsville, Maryland", 262, 85, "I've been to this place a couple of times. The first time, it was for drinks. I was impressed with the unique mixes in their cocktail menu as well as the bartender's knowledge and ability to answer questions. The atmosphere in the main bar area is lovely and comfortable.\nToday, I went for brunch with a couple of other people....\n\n\nMore"], ["cozy and romantic pub on 11th street", 4.0, "March 18, 2013", "sjtam", "silver spring", 136, 148, "Stopped here late-ish on a Sunday nt. We only had dessert, coffee, wine, and cocktails but I could see that other couples were enjoying appealing looking charcuterie and cheese plates. I would definitely return here for a full meal. The vibe was low-key, hip, and it seems like a great little neighborhood bar/bistro with unusually early to late hours. Wish...\n\n\nMore"], ["Nicely done", 3.0, "February 15, 2013", "Sabar3", "Falls Church, Virginia", 71, 29, "Food was nicely prepared and presented. Web Site did not list that dinner menu did not start until 5 PM so sitting outside was not available. We need to dine off the lunch menu in the bar area seating. We were competed for our drinks for this misfortune. Very nice assortment of pastries that were displayed on the bar counter....\n\n\nMore"], ["Tiny place--huge tastes!", 4.0, "November 30, 2012", "Anne S", "Clemson, South Carolina", 30, 9, "This tiny restaurant has top-notch choices on the menu, excellent service, and some of the tastiest entrees ever! It is a fantastic little neighborhood place that few know of. Don't miss it!"], ["Tiny neighborhood gem", 5.0, "October 12, 2012", "MaryRP", "Boulder, CO", 65, 66, "Only 4 small tables and bar seats do not predict a menu including branssino and quail along with more common menu items., all at a great price for Washington DC. We had some special requests and the cook came to our table to discuss options with us, and the food was prepared perfectly and presented well. Also a good choice...\n\n\nMore"], ["Creative cocktails & fun service!", 5.0, "September 23, 2012", "snowcait", "Breckenridge, Colorado", 8, 1, "My fiancé & I were recently staying with a friend in D.C., and he couldn't wait to take us to Room 11. Needless to say, the experience lived up to the high expectations he had set! We sat at the bar and got amazing service... Lots of recommendations, plus stories about the insane collection of bitters from around the world...\n\n\nMore"], ["Flies Flies Flies -- Shame on the Flies or the Management??", 3.0, "August 4, 2012", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "I live in the hood and walk pass this place all the time, I finally decided to try it. I like the patio outside is one reason. Plus Yelp gave it a 4 stars. Since it does not takes booking we arrived just before 7 to get a table. The minute I sat down, I started noticing all the flies...\n\n\nMore"]]], ["Capitol Grounds", [["Best sausage/egg/cheese ever", 5.0, "July 8, 2015", "nad130", null, 11, 7, "Wonderful coffee shop/bistro. Best breakfast sandwich ever. Nice outdoor seating when weather permits. A couple blocks from Foggy Bottom metro. Great staff, coffee, and breakfast/lunch. Limited counter seating inside but great for grab/go on your way to the mall, White House, other tourist spots."], ["Good Coffee Shop", 4.0, "November 7, 2014", "jeffl499", "Alexandria, VA", 997, 373, "Perched on the corner of Pennsylvania and 21st Street, Capitol Grounds is well situated for the large flow of pedestrian traffic in the area. The coffee and tea menus are limited but good. Also, try a fruit or coffee frappe(in various flavors) for something special. A very creative sandwich menu as well a fully stocked soft drink case for those...\n\n\nMore"], ["Crowded, but breathtaking, for inauguration", 5.0, "January 26, 2013", "nanster93", "Henderson, Nevada", 13, 14, "Views were spectacular, but gating, and routing for inauguration not adequate, and resulted in our being turned away from our designated gate entrance."], ["Huge!!!", 5.0, "September 4, 2012", "Steven P", "Nashville, Tennessee", 56, 24, "Pictures cannot possible portray the size of this place. To stand on the Capitol grounds and see history in the making is impressive. The detail in the buildings architecture is breath taking. Wanted to take a tour of the inside, but too much to see for only one day in D.C."]]], ["Captain White's Seafood City", [["Feels like a dockworker's eating place... Perfect!", 5.0, "September 17, 2015", "Christopher C", "Frankfurt", 44, 20, "Read thru the comments after I visited the place. No, it is not a restaurant and people complained about it not being cleaned? This is like stationary food trucks at a busy fair people. They clean over night and that is that and it is fine and expected.\nIt felt like it was just locals from the area. Lot's of...\n\n\nMore"], ["What great fun! Loved this place.", 4.0, "September 16, 2015", "beej5000", "Osceola, Indiana", 162, 51, "How could I have been going to DC annually for years and not be aware of this fish market? But, this time were staying with friends instead of being there for business and were introduced to Captain White's. What great fun to see all the fresh seafood on display. (I note that TA has this listed as a \"restaurant\" and...\n\n\nMore"], ["Average food", 2.0, "September 7, 2015", "klkh2002", "Sydney", 345, 110, "Captain White seems to be a bit of an institution in DC so when I went to the fish market, I had to try something from this store. The store looks really impressive but I found the food to be pretty average. I got some stone crab claws but when I started eating them, they were pretty stale. Half of...\n\n\nMore"], ["Fresh and delicious", 4.0, "September 4, 2015", "Lisa B", "Kerrville, Texas", 9, 1, "It was a little hard to get to since my navigation kept losing gps signal but well worth circling the area a couple of times!"], ["Food is Great, but filthy, and no sence of urgency.", 3.0, "August 21, 2015", "Max K", null, 2, 1, "We ordered our food and waited for 30 minutes which is kind of long. We saw are food on the counter but it took the guy 10 minutes to load ketchup, napkins, and a few condiments into the bag. In addition, the staff was not friendly and they were eating stuff that they got from the kitchen, and drinking stuff...\n\n\nMore"], ["Take some seafood home.", 5.0, "August 16, 2015", "Itsmytime73", "Orlando, Florida", 17, 6, "My family of four ordered two crab cake specials which include two card cakes with two sides, delicious real live card meat NO imitation crab meat here. Ordered a soft crab sandwich ......delicious delicious delicious. My son ordered shrimp and fries. He enjoyed the taste and seasoning of the old bad. This spot has a standing room policy on eating....\n\n\nMore"], ["The ONLY place I buy crab in the DMV!!!", 4.0, "August 10, 2015", "Ladynslvspr", null, 29, 6, "I have ordered from here time and again and I love the place. WOMEN can get a little extra, especially if they bat their lashes and flirt a little. The guys here are honest and they will make sure you get 'good' crab. I can eat myself sick of crab and will try to do just that!"], ["Great Shrimp!", 5.0, "July 20, 2015", "tryto82", "Bryans Road, Maryland", 69, 30, "Whoa, wasn't expecting this. Recommended by a coworker stopped by to sample the shrimp. Ordered steamed and fried shrimp. Outstanding! Received a huge portion, and the taste was amazing. Very fresh. Highly recommended if you visit. So much seafood. Great choices from fish, hush puppies, chicken, clams, oysters, you name it they have it. We were in a hurry, so...\n\n\nMore"], ["Fresh Fish", 4.0, "July 20, 2015", "Qhgirl", "Rockville, Virginia", 23, 12, "Love going to the seafood market. Not only can you get a very wide variety of all sorts of raw/fresh seafood, there are also lots of ready to eat selections that you can get right there at the dock. There is even a little dining area on the pier. Right now (july2015) the pier area is undergoing renovation.. so expect...\n\n\nMore"], ["Crab cake platter", 3.0, "July 19, 2015", "Paneraiguy", "Washington DC, District of Columbia", 41, 28, "So I guess I may have set the bar too high since this was a seafood place. Thought I'd get some killer crab-cakes here. This is not the healthiest place. Everything is pretty much fried. The crab cakes were fried. Why in the world did I think they may be baked. On top of that there seemed to be filler...\n\n\nMore"], ["THE SMELLS, THE SIGHTS... THE SEAFOOD", 4.0, "July 14, 2015", "Pyra-Danny", "St. Petersburg, Florida", 132, 66, "I had no idea this place existed but I’m glad we found it. First of all it provided a great break from the indoor, refurbished, buildings and restaurants around D.C.—this looked more community-driven, chill, and unpretentious.\nMOUNDS OF SEAFOOD FOR PURCHASE\nThe first thing you’ll be drawn to are the mounds of caught seafood: crabs, shrimp, etc. They sit on...\n\n\nMore"], ["Just plain disappointing", 2.0, "July 3, 2015", "lyle7692", "lyle7692", 113, 58, "We've been to wharf area eateries before and this one ranks very low. It's unclean, it smells, it's disorganized, and slow. Just plain disappointing."], ["He Crab, She Crab, Red Crab, Blue Crab", 4.0, "July 1, 2015", "Sherri B", "Yucca Valley, California", 38, 13, "Amazing variety of Seafood. This market stinks to high heaven and the workers are a bit bawdy. You pick the crab or shrimp and they will boil it in spices to your taste. Capt Whites has the stand up tables to eat from but no drinks or other accompaniments. Got Sweet Tea, Hush Puppies and Lobster Bisque from adjoining stand....\n\n\nMore"], ["Hot Crabs to go/or stay", 3.0, "May 19, 2015", "patrick v", "Washington DC, District of Columbia", 11, 1, "Amid the construction being done on the new Southwest Waterfront, the Wharf in DC is still thriving. A great place to purchase a wide variety of fresh seafood including Maryland Blue Crabs, prices vary according to the time of the season and availability, but September is always the best month for locally caught crabs! Take bushel to go or eat...\n\n\nMore"], ["Strawberry Lemonade", 5.0, "May 15, 2015", "L R", "Detroit, Michigan", 79, 34, "Yes, I'm writing about strawberry lemonade at a seafood place. We stumbled upon this place. We had actually purchased food at one of the other establishments, but because we wanted to eat in their reserved area, we decided to purchase some soup from them. The lobster bisque was very good. As we were paying for the soup, one of the...\n\n\nMore"], ["Welcome to DC", 5.0, "February 10, 2015", "JohnBGreatFallsVa", "Great Falls, VA", 120, 61, "If someone told me that Captain White's was secretly operated by the Smithsonian, I'd go along with the thought. The entire waterfront/seafood-sales area is quintessential DC, and Captain White's is the best of the lot. Everything we get there is the best, BUT the best of the best is buying a dozen jumbo crabs after a Sunday afternoon Nats game,...\n\n\nMore"], ["Go on Sunday evenings", 5.0, "December 21, 2014", "Cristine C", "Olney, Maryland", 35, 15, "Excellent food. Great value.\nNo matter what I always get the clam chowder and the shucked oysters.\nCannot find fresh relatively inexpensive seafood anywhere. No restaurant is worth it in value compared to this place.\nMust go!"], ["Avoid it like the plague", 2.0, "October 21, 2014", "FuzzBall25", "Houston, Texas", 82, 34, "This establishment is one of those bare-bones types secluded from the rest of the city near an overpass. While customer service typically isn't expected to be superior at these sorts of places, it is downright awful at Captain White's.\nWhen you first visit, you will most likely walk into the fish market area where sellers will aggressively try to sell...\n\n\nMore"], ["Simply amazing for seafood lovers", 5.0, "October 2, 2014", "Sabine S", "Zurich, Switzerland", 18, 31, "If you love seafood, this is the place to go. We walked there from the city and were able to find it well. As we weren't too hungry, we only got half a pound of shrimps to go. I chose with spice (it's a powder they put on the unpeeled shrimps) and it was very good. It's just the right...\n\n\nMore"], ["Filthy and horrible", 1.0, "September 2, 2014", "mom2tn", "usa tn", 3, 2, "On Saturday we went to the fish market in Washington, D.C. Was amazed to find many open stores selling beautiful fish and shellfish. Captain White boasted cooked food and a reserved patio to eat. We got on line and waited for 25 minutes until I got to the counter. It was 99 degrees, my daughter was getting lite headed, I...\n\n\nMore"], ["Generous portions, good deal", 4.0, "August 20, 2014", "Jay Y", "Houston, Texas", 215, 124, "I didn't know what fresh fried seafood was like until I brought food from Captain White's during my DC visit!\nWhen I first entered the Maine Avenue Fish Market, I was overwhelmed by the amount of choices there. Captain White's stood out to me because it was the only one that clearly priced its food with a clear menu of...\n\n\nMore"], ["Satisfied and highly recommended", 4.0, "August 19, 2014", "yk2", "toronto", 86, 54, "Instead of a regular restaurant setting, here you have the flexibility of eating your seafood at the pier or eat your home's comfort. We were just visiting DC and couldn't resist going back the second time but ordered too much that we actually wasted 2 out of the 12 crabs. It's a lot of work for that little bit of...\n\n\nMore"], ["Fish and Seafood Lover's Dream", 5.0, "August 5, 2014", "millc54", "Indian Shores, Florida", 334, 148, "We have been to DC a few times and I don't know how we overlooked this place. On the metro get off at Waterfront and walk towards The Wharf. There is a major waterfront construction going on, but if you walk to 9th it will get you to fish heaven.\nThis place has been here forever and is an institution....\n\n\nMore"], ["Loved it so much we visited 3 times", 5.0, "July 10, 2014", "Maureen P", "Oregon City, Oregon, United States", 66, 30, "The best shrimp I've ever had, great crab, and my very first hush puppies. You can get food to order, or buy in bulk for cooking there or at home. Very limited parking, so we ended up walking each time we went. Much more crowded on the weekends with longer waits, but it was still worth it."], ["It's the wharf / Capetian whites / seafood market", 4.0, "June 26, 2014", "James V", "Maryland Heights, Missouri", 127, 65, "It's an open air seafood market. All fresh on ice bay crab Alaskan crab squid mussels clams flounder whiting blue lobster shrimp trout crawfish catfish squid octopus and most anything you want from the water. Cash or credit. They can cook it for you there if you want. Parking is a maze of people and cars. 30 min free parking....\n\n\nMore"], ["Terrible", 1.0, "June 8, 2014", "DCtoTB", "Tampa, Florida", 143, 76, "The fresh fish looks good but don't come here for the prepared food. We ordered broiled shrimp and crawfish. The shrimp had no flavor at all. The crawfish were overcooked and mushy and couldn't get any meat out of the tails. We also ordered two crab cakes with fries and hush puppies along with clam chowder and Maryland crab soup....\n\n\nMore"], ["Fried and died", 1.0, "June 7, 2014", "yvonne p", "El Sobrante, California", 144, 72, "Several years ago, we loved our experience in this area. Construction has most of the restaurants gone; all that's left is the fish markets and fried foods. The fresh seafood looks great. We ordered shrimp and 'Broiled' salmon. After a long wait (\"...it takes 20 min for broiled...\") the salmon was not only dead but dried out, overcooked. No chairs...\n\n\nMore"], ["Best place in town", 5.0, "June 1, 2014", "463fredc", "Montpellier, France", 97, 45, "This is an incredibe place that you are not expeted to find in a clean city as Washington. A real fish market, with tons of oyter, crabs and fish sold on flotting barges. The ony restaurant is instaled on two barges. One for selling seafood and cooking, the second to eat but without char in front of a potpmac river...\n\n\nMore"], ["Great place to visit", 5.0, "April 7, 2014", "Ditjr", "Grand Rapids, Michigan", 77, 15, "This is one of those places we stumbled upon by accident but if I lived in DC I'd be there every week.."], ["Awesome seafood", 5.0, "February 18, 2014", "Lei H", "Baltimore, Maryland", 1, 0, "My girlfriend and I went there last Saturday. We ordered one dozen of oysters, which are the freshest ones I have ever ate. The cooked shrimp and crab are also tasted. However, there is no place for you to sit and eat."], ["Severa choices but not impressed", 3.0, "February 13, 2014", "foghesino", "San Antonio TX", 99, 45, "This is my second visit to Captain White's. The first it was because after sampling shellfish in the market we wanted a place to sit (indoors) and eat (this was the closest). This time, it was more of the same. I must state that I have very high seafood expectations (being raised near the ocean) so I might be tougher...\n\n\nMore"], ["Best Fresh Seafood In the City!", 5.0, "September 9, 2013", "Hollin D", "Washington, District of Columbia, United States", 130, 48, "The best seafood restaurant in the city is at our house thanks to Captain White's. We bought six big soft shell crabs and two pounds of Carolina shrimp and had a feast at home. Seafood is so easy to prepare and usually so expensive when you go out. The service there is nice and friendly. We have been buying wonderful...\n\n\nMore"], ["Abysmal food slow service", 2.0, "August 21, 2013", "Lekimoppilifnas", null, 15, 11, "Waited well over half an hour for food for 5. Nothing complicated just crab cakes and chicken ( one of our group allergic to seafood). Everything was greasy flavorless and lukewarm. No discernable spicing to the crab cakes although they did have a fresh crabbiness to them. The fries were limp and the hush puppies like little crusty golf balls....\n\n\nMore"], ["It's an experience!", 4.0, "August 14, 2013", "Judy C", "Marshfield, Wisconsin, United States", 287, 148, "So you have to be a little adventurous to do the seafood market, and not afraid to try new things. First, walk around and be amazed at all the different types of fish and seafood available--you'll be wishing you lived closer to take some home with you and/or knew how to cook it. Then head to one of the stands...\n\n\nMore"], ["Great shrimp!", 5.0, "July 16, 2013", "Jabez828", "Huntsville, Alabama", 70, 29, "Great steamed shrimp, crab claws & oysters.\nThis is kinda hidden away from the common tourist sites, but just a short walk from the tidal basin near the Jefferson Memorial.\nYou can get it to go or stand at a bench and eat while looking out at the marina.\nA must stop!!!!!"], ["Basic fresh seafood market, friendly folks", 3.0, "June 19, 2013", "ViewsAndReviews", "Washington, DC", 167, 105, "This waterfront seafood market is rustic and friendly, with some waterfront/waterview wooden standup counterspace for \"dining\", so don't expect a picnic table or more. Seafood can be purchased by the pound or the plate. The gumbo, while very tasty (especialy spiced up at the condiment table) had generous amounts of whole shrimp in it - though also unpeeled (shell, legs...\n\n\nMore"]]], ["Laliguras Indian & Nepali Bistro", [["Really tasty, a great find", 4.0, "August 23, 2015", "GypsyTraveller94", "Washington DC, District of Columbia", 335, 156, "Super butter chicken and kashmiri lamb. We came at the tail end of lunch so I wasnt expecting the best, but both dishes were freshly made and very tasty. We lived in India so our standards are high; this place meets them!"], ["Great lunch!", 5.0, "July 1, 2015", "Gregg L", "Tucson, Arizona", 128, 43, "The food and the value are the best!! Delicious food for a great price. I had the saag paneer and it was amazing. Combo included rice, naan, and a small cup of lentils. Fast food low price with much better value!"], ["A Himalayan challenge to distinguish between Indian & Himalayan food", 4.0, "June 20, 2015", "DisplacedTarheel", "Washington DC, District of Columbia", 8, 0, "With enough time for a comfortable lunch, a friend recommended we try the \"new\" Indian/Nepali restaurant near UDC. Neither of us regretted the idea.\nThe interior is colorful, with photos/art-work of both India & Nepal. The servers were either inexperienced or having a bad day, not clarifying our beverage order (nice pungent lemon-ginger tea to share) either time, stopping by...\n\n\nMore"], ["Indian & Nepalese restaurant", 4.0, "June 13, 2015", "NittanyLion70", "Somers Point, New Jersey", 195, 68, "Convenient to the Days Inn on Connecticut Avenue\nWife had a vegetarian dish\nI had Nepalese Chicken Curry\nPortions were fine\nGarlic Naan was yummy"], ["Good choice if at Van Ness", 4.0, "May 8, 2015", "chazzq", "Maryland", 205, 94, "As with Gerson S, we discovered this place by accident when we happened to be at the Van Ness Metro. We were quite pleased with the food. I had a Kashmiri lamb curry and my wife a Nepalese vegetable dish. Both were above average. One downer - you have to specially order papadon (sp?) and they change as if it...\n\n\nMore"], ["Plastic piece in food, Unauthorized charge on card, unprofessional and racist manager / staff", 1.0, "April 7, 2015", "S V", "Long Beach, California", 1, 1, "There was a piece of plastic in the Veg. Korma we ordered. Also that dish tasted like someone opened a bag of frozen vegetables and put it in tasteless gravy. It was really uncooked and tasted really bad.\nThe quantity of the foods offered was very less compared to other places that offer similar dishes for same price. Really very...\n\n\nMore"], ["A Solid Option in Van Ness", 4.0, "February 18, 2015", "pine1144", "North Bethesda, Maryland", 71, 67, "I was happy to see an Indian food place open here. The one formerly at this location was one of my favorites, so I was not sure if this place could live up to my expectations. I had a great lunch experience and look forward to returning for dinner soon. The curried lamb dish was nicely seasoned and was served...\n\n\nMore"], ["Great Find", 5.0, "February 16, 2015", "Gerson S", "Washington DC, District of Columbia", 74, 45, "There are lots of good Indian restaurants in DC. I'm most familiar with the ones downtown. I came across Laliguras by accident, walking between my piano lesson and the Van Ness Metro and, as a lover of South Asian food, I'm very happy I did. They have both Nepalese and Indian dishes and both are superb. Their lunch prices are...\n\n\nMore"], ["Good, healthy, tasty, almost like home cooking", 4.0, "January 25, 2015", "Fussy4", "Washington DC, District of Columbia", 67, 39, "This is a great place to eat out frequently and continue to be healthy. Food is always fresh, not greasy, and almost as if it was cooked at home. Try their tandoori salmon, and mustard greens with naan, (which is particularly well made) for a well balanced and reasonably priced lunch for two. There is enough choice for vegetarians, good...\n\n\nMore"], ["Welcome addition to the neighborhood", 4.0, "January 25, 2015", "LisaMore720", "Washington DC, District of Columbia", 10, 5, "We've been missing the former Indian restaurant that used to occupy this space. I'm so happy we came in to taste tonight. Samosas are light and not at all greasy; the filling tasted almost fluffy. We got traditional na'an, aloo gobi, and malai kofta. All were delicious, well flavored, but not over powering. The malai kofta sauce is velvety as...\n\n\nMore"], ["Enrich your taste buds with Indian & Nepali food", 5.0, "January 10, 2015", "44Sam44_12", "Fairfax, Virginia", 50, 29, "I have been a regular customer here..from the decor of the restaurant to the food...everything is awesome!! The commute to the restaurant is easy one as it is 5 mins walk from Van Ness metro station. There is wide variety of food. I have tried their chicken momo, chicken chhoila, lamb sekuwa, butter chicken, and few other dishes. The food...\n\n\nMore"], ["Tasty Nepali and Indian fare in a fresh, colorful dining room, tablecloth service", 4.0, "January 4, 2015", "LisandroVoyager", "Washington DC, District of Columbia", 367, 206, "Right on Connecticut Avenue by the Van Ness Metro station, this is an attractive, mid-priced dining option bringing up the standard of eating places in the immediate vicinity. I enjoyed a long dinner there, was not rushed and the noise level was not too high. Large menu with plenty of vegetarian and vegan dishes as well as plenty of selections...\n\n\nMore"], ["Very tasty in Van Ness", 5.0, "December 2, 2014", "Ted S", "Washington DC, District of Columbia", 5, 5, "Restaurants come and go in this neighborhood. I really hope this one stays. The shrimp korma, sag lamb, naan were all delicious. The service was great, the decor warm. We'll be back to explore more of the menu."], ["Great Indian veggie dishes", 4.0, "September 12, 2014", "Lolaz007", "Washington, DC", 54, 59, "Laliguras is a welcome addition to the Van Ness / North Cleveland Park neighborhood. I regularly order the Aloo Gobi Masala (a flavorful cauliflower and potato dish in a tomato-based sauce with various spices) and the Mataar Paneer (spicy peas and cottage cheese). Everything is fresh and flavorful. The butter naan is also delicious. Staff is helpful in terms of...\n\n\nMore"], ["Naan was delicious", 4.0, "July 28, 2014", "Lindsey P", null, 1, 4, "Great food.Great atmosphere, nice and clean. I enjoyed the food especially the naan (garlic and butter) was delicious."], ["An elegant neighborhood restaurant", 4.0, "July 3, 2014", "paxa", "Washington DC, District of Columbia", 370, 207, "This restaurant opened recently in Van Ness and unlike previous ones at this location has already been getting some rave reviews. We tried it on a weekday evening when it's relatively quiet, not a lot of diners but plenty of take out traffic. The one room interior is indeed very nicely decorated, walls painted a warm reddish tone, contemporary bright...\n\n\nMore"], ["A small but happy new find", 4.0, "June 24, 2014", "MrsRehoboth", "Washington DC", 231, 92, "Delicious Nepalese food; very warm and welcoming staff; soft bright pillows on the benches. This is comfort food in a comfort place; just what I wanted after work today. I had goat biryani - tender and very yummy, lightly spiced but still very flavourful. And there was something I had never had before: Nepalese Momo: a dumpling with either chicken...\n\n\nMore"], ["A Standout Innovative menu", 5.0, "May 31, 2014", "EHFWashingtonDC", "Washington DC", 19, 25, "What at treat!\nThis newly opened Nepalese/Indian restaurant has fresh, fresh food cooked with skill and love. The menu is unusually interesting, featuring a goodly assortment of \"typical street food favorites\" which I've always wanted to try, but have hesitated to on the street. The dishes are subtly prepared with a melange of intricate flavors present in each one. Generous...\n\n\nMore"]]], ["The Sacrificial Lamb", [["It was no Sacrifice", 4.0, "August 2, 2015", "Chimesboss", "Hunt Valley, Maryland", 54, 26, "On a walk to a near by museum, we noticed their sign and laughed about it. After a few hours looking at the artifacts we had come to see at the JWV museum we decided why not given them a try. It is not so much an Indian Restaurant as an Indian Sub-Continent Restaurant, with dishes from both Indian and...\n\n\nMore"], ["Excellent indian", 5.0, "July 26, 2015", "FlyerCG", "Charleston, South Carolina", 27, 8, "Take out. Absolutely delicious, no frills Indian/middle eastern. Great flavor, daily specials. It's quick, inexpensive and worth trying. I'm addicted to this place. Go see Omar--you won't be disappointed."], ["Exceptional, cheap, fast", 5.0, "May 16, 2015", "MikeMfromWashDC", "Washington, DC", 148, 89, "Great variety including of all the regular Indian and Pakistani regulars plus goat dishes. Friendly staff, not much seating."], ["GOOD INDIAN FOOD", 4.0, "May 19, 2014", "maureen r", "Dublin, Ireland", 4, 2, "It's a whole in the wall, but their food was good & cheap !\nTheir regular chicken curry was spicy & had a kick to it !!\nWe added chick peas & spinach to it & it was tasty"], ["Great takeout", 5.0, "May 10, 2014", "Harrison-act", "Canberra, Australia", 132, 63, "I went back a couple of times for vegetarian curries, and naan. Their eggplant curry was exceptional. Their palak paneer very good. Service was quick and prices very reasonable."], ["Fab Chicken Biryani!", 5.0, "May 6, 2014", "Frequent_Flyer99999", "Dijon, France", 2, 2, "Delicious food, nice people & they deliver to nearby addresses :)\nLocated downstairs so you might walk right past it. Worth a try!"], ["Exceptional tastes, low-key atmosphere", 4.0, "July 11, 2013", "MikeMfromWashDC", "Washington, DC", 148, 89, "The name is unfortunate, because I think it scares customers away. But the food--lamb and other meats--is wonderful. Plenty of unique dishes. Best to carry out, though, as the dining area is small."], ["Food Not Very Good; Menu is Schizophrenic", 2.0, "January 8, 2013", "KamuelaFoodie", "Waimea", 327, 109, "This small kitchen in DuPont Circle has what appears to be an Indian menu with some Middle Eastern offerings. The spices, flavors and textures do not belong to India or any other type of cooking.\nI would not recommend this restaurant."]]], ["Elephant & Castle", [["Ok for drinks and starters", 3.0, "October 10, 2015", "UE_DC64", "Washington DC, District of Columbia", 141, 315, "Went her with friends for drinks. The only words uttered by the outdoor servant, the guy in a red shirt, was \"no\", \"no\", \"no\" to questions if we could sit outside, if he had an idea how soon we might be able to get a table outside, and whether we could sit inside. He then managed to be both unhelpful...\n\n\nMore"], ["Really long wait/bad service", 2.0, "October 4, 2015", "C P", "Saint Louis, Missouri", 1, 0, "Seated quickly, then forgotten about pretty much for the rest of the night. Steak and chips average at best. Keep walking..."], ["Great for lunch & beers..", 5.0, "September 28, 2015", "Bella8891", "Leeds, United Kingdom", 158, 69, "Called here for lunch whilst sightseeing. There is both inside & outside seating available. There are also tv's inside if you're into your sport?\nThe menu is varied with lots of choice to suit most tastes.\nI would recommend the Citrus Chicken Salad or Ceaser wrap. Both were served very quickly and were very tasty.\nReasonably priced at $13 each....\n\n\nMore"], ["Good atmosphere", 5.0, "September 22, 2015", "jcrc04", "ayrshire,scotland", 41, 13, "Ate at the Elephant and Castle on two nights, average pub food but enjoyable to eat. All the staff very nice and pleasant. We had drinks here most nights of our holidays, very nice as a pub."], ["Lively and good food", 4.0, "September 11, 2015", "lpstohler", "Pinehurst, North Carolina", 20, 7, "After a long day of sight seeing, we took Trip Advisor's recommendation to this busy pub. The fish and chips and fish tacos were great and so was the service. A great find in the big city."], ["Good for lunch and a beer", 4.0, "August 22, 2015", "JZBach", "USA", 62, 13, "Great lunches such as Shepherd's Pie, Chicken Pot Pie, and similar dishes. And good selection of beers and ales on tap. Sports fans will appreciate the many TV screens."], ["A nice friendly pub with an English theme", 4.0, "August 19, 2015", "Steve P", "Clontarf, Queensland", 191, 160, "This is an English type pub in central DC. This is a big place with a quite a few tables outside to be enjoyed on a summers day. We found the service very good and the menu interesting if not too inspiring.\nThe quality of the food was good and the interaction with the locals after work was nice. A...\n\n\nMore"], ["5 Stars just for the Cask Ales", 5.0, "August 15, 2015", "Ricky R", "Saint Charles, Illinois, United States", 21, 12, "Stopped in for lunch while on a trip in DC and enjoyed the menu and the selection of beers. The Cask Ale beer selection is a reason to visit this pub as it is unique to the area and offers a smoother more enjoyable beverage. The food was also top notch and everyone that was with me on lunch enjoyed...\n\n\nMore"], ["Good", 4.0, "August 6, 2015", "divasoul", "Beltsville, Maryland", 34, 14, "I've been to the other Elephant & Castle in DC, but never this one. This one is just as good. We went just at the start of happy hour for food and service was relatively quick. The food was excellent as always and the waiter and manager were friendly and helpful. I'm partial to pub type food and this fit...\n\n\nMore"], ["Great pub atmosphere!", 4.0, "August 4, 2015", "KellyD2013", "Warwick", 11, 0, "Great pub fare with numerous classic pub favourites, convenient to the hotel, attentive waiters and all at a reasonable price!"], ["I just love this place!", 4.0, "July 21, 2015", "Lisa R", "Pittsburgh, United States", 16, 8, "We ate here while visiting D.C. and seeing a show and touring. People were so nice! Great place to enjoy a meal at decent price!"], ["A Wonderful Irish Pub!", 5.0, "July 15, 2015", "Paul S", "Safford", 2, 0, "The food was absolutely excellent: I had the fish and chips and a Guiness beer. My wife had the seafood salad. Good food, good service, good beers.\nIt was a little overwhelming to listen to a trivia contest, but overall, highly recommended. It was also very close to our hotel, so it was convenient!"], ["Good for after work group", 4.0, "July 9, 2015", "Vikingtraveller59", "Sterling, Virginia", 80, 40, "This restaurant was a good choice with a group of ten people with diverse eating and drinking tastes. The folks that wanted to have a soft drink and an appetizer found plenty of choices, as did those that wanted plenty of beer in a range of choices. All the entrees were well done, as advertised, though nothing out of the...\n\n\nMore"], ["A great place to watch the world cup!", 4.0, "July 8, 2015", "chrisandun", "Wichita, Kansas", 124, 67, "I went to check out the pub earlier in the day but was told I could not make reservations so we turned up at 6:00 pm and were able to get a table with good views of the screens. The establishment was clean and pleasant and the food was, for the most part, hot. That was remarkable in itself as...\n\n\nMore"], ["Had a few beers and watched the football (soccer!)", 4.0, "July 7, 2015", "popey89", null, 22, 6, "Visited here on my last day in DC, was looking for somewhere to enjoy a drink with my boyfriend and to watch the English football match. Elephant and Castle fulfilled our requirements. The beer was good value, the staff were friendly and though we didn't eat the menu looked good and somewhere sat near us was very satisfied with their...\n\n\nMore"], ["Late night meal", 4.0, "July 5, 2015", "Judilynn S", null, 5, 0, "Hubby and I went in for dinner. Nice casual place for a meal. Hubby had steak sandwich on garlic bread. It was hard to eat together but he opened it and ate it with a fork. We started with the tempura shrimp appetizer. Quite good. I had the onion soup. Very flavorful. Hubby dipped his sandwich in ithubby had the...\n\n\nMore"], ["Great Family Restaurant, Great Staff", 4.0, "June 29, 2015", "HappyRen123", "Wheeling, West Virginia, United States", 28, 20, "We ate here last Saturday, June 27 at 11:30. Right as the day began to downpour. We met our cousins and their three kids. We had our daughter with us. The staff was great, very friendly, greaty with the kids. It had the standard kids menu food, but the adult menu was really good and so was the beer and...\n\n\nMore"], ["Happy hour", 4.0, "June 11, 2015", "Charles K", "Towner", 3, 0, "Reasonably priced drinks and great service at happy hour. Plenty tvs for the soccer games. Ample portions of food. Near the metro stop."], ["Too noisy", 3.0, "June 4, 2015", "Educid", "Washington DC, District of Columbia", 16, 3, "Service is excellent and food is for pub food, great. However the ambient inside is way too noise, to the point you have to restrict your conversation to who seats next to you and shouting. There are other better pubs in dc"], ["OK Pub...", 3.0, "June 3, 2015", "impresiv1", "Chandler, Arizona", 205, 77, "This place was just a few blocks North of the Mall area. It had a nice patio with some people enjoying the weather. It was packed on a Tuesday for early happy hour. But by 7:30 or so, it was dead. Reasonably priced for DC (expensive from the midwest). Good beer selection. Some TV's with some sports....\nI guess I...\n\n\nMore"], ["After walking 10 hours in DC", 4.0, "May 24, 2015", "hannes1941", "West Milford, New Jersey", 29, 5, "Yesterday May 23th was a sunny but not very hot day. We enjoyed (5 adults & 2 children) an early dinner. Steak and kidney pie is not in the menu and I love it. We enjoyed the dinner. Good selection of imported and local beers."], ["Frequent lunch spot", 4.0, "May 19, 2015", "Will J", null, 20, 6, "Went by here for newcomer lunch today (2nd time). This time we ate outside with the beautiful weather with the shade. I had the salmon am sandwich with fries and Arnold Palmer. Great food, this is definitely a weekly spot with good food and a 5 mi walk from my office."], ["Great Value and the Nearest Equivalent to a Genuine Pub that I have found outside the British Isles", 5.0, "April 15, 2015", "MJS1944", null, 94, 55, "The whole effect is the nearest I have found to a genuine pub outside the British Isles - generally you can call anything you like a \"Pub\" in the name, but in fact in nearly all cases the concept does not really 'travel'. There is American Sports Bar stuff going on indoors (large TV screens everywhere) but hey, we are...\n\n\nMore"], ["Great buzz and great food", 4.0, "April 3, 2015", "Donald M", "Falkirk", 55, 15, "Dropped in on the off chance and had a very pleasant experience sitting outside in the front area in the Spring sunshine.\nVery good service from an organised team who dealt with the ever increasing number of patrons seamlessly. Had a very tasty meal with my Rubens sandwich being as good as any I have tasted in New York.\nWill...\n\n\nMore"], ["An oasis in the land of family vacations", 4.0, "April 1, 2015", "LaurieR1021", "Ellington, Connecticut, United States", 38, 17, "The Smithsonian museums are wonderful places, but at some point one becomes exhausted by harried parents forcing their children to have an educational experience and the giant amoeba-like school groups that engulf the unwary. At this point, one is in need of a restorative beverage, which the Elephant and Castle delivers. Sneak your way behind the Smithsonians, walk past the...\n\n\nMore"], ["great pub", 4.0, "January 25, 2015", "trav419", null, 10, 1, "I love the feel of elephant and castle, sit at the bar enjoy a pint or have lunch in the dining room. The beer selection is great and the food is also very good. Service is always on point and there is always a manager patrolling the floor and asking how everything was. This is a well run establishment."], ["Karen at Lunch and After Work Drinks", 3.0, "January 9, 2015", "Karen A", "Washington DC, District of Columbia", 17, 5, "I have dined in this restarant for lunch and had after work drinks and appetizers there too. It is more of a sports bar atmosphere which is OK, the food is pretty good too."], ["Good value for the price", 4.0, "January 8, 2015", "EGP777", "Rockville, Maryland", 27, 13, "I went with a family of 4, and we had a nice dinner for a very decent price tag. This is a place for lovers of the potpies, fish&chips, \"poutine\" and other deep fried stuff. I'm adding an extra star for the ambiance, especially if you are seated near the fireplace."], ["Decent sports bar with good pub grub!", 4.0, "January 4, 2015", "catp79", "Winchester, United Kingdom", 142, 84, "We found this place by chance on our walk back to the hotel. We were seated straight away by a very friendly waitress to a nice seat by the window.\nI had the chicken burger and my husband had the sausage & mash; we were both very impressed. The meals came out quite quick and fresh. The drinks get coming...\n\n\nMore"], ["Nice Pub Lunch", 4.0, "December 15, 2014", "Seth J", "Seven Corners, Virginia", 480, 162, "Very nice place inside with fireplace and a little bit of a sport theme. We were quickly seated and attended to by a waitress. Menu is very diverse. I highly recommend their onion soup. Overall, we had a great time there."], ["Tasty pub lunch", 4.0, "November 14, 2014", "Morag H", "Limassol, Cyprus", 161, 89, "We selected here as it was a beautiful day and they have tables outside. Good choice of meals including typical English dishes (I suppose it has to have given its name!) good simple tasty food, not fine dining but that's not what its set out to be. Good value for money offering attentive service."], ["Unique options, average overall experience", 3.0, "November 1, 2014", "KristaLeeH", "Burlington, Connecticut", 69, 34, "Stopped by here for dinner on Saturday night, around 6pm. We called ahead to see if there was a wait and was told just to ask for Aaron. Not really sure what that meant but it was close enough to our hotel so we headed over and found it almost empty. We opted to sit outside since it was a...\n\n\nMore"], ["Good place for a brew and burger", 4.0, "October 22, 2014", "JoeFormaggio", "Indianapolis, Indiana", 145, 56, "Ate dinner at this American pub with the English name. Pleasant atmosphere, lively but not too loud. Service was okay. Not special, but a good, solid casual spot to drink and dine. We'd go back. There's another one just a few blocks away."], ["Great pub food & friendly atmosphere", 4.0, "October 6, 2014", "Webgoddess5", "Virginia", 76, 147, "The Steak & Mushroom Pie is my favorite dish, rich and succulent, but so is the butter chicken. A side not to miss is the truffle parm potato crisps...and for dessert, try the bread pudding. It's the best I ever tasted!"], ["Good bet for a boisterous after work snack and drink", 3.0, "September 11, 2014", "Decoamie", "Washington, DC", 282, 136, "I meet friends most frequently at E&C's Penn Ave. branch but recently, I met a friend at the I St. branch. Both have outside seating and both are popular with downtown workers for a happy hour drink and snacks. I ended up eating dinner, and a non-pub offering. Should have stuck with the pub fare. While the Thai mussels' sauce...\n\n\nMore"], ["Poutine!", 4.0, "August 26, 2014", "SeatOfMyPntsTravelr", "Washington DC, District of Columbia", 492, 148, "Great pub with indoor and outdoor seating. Best thing is the selection of poutine. I had the traditional and although the fries should have been crisp the flavor was like I've tasted in Canada."], ["Expected more for the $$$", 3.0, "August 20, 2014", "Brent C", "Chattanooga, Tennessee", 39, 6, "The food wasn't bad, but it certainly wasn't great, and not what I expected for the $$$ I paid. THe sweet potato fries looked amazing, but were only above average. My wife's jerk chicken sandwich has the strangest jerk chicken flavor either of us have ever tried. Very disappointing. I had a great burger, but it wasn't worth $14."], ["A fine happy hour place", 3.0, "August 16, 2014", "SZ49", "Toronto, Ontario, Canada", 42, 26, "Their beers are not expensive, and they can accommodate a large group of people. I have not yet tried their food, but their services are fine. The managers at the location of I street and 19th street NW may be rude over the phone, but the ones at the other location are great people to talk to."], ["An enjoyable diversion", 3.0, "August 10, 2014", "John B", "Cheshire, England", 95, 58, "We dropped by to borrow some air conditioning and have a cold drink after some sightseeing. I was pleasantly surprised by the beer choice and enjoyed a couple of pints of apparently well kept Boddington's Bitter.\nThe service from Evan was attentive and engaging and so we had a thoroughly enjoyable few hours. We didn't really eat there but did...\n\n\nMore"], ["Perectly Average", 3.0, "July 31, 2014", "Matt P", "Lutherville, Maryland", 98, 36, "OUr party of seven had a reserved table inside. The staff were attentive and brought our food out without much of a wait. No one raved, but no one complained. I had the Rocket Salad which had a nice amount of rocket and a good dressing, but the portion was small for $10.50. Also, it had an excessive amount of...\n\n\nMore"], ["Great atmosphere", 4.0, "July 25, 2014", "JohnJovi1", null, 114, 28, "Cool bar with good food. Nice tree lined outdoor patio area. Reasonable drink prices and the staff was very accommodating."], ["Good sports viewing; average food", 3.0, "July 5, 2014", "Kochersl", "Washington DC, District of Columbia", 32, 7, "This was a fun place to watch FIFA World Cup. Lots of screens everywhere and the crowd was into it! Game time drink specials were good for DC $5 for several beer choices including Heineken. We ordered fish tacos, a burger and fried pickles. All were okay for bar food but not memorable. Service was very good especially considering how...\n\n\nMore"], ["Not bad for English style eatery.", 3.0, "May 24, 2014", "traceythomas64", "traceythomas64", 70, 34, "We usually make a point of avoiding all things English when on holiday as, after all, if that's what you want then stay at home.\nHowever, after a long, hot day walking around the tourist attractions, and it now being dark and feeling very tired, there seemed to be a lack of places to eat, so when we came across...\n\n\nMore"], ["Good Place to Chill with Friends after work", 4.0, "April 11, 2014", "R2D2-CamperVan", "Atlanta, Georgia", 25, 3, "Good food, great drinks, interesting mix of people. The premise of the place is all about location and comfort, if that's not you're thing then walk on by."], ["Terrible meal", 2.0, "April 1, 2014", "WeeJohnnie", "London, United Kingdom", 97, 26, "I've eaten here before three years ago, and liked it. A meal this week was frankly terrible: the chicken fingers were grossly over salted and the fries burnt (wonder when they were cooked). Still a good beer selection - the only redeeming feature."], ["Pleasant evening", 3.0, "February 18, 2014", "Richard S", "Nyons, France", 8, 8, "Martini specials at $5, menus includes simple to upscale. My Shepards pie was great, wife's salmon looked good ... Not as big or as well prepared as Circa, down the street, but she liked it. Easy to eat well for less than $50 for two."], ["Fun dinner", 4.0, "December 1, 2013", "Butter1111", "Clarkesville, Georgia", 30, 5, "Great place to wind down after a long day of walking in DC. Great food and service. We had the fish and chips, chicken pot pie and drinks. Pricing was not bad. Busy place for dinner, one large group having an office party. Short walk from the American History Museum."], ["Good pub food", 4.0, "November 18, 2013", "John V", "Annapolis, Maryland", 161, 99, "A friend suggested Elephant & Castle for lunch recently after the first choice turned out to be closed, so I went without checking it out first on Trip Advisor. For once, that was a good thing.\nHad I read the reviews first, I might have balked. But we encountered none of the indifferent service or mediocre food some have described....\n\n\nMore"], ["Good food, great football happy hour", 4.0, "October 5, 2013", "Camcolo", "Littleton, Colorado", 104, 58, "We ate here a 2 times during out stay. Once we were there for Sunday football. Cheap beer and well drinks. The fish tacos were really good. Hard to judge the more traditional foods since I am not a big fan of lamb. Everyone left filled up."], ["Don't go here if you want to be waited on!", 2.0, "August 6, 2013", "Gail F", "Daytona Beach, Florida", 154, 100, "We have gone to this restaurant many times in the past,and service had been declining. This visit it was nonexistent. Considering we were one of a handful of people there on a Sunday afternoon, one would think that it would have been different. They had also changed their menu. One of the people in our party had a milk allergy...\n\n\nMore"], ["great pub food", 5.0, "August 5, 2013", "tt240", "ne england", 79, 38, "This is a good value pub that offers good food in the heart of DC, the burgers and fries were tasty and being very picky would have liked a little more cheese, but the beef was flavoursome and cooked as we ordered, you also got a hint of charcoal which added to the taste. The fries were some of the...\n\n\nMore"], ["Loved it so much we went back 3 times in a week!", 5.0, "July 30, 2013", "cheerhcs1", "Milwaukee, Wisconsin USA", 19, 3, "We felt like we were back in London visiting a great neighborhood pub! Food & service were excellent-huge choice in beers etc. They had a cute outdoor patio but since it was 100 degrees outside-we did not utilize it. One night they had a trivia contest open to everyone who wanted to form teams. Though we did not want to...\n\n\nMore"], ["Good pub", 4.0, "July 20, 2013", "Paul C", "Chicago, Illinois", 237, 55, "Nice place to have a pub meal. Good hamburgers. Excellent choice of beers on tap and in bottles. Service was good. Decor reminiscent of London pubs"], ["Good and fast", 5.0, "July 12, 2013", "orbut", null, 4, 1, "Despite being busy, very quick and quite good service. NY Steak was great and casual pub atmosphere was comfortable."], ["Disgusting food and mediocre service", 1.0, "July 7, 2013", "highlander1971", "Zürich", 191, 96, "I've had the Yorkshire Pudding and clearly the chef must have had left already. Somebody planted the pudding on the mash, stuffed it with meat that smelled like fridge and topped it with the most disgusting gravy I've ever had. The green beans were still raw and everything altogether closer to cold than warm. The waitress must have had a...\n\n\nMore"], ["Great pub option in DC!", 4.0, "July 5, 2013", "Decoamie", "Washington, DC", 282, 136, "I have been to two Elephant and Castle's in DC - at Farragut Sq. and on Penn Ave and 12th. Both venues have a lively bar scene and share a very decent appetizer and main course menu. The most recent experience was at the Penn. Ave. location, where I spent a wonderful few hours on the terrace. Excellent selection of...\n\n\nMore"], ["Cosy Friendly and Eclectic", 5.0, "June 27, 2013", "marcimpala", "Bethesda, Maryland", 31, 28, "I've been going to the Elephant and Castle on Pennsylvania for some time now but after my most recent visit, I was pleased as to how it has evolved. Now that smoking is banned in DC public places, the pub is even better. The place never gets overly loud and the crowd is more professional so one can avoid the...\n\n\nMore"], ["Very Pleasant and Nice, 19Th and I Sts", 4.0, "June 7, 2013", "Orleans2013", "New Orleans, Louisiana", 11, 6, "Nice Pina Colada and Great Huge Brownie and Ice cream ($7.00). Prices vey fair by DC standards. Other customers and the staff very nice. I would go again."], ["Cheerful Watering Hole", 4.0, "June 3, 2013", "pmotton", "Rockville Maryland", 16, 8, "I have had lunch here several times and always enjoyed the atmosphere. The staff is efficient and friendly and the food is superior pub grub. Located near IMF and WBG and close the K Street. Wine and beer selection also good."]]], ["Taqueria Nacional", [["High hopes, cool decor, nice people, but average food", 3.0, "October 14, 2015", "FabEliz", "Somerville, Massachusetts", 7, 2, "I was pumped to try out Taqueria Nacional during a recent visit to DC. Plenty of options, clean place with cool decor, great vibe inside... and thought it would be a nice casual place to grab a bite before heading out for the night. I had high hopes and unfortunately Taqueria Nacional didn't live up to my expectations. The food...\n\n\nMore"], ["nice lunch", 5.0, "July 23, 2015", "danc25", "Munroe Falls, Ohio", 43, 7, "Stopped here for lunch while visiting DC. Nice place set up kind of like a chipotle, but much better food I had tacos and a margarita I would go again"], ["Delicious breakfast tacos", 5.0, "July 11, 2015", "upenn1", "Washington DC", 17, 21, "My wife and I visited Taqueria Nacional for a late morning snack, and were pleasantly surprised by the delicious breakfast tacos. Veggie options and chorizo. The toppings were very fresh. Service was pleasant and fast, and the atmosphere of the place is very comfortable and clean."], ["Good late night tacos on 14th", 4.0, "July 2, 2015", "busy_traveler", "Chicago", 92, 96, "Got some tacos, yucca fries, frozen margaritas and sat at the large open window overlooking the patio and street traffic. Nice atmosphere for a quick service restaurant. An oasis off the beaten path of the busy bars on 14th street and there is a happy hour here also."], ["Bison Tongue Tacos? Delicious", 4.0, "June 6, 2015", "FinnyGo", "Miami Beach, Florida", 57, 45, "Like Andrew Zimmern, I will try anything, food wise, at least once.\nBut cow tongue tacos are actually very common in authentic Mexican taquerias. It is a delectable meat, that when chopped up with onion, cilantro, jalapeños (etc etc) can be outrageously delicious.\nThese Bison tongue tacos were also yummy. The place was good and the spiciness not too desensitized...\n\n\nMore"], ["Good Tacos!", 4.0, "April 14, 2015", "Arthur230", "Dallas, Texas", 19, 43, "This was two doors down from where I was staying while visiting DC so I had to try it out.\nI was waited on promptly when I walked in. I think the person making my tacos was training so he was a little slow, did not know what some of the sauces were on the line and literally counted out...\n\n\nMore"], ["Happy Hour Frozen Margaritas", 4.0, "March 24, 2015", "Alan M", "Washington DC, District of Columbia", 38, 16, "Win Win Win!!!! The frozen margaritas were heavy with liquor. One of these jokers had we swerving when I stood up. The tacos helped with soaking it up though. LOL. Their happy hour runs late too. Check them out!"], ["Very fresh!", 5.0, "March 12, 2015", "Jaime P", "Dallas, Texas", 42, 21, "My sister and I popped in for a quick lunch and were pleasantly surprised. Everything was delicious and very fresh tasting.\nThe guacamole is the best I've had in this city so far (and I'm from Texas - guacamole is pretty much a meal in itself.) We got the large one and it comes in a a resealable container so...\n\n\nMore"], ["Love this place!", 5.0, "March 9, 2015", "Don H", "Washington DC, District of Columbia", 10, 9, "Had a great lunch there (again) The shrimp tacos were amazing! Flavorful and lots of it. the chicken and steak are fantastic. So much flavor and so good!! I think their guac is some of the best in the city, especially for the price! Great food at a great price and I love the fact that they are local folks...\n\n\nMore"], ["Good fast lunch", 3.0, "October 26, 2014", "ENC342", "Eastern NC", 30, 11, "Enjoyed a daily lunch special, two tacos, salad and beans for less than $10. Service was quick and food flavorful. You can choose what to top tacos with and line moved quickly when I was there."], ["You wait a really long time for more authentic tacos.", 2.0, "September 28, 2014", "Jason O", null, 3, 0, "I've eaten here a few times now, and while the tacos are good, the wait (even when there is no one in line) is unbelievable. The staff seems generally unaware of how to effectively process orders. They also don't seem to understand how to make drinks correctly. Also for a taqueria they have a very limited selection of tequilas (3...\n\n\nMore"], ["good Mexican food but orders take a long time", 4.0, "August 25, 2014", "jg325", "WashingtonDC", 489, 320, "I was first introduced to Taqueria Nacional at a food fair, and I was pleasantly surprised it was very close to my house.\nWhat I was most surprised at with this place is how long everything takes. It's set up somewhat like a chipotle, but basically double the prices and triple the wait.Thankfully, I have only been here when there...\n\n\nMore"], ["Decent fast food", 3.0, "August 12, 2014", "s y", "Washington DC, District of Columbia", 49, 23, "I happened to pass by and decided to try this place. They do have a pre-determined menu but you can customize your order. I ordered one premium taco and one \"tostada\" which totaled about $7. The service was great. The food was ok. The lamb lacked flavor. The vegetarian tostada was a bit more flavorful. I would give it another...\n\n\nMore"], ["Just a tad pricey in comparison, but it's good.", 3.0, "May 25, 2014", "sesmarks", "Washington DC, District of Columbia", 123, 84, "It's hard not to compare this to Chipotle - it's in a similar price range and type of food. That said, the portions are really small compared to Chipotle, so that makes the price just a little bit high for what you get. I only tried the chips/salsa and tacos for lunch - the food was all very fresh and...\n\n\nMore"], ["Off to a decent start", 4.0, "July 18, 2013", "AJ C", "Washington DC, District of Columbia", 169, 35, "Waited a long time. For these guys to open. So far so so\nChips are great.\nTacos yummy but not the fish ones.\nThe ordering process is goofy but they willI. Figure it out. Maybe.\nIt's good cheap quick eats. Nice sitting at window. Try it."], ["Very tasty with lots of potential but needs some quick fixes.", 3.0, "July 16, 2013", "PhilNTed", "Washington DC, District of Columbia", 44, 25, "I've been there twice. Very flavorful \"fast food\" in a large and welcoming space but they need a few quick changes with Chipotle moving in soon:\n* Add a self-serve fountain drink station. Charging $2 per can for Diet Coke is just silly, especially on a hot summer day.\n* Counter ordering process needs to be quicker so the food...\n\n\nMore"], ["You can't just order one...", 4.0, "May 27, 2013", "David A", "Washington DC", 6, 4, "Even since leaving my hometown of San Diego, I've been in the never-ending quest to find the perfect taco wherever I end up moving to. I think search ended for DC!\nI've been to their new location off of 14th a couple times, and have loved it for a quick bite.\nFavorite is the lamb with pickled vegetables and steak...\n\n\nMore"], ["Not just for lunch!", 4.0, "August 9, 2012", "Jim S", "Houston, Texas", 67, 23, "Since we are Texans, breakfast tacos are a mainstay. Huevos Rancheros and Tacos with Chorizo were both very good and reasonably priced"], ["Very reasonable", 3.0, "January 30, 2012", "nosinAround", "Earth", 5, 2, "I went here for breakfast to avoid the $20 breakfasts at the hotel restaurant. I got a nice serving of huevos rancheros for less than $6. Unfortunately I didn't notice before I ordered that there is absolutely no seating in this restaurant. I liked the eggs and the sauce. The beans were not my favorite, but were not bad. Overall,...\n\n\nMore"], ["Fast, cheap, and delicious!!", 5.0, "October 21, 2011", "tediousmonkey", "Honolulu, Hawaii", 2, 0, "Yucca fries and fish tacos were perfect and not heavy. Even though it was lunch time, the service was fast and really nice."], ["Outstanding takeout, unique in the DC metro area", 5.0, "October 18, 2011", "jofawan", null, 8, 13, "The yucca is done like nowhere else -- soft pillows of warmth. Great tacos and aquas frescas that are just not available much. Great prices, high quality ingredients, fast service; this is a place for serious Mexican food. Even the breakfast can't be argued with. Although it is hidden very well, it is worth finding. Truly unique in DC. Highly...\n\n\nMore"], ["Great Fast Cheap Mex Breakfast. Where’s The Refried Beans ??!!", 4.0, "July 27, 2009", "ForensicDoc", "Millstone, New Jersey", 29, 8, "1. Before going out for a day of sightseeing we decided to have breakfast here, around the corner from our hotel. As the name clearly states, this is a Taqueria, NOT a full blown Mexican restaurant. Very simple and limited menu but the food is plentiful and fresh. Our breakfast was the Mexican equivalent of the ubiquitous breakfast sandwich. Two...\n\n\nMore"], ["Best Mexican in DC and Great Price", 5.0, "September 19, 2008", "enlightenment", "Joplin, Missouri", 53, 46, "We walked to this restaurant, hidden from the street. It has an outside entrance but is hidden in the building's court. It has 4 small tables outside so they are equiped to be used for take out. They have breakfast and lunch. We had 5 tacos and two sides and two drinks for $23.00. They were one of the few...\n\n\nMore"]]], ["Mandu", [["Bland Korean Food in a Nice Setting", 2.0, "October 8, 2015", "Mikeb1Falmouth_MA", "Falmouth, MA", 454, 235, "My wife and I love Korean food and have eaten it in the Pacific Rim and in numerous places in NYC. The food was incredibly bland for Korean food. My veggie dumplings fell apart, the dough gooey with a filling of tasteless finely chopped veggies. The plate of Korean tidbits had no pizzazz, even the kimchi was watery and not...\n\n\nMore"], ["Awesome Korean Food", 4.0, "September 8, 2015", "Madison M", null, 5, 0, "Wow. Very impressed with Mandu. Everything that we ordered was delicious, but the highlight of our lunch was the Galbi Dolsot Bibimbap and the kimchi. The kimchi was out of this world actually. It had a crisp and clean bite to it, unlike the kimchi I've had at other places before which has a rotten fermented taste to it. I...\n\n\nMore"], ["Mandu i like you", 4.0, "September 3, 2015", "esopus35", "University Park, Maryland", 219, 99, "Ate noodles and veggie bibimbap, food was good, service was great, and atmosphere was cosy. I liked the starters they brought to the table. My major complaint was they had no sauce that was that hot."], ["Disappointing", 3.0, "July 30, 2015", "RHtravels", "Rocky Hill, Connecticut", 154, 48, "I typically love all Asian food, but I wasn't impressed. We ordered beef and pork Mandu dumplings and they were OK because there was a weird vegetable taste in it. For dinner we got kimchi bokum bap (a very spicy fried rice), dak gui (a spicy chicken stir fry dish) and bulgogi (a sweet gingery beef and veggie dish). The...\n\n\nMore"], ["Good Korean Food", 4.0, "July 9, 2015", "Ju K", null, 4, 4, "Good korean food close to china town.\nWe ordered kimchi jjigae, bibimbap and yukgaejang. We paid around 45 usd. The interior is great the personnel very nice and the food (even though i didn't see any koreans in the kitchen) good.\nWorth a visit"], ["Food was ok", 3.0, "May 23, 2015", "ZestnLeisure", "Boston, Massachusetts", 38, 15, "We stumbled upon this Korean restaurant, Mandu, when looking around a dinner place. The ambiance of the restaurant was ok, servers were good, price seemed reasonable, but the food was just not that great! Actually we have a local Korean restaurant near our home in MA, where food is far better than Mandu."], ["AWESOME", 5.0, "May 13, 2015", "Joy N", "Richmond, Virginia", 57, 15, "if you like Korean BBQ you will love this place! Kalbi, duboyki, dumplings-great saketini's. Everything is fresh and seasoned very well. A must try if you are in the area."], ["Excellent Experience", 5.0, "May 2, 2015", "daroff", "Washington, DC", 24, 13, "We were looking for a vegan-friendly restaurant near the DC Convention Center, and were thrilled with Mandu! We loved the food, the wait staff, the hostess, and the ambiance.\nWe made our reservation on Open Table, noting that we had four vegans and two non-vegans - and also asking for a quiet table. When the restaurant called to confirm the...\n\n\nMore"], ["Very Good but needs to improve consistency", 4.0, "April 19, 2015", "nc2stores", "Northern New Jersey, USA", 8, 8, "we had dinner at the restaurant a second time last week and while the food was very tasty, i had ordered the bim bam bap with the stone pot which should produce the crispy rice lining but unfortunately, given it was the 'rush period friday nite' the stone wasnt hot enough to produce the crisped rice. while the flavor of...\n\n\nMore"], ["Gracious waiter, good food and gluten free Korean food makes for an enjoyable memory", 5.0, "April 8, 2015", "knittingjenny", "Minn", 18, 8, "As I was planning our weeklong trip to Washington DC, I had to find some way to accommodate our daughter who is celiac. I did some research on gf in DC, and found this restaurant, which she was very excited about as she is into K-pop and all things Asian now. We walked over there from Chinatown (we're big walkers)...\n\n\nMore"], ["nice food and service", 5.0, "April 8, 2015", "apple1123", "San Francisco, California", 7, 2, "Food was great and the server was really kind and friendly. Better to make a reservation before you go; otherwise, waiting time will be pretty long."], ["Really good Korean food", 5.0, "March 24, 2015", "LSC63", "Melbourne, Australia", 91, 80, "We had an excellent dinner at Mandu. We had a 7pm booking and arrived a few minutes early. We were told that 'Happy Hour' was just about to end, so we were given the opportunity to order our first round of drinks and appetizer at happy hour prices, but we weren't rushed into this and our server took the time...\n\n\nMore"], ["Great Korean Spot in the middle of DC", 4.0, "March 22, 2015", "Superlegalbabe", "Washington DC, District of Columbia", 537, 159, "Found this place online. I don't know what to expect before I got here. I am a big fan of Korean BBQ, preferably the one that you do it yourself with the stove on your table. Now although Mandu does not have a table top BBQ, the Grilled Short Ribs are very good.\nTo start with the Hostess actually takes...\n\n\nMore"], ["Modern Korean food", 3.0, "March 21, 2015", "KC_Choi", "New Rochelle, New York, United States", 219, 24, "Been to the other Mandu location and went to this one after hanging out in Chinatown and not feeling up for Chinese.\nIf you are looking to be introduced to Korean food, but looking for a more modern ambiance and service than what you would get out in Annandale, then this is a good place to go."], ["Very precious & fantastic restaurant", 4.0, "March 21, 2015", "mdzara", "San Antonio, Texas", 4, 0, "I went there during my family travel. This place has antique decorations and variable foods; Korean food, modified. You love cuisines of Mandu. Enjoy yourself at this restaurant."], ["Korean... Yeah!!!", 4.0, "December 23, 2014", "JValentine2", null, 27, 19, "First time korean, first time kimchi, first time golbi, first time bibimbap, love for a lifetime!\nMandu is a sofiaticated restaurant with a taste unlike other oriental cuisine-themed places. Food is fresh, high quality and comes along with amiable service."], ["Neighborhood Asian go-to", 4.0, "December 21, 2014", "JetSkiFLA", "Winter Park, Florida", 9, 16, "Excellent food, attentive service! This is one of my favorite neighborhood spots - the drinks are awesome, and it has a Boppin' after work scene on Thursdays! Sojutinis are awesome and the apps and bibum bop are fantastic! Love it here!"], ["Ideal bar food and drinks", 4.0, "December 1, 2014", "PaulSnood", "Miami, Florida, USA", 226, 88, "Went for happy hour (daily) and enjoyed their excellent dumplings (6 for $4.00) and $3.00 craft drafts in a comfortable, relaxed atmosphere. Also sampled steak skewers and cold rolled crepes that were also delicious. Lively bar scene populated by the young local inhabitants."], ["Unexpected Surprise", 5.0, "October 19, 2014", "ongoni", null, 33, 14, "My family visited Washiton D.C. from New Zealand.\nWe had Museum tour for all day and wanted to have Korean meal for a dinner.\nMy daughter searched a place through Apple apps Tripadvisor and Foursquare.\nBoth apps recommended Mandu.\nWe ordered Hot pot Bibimbap, Mandu, Ddukbokki and Hodduk.\nIn fact, we didn't expect much but it was more than a...\n\n\nMore"], ["Good Food, Friendly Staff", 4.0, "October 3, 2014", "w0rldtraveler007", "w0rldtraveler007", 142, 69, "Mandu is a go-to restaurant for me if I'm in the neighborhood - the staff are friendly and the happy hour specials are great. Off-happy hour, the dolsot bibim bap and the soon dooubu are fantastic."], ["Nice for a change of pace but wouldnt go back", 3.0, "September 2, 2014", "Sanders y", "Washington DC, District of Columbia", 9, 3, "Mandu is convenient for me since I live right down the street and hoped it would be a place I would want to return/ unfortunately, this was not the case. The food and drinks were good, but lacked the sort of pop and sizzle I want in a high end Korean place. The coolest part of the place is the...\n\n\nMore"], ["Disappointing", 2.0, "July 23, 2014", "TheFoodLegend", "Charleston,SC", 184, 44, "Expected it to have good food, if nothing else. My bbq ribeye had gristle!! I told the server and she apologized but did not offer to substitute for it or remove it from the check. I only gave it 3 stars because the other members of my party had acceptable meals and the appetizers were OK, otherwise one star."], ["Simple Korean Food", 3.0, "July 13, 2014", "HelenaGuerra", "Washington DC, District of Columbia", 2343, 1184, "We started with steamed dumplings (veggie, beef & pork, shrimp). They were good except the veggie ones.\nThe complimentary appetizers were also good. My fav was the fish cake.\nWe had the galbi dolsot and dolsot bibimbap. Both were tasty.\nGina, our server, was nice and attentive.\nI'm giving it 3 stars because it's pricey for Korean (very) simple food."], ["Good brunch", 4.0, "June 25, 2014", "Traveler3305", "United States", 56, 8, "First time at Mandu on K Street. The brunch was delicious! It starts off with a small appetizer (kimchi, broccoli, potatoes, and fermented beans) and the main dish comes with Korean pancakes, hash browns, omelette, your choice of meat and Gim bap. The gelato and sojutinis were also pretty good. The only problem is the noise level. It was very...\n\n\nMore"], ["Great Happy Hour", 4.0, "April 24, 2014", "annapolis123", "Annapolis, Maryland", 89, 31, "Stopped in for a quick happy hour. Had the sojutini and assorted mandu (dumplings). The cocktail was quite good, the dumplings average but at $4.00 a good deal. Even through the restaurant is in a new modern building the atmosphere was local neighborhood bar. Bartenders were upbeat and friendly and seemed that many patrons were from nearby. Will be back...\n\n\nMore"], ["Decent Korean food in a city that lacks good ethnic food", 4.0, "April 23, 2014", "WFleet", "Washington DC, District of Columbia", 136, 54, "D.C. isn't a great place for authentic ethnic food, like Korean. I guess the expensive real estate means high rents so really authentic, mom and pop places just can't make it. So, my recommendation for Mandu is based on the fact that there just isn't much to compare it to. I'd skip the tofu stew, and stick with basics like...\n\n\nMore"], ["Well done Korean food.", 4.0, "April 5, 2014", "waterboy1368", "Salem, Oregon", 163, 58, "Nice food and fun atmosphere. Good service and some nice variations on the traditional Korean restaurant menu."], ["Modern, friendly, A+", 5.0, "February 17, 2014", "gg99", "nj", 197, 131, "Lovely front of house greeting. Table not ready, drinks at the bar....another terrific staffer. Had the spicy Bloody Mary. Sooooo good. Friendly efficient waiter. Excellent food. Our companions suggested this place last year at the volleyball tourn and we came back. Loved it! A keeper."], ["Bland flavorless food", 2.0, "February 12, 2014", "eileen572", "New York City, New York", 78, 26, "I went there with my husband for a dinner on a weekday night. Even though most of the tables were available, the attendant seated us to a small table next to the wall and when I asked her if she could seat us to a larger table, she gave us a weird look and started to laugh looking at the...\n\n\nMore"], ["Good Mandu and Excellent happy Hour", 4.0, "January 4, 2014", "KABC1980", "Washington DC, District of Columbia", 35, 11, "Two locations in DC, nice modern decor with an interesting drink menu. Decent beer selection the happy hour is very good. Mandu (Dumplings) unique with a shrimp, pork & beef and vegetable choices that can be prepared steamed or fried. Go to happy hour in DC everyday of the week."], ["Fun Restaurant with Great Korean Food!", 5.0, "December 14, 2013", "Daniel S", "Denver, Colorado, United States", 136, 52, "Dinner with family on a busy Friday night but everything went smoothly with service and food. Chose this restaurant because of the vegetarian and vegan options and were not disappointed. Great appetizers with a wide variety of tastes and textures. Entrees came very quickly and were perfectly prepared. The wine list was short but really had a couple of very...\n\n\nMore"], ["Chic korean", 4.0, "November 5, 2013", "adagrl", "Orlando, Florida, USA", 3, 0, "I was in dc for a business trip but couldn't get out to the Korean restaurants where it has the grill on your table. I had bulgogi and it was good but my moms kalbi was even better. It was definitely enough to share for 2-3 people."], ["And Kids Too", 4.0, "November 1, 2013", "mamtravels", "Washington DC, District of Columbia", 66, 30, "Yes, Mandu is trendy, but this is the \"new downtown DC\" so if you are looking for an authentic Korean meal, drive to Annendale. However, if you want a quick meal, Mandu will always be good. The wait staff is excellent and they are very kid friendly. I live in the building and bring my kid to eat here -...\n\n\nMore"], ["Regular eater", 4.0, "October 16, 2013", "pongo1390", "DC", 45, 37, "I live upstairs from this place, and eat there fairly frequently. Very good mandu, the beef and pork is especially good. Bulgoki and bibimbap always good. Nice bar, a bit trendy and don't go there to watch a game. Waiters are usually very attentive. Good value for cash.\nOverall a very good Korean place, and this comes from someone who...\n\n\nMore"], ["Nice atmosphere but food suprisingly bland", 3.0, "October 6, 2013", "Ksutton79", null, 23, 5, "The atmosphere and service at this restaurant were quite nice, but the food had to be the blandest Korean food I've ever had. The quality was good but the flavor just wasn't there in two of the three dishes ordered by the group I was with. I think there's probably a better choice for Korean in the area."], ["Trendy Korean western style Restaurant", 3.0, "August 3, 2013", "Holamobile", "Washington DC, District of Columbia", 81, 12, "Overall good. About half of the dishes seemed to be flavored more for Americans and less Korean. Very trendy place so nice atmosphere. The Happy Hour food and drink specials are worth it. But the overall menu a bit overpriced. Good sized portions though. Recommend you visit if you like Korean and see if its for you."], ["Excellent food, atmosphere, drinks", 5.0, "July 14, 2013", "Darin J", "Des Moines, Iowa", 160, 104, "A friend and I stopped by Mandu last night for our dinner. I was, to say it mildly, very impressed with the place. While we didn't make reservations, we were able to secure a couple seats at the bar. I ordered a Bibimbap and he had a Dokk Bo Gi. The pancheon (or side dishes of kimchee and other Korean...\n\n\nMore"], ["Good food, nice atmosphere", 5.0, "July 10, 2013", "Derkenb", "korea", 58, 25, "The restaurant is well set up and finds a good balance between casual and formal (I would take a date here). The food is pretty American style, but is good, and I haven't found a better Korean restaurant in the District. It is a little more expensive than I would expect, but it's comparable to any other Korean restaurant in...\n\n\nMore"], ["Loooove this place.", 5.0, "June 29, 2013", "PeteUSN", null, 92, 9, "I absolutely love this place. The food is fantastic and the happy hour is unbeatable. HH is from 4-7pm 7 days a week. Try the sojutinis."], ["Unique and delicious", 5.0, "May 30, 2013", "Christine K", "Boca Raton, United States", 4, 2, "This was our first attempt at Korean dining and LOVED it! Our server patiently went through the menu and offered excellent suggestions. We sat outside at clean tables and enjoyed people watching in this delightful up and coming neighborhood."], ["One of my fav places in DC, awesome brunch", 5.0, "May 28, 2013", "michaeldurmont", "Arlington, Virginia", 59, 31, "Mandu has one of the best brunch deals in DC - whole Korean setup for $1: gim bap, orean-style omelet, chive pancakes, korean hash browns and marinated beef, chicken, pork or tofu. Plus a scoop of gelato or sorbet. Large portion makes it easy to share w/ another. The service is also very friendly and attentive. Have been to this...\n\n\nMore"]]], ["Cafe Divan", [["Consistant over years and still love it", 5.0, "September 28, 2015", "Heiko D", "Miami, Florida", 1, 0, "I used to live in this area and always enjoyed the diverse dining options. Cafe Divan has always been one that maintained high quality food with a touch of european service. This time I had the lamb kebobs with the refreshing yogurt sauce and it was delightful. I also forgot how good the turkish coffee was...perfect before I started my...\n\n\nMore"], ["good food, average to small portions", 3.0, "September 20, 2015", "DrSpencerFlannagan", "Miami, Florida", 81, 33, "I went with my family to this Turkish restaurant, the food was fresh and tasty, the amount of the dishes is for a person not too hungry, and is not cheap, the place is small and you feel a little like a sardine in a can, the waitress were nice but not very friendly, may be a little bit of...\n\n\nMore"], ["Delicious Late Night Food and Drink", 5.0, "September 10, 2015", "LadyDJNorthCarolina", "North Carolina", 74, 30, "I am just beginning to try Mediterranean food. This place is small but the staff was great and the food delicious! I ordered the $12.95 Iskender Kebab - thin sliced marinated lamb and veal cooked with an open flame on a vertical spit shaved off in tender thin slices served over toasted pita bread with fresh sauteed tomato and yogurt...\n\n\nMore"], ["Consistent", 4.0, "August 25, 2015", "JustMi", "Washington,DC", 50, 48, "I have been going to Cafe Divan since they fist opened, many years ago. the food has always been good and it is the only place I go to for lamb- always fresh, perfectly cooked. The eggplant salad is my favorite and luckily they deliver within 3 miles so that's a great option for me. Service can be a bit...\n\n\nMore"], ["Good food, cross cultural expectations", 4.0, "August 3, 2015", "Texasbaseballfan", "Dallas, Texas", 110, 35, "The food was quite nice, we stopped in when walking by during the lunch hours. There was a short wait for a table inside (it was quite warm outside, and the limited seating outside was mostly in the sun), but we actually prefer a bit of sun, and sat outside mostly by ourselves. It must have caused the staff a...\n\n\nMore"], ["Expensive kebab", 3.0, "July 16, 2015", "Bettina P", null, 7, 2, "The service was good and the food ok, but it seemed to me that it was just a fancy way of serving a kebab that could have been bought for 1/3 of the price next door"], ["Consistently good", 4.0, "July 10, 2015", "MdTravelerX2", "Washington, DC", 181, 34, "The food is always good--fresh, nicely prepared, nicely presented. It has been consistent over the past several years that I've worked nearby. It's quiet--easy to talk without shouting!"], ["Awful food", 1.0, "June 30, 2015", "Lyah78", "washington", 49, 48, "I don't get who writes the excellent reviews for this place which should not even be considered Turkish food.\nFolks I know come here because it's open all day till late so you can grab bad food to fill you and go. It's also location probably as there are not a ton of places around to eat.\nI was invited...\n\n\nMore"], ["Good restaurant", 4.0, "June 20, 2015", "ChivasG", "Belgaum, India", 151, 191, "Good middle eastern and Turkish food and efficient service in Georgetown area. Worth visiting. Good value for money."], ["Intimate-comfortable-authentic", 5.0, "June 4, 2015", "Ktwho", "Madison, Wisconsin", 52, 39, "We loved the menu choices and building. Lamb was completely melt-in-your mouth tender, mild & tasty. We liked that everyone is seated near a window and with the roses in bloom it really added to the atmosphere. Looks formal but feels casual; it's not a large restaurant but that added to it's charm. I did notice a take out counter...\n\n\nMore"], ["Disappointed!", 2.0, "June 3, 2015", "LeiaVirginia", "Alexandria, Virginia", 65, 35, "I decided to take visiting family members to Cafe Divan after reading a review in the Washingtonian. I made a reservation for six but when we arrived they said they had the reservation but a table wasn't ready. We waited for 15 minutes while they re-set a table. Seemed very disorganized.\nThe mixed meze plate (appetizer) was the high point...\n\n\nMore"], ["An Oasis at an Urban Corner", 4.0, "May 9, 2015", "drdesign", "Storrs, CT", 74, 29, "It was a hot day at the corner off Wisconsin and we stopped for refreshments and a\nsmall bite to eat. The atmosphere is decidedly modern circa early 2000's. The Turkish dishes were very tasty and even the pizza was very well prepared. A perfect respite in North Georgetown. Turkish tea and coffee were also excellent."], ["Great Food, Fun Decor", 4.0, "April 21, 2015", "Gail T", null, 3, 2, "The grilled chicken with rice pilaf and vegetables was wonderful - tender and moist with great seasonings. The lamb stew and shaved lamb were very good, as well. The flatiron building allows for lots of windows, which works well with the modern decor that has delightful Turkish accents. Enjoy!"], ["Authentic experience", 5.0, "April 15, 2015", "CannontheTraveller", "Saint Louis, Missouri", 3, 1, "Nice place with quirky ambiance. The Turkish elements were authentic and the houmous was as good as any I've had in the U.S."], ["Excellent Turkish food", 5.0, "April 6, 2015", "Roberto D", null, 8, 2, "We stayed at a hotel close by and decided to visit this restaurant/cafe. Overall restaurant aspect is ok but food is superb. Is convenient located and service is friendly.\nYou have to try the Turkish coffee"], ["Great food", 4.0, "March 5, 2015", "Aburel", "Bucharest, Romania", 574, 271, "Been there on a cold icy evening. Inside was warm and welcoming. Service was very good and attentive. Food, Turkish, Balkan, Middle East. Very well prepared and presented. Portions are pretty ok, not overwhelming... The yoghurt chicken kebab was delicious and also the aubergine salad. Good wine list, including...Turkish wines. The only minus was coffee, only Turkish and filter. Lots...\n\n\nMore"], ["Good Turkish Food", 3.0, "February 15, 2015", "nancy s", "Denville, New Jersey", 203, 113, "This is truly Turkish (not Middle Eastern) food that is well presented, very good service and average food. A good local restaurant that also offers take out/delivery for the neighborhood. Prices were moderate. Our server was attentive."], ["Not perfect, but good.", 4.0, "December 30, 2014", "CanRu", "Toronto, Ontario, Canada", 106, 81, "Turkish specialities (Lahmakun, Pide and stewed/braised meat dishes) is what sets this place apart from a standard Middle Eastern restaurant, but even Middle Eastern stalwarts like shish kebabs are done well."], ["Good food with dodgy pricing!", 4.0, "December 30, 2014", "kibongi1965", "Bourne, United Kingdom", 62, 70, "Tried this place whilst visiting DC. Staying at Holiday Inn Georgetown so just across from our hotel. Service was good, food served quickly and was tasty, freshly cooked! Drinks replenished when required. The only thing I would say is that the prices advertised outside were very different to those on the menu inside!!"], ["It's Time to Modernize - Either Overrated or Outdated Reputation", 1.0, "November 27, 2014", "David T", "Washington DC, District of Columbia", 6, 3, "And I'm a forgiving guy; I worked in restaurants growing up. Got carry-out on Nov 21, 2014 through Arslan D according to my receipt. He's completely distracted while I wait patiently to order, am ordering, and repeating my order the 2nd time. My partner gets sick from the shrimp penne. I think the lamb sandwich is OK, too fatty. The...\n\n\nMore"], ["Good place for fast Turkish food.", 3.0, "November 3, 2014", "Mert51", "Los Angeles, California", 93, 51, "We were visiting Georgetown in Washington DC and heard about this place before so we decided to give a try. It has two major rooms, one is for quick pick up room where there are two cocktail-tables present; and second one was like a real restaurant with nice tables. We decided to have something quick so we ordered at first...\n\n\nMore"], ["Disappointing", 3.0, "October 14, 2014", "HofH999", "Melbourne, Australia", 262, 103, "The food and service were disappointing. There were three staff but they seemed to be covering take away as well as the seated guests including our party of 10. Very slow to take drink orders and get drinks to us. We had to go looking for someone to pay the bill. But the greatest disappointment was the food. The sigara...\n\n\nMore"], ["We'll prepared and pretty authentic", 4.0, "October 12, 2014", "KeenBEater", "Somerset", 38, 27, "I went to the Cafe Divan with a large group, which did test the staff a little, but the food was good and hot and seemed to be quite genuine. I enjoyed a 'lamb shank' which was excellent. Complimentary desert tester plate was a nice touch. Would definitely go back."], ["Good food, disappointing service", 3.0, "September 14, 2014", "N41B", "Chevy Chase, Maryland", 34, 10, "We have enjoyed this Turkish/Middle Eastern restaurant in the past, but two visits there in last few weeks were disappointing in that the service was very poor. In one case, one member of our party was brought the incorrect dish and thirty minutes after the others in our party were served, the correct item was served, with little apology, no...\n\n\nMore"], ["If you like Turkish food, stop in", 4.0, "July 31, 2014", "Sophrosune", "United States", 14, 7, "Loved the lamb kofte. Crowded but fun outdoor seating. Ate there at least three times for lunch and dinner."], ["Still great, but just a few cracks have appeared", 4.0, "July 23, 2014", "UA787", "Arlington, Virginia", 90, 28, "I've loved Cafe Divan since I first came across it in 2007. The food is still pretty tasty and sets a standard for other Turkish venues I visit. The Iskander Kabob is my regular, but I noticed that they don't put that fiery green pepper on it like I'm used to.\nAlso, the service didn't seem to be as good....\n\n\nMore"], ["Not recommended", 1.0, "July 19, 2014", "Baris T", "North Bethesda, Maryland", 23, 1, "I went to this place almost six years ago for the first time and at that time it was a terrible experience. I wanted to give another chance, but unfortunately, no change in the interval.\nFood does not taste well, service is below average, customer appreciation almost does not exist, music and athmosphere below average, prices unnecessarily high.\nFor sure,...\n\n\nMore"], ["Great food and service", 5.0, "May 23, 2014", "caomhail", "Williamsburg, Virginia", 40, 10, "Looking for a place to have a late lunch, we stumbled upon Cafe Divan. Excellent menu; we couldn't decide what we wanted so ordered a few appetizers and a bottle of wine. The food was great - the eggplant salad is marvelous! Will definitely go back."], ["Turkish delight", 4.0, "May 19, 2014", "sunnyWashingtonDC", "Washington DC", 33, 12, "This is a good neighborhood place that adds variety to the palette. They offer wonderful fresh branzino, flown in by a friend of the owner. The waiters are friendly, and one makes the best mojito! unexpected.. the regular Turkish offerings make it a wonderful lunch destination, and they offer a few outdoor tables., although we love the corner tip table-...\n\n\nMore"], ["Great breakfast spot", 4.0, "April 24, 2014", "normw60", "Land O Lakes, Florida", 26, 9, "We happened upon Cafe Divan by while searching for a restaurant that was open and serving breakfast on a Saturday. The service was attentive and the food was excellent.\nI had the Turkish Breakfast which included Turkish meat and cheese and will definitely be back for a repeat!"], ["I should come here before !!", 5.0, "April 20, 2014", "Alamaya12", "Miami, Florida", 74, 36, "We went for brunch and we loved it! Everything was super fresh and delicious. Price was very fair. Location is perfect, in Georgetown. Service : the best. Thanks!"], ["Are you in the mood for lamb?", 5.0, "April 15, 2014", "Skuba C", "Washington DC, District of Columbia", 10, 6, "I love Cafe Divan and eat there every other month. The food is fresh and delicious. For appetizers, I love the fried zucchini patties and the cacik. I'm a big fan of the Divan mixed grill platter but my wife loves the Doner kebab. On Thursday evenings, they have a great lamb specialty dish. The staff are actually very friendly...\n\n\nMore"], ["Delicious", 5.0, "March 31, 2014", "brcozlm", "Istanbul, Turkey", 18, 9, "We went there because my friend wanted to try Turkish cuisine. We ordered some starters (what we call in Turkish \"meze\") which were really good. They taste always better with Rakı, of course. Then we had a meal which was bigger than we expected and was also delicious. The service was not that good, they were just coming, getting your...\n\n\nMore"], ["Delicious food", 4.0, "February 19, 2014", "CoolGranny2014", "Potomac, Maryland", 2, 0, "Lunch was delicious; fresh and tasty. Disappointing that service was indifferent. The food deserves a more enthusiastic presentation and description."], ["Fresh and Healthy!", 5.0, "February 12, 2014", "dglukach", "Bedford, Texas", 63, 11, "Food was all fresh Mediterranean style cuisine. Easy and accessible, fast and courteous. Prices were o.k."], ["If you like Turkish....go here", 4.0, "December 4, 2013", "Lyn J", "Atlanta, Georgia, United States", 30, 12, "This was a welcome surprise. I went here with a business client and had the time of my life. The menu choices are traditional Turkish and the coffee nothing to laugh at. It has been rated as one of the top choices by Zagat for years, and I know why. The service was impeccable, and the food terrific. The waiters...\n\n\nMore"], ["Charming", 4.0, "December 2, 2013", "Chakal01", "Brighton, United Kingdom", 81, 24, "I was with my sister and brother-in-law and didn't know where to go. They came up with lots of ideas, being one of them Cafe Divan, and mentioned that it was Turkish cuisine. I helped them pick it as I love Turkish food, and didn't regret it.\nGood service, lovely food, good price plus on a good location in Georgetown....\n\n\nMore"], ["Best Turkish food", 5.0, "November 13, 2013", "HarAntIst", "Harrisonburg, Virginia", 1, 0, "I'm originally From Turkey --- my job as an academic allows me to visit many cities in the US and in Europe. This restaurant offers the best Turkish food I've tasted outside Turkey. Taste-wise it is the most authentic Turkish restaurant and closest to the real thing by far. The chef is from the city of Bolu which is famous...\n\n\nMore"], ["Nice Cafe and good food", 4.0, "November 12, 2013", "Farhad A", "Reston, Virginia", 236, 71, "I recently ate at this charming cafe in Georgetown, The food and service was very good. The salad was fresh and my chicken kabob was very tasty. I very highly recommend this restaurant to others and I will eat there again. The only negative was the bathroom which was not clean."], ["Doner Fiesta", 4.0, "November 3, 2013", "BirTurk", "Tysons Corner, Virginia", 173, 48, "Awesome Turkish kitchen in upper Georgetown. For the people familiar to NYC Turkish kebab restaurants taste, this place never embarrass you. Menu is very rich and plenty choices to satisfy the eastern mediterranean appetite. Best if you get your baklava at the end and sip your thick sugarless Turkish coffee!"], ["Amazing Turkish Food", 5.0, "October 23, 2013", "Lubna C C", "Washington DC, District of Columbia", 8, 1, "I have been here a couple of times for lunch with clients and we always left full and happy with the food.They serve warm bread with olive oil right when you arrive and almost every entree comes with a basic salad. Their lamb is cooked to perfection with enough spices. I also tried their pide and was happy with my...\n\n\nMore"], ["Nice place", 4.0, "October 22, 2013", "Arash Z", "Washington DC, District of Columbia", 2, 0, "They have good food and price are also good. Not so fancy but nice enough to invite a fiend. There is sandwich section next to restaurant which they have good sandwich."], ["Great food", 5.0, "October 11, 2013", "1Oren1", "Washington DC, District of Columbia", 2, 0, "It is a very Nice place. They play great music.We Had a Wonderful Shank and great Knafe for desert. Highly recommended. not cheap, but worth it."], ["Not friendly, Needs cleaning!", 2.0, "September 24, 2013", "Emad B", "Kuwait City, Kuwait", 87, 33, "We wear in town and decided to eat at Turkish restaurant, so we did a small search and found this place. The food is not bad but not great Either. The general cleanliness of the restaurant is not that good specially the toilet!.\nThe waiter was not very friendly and the service was very slow.. The worst part is after...\n\n\nMore"], ["nice surprise in Georgetown", 4.0, "September 2, 2013", "Daninchatham", "Chatham,NJ", 43, 31, "when early on a Saturday morning for breakfast, around 9:30. The place was almost empty, and hat was fine and expected. The breakfast menu was good, with a nice mix of omelets and other taste items. I had the mushroom omelet. It was very good, with a small side of fruit and a few potatoes. The cost as 9... plus...\n\n\nMore"], ["Lovely lunch", 4.0, "August 19, 2013", "havaneseangel", "St Augustine FL", 147, 70, "We tried this cafe because it was on the current Washingtonian List of Cheap Eats. Actually, it has received an award every year since 2003. Before you get to the food, the cafe is charming and staffed by gorgeous Turkish waiters. The menu was interesting, particularly the appetizers. I loved the artichoke appetizer and liked the eggplant pida and lamb...\n\n\nMore"], ["Give yourself to the waiter", 4.0, "August 7, 2013", "Lord H", "Florida", 108, 62, "From time to time I look at a menu and decide that there are no bad choices and ask the waiter to bring me what he would bring his beloved mother. I was rewarded with a falling-off-the-bone lamb shank. Each bite oozed succulence. Service was speedy, the location quite accessible and is worth the trip if you want an authentic...\n\n\nMore"], ["Authetic Turkish cuisine", 4.0, "July 16, 2013", "Wrbcks", "Fairfax Station, Virginia", 24, 9, "We have dined at Café Divan several times, and enjoyed food and friendly service. The ambiance is not exactly conducive to a great dining experience, but food is well prepared, authentic and served by people familiar with the dishes."], ["Wonderful Carry Out", 4.0, "July 2, 2013", "Michael Q", "Washington DC, District of Columbia", 59, 45, "Our tradition is to get carry out here before every trip we take. Food is authentic, fresh ingredients and lots of warm bread. Kabobs are great, both chicken and lamb. Try the Thursday lamb special, it's wonderful. Staff is friendly and the orders are ready when they say they will be. Important for parking in Georgetown. We travel partly to...\n\n\nMore"], ["FantasTurkly delicious", 5.0, "June 9, 2013", "strongman2013", "Folkestone, United Kingdom", 1, 0, "Right middle of the George Town something very great something very unique waiting for you.taste just as same as in Turkey.nice atmosphere with the nice bunch of people with the smile on their face.great value for the great food.dont miss out this authentic Turkish restaurant/cafe..well done guys..."], ["Good food and service if not outstanding", 4.0, "May 22, 2013", "Y_Ddraig", "Geneva, Illinois", 40, 23, "Nice small, cozy location in Georgetown. Good range of menu options nicely done, although friend's seafood could have had a little more flavor, she says. Service was friendly and we did not feel rushed even though they were busy."], ["Authentic Turkish Food", 4.0, "May 7, 2013", "MarttaH", "Austin, Texas", 44, 149, "I enjoyed a great lunch here! The food was so authentically Turkish that I thought I was back in Turkey.\nMy friend had the Lahmacun pide and thought it was really flavorful. I enjoyed the chicken kabobs which I thought could have used a bit more flavor but overall was a very successful dish.\nThe portions were generous and the...\n\n\nMore"], ["OK", 3.0, "April 11, 2013", "attractiveprof", "Fort Worth", 17, 89, "Seemed to be very popular. But even the very friendly waiter couldn't make us forget that we had better Mediterranean food elsewhere."], ["I cannot stop going here! Wonderful!", 5.0, "March 26, 2013", "Ellen K", "Washington DC, District of Columbia", 6, 0, "You must get the sampler! The best food around and pair it with the only white Turkish wine on the menu! Perfection! I can make a meal of it! Although the sampler will hook you in to order more! It is just that great! Service, atmosphere...all of it is truly, well...DIVINE!"], ["Great taste and sevice", 5.0, "March 18, 2013", "KingArthu", null, 5, 0, "I had dinner with a good friend of mine and we had a great time. Food was great,service was perfect and very personalized. I recommend this place to everyone who would like to taste the real turkish food!"], ["need some renovation", 2.0, "January 15, 2013", "sosyetik", null, 97, 34, "I used to like this place a lot. The service is still good.But the quality of the food and cleanliness of the site is very poor. They need some serious renovations. I could see cockroaches on the table. Disgusting!"], ["Delicious!", 5.0, "December 26, 2012", "Traveler19", "South Carolina", 15, 11, "Seven family members and I Had a wonderful meal here the other day. The appetizers were good and everything was prepared with care. The heydari yoghurt was outstanding; I could have eaten the whole thing! The chicken entree was flavorful and cooked perfectly. The rice was light and fluffy. Tea and firin sutlac provided the perfect finish to the meal....\n\n\nMore"], ["Good meal, no 'wow' factor", 3.0, "December 16, 2012", "Travelache", "Melbourne, Australia", 166, 82, "The staff were pleasant & professional, & the food was nice. The servings were not large, & I have had better turkish food elsewhere. It's certainly a decent place to eat though, it's just not special in any way. However if you have a hankering for middle eastern food, & you are staying at The Holiday Inn in Georgetown, I...\n\n\nMore"], ["Doner Kebap", 5.0, "December 4, 2012", "Esperanza_Turkey", "Turkey", 54, 31, "This place is where you get real Turkish food. With the atmosphere you could almost feel at home! The owner is very modest, and always in the house. Don't forget to try sigara borek and Turkish Pastrami. Also the Turkish pastrami pide! I uually eat Doner, because it is the dish of my childhood. At Cafe Divan, they make their...\n\n\nMore"], ["Beware", 3.0, "October 14, 2012", "Jack37", "Lewistown, PA", 136, 77, "Intrigued by this restaurant's website, showing fancy, modern surroundings and exceptional food, we went to lunch there the other day. A somewhat distracted waitress showed us to a table in what looked like an office lunchroom. We ordered fairly standard fare - shish kebab with the tray of usual appetizers - and what we got looked like something from Mustapha's...\n\n\nMore"], ["Excellent meal and service at a fair price", 5.0, "October 10, 2012", "Lanceman1005", "Alexandria, VA", 36, 6, "I recently hosted a lunch at the Cafe Divan - a Washington VIP was one of the guests. I could not have been more pleased with the food, service and reasonable prices. All special requests were acted upon with a high degree of professionalism and courtesy. I lived in Ankara,Turkey for many years and I assure you that this is...\n\n\nMore"], ["Excellent & Very Health Meal...", 4.0, "October 1, 2012", "wjboczany", "McLean, VA", 43, 16, "Cafe Divan was an excellent little hideaway right aross from the \"Social Safeway\" on Wisconsin Avenue in Georgetown. Food is Turkish and generally healthy and tasty. Since I eat healthy, they had several excellent dishes to select from. I had the Chicken Kabob. Service was excellent and noise level was fine. It was not super crowded on a Friday night...\n\n\nMore"], ["Grossest meal I've had in a while . Service terrible.", 1.0, "September 29, 2012", "Mmodom", null, 6, 15, "Our waiter ran out to the supermarket in the middle of our meal. Took 45 min to get our food. Overlooked boiled eggs."], ["A turkish Oasis just above Georgetown", 4.0, "August 8, 2012", "Jadorevelo", "Washington DC, District of Columbia", 37, 17, "A few weeks ago i re-visited an old favorite with friends from the old neighborhood at McLean Gardens: Cafe Divan.\nA rare Turkish gem in a city filled with, lately, Belgian and small plate (Tapas/Mezze/Antojito) concepts. This is located on Wisconsin Ave, NW just across from the famous Georgetown's social Safeway, which is now being developed into a multi-use property.......read...\n\n\nMore"], ["Really tasty Turkish", 5.0, "May 8, 2012", "NairobiGirlOH", "Cleveland, OH", 19, 16, "I ordered the Iskender and boy are the portions great and the meal sumptuous!"], ["great pizza", 4.0, "April 23, 2012", "mikeandstephtravel", "Macomb, Michigan", 26, 19, "Walked from Holiday Inn - Georgetown. Great pizza, kids really enjoyed it. A bit like a wine bar, but they made our family feel welcome."], ["One of my favorite DC restaurants", 5.0, "March 26, 2012", "JPSWashington_DC", "Washington, DC", 113, 124, "I love Cafe Divan and it's one of my favorite restaurants in DC. My husband loves the Doner Kabob and humus. I also get chicken with eggplant puree or a wood oven pizza made to order. For dessert, don't miss their wood oven rice pudding. If you go on a Sunday, there's a flea market next door. It's great and...\n\n\nMore"], ["Fresh, creative . . .", 5.0, "March 7, 2012", "nys", "Vero Beach, FL", 76, 193, "We loved the lamb, the rice, the crisp, grilled fresh vegies and the pita. The price was right, about $50 for 2, but the service was a bit slow due to the restaurant being very busy. The baklava was outstanding. We will be back."], ["Never again", 1.0, "February 23, 2012", "Traya", "Bethesda, Maryland", 40, 11, "A friend took me for a brunch one time, it was delish food, good table with sunny street view. I next invited another friend, and that was the worst experience ever. Restaurant was almost empty, they insisted to seat us in table without view. Shortly after starting eating, there was the strongest horrible smell, complained to the waitress who claimed...\n\n\nMore"], ["Great Doner Kabob", 4.0, "February 22, 2012", "ace4444", "Fairfax, Virginia", 431, 141, "Cafe Divan is a nice small restaurant with lots of light and great Doner kabob. Service is friendly and the bread is warm and tasty. It's a nice place to hang out for awhile and watch Georgetown walk by."], ["Great Turkish food", 4.0, "February 18, 2012", "Bobtdiver", null, 218, 88, "Really authentic selection of appetisers, and great mains. I ha lamb shank, fell off the bone. Definitely worth another visit."], ["Agree with \"Never Going Again\"", 1.0, "January 25, 2012", "tobeycat", "Washington, DC", 12, 7, "I live in a neighborhood close to Cafe Divan. One evening after work, my husband and I went there for drinks. First off, the bar area smelled so badly that we moved to the dining area, where we were seated immediately (the restaurant was empty). Once in the restaurant, we were never acknowledged, given a menu or waited on --...\n\n\nMore"], ["Never Going Again", 2.0, "January 20, 2012", "JBurkert", "Falls Church, Virginia", 15, 2, "I think too much has changed at Divan over the years we have been going. On our last visit in Dec. 2011, the doner kebab had an off smell to it almost like an indian dish. It would appear that they have changed the spice mix or something. The rice has never been great but again on the last visit...\n\n\nMore"], ["Authentic", 5.0, "December 27, 2011", "TrishHWashington_DC", "Washington DC, District of Columbia", 110, 67, "Turkey being my second home for 32 years, I can say I know the food--which is delicious and varied. Eating in Divan takes me back to Istanbul. Their dishes are authentic, waiters friendly, and prices very resonable. I have not eaten at a better Turkish restaurant outside of Turkey than this corner restaurant on Wisconsin Ave. Large windows bring in...\n\n\nMore"], ["Staff goes the extra mile", 5.0, "December 23, 2011", "CGBfromDC", "Washington, DC", 30, 12, "Cafe Divan is great for a special dinner for two but equally special for a group. Recently the staff provided a special menu of 3 items to keep costs down for our group and then when 5 extra people showed up, they quickly moved us to a bigger table, smiling all the time. Great Turkish food, not too strange for...\n\n\nMore"], ["perfect reminder of the pleasure of eating in Turkey", 5.0, "November 21, 2011", "elizapen", "washington dc", 28, 8, "I lived in Turkey for 3 years and this is the best way to revisit the delicious food and warm hospitality of true Turkish restaurants."], ["Excellent food, beautiful space, good service", 5.0, "September 19, 2011", "LorininDC", "Brentwood, MD", 11, 4, "My boyfriend and I recently ate at Cafe Divan for the first time, and had a wonderful Sunday lunch. The space is small, but extremely nicely designed, with windows on both sides. And in spite of the size, it doesn't have a noise problem. We had imam bayildi and an artichoke dish and a sucuk pide, and they gave us...\n\n\nMore"], ["Great food, great value", 5.0, "August 24, 2011", "dc1sanibel", "home", 148, 91, "Excellent genuine Turkish cuisine[ believe me I know having lived there for 8 years], reasonably priced. Great kebabs, especially the doner & sis kofte[ groung lamb char grilled meatballs ]. and terrific appetizers. You can make a meal of the appetizers alone; borek [ feta cheese filo dough cigars ], smoked eggplant, mini lamb meatballs, stuffed grapeleaves, hummus & more."], ["Wont make you miss Turkish food in Turkey", 5.0, "July 31, 2011", "Sightseer86", "Istanbul, Turkey", 12, 12, "We sat in the meat restaurant side of Cafe Divan (they also have a fish restaurant side) and had amazing food! It was prepared wonderfully! I had the Adana kebab and my husband the Incik Kebab. With mezzes like hummus, dolma and su borek. All were good choices and filling. I don't think we left the plate with food on...\n\n\nMore"], ["Authentic Turkish & a good value in Glover Park/Upper Georgetown", 4.0, "July 16, 2011", "dcbird", "Washington, DC", 82, 31, "Although Cafe Divan has been in Glover Park/Upper Georgetown for a few years, this was the first time we went there for dinner. We've had their take-out before, and it's very sit-down-quality take-out, but we were glad to finally experience what the restaurant has to offer. We first had a shared appetizer of lamb kofte patties -- very flavorful. The...\n\n\nMore"], ["First try with Turkish food, but after eating here it won't be the last.", 5.0, "May 8, 2011", "Sonoraguy", null, 36, 24, "My wife had the stuffed pasta and I had a turkish pride. Both were perfectly cooked and full of flavor. Service was okay and the restaurant felt a little cramped, but the food was pure yummy goodness."], ["Delicious", 5.0, "September 8, 2010", "VBB44535", "Kansas City, Missouri", 2, 1, "I was told to go while on vacation by a friend who used to live in D.C., delicious food and I am a fan of Turkish beer now . My first time trying Turkish food and it makes me want to go to the country. Portions were perfect and the bread!"], ["Nice restaurant on upper Wisconsin Ave between M St. and the Cathedral", 4.0, "July 10, 2010", "K-man-Jax", "Jacksonville", 98, 38, "Cafe Divan features Turkish cuisine. The owner and his staff go out of the way to please. The food was excellent with a mixed Meze appetizer platter - plenty for 3. Excellent large lamb shank, finished off with a bombshell for dessert (ice cream ball dipped in chocolate). The wine pouring were generous, too. I'd say that Cafe Divan beats...\n\n\nMore"], ["Great Turkish food, should definitely try ;)", 5.0, "June 1, 2010", "cione", "Milwaukee, Wisconsin", 23, 11, "We found this restaurant while searching for a place to dine in Georgetown. Although the restaurant area was small, it was very well decorated. The wooden covering on the columns created a great environment. The place has a warm, welcoming atmosphere.\nWe got ezme and lahmacun as appetizer. They were delicious with their great pita :) As entrees, we got...\n\n\nMore"], ["Best Turkish cuisine in town!", 5.0, "April 15, 2010", "Canan-1", "washington dc", 1, 0, "I recently took a new job in Washington DC and wanted to have Turkish food for dinner. They were open even on Sunday evening for dinner. I went back last night (Wednesday night) and had a wonderful experience again! Wine was excellent, food was healty and very tasty! Turkish coffee and deserts were a great way to complete the dinner....\n\n\nMore"], ["Mediocre Turkish food, and bad service - disappointing", 3.0, "April 3, 2010", "AmericaninJkta29", "New York City, New York", 96, 73, "it's a nice atmosphere inside, but the food is nothing great. The waiter we had was very rude too, he literally took the salad plate from my friend as he was still eating the salad - literally, had a cucumber on the fork and was lifting to his mouth when our waiter swooped in and said are you finished and...\n\n\nMore"], ["Fun, bustling place with good Turkish food", 4.0, "January 10, 2010", "onfire444", "onfire444", 12, 8, "We enjoyed our iskander kebab and cigarette bareks. The service was very attentive and polite. The atmosphere was bustling. I can't wait to go back."], ["Decent neighborhood restaurant but not outstanding.", 3.0, "April 14, 2009", "eventsdc", "washington, dc", 170, 88, "Decent neighborhood restaurant but not outstanding."], ["Closest to Turkey in DC", 4.0, "December 20, 2008", "JBurkert", "Falls Church, Virginia", 15, 2, "We have tried most Turkish restaurants in DC and Divan is, in our opinion, the closest you will find to real Turkish food in DC. Moderate prices also make it appealing. Thye also have takeout which is nice if its late and you want to grab something for home."], ["Definitely good, but nothing special.", 3.0, "June 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Definitely good, but nothing special."], ["Divine Time at Divan!", 5.0, "June 15, 2008", "2Travelers2go", "DC Metro Area", 201, 377, "Had dinner at Cafe Divan in June 08. Since none of the other reviewers bothered to spend more than five words on their \"reviews\" (what's up with that?), I guess I'll have to be the one to expound and give others a more detailed review . The restaurant itself is located on a triangle-shaped corner building, and the dining room...\n\n\nMore"], ["Turkish food in Gerogetown", 3.0, "April 22, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Turkish food in Gerogetown"], ["not a Turkish restaurant", 1.0, "February 17, 2008", "mayakoska", "Pennsylvania", 1, 0, "the food served was not Turkish food at all. They served regular pasta with yoghurt with diced tomatoes which was far away from what is called manti. There was 20 squared pasta in the dish with a price around 13 dollars. The iskender kebap was very fatty. The serving was very slow and dishes came to table cold. I have...\n\n\nMore"], ["Excellent food, ambience...", 5.0, "February 16, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent food, ambience and service!"], ["I've only had it as office OT food so my view is biased....It's alright. Nothing to get excited for.", 2.0, "February 15, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "I've only had it as office OT food so my view is biased....It's alright. Nothing to get excited for."], ["This place was surprisingly good and convinced me that I like Turkish food. The flatbread is delish!", 3.0, "January 29, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "This place was surprisingly good and convinced me that I like Turkish food. The flatbread is delish!"], ["Great location, food is...", 4.0, "January 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great location, food is very good and nice wines"], ["Nice environment. Good...", 3.0, "January 21, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Nice environment. Good food."], ["Pretty tasty Turkish food.", 4.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Pretty tasty Turkish food."], ["good kebabs, one of a few places that has actual doner!", 3.0, "January 4, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "good kebabs, one of a few places that has actual doner!"], ["closest to turkish taste...", 4.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "closest to turkish taste in washington dc :)"], ["Steps from school....they were my savior. Get the chicken sandwich. If you get any of their excellent salads - MAKE...", 4.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Steps from school....they were my savior. Get the chicken sandwich. If you get any of their excellent salads - MAKE SURE to ask for bread. It's light - fluffy - out of this world."], ["A bit hidden but the place offers a variety of safe Turkish options. Good place for a smaller group.", 4.0, "January 2, 2008", "A TripAdvisor reviewer on Facebook", null, 1, 0, "A bit hidden but the place offers a variety of safe Turkish options. Good place for a smaller group."], ["yum.", 5.0, "December 28, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "yum."], ["It was average.", 3.0, "December 17, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "It was average."], ["Excellent Turkish Food", 5.0, "December 12, 2007", "gezenti", "Washington DC, District of Columbia", 6, 15, "This is a great Turkish restaurant that you would find in DC. Lentil soup is the best to start with then of course Iskender Kebab and last Kunefe as a desert. Everything is good, but these are my favorite!\nIf you like to have a taste of Turkish food, I highly recommend this place. Enjoy!"], ["Very good service and nice decor. Excellent Donner & Iskender.", 5.0, "December 2, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Very good service and nice decor. Excellent Donner & Iskender."], ["Tasty Turkish food. I prefer the carry-out section of the restaurant located one door down from the main door. There...", 3.0, "November 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Tasty Turkish food. I prefer the carry-out section of the restaurant located one door down from the main door. There are a couple high tables with stools there if you want to have a quick lunch."], ["not good", 2.0, "November 27, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "not good"], ["Great Doner.", 5.0, "November 19, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Great Doner."], ["Excellent food! We always take our (American) guests there to introduce the Turkish cuisine. The place is a bit small...", 5.0, "November 18, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Excellent food! We always take our (American) guests there to introduce the Turkish cuisine. The place is a bit small, though."], ["The quality of food here...", 5.0, "November 15, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "The quality of food here is simply astounding. I just went yesterday for some Iskander kabob. Very respectable, though I took a date there recently and looked out the window to see a giant rat sitting outside. Guess he heard how good the food was too..."], ["Wasn't overwhelmed, thought most of the dishes were too oily.", 2.0, "November 14, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Wasn't overwhelmed, thought most of the dishes were too oily."], ["Good food. Reasonable prices. Would go again.", 3.0, "November 12, 2007", "A TripAdvisor reviewer on Facebook", null, 1, 0, "Good food. Reasonable prices. Would go again."], ["Outstanding Doner Kebab!", 5.0, "March 14, 2007", "cd896", "Denver, Colorado", 13, 24, "I had a colleague from Turkey recommend this place as the only place in DC to go for great, authentic Turkish cuisine - he even offered to pick up the tab if we didn't like the food. Having been a fan of doner kebab from my travels to Germany, I was anxious to try it out, and I ordered the...\n\n\nMore"], ["Good Food", 4.0, "April 3, 2006", "traveljunkie20", "New Jersey", 50, 43, "We tried Turksih Food for the first time and enjoyed it. The food was great - service was great - we asked for recomendation and had an informed person to help us out. Priced reasonably."], ["Turkish Delight", 5.0, "December 7, 2005", "Travelingmaven", "Chicago, IL", 168, 115, "This small Turkish restaurant serves the best ethnic food this side of the Bosphorus. The restaurant is situated in a corner building with windows on both sides (great for people watching); the decor is clean modern with comfy pillows backing the benches. There is a \"take out\" section as well as a dine-in area.\nThe menu, as expected. relies heavily...\n\n\nMore"], ["WooooWW!", 5.0, "August 13, 2005", "A TripAdvisor Member", null, 1, 0, "MAny people have been telling me to try turkish food, and last week i went to Cafe Divan, due to their great reputation. The restaurant is magnificant, and the people are great. but the best part of all, is the food. the meals are filling, and the taste is to die for. i give it three thumbs up!!"]]]]